      **************************************************************                                
      * APLICACIÓ: MÒDUL DE COMPRES                                *                                
      **************************************************************                                
      * TITOL: CM0085  © AQUAPOINT S.A.                           *                                 
      * DATA CREACIO:  23/07/1997                                  *                                
      * FUNCIO DEL PROGRAMA: MANTENIMENTO DE PEDIDOS A CLIENTES    *                                
      *                                                            *                                
      * DOCUMENTACIO:                                              *                                
      *                                                            *                                
      * ZXOPT1 = NOM DEL PROCÉS                                    *                                
      *        - SN = SUBFITXER N.          N=[01,02,...,99]       *                                
      *        - N TAMBÉ EQUIVAL AL NÚMERO DE FORMAT DEL SFL       *                                
      *          I COINCIDEIX AMB EL Nº DE LÒGIC (ESSENT N=00 EL   *                                
      *          FITXER FÍSIC)                                     *                                
      * ZXOPT2 = RUTINA DINTRE DEL PROCÉS                          *                                
                                                                                                    
      *        - 'DSP'= VISUALITZA DE PANTALLA                     *                                
      *        - 'CHK'= VALIDACIÓ DE LA PANTALLA                   *                                
      *        - 'CLR'= NETEJA DEL SFL                             *                                
      *        - 'UPD"= ACTUALITZACIONS DELS FITXERS               *                                
      *                                                            *                                
      * ZXNNN00= Últim nº de registre carregat en subarxiu         *                                
      * ZXNRR00= Numerador de registres de subarxiu                *                                
      * ZXCOUNT= ZXNRR00 del 1er registre de la últ. pag.          *                                
      *          que visualizaba el usuario                        *                                
      * ZXLOP00= Numerador de registres en carrega de pantalla     *                                
      * SUFRCDN= SFLRCDNBR del subarxiu                            *                                
      * PREFIXE DE CAMP: CCC- (CAMP COMÚ DE CAPÇALERA: CAMP QUE EL *                                
      *        SEU CONTINGUT NO VARIA EN LES ALTRES CAPÇALERES DE  *                                
      *        L'APLICACIÓ. P.EX.: NOM DEL PGM O DEL TREBALL)      *                                
      *                                                            *                                
      * CS_(NOM): COMMON SUBRUTINE (COL·LOCADES FINAL PGM)        *                                 
      * @PE(NOM) : PARAMETRES D'EXPORTACIÓ                         *                                
      **************************************************************                                
      * DATA DE MODIFICACIÓ: DD/MM/AAAA  MARCA: DDMMA              *                                
      * AUTOR:                                                     *                                
      * DOCUMENTACIÓ:                                              *                                
      *                                                            *                                
      **************************************************************                                
FQ365 * Modificación: FQ365                                        *                                
FQ365 *        Autor: Josep Aragonès                               *                                
FQ365 * Fecha Inicio: 23/03/2009                                   *                                
FQ365 *  Descripción: Inclore les comandes amb Status ='10'        *                                
FQ365 *               i confirmar-les si Autoritzem risc           *                                
FQ365 **************************************************************                                
FQ446 * Modificación: FQ446                                        *                                
FQ446 *        Autor: Josep Aragonès                               *                                
FQ446 * Fecha Inicio: 14/07/2009                                   *                                
FQ446 *  Descripción: Inclore CC i PR                              *                                
FQ446 **************************************************************                                
FQ665 * Modificación: FQ665                                        *                                
FQ665 *        Autor: Josep Aragonès                               *                                
FQ665 * Fecha Inicio: 23/06/2010                                   *                                
FQ665 *  Descripción: Inclore Import a les 2 vistes                *                                
FQ665 **************************************************************                                
      * Modificación: 06070                                        *                                
      *        Autor: TL                                           *                                
      * Fecha Inicio: 06/07/2010                                   *                                
      *  Descripción: PROBLEMA EN PEDIDOS SIN CARGO SC             *                                
      **************************************************************                                
09022 * Modificación: 09022                                        *                                
09022 *        Autor: JG                                           *                                
09022 * Fecha Inicio: 09/02/2012                                   *                                
09022 *  Descripción: aÞadir nueva vista por pedido                *                                
09022 **************************************************************                                
FH002 * Modificación: FH002                                        *                                
FH002 *        Autor: X.BOU                                        *                                
FH002 * Fecha Inicio: 25/04/2012                                   *                                
FH002 *  Descripción: CAMBIAR SETUP PARA PERMITIR SELECCION POR    *                                
FH002 *               GESTOR DE RIESGOS ASIGNADO AL CLIENTE        *                                
FH002 **************************************************************                                
2310B * Modificación: 2310B                                        *                                
2310B *        Autor: X.BOU                                        *                                
2310B * Fecha Inicio: 23/10/2012                                   *                                
2310B *  Descripción: CAMBIAR FORMA DE ACCESO A GESTOR ASIGNADO    *                                
2310B *               POR CLIENTE                                  *                                
2310B **************************************************************                                
PG615* DATA DE MODIFICACIÓ: 22/02/2023  MARCA: PG615                                               
PG615* AUTOR:        David Grau                                                                    
PG615* DOCUMENTACIÓ: Retener pedidos cliente x bloqueo albaran                                     
PG615*   No mostrar registros bloqueados por bloqueo albaran                                       
PG615******************************************************************************************    
E7394* DATA DE MODIFICACIÓ: 15/03/2023  MARCA: E7394                                               
E7394* AUTOR:        MMontana                                                                      
E7394* DOCUMENTACIÓ: Retroceder PG615 - Italia                                                     
E7394*  Tota la codificació s'ha realitzat en format RPG de 1994                                   
E7394* RPG IV, a.k.a. RPGLE was released in 1994 as part of the V3R2 release of OS/400             
E7394******************************************************************************************    
                                                                                                    
     H DATEDIT(*YMD/)                                                                               
                                                                                                    
     H OPTION(*NODEBUGIO:*SRCSTMT)                                                                  
     FCM0085FM  CF   E             WORKSTN INFDS(SFLDS)                                             
     F                                     SFILE(SUFD:ZXNRR00)                                      
     FCOCLIN    IF   E           K DISK                                                             
     FCOCAPE    IF   E           K DISK                                                             
     FCOCAPE23  IF   E           K DISK    RENAME(RCOCAPE:RCOCAPE23)                                
FQ365FCOCAPE25  IF   E           K DISK    RENAME(RCOCAPE:RCOCAPE25)                                
09022FCOCAPE38  IF   E           K DISK    RENAME(RCOCAPE:RCOCAPE38)                                
     FCMA040    IF   E           K DISK                                                             
     FCMA04024  IF   E           K DISK    RENAME(RCMA040:RCMA04024)                                
09022FCMA04034  IF   E           K DISK    RENAME(RCMA040:RCMA04034)                                
     FPMSETP    UF A E           K DISK                                                             
     FPMTABD    IF   E           K DISK                                                             
FQ665FCOCLIN09  IF   E           K DISK    RENAME(RCOCLIN:RCOCLIN09) PREFIX(C_)                     
FQ665FCODEPE08  IF   E           K DISK                                                             
FQ665FMSIVAS    IF   E           K DISK                                                             
FQ665FPMUNAL    IF   E           K DISK                                                             
FQ665FMSDIV0    IF   E           K DISK                                                             
2310BF*AQCDV00  IF   E           K DISK                                                             
2310BFZQGSRK00  IF   E           K DISK                                                             
FH002FZQGCSC00  IF   E           K DISK                                                             
                                                                                                    
      * ESTRUCTURA DE LA INFDS                                                                      
     D                SDS                                                                           
     D  SDSPGM                 1     10                                                             
     D    CCCPGM                     10    OVERLAY(SDSPGM)                                          
     D  SDSJOB               244    253                                                             
     D    CCCJOB                     10    OVERLAY(SDSJOB)                                          
     D  SDSUSR               254    263                                                             
     D  SDSJNBR              264    269                                                             
                                                                                                    
      * AREA DE DADES D'INFORMACIÓ ARXIU                                                            
     D  SFLDS          DS                                                                           
     D    SFLPOCUR           370    371B 0                                                          
     D    SFLPOS1            378    379B 0                                                          
     D    SFLRCD         *RECORD                                                                    
                                                                                                    
     D                 DS                                                                           
     D  JOTRAT                 1     18                                                             
     D   ZXJNBR                1      6                                                             
     D   ZXDATA                7     12                                                             
     D   ZXHORA               13     18  0                                                          
                                                                                                    
     D Z1COMA          DS          2000                                                             
                                                                                                    
      * AREA DE DADES LOCAL I INICIALITZACIO DE VALORS COMUNS                                       
     D DSLDA         E DS                  EXTNAME(PURLDADS)                                        
     D    CCCDEEM                    30    OVERLAY(ZZDEEM)                                          
                                                                                                    
      * AREA DE PARAMETRES DE PROGRAMA                                                              
     D  CM0085       E DS                  EXTNAME(CM0085DS)                                        
                                                                                                    
      * PLANTILLA D'INDICADORS DEL PROGRAMA (ELS RESERVATS NO SURTEN)                               
      * ELS DE TREBALL ES PODEN REDENOMINAR MITJANÇANT OVERLAY                                      
     D  INDICADORS   E DS                  BASED(INDICADORP)                                        
     D                                     EXTNAME(INDDS:RIND0199)                                  
     D     INPOS01   E                     EXTFLD(SETL01)                                           
     D     INPOS02   E                     EXTFLD(WRK97)                                            
09022D     INPOS03   E                     EXTFLD(WRK98)                                            
     D     INDPRO1   E                     EXTFLD(READ5)                                            
     D     INDPRO2   E                     EXTFLD(READ6)                                            
09022D     INDPRO3   E                     EXTFLD(setl02)                                           
     D     SFLDROP   E                     EXTFLD(READ7)                                            
     D     VLDCMDKEY E                     EXTFLD(WRK74)                                            
FQ665D    INDFRA                      1    OVERLAY(WRK66)                                           
     D  INDICADORP     S               *   INZ(%ADDR(*IN))                                          
                                                                                                    
      * CONTROL DEL FLUXE DEL PROGRAMA AMB INICIALITZACIÓ DE POSIC. INICIAL                         
     D                 DS                                                                           
     D  ZXOPT                  1      6    INZ('S01CLR')                                            
     D    ZXOPT1               1      3                                                             
     D    ZXOPT2               4      6                                                             
                                                                                                    
     D* Descomposicion de FIELD para tomar la parte del diccionario                                 
     D                 DS                                                                           
     D  FIELD                  1     10                                                             
     D    ZXFMTO               1      3                                                             
     D    ZXFIE4               4      7                                                             
     D                 DS                                                                           
     D  ZXARVMX                1     25                                                             
     D    ZXARTIX              1     15                                                             
     D    ZXVARIX             16     18                                                             
     D    ZXMODEX             19     21                                                             
      * ESTRUCTURA DE DADES PELS DIFERENTS FORMATS DE SUBARXIU                                      
      * W1DATA -> S01D                                                                              
      * W2DATA -> S02D                                                                              
      **********                                                                                    
      * W1DATA -> S01D  W1DAT2                                                                      
     D                 DS                                                                           
     D  W1DATAV1               1     71                                                             
     D    S11CUST              1     10                                                             
     D    S11FPED             12     21                                                             
     D    S11TPED             23     24                                                             
     D*   S11FREP             26     35                                                             
     D    S11NPCO             26     35                                                             
     D    S11REFE             37     49                                                             
     D*   S11LOGE             51     53                                                             
     D*   S11TPOR             55     57                                                             
     D    S11MONE             59     61                                                             
     D    S11STCO             65     66                                                             
     D    S11TALB             68     68                                                             
     D                 DS                                                                           
     D  W1DAT2                 1     71                                                             
     D    S012DES1             1     40                                                             
FQ665D*   S012RCON            42     56                                                             
FQ665D    S012IMPO            42     55                                                             
FQ665D    S012RCON            57     71                                                             
      **********                                                                                    
      * W2DATA -> S02D  W2DAT2                                                                      
     D                 DS                                                                           
     D  W2DATAV1               1     71                                                             
     D    S21NPCO              1     10                                                             
     D    S21TPED             12     13                                                             
     D    S21CUST             15     24                                                             
     D    S21FPED             26     35                                                             
     D*   S21FREP             37     46                                                             
     D    S21REFE             37     51                                                             
     D    S21MONE             59     61                                                             
     D    S21STCO             65     66                                                             
     D    S21TALB             68     68                                                             
                                                                                                    
     D                 DS                                                                           
     D  W2DAT2                 1     71                                                             
     D    S022DES1             1     40                                                             
FQ665D    S022IMPO            42     55                                                             
FQ665D    S022RCON            57     71                                                             
09022 * W3DATA -> S03D  W1DAT2                                                                      
09022D                 DS                                                                           
09022D  W3DATAV1               1     71                                                             
09022D    S31CUST              1     10                                                             
09022D    S31FPEd             12     21                                                             
09022D    S31TPED             23     24                                                             
09022D    S31NPCO             26     35                                                             
09022D    S31REFE             37     49                                                             
09022D    S31MONE             59     61                                                             
09022D    S31STCO             65     66                                                             
09022D    S31TALB             68     68                                                             
09022D                 DS                                                                           
09022D  W3DAT2                 1     71                                                             
09022D    S032DES1             1     40                                                             
FQ665D*   S032RCON            42     56                                                             
FQ665D    S032IMPO            42     55                                                             
FQ665D    S032RCON            57     71                                                             
      **********                                                                                    
      * EXPORTACIÓ DE PARÀMETRES                                                                    
     D* @PEXPORT       DS                  EXPORT                                                   
     D  @PEXPORT       DS                                                                           
     D*  @PEALL                      50                                                             
     D    @PECIAS      S                   LIKE(S0CIAS) INZ                                         
     D    @PEDLGA      S                   LIKE(S0DLGA) INZ                                         
     D    @PECUST      S                   LIKE(S0CUST) INZ                                         
     D    @PETPED      S                   LIKE(S0TPED) INZ                                         
     D    @PENPCO      S                   LIKE(S0NPCO) INZ                                         
     D    @PEDATP      S                   LIKE(S0DATP) INZ                                         
     D    @PENOPL      S                   LIKE(S0nopl) INZ                                         
     D    @PELINP      S              3  0                                                          
     D    @PELINE      S              3  0                                                          
     D    @PEIDIO      S              1                                                             
     D    @PEOPT       S                   LIKE(SUFOPCI)INZ                                         
     D    @PEPGM       S                   LIKE(SDSPGM) INZ                                         
     D    @PEFMT       S                   LIKE(RECORD) INZ                                         
     D    @PEFLD       S                   LIKE(FIELD)  INZ                                         
     D    @PEERR       S              1                 INZ                                         
     D    @PERRO       S              1                                                             
     D    @POPCI       S                   LIKE(SUFOPCI)                                            
     D    @PEPRG2      S             10                                                             
     D    @PEJOBT      S             18                                                             
     D    @PERCDR      S             10                                                             
     D    @PEFIEL      S             10                                                             
     D    @PEOPCI      S              2                                                             
     D    @PECCIT      S              7                                                             
     D    @PEPAR1      S              1                                                             
     D    @PEPAR2      S              1                                                             
     D    @PEPROG      S             10                                                             
     D  @PCLTA         S             10    INZ                                                      
     D  @PCTAB         S             10    INZ                                                      
                                                                                                    
     D    @PCIAS       S                   LIKE(S0CIAS)                                             
     D    @PDLGA       S                   LIKE(S0DLGA)                                             
     D    @PCUST       S                   LIKE(S0CUST)                                             
     D    @PTPED       S                   LIKE(S0TPED)                                             
     D    @PNPCO       S                   LIKE(S0NPCO)                                             
     D    @PDATP       S                   LIKE(S0DATP)                                             
     D    @PNOPL       S                   LIKE(S0nopl)                                             
                                                                                                    
     D  @PVAN          S             10  0                                                          
     D  @PVAA          S             10                                                             
     D  @PFMI          S              7                                                             
     D  @PFMF          S              7                                                             
     D  @PSEP          S              7                                                             
                                                                                                    
     D* SERIES A UTILITZAR EN PROGRAMA                                                              
     DSSSECPA          S              1A   DIM(10)                                                  
FQ665DSDE              S              1A   DIM(10)                                                  
                                                                                                    
     D* DEFINICIO DE CAMPS DE TREBALL                                                               
     D  ZXGENPL        S              1                                                             
     D  ZXNRR00        S                   LIKE(SUFRCDN)INZ                                         
     D  ZXNNN00        S                   LIKE(SUFRCDN)INZ                                         
     D  ZXLOP00        S                   LIKE(SUFRCDN)INZ                                         
     D  ZXCOUNT        S                   LIKE(SUFRCDN)INZ(1)                                      
     D  ZXFMT          S                   LIKE(CCCFMT) INZ                                         
     D  ZXTRAB         S                   LIKE(S0TRAB) INZ                                         
     D  ZXDROP         S                   LIKE(PA0DROP)INZ                                         
     D  ZXTDOC         S                   LIKE(PA0TDOC)INZ                                         
FX002D  ZXGCSC         S                   LIKE(PA0GCSC)INZ                                         
FX002D  XZGCSC         S                   LIKE(PA0GCSC)INZ                                         
     D  ZXDLGA         S                   LIKE(S0DLGA) INZ                                         
     D  ZXDLGA1        S                   LIKE(PA0DLGA)INZ                                         
     D  ZXCUST         S                   LIKE(S0CUST) INZ                                         
     D  ZXNPCO         S                   LIKE(S0NPCO) INZ                                         
     D  ZXDATP         S                   LIKE(S0DATP) INZ                                         
     D  ZXNOPL         S                   LIKE(S0nopl) INZ                                         
     D  ZXDES1         S                   LIKE(S0DES1) INZ                                         
     D  ZXCLAB         S                   LIKE(S0CLAB) INZ                                         
     D  ZXTPED         S                   LIKE(S0TPED) INZ                                         
     D  ZXFPED         S                   LIKE(S0FPED) INZ                                         
     D  ZXFREP         S                   LIKE(S0FREP) INZ                                         
     D  ZXREFE         S                   LIKE(S0REFE) INZ                                         
     D  ZXAU15         S             15  0                                                          
     D  ZXSELSFL       S              1  0                                                          
     D  ZXFILE         S              1                                                             
     D* Los Campos que vienen a continuacion guardan los valores                                    
     D* de la primera clave con que se cargo el subarchivo y                                        
     D* ACCREF 1=SI 0=NO                                                                            
     D  ZXNOPL_1       S                   LIKE(S0nopl) INZ                                         
     D  ZXDATP_1       S                   LIKE(S0DATP) INZ                                         
     D  ZXNPCO_1       S                   LIKE(S0NPCO) INZ                                         
     D  ZXCUST_1       S                   LIKE(S0CUST) INZ                                         
     D  ZXDLGA_1       S                   LIKE(S0DLGA) INZ                                         
     D  ZXTPED_1       S                   LIKE(S0TPED) INZ                                         
     D  ZXFPED_1       S                   LIKE(S0FPED) INZ                                         
     D  ZXFREP_1       S                   LIKE(S0FREP) INZ                                         
                                                                                                    
      * VALOR NUMÈRIC                                                                               
     D   PXNUM         S             29  9                                                          
      * VALOR ALFANUMÈRIC                                                                           
     D   PXALPH        S             29                                                             
      * LONGITUD TOTAL DEL CAMP (Nº CARÀCTERS INCLÒS CODI EDICIÓ)                                   
     D   PXFLDD        S              2  0 INZ(20)                                                  
      * Nº DE DECIMALS DEL CAMP                                                                     
     D  PXDCCD         S              1  0                                                          
      * TIPUS DE FORMAT DECIMAL (.,)                                                                
     D  PXFMD1         S                   LIKE(ZZFMD1)INZ                                          
      * CODI D'EDICIÓ (4,M,Q,Z)                                                                     
     D  PXEDTC         S                   LIKE(ZZEDTC)INZ('4')                                     
      * RETORN CODI D'ERROR                                                                         
     D  PXNMER         S              1  0 INZ(0)                                                   
      * TIPUS D'AJUST DECIMAL (0=MIG 1=PER SOBRE 2=PER SOTA)                                        
     D  PXTIPA         S              1                                                             
                                                                                                    
      * El valor ZXCOMCAR marcara cuando se deben guardar los valores                               
      * de primera clave anteriores                                                                 
     D  ZXCOMCAR       S              1  0                                                          
      * Campos de uso para trabajar con la API QCMDEXC                                              
     D  ZXQCMD         S            150                                                             
     D  ZXLOGC         S             15  5 INZ(150)                                                 
      * El valor ZXLIPAG tiene el numero de registros a cargar despues de                           
      * un Clear de subfichero y ZXSFLSIZ tiene el valor correspondiente                            
      * de SFLSIZ en el subfichero y ZXSFLFILAS es el nº de filas de entrada                        
      * del subarchivo y ZXSFLCOLU el de columnas                                                   
     D  ZXLIPAG        S                   LIKE(SUFRCDN)INZ(6)                                      
     D  ZXLIPA2        S                   LIKE(SUFRCDN)INZ(6)                                      
     D  ZXNUPAG        S                   LIKE(SUFRCDN)                                            
     D  ZXRESTO        S                   LIKE(SUFRCDN)                                            
     D  ZXSFLSIZ       S              4  0 INZ(720)                                                 
     D  ZXSFLFILAS     S              4  0 INZ(12)                                                  
     D  ZXSFLCOLU      S              4  0 INZ(1)                                                   
      * Definicion de algunas constantes                                                            
     D  JOLINE         S              3  0                                                          
     D  ZXCOCAMB       S             15  9                                                          
     D  ZXZERO10       S             10A   INZ(*ALL'0')                                             
     D    @PCMCOCO     S             20  9                                                          
     D    @PCMCCCO     S             20  9                                                          
     D  @PDATA         S                   LIKE(S0FREP)                                             
     D  @PHORA         S                   LIKE(S0HORA)                                             
FQ446D  @PEDATD        S                   LIKE(S0DAT8) INZ                                         
FQ446D  @PEDATH        S                   LIKE(S0DAT8) INZ                                         
FQ446D  @PEANYY        S              4  0              INZ                                         
FQ446D  @PETNEX        S              2                                                             
FQ446D  @PEMONE        S                   LIKE(S0MONE) INZ                                         
FQ446D  @PETMIL        S              2                                                             
FQ665D    XZDECM       S                   LIKE(MBDECI)                                             
FQ665D    XZAJUM       S                   LIKE(MBDECI)                                             
FQ665D    XZARTI       S                   LIKE(S5ARTI)                                             
FQ665D    XZVARI       S                   LIKE(S5VARI)                                             
FQ665D    XZMODE       S                   LIKE(S5MODE)                                             
FQ665D    XZCIAS       S                   LIKE(S5CIAS)                                             
FQ665D    ZXUNIM1      S                   LIKE(S5UNIM)                                             
FQ665D    ZXUNIM       S                   LIKE(S5UNIM)                                             
FQ665D    ZXUNDC1      S                   LIKE(S5UNDC)                                             
FQ665D    ZXARTI1      S                   LIKE(S5ARTI)                                             
FQ665D    ZXVARI1      S                   LIKE(S5VARI)                                             
FQ665D    ZXMODE1      S                   LIKE(S5MODE)                                             
FQ665D    ZXDTPP1      S                   LIKE(S0DTPP)                                             
FQ665D    ZXCANS1      S                   LIKE(S5CANS)                                             
FQ665D    ZXPRCC1      S                   LIKE(S5PRCC)                                             
FQ665D    ZXCADC1      S                   LIKE(S5CADC)                                             
FQ665D    ZXDTO11      S                   LIKE(S5DTO1)                                             
FQ665D    ZXDTO21      S                   LIKE(S5DTO2)                                             
FQ665D    ZXDTO31      S                   LIKE(S5DTO3)                                             
FQ665D    ZXDTO41      S                   LIKE(S5DTO4)                                             
FQ665D    ZXTIVA1      S                   LIKE(S5TIVA)                                             
FQ665D    ZXFLCD1      S                   LIKE(S5DAT1)                                             
FQ665D    ZXMONE1      S                   LIKE(S0MONE)                                             
FQ665D    ZXMONE2      S                   LIKE(S0MONE)                                             
FQ665D    ZXMON4       S                   LIKE(S0MONE)                                             
FQ665D    @PEECOP      S                   LIKE(S5ECOP)                                             
FQ665D    @PEFLCD      S                   LIKE(S5DATP)                                             
FQ665D    @PETAXE      S                   LIKE(S5PRCC)                                             
FQ665D  @PMON1         S                   LIKE(S0MONE)                                             
FQ665D  @PMON2         S                   LIKE(S0MONE)                                             
FQ665D    ZXBIMP1      S             20S 5 INZ                                                      
FQ665D    ZXBIMPO      S             20S 5 INZ                                                      
FQ665D    ZXCOCAMB1    S             15  9 INZ                                                      
FQ665D    ZXBIMP1ECO   S             20S 5 INZ                                                      
FQ665D    ZXBIMPOECO   S             20S 5 INZ                                                      
FQ665D    ZXECOP1      S                   LIKE(S5ECOP)                                             
FQ665D    ZXDOCUM      S             20S 5 INZ                                                      
FQ665D    ZXIIVA1      S             20S 5 INZ                                                      
FQ665D    ZXIIVA2      S             20S 5 INZ                                                      
FQ665D  ZXTIVC         S              1                                                             
FQ365D  ZXRCON         S                   LIKE(S0FREP)                                             
FQ365 *                                                                                             
FQ365D  S0AMPL         DS                                                                           
FQ365D    S0COEN               1      1                                                             
FQ365D    S0RSPP               2      2                                                             
FQ365D    S0BRDT              24     24                                                             
FQ365D    S0RCON              25     32                                                             
FQ665D    S0RDEN              94     94                                                             
FQ665D*** S0RESTO             33    100                                                             
FH002D  S0AMP2         DS                                                                           
FH002D    S0CUNO               9     18                                                             
FQ665D  S5AMPL         DS                                                                           
FQ665D    S5ECOP              24     24                                                             
FQ665D                 DS                                                                           
FQ665D  ZXBL65I                1      5                                                             
FQ665D    ZXPABI               1      1                                                             
FH002 *                                                                                             
FH002 * Parámetros para GX2500 (Busqueda de Equivalencias)                                          
FH002 *                                                                                             
FH002D  @PXCONO        S              3P 0                                                          
FH002D  @PXDIVI        S              3                                                             
FH002D  @PXDIV2        S              3                                                             
FH002D  @PXCIAS        S              3P 0                                                          
FH002D  @PXCIA2        S              3P 0                                                          
FH002D  @PXMODO        S              1                                                             
FH002D  @PXFLDQ        S              1P 0                                                          
FH002D  @PXFLD1        S              4                                                             
FH002D  @PXFLD2        S              4                                                             
FH002D  @PXFLD3        S              4                                                             
FH002D  @PXVAL1        S             30                                                             
FH002D  @PXVAL2        S             30                                                             
FH002D  @PXVAL3        S             30                                                             
FH002D  @PXFLDR        S              4                                                             
FH002D  @PXVALO        S             30                                                             
FH002D  @PXVALT        S             30                                                             
FH002D  @PXDESC        S             50                                                             
FH002D  @PXPRIO        S              1P 0                                                          
FH002D  @PXERRO        S              1                                                             
FH002D*                                                                                             
FH002D ZXDIVI          s                   LIKE(G0DIVI)                                             
FH002D ZXCIAS          s              3                                                             
PG615dbLckAlb          s               n                                                            
                                                                                                    
06070IRCOCLIN                                                                                       
06070I              S0TPED                      CXTPED                                              
      **************************************************************                                
      * RUTINA PRINCIPAL DEL PGM : DISTRIBUCIÓ DEL PAS PELS 3 SFL  *                                
      *------------------------------------------------------------*                                
     C     ZXOPT1        DOWNE     'END'                                                            
     C     ZXOPT1        CASEQ     'PA0'         PA0MAIN                        SETUP DEL PGM       
     C     ZXOPT1        CASEQ     'S01'         S01MAIN                        SELEC.DIRECTA AR    
     C     ZXOPT1        CASEQ     'S02'         S02MAIN                        FMT. CLAU DE REC    
09022C     ZXOPT1        CASEQ     'S03'         S03MAIN                        FMT. CLAU DE REC    
     C                   ENDCS                                                                      
     C                   ENDDO                                                                      
     C                   SETON                                        LR                            
      **************************************************************                                
      * SUBRUTINA INICIAL. DEFINICIO DE TOTS ELS PARÀMETRES        *                                
      * GENERALS DEL PROGRAMA.                                     *                                
      *------------------------------------------------------------*                                
     C     *INZSR        BEGSR                                                                      
                                                                                                    
      * DEFINICIO DE LES KLIST DEL PGM                                                              
     C     KPMTABD       KLIST                                                                      
     C                   KFLD                    PECIAS                                             
     C                   KFLD                    PECTAB                                             
     C                   KFLD                    PECLTA                                             
     C     KCOCLIN       KLIST                                                                      
     C                   KFLD                    S0CIAS                                             
     C                   KFLD                    S0CUST                                             
     C     KCOCAPE0      KLIST                                                                      
     C                   KFLD                    S0CIAS                                             
     C     KCOCAPE23     KLIST                                                                      
     C                   KFLD                    S0CIAS                                             
     C*                  KFLD                    S0DLGA                                             
     C                   KFLD                    S0NPCO                                             
     C                   KFLD                    S0TPED                                             
FQ365C     KCOCAPE25     KLIST                                                                      
     C                   KFLD                    S0CIAS                                             
     C*                  KFLD                    S0DLGA                                             
     C                   KFLD                    S0CUST                                             
09022C     KCOCAPE38     KLIST                                                                      
09022C                   KFLD                    S0CIAS                                             
09022C                   KFLD                    S0FPED                                             
     C     KCMA0400      KLIST                                                                      
     C                   KFLD                    S0CIAS                                             
     C     KCMA04024     KLIST                                                                      
     C                   KFLD                    S0CIAS                                             
     C*                  KFLD                    S0DLGA                                             
     C                   KFLD                    S0CUST                                             
09022C     KCMA04034     KLIST                                                                      
09022C                   KFLD                    S0CIAS                                             
09022C                   KFLD                    S0FRRR                                             
     C     KCMA04011     KLIST                                                                      
     C                   KFLD                    S0CIAS                                             
     C                   KFLD                    S0DLGA                                             
     C                   KFLD                    S0NPCO                                             
     C                   KFLD                    S0TPED                                             
     C     KMSSETP       KLIST                                                                      
     C                   KFLD                    PICIAS                                             
     C                   KFLD                    PIPROG                                             
     C                   KFLD                    PIUSU1                                             
FQ665C     KCOCLIN9F     KLIST                                                                      
FQ665C                   KFLD                    C_S0CIAS                                           
FQ665C                   KFLD                    C_S0GRP2                                           
FQ665C                   KFLD                    C_S0CUST                                           
FQ665C     KCODEPE08     KLIST                                                                      
FQ665C                   KFLD                    S5CIAS                                             
FQ665C                   KFLD                    S5DLGA                                             
FQ665C                   KFLD                    S5NPCO                                             
FQ665C                   KFLD                    S5TPED                                             
FQ665C                   KFLD                    S5DATP                                             
FQ665C                   KFLD                    S5NOPL                                             
FQ665C     KMSIVAS       KLIST                                                                      
FQ665C                   KFLD                    MVCIAS                                             
FQ665C                   KFLD                    MVTIVA                                             
FQ665C                   KFLD                    MVPABI                                             
FQ665C                   KFLD                    MVFLCD                                             
FQ665C     KMSIVASA      KLIST                                                                      
FQ665C                   KFLD                    MVCIAS                                             
FQ665C                   KFLD                    MVTIVA                                             
FQ665C                   KFLD                    MVPABI                                             
FQ665C     KPMUNAL       KLIST                                                                      
FQ665C                   KFLD                    P6CIAS                                             
FQ665C                   KFLD                    P6ARTI                                             
FQ665C                   KFLD                    P6VARI                                             
FQ665C                   KFLD                    P6MODE                                             
FQ665C                   KFLD                    P6UNIM                                             
FQ665C     KMSDIV0       KLIST                                                                      
FQ665C                   KFLD                    MBCIAS                                             
FQ665C                   KFLD                    MBMONE                                             
FH002C     KZQGCSC00     KLIST                                                                      
FH002C                   KFLD                    G0CONO                                             
FH002C                   KFLD                    G0GCSC                                             
2310BC*    KZAQCDV00     KLIST                                                                      
2310BC*                  KFLD                    OKCONO                                             
2310BC*                  KFLD                    OKCUNO                                             
2310BC*                  KFLD                    OKDIVI                                             
2310BC     KZQGSRK00     KLIST                                                                      
2310BC                   KFLD                    R0CONO                                             
2310BC                   KFLD                    R0DIVI                                             
2310BC                   KFLD                    R0CUNO                                             
      * RECUPERACIÓ DE LA LDA DE COMPRES                                                            
     C     *DTAARA       DEFINE    PURLDA        DSLDA                                              
     C     *LOCK         IN        DSLDA                                                            
     C                   MOVEL     'C'           ZZSECP                                             
     C                   OUT       DSLDA                                                            
     C     *ENTRY        PLIST                                                                      
     C                   PARM                    @PCUST                                             
     C                   PARM                    @PERRO                                             
                                                                                                    
FQ665C                   EVAL      ZXCOCAMB=1                                                       
FQ665C                   EVAL      MVCIAS=ZZCIAS                                                    
     C                   EVAL      Z1ASTE='*'                                                       
     C                   EVAL      PXFMD1=ZZFMD1                                                    
     C                   EVAL      PXDCCD=2                                                         
     C* CAPÇALERES D'OPCIONS DEL SFL  (CODIS D'ARXIU DE MISSATGES)                                  
     C                   EVAL      SUFOPC2=*BLANKS                                                  
     C                   IF        ZZNPGM=' '                                                       
     C                   EVAL      SUFOPC1='OCM0085'                                                
     C                   ELSE                                                                       
     C                   EVAL      SUFOPC1='OCM0085'                                                
     C                   ENDIF                                                                      
     C* TITOLS DE PANTALLES (CODIS D'ARXIU DE MISSATGES)                                            
     C                   IF        ZZNPGM=' '                                                       
     C                   EVAL      CCCCTIT='TCM0085'                                                
     C                   ELSE                                                                       
     C                   EVAL      CCCCTIT='TCM0085'                                                
     C                   ENDIF                                                                      
     C* ACTIVEM EL SFLDSPCTL                                                                        
     C                   EVAL      SFLCTL=*ON                                                       
      * ACTUALITZACIÓ DELS CAMPS DEL PMSETP I ALTRES CAMPS AMB VALORS COMUNS                        
     C                   EVAL      @PCIAS=ZZCIAS                                                    
     C                   EVAL      @PEDLGA=ZZDLGA                                                   
     C                   EVAL      @PECIAS=ZZCIAS                                                   
     C                   EVAL      @PEDLGA=ZZDLGA                                                   
     C                   EVAL      S0CIAS=ZZCIAS                                                    
     C                   EVAL      S0DLGA=ZZDLGA                                                    
     C                   EVAL      S0CUST=@PCUST                                                    
     C                   EVAL      S0TPED=@PTPED                                                    
     C                   EVAL      PICIAS=ZZCIAS                                                    
     C                   EVAL      PIPROG=SDSPGM                                                    
     C                   EVAL      PIUSU1=ZZUSUA                                                    
     C                   EVAL      ZXDLGA=ZZDLGA                                                    
     C                   EVAL      ZXCUST=@PCUST                                                    
                                                                                                    
     C                   EVAL      S0DES1=*BLANKS                                                   
     C                   EVAL      S0CLAB=*BLANKS                                                   
     C* Puesto que en cada pedido se puede poner una clave o descripción                            
     C* distinta o modificada se decide tomar los datos del fichero de                              
     C* proveedores para tener los valores de posicionamiento                                       
     C     KCOCLIN       CHAIN     COCLIN                             81                            
     C                   EVAL      ZXDES1=S0DES1                                                    
     C                   EVAL      ZXCLAB=S0CLAB                                                    
     C                   EVAL      ZXTPED=@PTPED                                                    
     C                   EVAL      ZXFPED=0                                                         
     C                   EVAL      ZXFREP=0                                                         
                                                                                                    
      *************************************************                                             
     C* Protección de campos según parámetros llegados                                              
     C                   EXSR      CS_PROTECT                                                       
      *************************************************                                             
      * RECUPEREM DEL FITXER DE SETUP EL FORMAT QUE EM DE MOSTRAR PER OMISIÓ                        
     C     KMSSETP       CHAIN (N) PMSETP                             81                            
     C                   CLEAR                   CM0085                                             
     C     PIDATR        CAT       CM0085:0      CM0085                                             
     C                   EVAL      ZXTDOC=MQTDOC                                                    
     C                   EVAL      ZXDLGA1=MQDLGA                                                   
     C                   EVAL      ZXDROP=MQSDRP                                                    
     C                   EVAL      ZXFMT=MQS085                                                     
     C                   EVAL      ZXTRAB=MQTRAB                                                    
FH002C                   EVAL      ZXGCSC=MQGCSC                                                    
     C                   IF        ZXDROP=' ' OR ZXDROP>'1'                                         
     C                   EVAL      ZXDROP='0'                                                       
     C                   ENDIF                                                                      
                                                                                                    
     C* RECUPEREM ELS VALORS DE L'AREA DE PARÀMETRES DE PROGRAMA                                    
     C                   IF        CHAIN=*OFF                                                       
     C                   SELECT                                                                     
     C                   WHEN      MQS085=' ' OR MQS085='0'                                         
     C                   EVAL      ZXOPT='S01CLR'                                                   
     C                   WHEN      MQS085='1'                                                       
     C                   EVAL      ZXOPT='S01CLR'                                                   
     C                   WHEN      MQS085='2'                                                       
     C                   EVAL      ZXOPT='S02CLR'                                                   
09022C                   WHEN      MQS085='3'                                                       
09022C                   EVAL      ZXOPT='S03CLR'                                                   
     C                   ENDSL                                                                      
     C                   ENDIF                                                                      
FQ665C                   IF        ZZE046='4'                                                       
FQ665C                   EVAL      INDFRA=*ON                                                       
FQ665C                   ENDIF                                                                      
                                                                                                    
     C                   EVAL      ERRGRL=*ON                                                       
FH002 *                                                                                             
FH002 *   DIVISION=BUSCAR EQUIVALENCIA DE EMPRESA                                                   
FH002 *                                                                                             
FH002C                   MOVEL     *BLANKS       @PXVAL1                                            
FH002C                   MOVEL     ZZCIAS        @PXVAL1                                            
FH002                                                                                               
FH002C                   CALL      'GX2500'                                                         
FH002C                   PARM      100           @PXCONO                                            
FH002C                   PARM      *BLANKS       @PXDIV2                                            
FH002C                   PARM      0             @PXCIA2                                            
FH002C                   PARM      '1'           @PXMODO                                            
FH002C                   PARM      1             @PXFLDQ                                            
FH002C                   PARM      'CIAS     '   @PXFLD1                                            
FH002C                   PARM      *BLANKS       @PXFLD2                                            
FH002C                   PARM      *BLANKS       @PXFLD3                                            
FH002C                   PARM                    @PXVAL1                                            
FH002C                   PARM      *BLANKS       @PXVAL2                                            
FH002C                   PARM      *BLANKS       @PXVAL3                                            
FH002C                   PARM      'DIVI     '   @PXFLDR                                            
FH002C                   PARM      *BLANKS       @PXVALO                                            
FH002C                   PARM      *BLANKS       @PXVALT                                            
FH002C                   PARM      *BLANKS       @PXDESC                                            
FH002C                   PARM      *ZEROS        @PXPRIO                                            
FH002C                   PARM      *BLANKS       @PXERRO                                            
FH002C                   IF        @PXERRO=*BLANKS                                                  
FH002C                   MOVEL(P)  @PXVALO       ZXDIVI                                             
FH002C                   ELSE                                                                       
FH002C                   MOVEL     ZZCIAS        ZXCIAS                                             
FH002C                   EVAL      ZXDIVI=ZXCIAS                                                    
FH002C                   ENDIF                                                                      
FH002 *                                                                                             
     C                   ENDSR                                                                      
      **************************************************************                                
      * SOBRE PROTECCION DE CAMPOS                                 *                                
      *------------------------------------------------------------*                                
     C     CS_PROTECT    BEGSR                                                                      
     C                   IF        @PCUST<>*BLANKS                                                  
     C                   EVAL      INDPRO1=*ON                                                      
     C                   EVAL      PSUCUST=ZXCUST                                                   
     C     KCOCLIN       CHAIN     COCLIN                             81                            
     C                   ENDIF                                                                      
                                                                                                    
     C                   IF        @PTPED<>*BLANKS                                                  
     C                   EVAL      INDPRO2=*ON                                                      
     C                   EVAL      PSUTPED=@PTPED                                                   
     C                   ENDIF                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA CONTROL DEL SFL S01                              *                                
      *------------------------------------------------------------*                                
     C     S01MAIN       BEGSR                                                                      
     C                   DOW       ZXOPT1='S01'                                                     
     C     ZXOPT2        CASEQ     'CLR'         S01CLR                                             
     C     ZXOPT2        CASEQ     'INZ'         S01INZ                                             
     C     ZXOPT2        CASEQ     'DSP'         S01DSP                                             
     C     ZXOPT2        CASEQ     'CMD'         S01CMD                                             
     C     ZXOPT2        CASEQ     'CHK'         S01CHK                                             
     C                   ENDCS                                                                      
     C                   ENDDO                                                                      
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA INICIALITZACIÓ I CARREGA DEL SFL                 *                                
      *------------------------------------------------------------*                                
     C     S01INZ        BEGSR                                                                      
     C                   EVAL      ZXOPT2='DSP'                                                     
     C                   EXSR      CS_SFLIN1                                                        
                                                                                                    
     C                   DOW       ZXLOP00 < ZXLIPAG                                                
     C                   EVAL      ZXFILE=' '                                                       
     C                   EXSR      CS_READ01                                                        
     C* Cargo el máximo de 204 registros                                                            
     C                   IF        ZXNRR00>ZXSFLSIZ                                                 
     C                   EVAL      EOF=*ON                                                          
     C                   ENDIF                                                                      
     C                   IF        EOF=*ON                                                          
     C                   LEAVE                                                                      
     C                   ENDIF                                                                      
                                                                                                    
     C                   EXSR      CS_SELSFL                                                        
     C                   IF        ZXSELSFL=1                                                       
     C                   GOTO      TNEXRE01                                                         
     C                   ENDIF                                                                      
                                                                                                    
     C                   EVAL      ZXNRR00=ZXNRR00 + 1                                              
     C                   EVAL      ZXLOP00=ZXLOP00 + 1                                              
     C                   EXSR      CS_MOVFP                                                         
     C                   EXSR      CS_SAVFK                                                         
     C                   WRITE     SUFD                                                             
     C     TNEXRE01      TAG                                                                        
     C                   ENDDO                                                                      
                                                                                                    
     C* LESTURA DEL FICHERO DE ALBARANES DIRECTOS                                                   
     C                   EXSR      CS_SETLL1B                                                       
     C                   EXSR      S01INZB                                                          
      *                                                                                             
     C                   EXSR      CS_SFLIN2                                                        
     C     S01INZT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA CONTROL DEL SFL S02                              *                                
      *------------------------------------------------------------*                                
     C     CS_READ01     BEGSR                                                                      
                                                                                                    
FQ365C     KCOCAPE0      READE     COCAPE25                               82                        
                                                                                                    
     C     READ01T       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA INICIALITZACIÓ I CARREGA DEL SFL                 *                                
      *------------------------------------------------------------*                                
     C     S01INZB       BEGSR                                                                      
     C                   EVAL      ZXOPT2='DSP'                                                     
                                                                                                    
     C                   DOW       ZXLOP00 < ZXLIPAG                                                
     C                   EVAL      ZXFILE='1'                                                       
     C                   EXSR      CS_READ01B                                                       
     C* Cargo el máximo de 204 registros                                                            
     C                   IF        ZXNRR00>ZXSFLSIZ                                                 
     C                   EVAL      EOF=*ON                                                          
     C                   ENDIF                                                                      
     C                   IF        EOF=*ON                                                          
     C                   LEAVE                                                                      
     C                   ENDIF                                                                      
                                                                                                    
     C                   EXSR      CS_SELSFL                                                        
     C                   IF        ZXSELSFL=1                                                       
     C                   GOTO      TNEXRE01B                                                        
     C                   ENDIF                                                                      
                                                                                                    
     C                   EVAL      ZXNRR00=ZXNRR00 + 1                                              
     C                   EVAL      ZXLOP00=ZXLOP00 + 1                                              
     C                   EXSR      CS_MOVFP                                                         
     C                   EXSR      CS_SAVFK                                                         
     C                   WRITE     SUFD                                                             
     C     TNEXRE01B     TAG                                                                        
     C                   ENDDO                                                                      
                                                                                                    
     C     S01INZBT      ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA CONTROL DEL SFL S02                              *                                
      *------------------------------------------------------------*                                
     C     CS_READ01B    BEGSR                                                                      
                                                                                                    
     C     KCMA0400      READE     CMA04024                               82                        
                                                                                                    
     C     READ01BT      ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VISUALITZACIÓ SFL                                *                                
      *------------------------------------------------------------*                                
     C     S01DSP        BEGSR                                                                      
     C                   EVAL      ZXOPT2='CMD'                                                     
     C                   IF        ZZNPGM=' '                                                       
     C                   EVAL      PPPCMD1='CMD3041'                                                
     C                   ELSE                                                                       
     C                   EVAL      PPPCMD1='CMD3041'                                                
     C                   ENDIF                                                                      
     C                   EVAL      SUFHED1='HCM0850'                                                
     C*                                                                                             
     C                   EXSR      CS_SFLDSP                                    SI REGS             
     C     S01DSPT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VALIDACIÓ DELS CMD'S                             *                                
      *------------------------------------------------------------*                                
     C     S01CMD        BEGSR                                                                      
     C                   EVAL      ZXOPT2='CHK'                                                     
     C                   EXSR      CS_SFLCMD                                                        
     C     S01CMDT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VALIDACIÓ DEL SFL: FORMAT SFL I OPCIONS          *                                
      *------------------------------------------------------------*                                
     C     S01CHK        BEGSR                                                                      
     C                   EVAL      ZXOPT2='DSP'                                                     
                                                                                                    
      * SUBRUTINA COMÚ DE VALIDACIÓ DEL SFL                                                         
     C                   EXSR      CS_SFLCHK                                                        
                                                                                                    
     C     S01CHKT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA DE NETEJA DEL SFL                                *                                
      *------------------------------------------------------------*                                
     C     S01CLR        BEGSR                                                                      
     C                   EVAL      ZXOPT='S01INZ'                                                   
     C                   EVAL      CCCFMT='1'                                                       
     C                   MOVEA     ZXZERO10      *IN(90)                                            
     C                   EVAL      INPOS01=*ON                                                      
     C                   EXSR      CS_SFLCLR                                                        
     C                   EXSR      CS_SETLL01                                                       
     C     S01CLRT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA CONTROL DEL SFL S012                              *                               
      *------------------------------------------------------------*                                
     C     CS_SETLL01    BEGSR                                                                      
     C                   EVAL      EOF=*OFF                                                         
     C                   EVAL      READ1=*OFF                                                       
     C                   EVAL      S0DLGA=ZXDLGA                                                    
     C                   EVAL      S0CUST=ZXCUST                                                    
                                                                                                    
FQ365C     KCOCAPE25     SETLL     COCAPE25                                                         
                                                                                                    
     C     SETLL01       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA CONTROL DEL SFL S012                              *                               
      *------------------------------------------------------------*                                
     C     CS_SETLL1B    BEGSR                                                                      
     C                   EVAL      S0DLGA=ZXDLGA                                                    
     C                   EVAL      S0CUST=ZXCUST                                                    
                                                                                                    
     C     KCMA04024     SETLL     CMA04024                                                         
                                                                                                    
     C     SETLL01B      ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA CONTROL DEL SFL S02                              *                                
      *------------------------------------------------------------*                                
     C     S02MAIN       BEGSR                                                                      
     C                   DOW       ZXOPT1='S02'                                                     
     C     ZXOPT2        CASEQ     'CLR'         S02CLR                                             
     C     ZXOPT2        CASEQ     'INZ'         S02INZ                                             
     C     ZXOPT2        CASEQ     'DSP'         S02DSP                                             
     C     ZXOPT2        CASEQ     'CMD'         S02CMD                                             
     C     ZXOPT2        CASEQ     'CHK'         S02CHK                                             
     C                   ENDCS                                                                      
     C                   ENDDO                                                                      
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA INICIALITZACIÓ I CARREGA DEL SFL                 *                                
      *------------------------------------------------------------*                                
     C     S02INZ        BEGSR                                                                      
     C                   EVAL      ZXOPT2='DSP'                                                     
     C                   EXSR      CS_SFLIN1                                                        
                                                                                                    
     C                   DOW       ZXLOP00 < ZXLIPAG                                                
     C                   EVAL      ZXFILE=' '                                                       
     C                   EXSR      CS_READ02                                                        
     C* Cargo el máximo de 204 registros                                                            
     C                   IF        ZXNRR00>ZXSFLSIZ                                                 
     C                   EVAL      EOF=*ON                                                          
     C                   ENDIF                                                                      
     C                   IF        EOF=*ON                                                          
     C                   LEAVE                                                                      
     C                   ENDIF                                                                      
                                                                                                    
     C                   EXSR      CS_SELSFL                                                        
     C                   IF        ZXSELSFL=1                                                       
     C                   GOTO      TNEXRE02                                                         
     C                   ENDIF                                                                      
                                                                                                    
     C                   IF        INDPRO2=*ON AND S0TPED<>@PTPED                                   
     C                   GOTO      TNEXRE02                                                         
     C                   ENDIF                                                                      
                                                                                                    
     C                   EVAL      ZXNRR00=ZXNRR00 + 1                                              
     C                   EVAL      ZXLOP00=ZXLOP00 + 1                                              
     C                   EXSR      CS_MOVFP                                                         
     C                   EXSR      CS_SAVFK                                                         
     C                   WRITE     SUFD                                                             
     C     TNEXRE02      TAG                                                                        
     C                   ENDDO                                                                      
                                                                                                    
     C* LESTURA DEL FICHERO DE ALBARANES DIRECTOS                                                   
     C                   EXSR      CS_SETLL2B                                                       
     C                   EXSR      S02INZB                                                          
      *                                                                                             
     C                   EXSR      CS_SFLIN2                                                        
     C     S02INZT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA INICIALITZACIÓ I CARREGA DEL SFL                 *                                
      *------------------------------------------------------------*                                
     C     S02INZB       BEGSR                                                                      
     C                   EVAL      ZXOPT2='DSP'                                                     
                                                                                                    
     C                   DOW       ZXLOP00 < ZXLIPAG                                                
     C                   EVAL      ZXFILE='1'                                                       
     C                   EXSR      CS_READ02B                                                       
     C* Cargo el máximo de 204 registros                                                            
     C                   IF        ZXNRR00>ZXSFLSIZ                                                 
     C                   EVAL      EOF=*ON                                                          
     C                   ENDIF                                                                      
     C                   IF        EOF=*ON                                                          
     C                   LEAVE                                                                      
     C                   ENDIF                                                                      
                                                                                                    
     C                   EXSR      CS_SELSFL                                                        
     C                   IF        ZXSELSFL=1                                                       
     C                   GOTO      TNEXRE02B                                                        
     C                   ENDIF                                                                      
                                                                                                    
     C                   IF        INDPRO2=*ON AND S0TPED<>@PTPED                                   
     C                   GOTO      TNEXRE02B                                                        
     C                   ENDIF                                                                      
                                                                                                    
     C                   EVAL      ZXNRR00=ZXNRR00 + 1                                              
     C                   EVAL      ZXLOP00=ZXLOP00 + 1                                              
     C                   EXSR      CS_MOVFP                                                         
     C                   EXSR      CS_SAVFK                                                         
     C                   WRITE     SUFD                                                             
     C     TNEXRE02B     TAG                                                                        
     C                   ENDDO                                                                      
                                                                                                    
     C     S02INZBT      ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA CONTROL DEL SFL S02                              *                                
      *------------------------------------------------------------*                                
     C     CS_READ02     BEGSR                                                                      
                                                                                                    
     C     KCOCAPE0      READE     COCAPE23                               82                        
                                                                                                    
     C     READ02T       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA CONTROL DEL SFL S02                              *                                
      *------------------------------------------------------------*                                
     C     CS_READ02B    BEGSR                                                                      
                                                                                                    
     C     KCMA0400      READE     CMA040                                 82                        
                                                                                                    
     C     READ02BT      ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VISUALITZACIÓ SFL                                *                                
      *------------------------------------------------------------*                                
     C     S02DSP        BEGSR                                                                      
     C                   EVAL      ZXOPT2='CMD'                                                     
     C                   IF        ZZNPGM=' '                                                       
     C                   EVAL      PPPCMD1='CMD3041'                                                
     C                   ELSE                                                                       
     C                   EVAL      PPPCMD1='CMD3041'                                                
     C                   ENDIF                                                                      
     C                   EVAL      SUFHED1='HCM0851'                                                
                                                                                                    
     C                   EXSR      CS_SFLDSP                                    SI REGS             
     C     S02DSPT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VALIDACIÓ DELS CMD'S                             *                                
      *------------------------------------------------------------*                                
     C     S02CMD        BEGSR                                                                      
     C                   EVAL      ZXOPT2='CHK'                                                     
     C                   EXSR      CS_SFLCMD                                                        
     C     S02CMDT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VALIDACIÓ DEL SFL: FORMAT SFL I OPCIONS          *                                
      *------------------------------------------------------------*                                
     C     S02CHK        BEGSR                                                                      
     C                   EVAL      ZXOPT2='DSP'                                                     
                                                                                                    
      * SUBRUTINA COMÚ DE VALIDACIÓ DEL SFL                                                         
     C                   EXSR      CS_SFLCHK                                                        
                                                                                                    
     C     S02CHKT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA DE NETEJA DEL SFL                                *                                
      *------------------------------------------------------------*                                
     C     S02CLR        BEGSR                                                                      
     C                   EVAL      ZXOPT2='INZ'                                                     
     C                   EVAL      CCCFMT='2'                                                       
     C                   MOVEA     ZXZERO10      *IN(90)                                            
     C                   EVAL      INPOS02=*ON                                                      
     C                   EXSR      CS_SFLCLR                                                        
     C                   EXSR      CS_SETLL02                                                       
     C     S02CLRT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA CONTROL DEL SFL S022                              *                               
      *------------------------------------------------------------*                                
     C     CS_SETLL02    BEGSR                                                                      
     C                   EVAL      S0DLGA=ZXDLGA                                                    
     C                   EVAL      S0NPCO=ZXNPCO                                                    
     C                   EVAL      S0TPED=ZXTPED                                                    
                                                                                                    
     C     KCOCAPE23     SETLL     COCAPE23                                                         
                                                                                                    
     C     SETLL02       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA CONTROL DEL SFL S022                              *                               
      *------------------------------------------------------------*                                
     C     CS_SETLL2B    BEGSR                                                                      
     C                   EVAL      S0DLGA=ZXDLGA                                                    
     C                   EVAL      S0NPCO=ZXNPCO                                                    
     C                   EVAL      S0TPED=ZXTPED                                                    
                                                                                                    
     C     KCMA04011     SETLL     CMA040                                                           
                                                                                                    
     C     SETLL22B      ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA INICIAL PARA PANTALL                                                              
      *------------------------------------------------------------*                                
     C     PA0MAIN       BEGSR                                                                      
     C                   DOW       ZXOPT1='PA0'                                                     
     C     ZXOPT2        CASEQ     'CLR'         PA0CLR                                             
     C     ZXOPT2        CASEQ     'INZ'         PA0INZ                                             
     C     ZXOPT2        CASEQ     'DSP'         PA0DSP                                             
     C     ZXOPT2        CASEQ     'CMD'         PA0CMD                                             
     C     ZXOPT2        CASEQ     'CHK'         PA0CHK                                             
     C     ZXOPT2        CASEQ     'UPD'         PA0UPD                                             
     C                   ENDCS                                                                      
     C                   ENDDO                                                                      
     C     PA0MAINT      ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA DE NETEJA DE PA0                                 *                                
      *------------------------------------------------------------*                                
     C     PA0CLR        BEGSR                                                                      
     C                   EVAL      ZXOPT2='INZ'                                                     
     C     *NOKEY        CLEAR     *ALL          RPMSETP                                            
     C                   MOVEA     ZXZERO10      *IN(40)                                            
     C                   MOVEA     ZXZERO10      *IN(50)                                            
     C                   EVAL      CSRFILA=0                                                        
     C                   EVAL      CSRCOLU=0                                                        
     C     PA0CLRT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA DE INICI DE PA0                                 *                                 
      *------------------------------------------------------------*                                
     C     PA0INZ        BEGSR                                                                      
     C     KMSSETP       CHAIN (N) PMSETP                             81                            
     C                   CLEAR                   CM0085                                             
     C     PIDATR        CAT       CM0085:0      CM0085                                             
     C                   EXSR      CS_MOVFP                                                         
                                                                                                    
     C                   EVAL      ZXOPT2='DSP'                                                     
     C     PA0INZT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VISUALITZACIÓ DE PA0                             *                                
      *------------------------------------------------------------*                                
     C     PA0DSP        BEGSR                                                                      
     C                   EVAL      ZXOPT2='CMD'                                                     
     C                   EVAL      PPPCMD1='CMD3031'                                                
     C                   EXFMT     PA0                                                              
     C                   EVAL      ERRGRL=*OFF                                                      
     C                   EVAL      MSGER=*BLANKS                                                    
     C                   MOVEA     ZXZERO10      *IN(40)                                            
     C                   MOVEA     ZXZERO10      *IN(50)                                            
                                                                                                    
     C                   EVAL      CSRFILA=0                                                        
     C                   EVAL      CSRCOLU=0                                                        
     C     PA0DSPT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VALIDACIÓ DELS CMD'S                             *                                
      *------------------------------------------------------------*                                
     C     PA0CMD        BEGSR                                                                      
     C                   EVAL      ZXOPT2='CHK'                                                     
                                                                                                    
     C                   SELECT                                                                     
                                                                                                    
      * F03=FINALITZAR                                                                              
     C                   WHEN      EXIT=*ON                                                         
     C                   EVAL      ZXOPT1='END'                                                     
                                                                                                    
      * F04=AJUDA DE CAMPS                                                                          
     C                   WHEN      HELP=*ON                                                         
     C                   EVAL      ZXOPT2='DSP'                                                     
     C                   EXSR      CS_POSCUR                                                        
                                                                                                    
     C                   IF        FIELD='PA0DROP'                                                  
     C                   EVAL      @PEFMT=*BLANKS                                                   
     C                   EVAL      @PEFLD=*BLANKS                                                   
     C                   EVAL      @PEFLD='DROP'                                                    
     C                   CALL      'MMPROM'                                     Query-Aut-F4   X    
     C                   PARM      *BLANKS       @PEOPT                         PARM Qry-F4         
     C                   PARM      *BLANKS       @PEPGM                         PARM Qry-F4         
     C                   PARM      *BLANKS       @PEFMT                         PARM Qry-F4         
     C                   PARM                    @PEFLD                         PARM Qry-F4         
     C                   PARM      *BLANKS       @PEERR                         PARM Qry-F4         
                                                                                                    
     C                   IF        @PEERR>'0'                                                       
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='ADP0304'                                                  
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           PA0CMDT                                            
      * Si no han realizado ninguna selección no tocamos nada                                       
     C                   IF        @PEERR='A'                                                       
     C                   EVAL      ERRGRL=*ON                                                       
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           PA0CMDT                                            
     C                   EVAL      PA0DROP=@PEOPT                                                   
     C                   GOTO      TPA0F4                                                           
     C                   ENDIF                                                                      
      * Ayudas en tablas                                                                            
     C                   IF        FIELD='PA0DLGA'                                                  
     C                   EVAL      @PCLTA=*BLANKS                                                   
     C                   EVAL      @PCTAB=*BLANKS                                                   
     C                   EVAL      @PCTAB=ZXFIE4                                                    
     C                   EVAL      @PCLTA=PA0DLGA                                                   
                                                                                                    
     C                   CALL      'MMTABL'                                     Query-Aut-F4   X    
     C                   PARM                    @PCLTA                         PARM Qry-F4         
     C                   PARM                    @PCTAB                         PARM Qry-F4         
     C                   PARM                    @PCIAS                         PARM Qry-F4         
     C                   PARM                    @PEERR                         PARM Qry-F4         
                                                                                                    
     C                   IF        @PEERR>'0'                                                       
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='ADP0304'                                                  
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           PA0CMDT                                            
      * Si no han realizado ninguna selección no tocamos nada                                       
     C                   IF        @PEERR='A'                                                       
     C                   EVAL      ERRGRL=*ON                                                       
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           PA0CMDT                                            
      *                                                                                             
     C                   EVAL      PA0DLGA=@PCLTA                                                   
                                                                                                    
     C                   ENDIF                                                                      
                                                                                                    
     C                   IF        FIELD='PA0TDOC'                                                  
     C                   CALL      'MMPROM'                                     Query-Aut-F4   X    
     C                   PARM      *BLANKS       @PEOPT                         PARM Qry-F4         
     C                   PARM      SDSPGM        @PEPGM                         PARM Qry-F4         
     C                   PARM      'PA0      '   @PEFMT                         PARM Qry-F4         
     C                   PARM      'PA0TDOC  '   @PEFLD                         PARM Qry-F4         
     C                   PARM      *BLANKS       @PEERR                         PARM Qry-F4         
                                                                                                    
     C                   IF        @PEERR>'0'                                                       
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='ADP0304'                                                  
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           PA0CMDT                                            
      * Si no han realizado ninguna selección no tocamos nada                                       
     C                   IF        @PEERR='A'                                                       
     C                   EVAL      ERRGRL=*ON                                                       
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           PA0CMDT                                            
     C                   EVAL      PA0TDOC=@PEOPT                                                   
     C                   GOTO      PA0CMDT                                                          
     C                   ENDIF                                                                      
      *                                                                                             
     C                   IF        FIELD='PA0S001'                                                  
     C                   EVAL      @PEFMT=*BLANKS                                                   
     C                   EVAL      @PEFLD=*BLANKS                                                   
     C                   EVAL      @PEFLD='CFMT'                                                    
     C                   ENDIF                                                                      
                                                                                                    
     C                   IF        FIELD='PA0DROP'                                                  
     C                   EVAL      PA0DROP=@PEOPT                                                   
     C                   ENDIF                                                                      
                                                                                                    
     C                   IF        FIELD='PA0SE01' OR FIELD='PA0SE02'                               
     C                             OR FIELD='PA0SE03' OR FIELD='PA0SE04'                            
     C                             OR FIELD='PA0SE05' OR FIELD='PA0SE06'                            
     C                   EVAL      @PEFMT=*BLANKS                                                   
     C                   EVAL      @PEFLD=*BLANKS                                                   
     C                   EVAL      @PEFLD='SECP'                                                    
     C                   ENDIF                                                                      
                                                                                                    
     C                   CALL      'MMPROM'                                     Query-Aut-F4   X    
     C                   PARM      *BLANKS       @PEOPT                         PARM Qry-F4         
     C                   PARM      SDSPGM        @PEPGM                         PARM Qry-F4         
     C                   PARM                    @PEFMT                         PARM Qry-F4         
     C                   PARM                    @PEFLD                         PARM Qry-F4         
     C                   PARM      *BLANKS       @PEERR                         PARM Qry-F4         
                                                                                                    
     C                   IF        @PEERR>'0'                                                       
     C                   EVAL      ERRGRL=*ON                                                       
     C                   IF        FIELD='PA0S001'                                                  
     C***                EVAL      WRK40=*ON                                                        
     C                   ENDIF                                                                      
                                                                                                    
     C                   IF        FIELD='PA0SE01' OR FIELD='PA0SE02'                               
     C                             OR FIELD='PA0SE03' OR FIELD='PA0SE04'                            
     C                             OR FIELD='PA0SE05' OR FIELD='PA0SE06'                            
     C                   EVAL      WRK41=*ON                                                        
     C                   ENDIF                                                                      
     C                   EVAL      MSGER='ADP0304'                                                  
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TPA0F4                                             
      * Si no han realizado ninguna selección no tocamos nada                                       
     C                   IF        @PEERR='A'                                                       
     C                   EVAL      ERRGRL=*ON                                                       
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TPA0F4                                             
      *                                                                                             
     C                   IF        FIELD='PA0S001'                                                  
     C                   EVAL      PA0S001=@PEOPT                                                   
     C                   ENDIF                                                                      
                                                                                                    
     C                   IF        FIELD='PA0SE01' OR FIELD='PA0SE02'                               
     C                             OR FIELD='PA0SE03' OR FIELD='PA0SE04'                            
     C                             OR FIELD='PA0SE05' OR FIELD='PA0SE06'                            
     C                   IF        FIELD='PA0SE01'                                                  
     C                   EVAL      PA0SE01=@PEOPT                                                   
     C                   ENDIF                                                                      
     C                   IF        FIELD='PA0SE02'                                                  
     C                   EVAL      PA0SE02=@PEOPT                                                   
     C                   ENDIF                                                                      
     C                   IF        FIELD='PA0SE03'                                                  
     C                   EVAL      PA0SE03=@PEOPT                                                   
     C                   ENDIF                                                                      
     C                   IF        FIELD='PA0SE04'                                                  
     C                   EVAL      PA0SE04=@PEOPT                                                   
     C                   ENDIF                                                                      
     C                   IF        FIELD='PA0SE05'                                                  
     C                   EVAL      PA0SE05=@PEOPT                                                   
     C                   ENDIF                                                                      
     C                   IF        FIELD='PA0SE06'                                                  
     C                   EVAL      PA0SE06=@PEOPT                                                   
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
                                                                                                    
     C     TPA0F4        TAG                                                                        
     C     ERRGRL        CABEQ     *ON           PA0CMDT                                            
                                                                                                    
     C                   ENDSL                                                                      
                                                                                                    
     C     PA0CMDT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VALIDACIÓ DE PANTALLA PA0                        *                                
      *------------------------------------------------------------*                                
     C     PA0CHK        BEGSR                                                                      
     C                   EVAL      ZXOPT2='UPD'                                                     
      * VALIDACIO DE LES OPCIONS DE DETALL DE PA0                                                   
     C* Validación de PA0S001                                                                       
     C                   EVAL      @PEFMT=*BLANKS                                                   
     C                   EVAL      @PEFLD=*BLANKS                                                   
     C                   EVAL      @PEOPT=*BLANKS                                                   
     C                   EVAL      @PEOPT=PA0S001                                                   
     C                   EVAL      @PEFLD='CFMT'                                                    
     C                   CALL      'MMPROM'                                     Query-Aut-F4   X    
     C                   PARM                    @PEOPT                         PARM Qry-F4         
     C                   PARM      SDSPGM        @PEPGM                         PARM Qry-F4         
     C                   PARM                    @PEFMT                         PARM Qry-F4         
     C                   PARM                    @PEFLD                         PARM Qry-F4         
     C                   PARM      'V'           @PEERR                         PARM Qry-F4         
                                                                                                    
     C                   IF        @PEERR>='0' AND PA0S001<>*BLANKS                                 
     C                             AND PA0S001<>'0'                                                 
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      WRK40=*ON                                                        
     C                   EVAL      MSGER='ASG1003'                                                  
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TPA0CHK                                            
                                                                                                    
     C* Validación de PA0DROP                                                                       
     C                   EVAL      @PEFMT=*BLANKS                                                   
     C                   EVAL      @PEFLD=*BLANKS                                                   
     C                   EVAL      @PEOPT=*BLANKS                                                   
     C                   EVAL      @PEOPT=PA0DROP                                                   
     C                   EVAL      @PEFLD='DROP'                                                    
     C                   CALL      'MMPROM'                                     Query-Aut-F4   X    
     C                   PARM                    @PEOPT                         PARM Qry-F4         
     C                   PARM      *BLANKS       @PEPGM                         PARM Qry-F4         
     C                   PARM                    @PEFMT                         PARM Qry-F4         
     C                   PARM                    @PEFLD                         PARM Qry-F4         
     C                   PARM      'V'           @PEERR                         PARM Qry-F4         
                                                                                                    
     C                   IF        @PEERR>='0' AND PA0S001<>*BLANKS                                 
     C                             AND PA0S001<>'0'                                                 
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      WRK44=*ON                                                        
     C                   EVAL      MSGER='ASG1003'                                                  
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TPA0CHK                                            
                                                                                                    
     C* Validación de PA0TDOC                                                                       
     C                   EVAL      @PEFMT='PA0'                                                     
     C                   EVAL      @PEFLD=*BLANKS                                                   
     C                   EVAL      @PEOPT=*BLANKS                                                   
     C                   EVAL      @PEOPT=PA0TDOC                                                   
     C                   EVAL      @PEFLD='PA0TDOC'                                                 
     C                   CALL      'MMPROM'                                     Query-Aut-F4   X    
     C                   PARM                    @PEOPT                         PARM Qry-F4         
     C                   PARM      'CM0085'      @PEPGM                         PARM Qry-F4         
     C                   PARM                    @PEFMT                         PARM Qry-F4         
     C                   PARM                    @PEFLD                         PARM Qry-F4         
     C                   PARM      'V'           @PEERR                         PARM Qry-F4         
                                                                                                    
     C                   IF        @PEERR>='0'                                                      
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      WRK42=*ON                                                        
     C                   EVAL      MSGER='ASG1003'                                                  
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TPA0CHK                                            
                                                                                                    
      * Validacion de la DELEGACION                                                                 
     C                   EVAL      PECIAS=@PCIAS                                                    
     C                   EVAL      PECTAB='DLGA      '                                              
     C                   EVAL      PECLTA=*BLANKS                                                   
     C                   EVAL      PECLTA=PA0DLGA                                                   
     C     KPMTABD       CHAIN     PMTABD                             81                            
     C                   IF        CHAIN=*ON OR PEBAJA='1'                                          
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='ASG1003'                                                  
     C                   EVAL      WRK43=*ON                                                        
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TPA0CHK                                            
                                                                                                    
     C                   IF        ZZDLGA<>*BLANKS AND PA0DLGA<>ZZDLGA                              
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='ASG1003'                                                  
     C                   EVAL      WRK43=*ON                                                        
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TPA0CHK                                            
FH002 *                                                                                             
FH002 * Validacion del Gestor de Riesgos                                                            
FH002 *                                                                                             
FH002 *     hay 3 posibles opciones:                                                                
FH002 *                                                                                             
FH002 *              1) En blanco= se seleccionan documentos de                                     
FH002 *                            clientes sin gestor asignado                                     
FH002 *                                                                                             
FH002 *              2) '*'      = se seleccionan todos los documentos                              
FH002 *                                                                                             
FH002 *              3) XXXXXXXX = se seleccionan documentos de                                     
FH002 *                            clientes con el gestor informado                                 
FH002 *                            asignado                                                         
FH002 *                                                                                             
FH002C                   IF        PA0GCSC='*         ' OR                                          
FH002C                             PA0GCSC=*BLANKS                                                  
FH002C                   GOTO      TPA0CHK                                                          
FH002C                   ENDIF                                                                      
FH002 *                                                                                             
FH002C                   EVAL      G0CONO=0                                                         
FH002C                   EVAL      G0GCSC=PA0GCSC                                                   
FH002C     KZQGCSC00     CHAIN     ZQGCSC00                                                         
FH002C                   IF        NOT %FOUND(ZQGCSC00)                                             
FH002C                   EVAL      ERRGRL=*ON                                                       
FH002C                   EVAL      MSGER='ASG1003'                                                  
FH002C                   EVAL      WRK47=*ON                                                        
FH002C                   ENDIF                                                                      
FH002C     ERRGRL        CABEQ     *ON           TPA0CHK                                            
FH002 *                                                                                             
                                                                                                    
     C     TPA0CHK       TAG                                                                        
     C                   IF        ERRGRL=*ON                                                       
     C                   EVAL      ZXOPT2='DSP'                                                     
     C                   ENDIF                                                                      
                                                                                                    
     C     PA0CHKT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA ACTUALITZACIO PANTALLA PA0                        *                               
      *------------------------------------------------------------*                                
     C     PA0UPD        BEGSR                                                                      
      * Actualización datos de PMSETUP                                                              
     C                   DOU       LCKRCD=*OFF                                                      
     C     KMSSETP       CHAIN     PMSETP                             8180                          
     C                   ENDDO                                                                      
     C                   CLEAR                   PIDATR                                             
     C                   EXSR      CS_MOVPF                                                         
     C     CM0085        CAT       PIDATR:0      PIDATR                                             
     C                   EVAL      PIDAT8=ZZDATS                                                    
     C                   TIME                    PIHORA                                             
     C                   EVAL      PIPANT=SDSJOB                                                    
     C                   EVAL      PIUSUA=SDSUSR                                                    
                                                                                                    
     C                   IF        CHAIN=*OFF                                                       
     C                   UPDATE    RPMSETP                                                          
     C                   ELSE                                                                       
     C                   EVAL      PIDAT1=PIDAT8                                                    
     C                   WRITE     RPMSETP                                                          
     C                   ENDIF                                                                      
                                                                                                    
     C                   EVAL      ZXDLGA1=PA0DLGA                                                  
     C                   EVAL      ZXTDOC=PA0TDOC                                                   
FX002C                   EVAL      ZXGCSC=PA0GCSC                                                   
     C                   EVAL      ZXOPT='S01CLR'                                                   
     C                   EVAL      ZXFMT='0'                                                        
     C                   EVAL      ZXDROP='0'                                                       
     C                   IF        PA0DROP<>' ' AND PA0DROP<='1'                                    
     C                   EVAL      ZXDROP=PA0DROP                                                   
     C                   ENDIF                                                                      
     C                   EVAL      ZXTRAB=MQTRAB                                                    
                                                                                                    
     C* Limpieza de parametros de subarchivo                                                        
     C                   EVAL      ACCREF=*ON                                                       
     C                   EXSR      CS_CLRK                                                          
                                                                                                    
     C                   SELECT                                                                     
     C                   WHEN      PA0S001=' ' OR PA0S001='0'                                       
     C                   EVAL      ZXOPT='S01CLR'                                                   
     C                   WHEN      PA0S001='1'                                                      
     C                   EVAL      ZXOPT='S01CLR'                                                   
     C                   WHEN      PA0S001='7'                                                      
     C                   EVAL      ZXOPT='S02CLR'                                                   
     C                   ENDSL                                                                      
                                                                                                    
     C                   EVAL      ZXFPED=ZZDATS                                                    
     C                   EVAL      ZXFREP=ZZDATS                                                    
                                                                                                    
     C                   EVAL      ERRGRL=*ON                                                       
     C     PA0UPDT       ENDSR                                                                      
      **************************************************************                                
      * COMMON SUBRUTINE (CS_) :                                  *                                 
      * SUBRUTINA DE NETEJA DEL SFL                                *                                
      *------------------------------------------------------------*                                
     C     CS_SFLCLR     BEGSR                                                                      
     C                   EVAL      SFLDSP=*OFF                                                      
     C                   EVAL      SFLCTL=*OFF                                                      
     C                   EVAL      SFLCLR=*ON                                                       
     C                   WRITE     SUFC                                                             
     C                   EVAL      SFLDSP=*ON                                                       
     C                   EVAL      SFLCTL=*ON                                                       
     C                   EVAL      SFLCLR=*OFF                                                      
     C                   CLEAR                   SUFRCDN                        SFLRCDNBR           
     C                   RESET                   ZXNRR00                        ULT.NRR             
     C                   RESET                   ZXNNN00                        ULT.NRR             
     C                   EVAL      ZXFMT=CCCFMT                                                     
      * Inicialitza la variable que indica inici de carrega de subarxiu                             
     C                   EVAL      ZXCOMCAR=0                                                       
     C                   MOVEA     ZXZERO10      *IN(40)                                            
     C                   MOVEA     ZXZERO10      *IN(50)                                            
     C                   EVAL      SFLDROP=ZXDROP                                                   
     C                   EVAL      ZXLIPAG=ZXLIPA2                                                  
     C                   IF        SFLDROP=*OFF                                                     
     C                   EVAL      ZXLIPAG=ZXLIPA2*2                                                
     C                   ENDIF                                                                      
     C     SFLCLRT       ENDSR                                                                      
      **************************************************************                                
      * COMMON SUBRUTINE (CS_) :                                  *                                 
      * SUBRUTINA INICIALITZACIÓ DEL SFL (1º PART)                 *                                
      *------------------------------------------------------------*                                
     C     CS_SFLIN1     BEGSR                                                                      
     C                   RESET                   ZXLOP00                                            
     C****               RESET                   ZXLIPAG                                            
                                                                                                    
     C                   IF        INDPRO1=*OFF                                                     
     C                   CLEAR                   PSUCUST                                            
     C                   ENDIF                                                                      
                                                                                                    
     C                   IF        INDPRO2=*OFF                                                     
     C                   CLEAR                   PSUTPED                                            
     C                   ENDIF                                                                      
09022C                   IF        INDPRO3=*OFF                                                     
09022C                   CLEAR                   PSUFPED                                            
09022C                   ENDIF                                                                      
                                                                                                    
     C                   CLEAR                   PSUNPCO                                            
     C                   CLEAR                   PSUDLGA                                            
                                                                                                    
     C                   EVAL      ZXNRR00=ZXNNN00                                                  
     C                   IF        ACCREF=*ON                                                       
     C                   RESET                   ZXNRR00                                            
     C     ZXCOUNT       DIV       ZXLIPAG       ZXNUPAG                                            
     C                   MVR                     ZXRESTO                                            
     C                   IF        ZXRESTO>0 OR ZXNUPAG=0                                           
     C                   EVAL      ZXNUPAG=ZXNUPAG+1                                                
     C                   ENDIF                                                                      
     C                   EVAL      ZXLIPAG=ZXNUPAG*ZXLIPAG                                          
     C                   ENDIF                                                                      
     C                   RESET                   ZXNNN00                        ULT.NRR             
     C                   EVAL      SFLEND=*OFF                                                      
     C                   EVAL      EOF=*OFF                                                         
     C     SFLIN1T       ENDSR                                                                      
      **************************************************************                                
      * COMMON SUBRUTINE (CS_) :                                  *                                 
      * SUBRUTINA DE MOURE CAMPS                                   *                                
      *------------------------------------------------------------*                                
     C     CS_MOVFP      BEGSR                                                                      
     C                   SELECT                                                                     
     C                   WHEN      ZXOPT1='S01'                                                     
     C                   EVAL      SUFOPCI=*BLANKS                                                  
     C                   EVAL      SFLNXC=*OFF                                                      
     C                   EXSR      S01MFP                                                           
                                                                                                    
     C                   WHEN      ZXOPT1='S02'                                                     
     C                   EVAL      SUFOPCI=*BLANKS                                                  
     C                   EVAL      SFLNXC=*OFF                                                      
     C                   EXSR      S02MFP                                                           
09022                                                                                               
09022C                   WHEN      ZXOPT1='S03'                                                     
09022C                   EVAL      SUFOPCI=*BLANKS                                                  
09022C                   EVAL      SFLNXC=*OFF                                                      
09022C                   EXSR      S03MFP                                                           
                                                                                                    
     C                   WHEN      ZXOPT1='PA0'                                                     
     C                   EVAL      PA0S001=MQS085                                                   
     C                   EVAL      PA0DROP=MQSDRP                                                   
     C                   EVAL      PA0TRAB=MQTRAB                                                   
     C                   EVAL      PA0TDOC=MQTDOC                                                   
FH002C                   EVAL      PA0GCSC=MQGCSC                                                   
     C                   EVAL      PA0DLGA=MQDLGA                                                   
     C                   MOVEA     MQSECP        SSSECPA                                            
     C                   EVAL      PA0SE01=SSSECPA(1)                                               
     C                   EVAL      PA0SE02=SSSECPA(2)                                               
     C                   EVAL      PA0SE03=SSSECPA(3)                                               
     C                   EVAL      PA0SE04=SSSECPA(4)                                               
     C                   EVAL      PA0SE05=SSSECPA(5)                                               
     C                   EVAL      PA0SE06=SSSECPA(6)                                               
                                                                                                    
     C                   ENDSL                                                                      
     C                   ENDSR                                                                      
      **************************************************************                                
      * COMMON SUBRUTINE (CS_) :                                  *                                 
      * SUBRUTINA DE MOURE CAMPS a FICHERO                         *                                
      *------------------------------------------------------------*                                
     C     CS_MOVPF      BEGSR                                                                      
     C                   SELECT                                                                     
     C                   WHEN      ZXOPT1='PA0'                                                     
     C                   CLEAR                   SSSECPA                                            
     C                   EVAL      MQS085=PA0S001                                                   
     C                   EVAL      MQTRAB=PA0TRAB                                                   
     C                   EVAL      MQSDRP=PA0DROP                                                   
     C                   EVAL      MQTDOC=PA0TDOC                                                   
FH002C                   EVAL      MQGCSC=PA0GCSC                                                   
     C                   EVAL      MQDLGA=PA0DLGA                                                   
     C                   EVAL      SSSECPA(1)=PA0SE01                                               
     C                   EVAL      SSSECPA(2)=PA0SE02                                               
     C                   EVAL      SSSECPA(3)=PA0SE03                                               
     C                   EVAL      SSSECPA(4)=PA0SE04                                               
     C                   EVAL      SSSECPA(5)=PA0SE05                                               
     C                   EVAL      SSSECPA(6)=PA0SE06                                               
     C                   MOVEA     SSSECPA       MQSECP                                             
                                                                                                    
     C                   ENDSL                                                                      
     C                   ENDSR                                                                      
      **************************************************************                                
      * COMMON SUBRUTINE (CS_) :                                  *                                 
      * GUARDO LA CLAU DE POSICIONAMENT DEL PRIMER REGISTRE DESPRES*                                
      * DE LA NETEJA DEL SUBARXIU                                  *                                
      *------------------------------------------------------------*                                
     C     CS_SAVFK      BEGSR                                                                      
     C                   IF        ZXCOMCAR=0                                                       
                                                                                                    
     C                   EVAL      ZXNPCO_1=S0NPCO                                                  
     C                   EVAL      ZXCUST_1=S0CUST                                                  
     C                   EVAL      ZXDLGA_1=S0DLGA                                                  
     C                   EVAL      ZXTPED_1=S0TPED                                                  
     C                   EVAL      ZXFPED_1=S0FPED                                                  
     C                   EVAL      ZXCOMCAR=1                                                       
                                                                                                    
     C                   ENDIF                                                                      
     C     CS_SAVFKT     ENDSR                                                                      
      **************************************************************                                
      * COMMON SUBRUTINE (CS_) :                                  *                                 
      * SUBRUTINA INICIALITZACIÓ DEL SFL  (2ª PART)                *                                
      *------------------------------------------------------------*                                
     C     CS_SFLIN2     BEGSR                                                                      
     C                   EVAL      ZXNNN00=ZXNRR00                                                  
     C                   EVAL      SUFRCDN=ZXNRR00                                                  
     C                   EVAL      ACCREF=*ON                                   SFLRCDNBR           
     C                   IF        EOF=*ON                                                          
     C                   EVAL      SFLEND=*ON                                                       
     C                   ENDIF                                                                      
                                                                                                    
     C                   IF        ZXNRR00=0                                                        
     C                   EVAL      CSRFILA=0                                                        
     C                   EVAL      CSRCOLU=0                                                        
     C                   EVAL      SFLDSP=*OFF                                                      
     C                   ELSE                                                                       
     C                   EVAL      SFLDSP=*ON                                                       
     C                   ENDIF                                                                      
                                                                                                    
     C                   IF        ZXCOUNT>ZXNNN00                                                  
     C                   EVAL      CSRFILA=0                                                        
     C                   EVAL      CSRCOLU=0                                                        
     C                   ENDIF                                                                      
     C     SFLIN2T       ENDSR                                                                      
      **************************************************************                                
      * COMMON SUBRUTINE (CS_) :                                  *                                 
      * SUBRUTINA VALIDACIÓ DELS CMD'S                             *                                
      *------------------------------------------------------------*                                
     C     CS_SFLCMD     BEGSR                                                                      
     C                   IF        VLDCMDKEY=*OFF                                                   
     C                   GOTO      SFLCMDT                                                          
     C                   ENDIF                                                                      
     C                   EVAL      ACCREF=*ON                                                       
     C                   EXSR      CS_SECCMD                                                        
     C     ERRGRL        CABEQ     *ON           SFLCMDT                                            
     C                                                                                              
     C                   SELECT                                                                     
      * F03=SORTIR DEL PROGRAMA                                                                     
     C                   WHEN      EXIT=*ON                                                         
     C                   EVAL      ZXOPT1='END'                                                     
      * F04=AJUDA DE PANTALLA                                                                       
     C                   WHEN      HELP=*ON                                                         
     C                   EVAL      ZXOPT2='DSP'                                                     
     C                   EXSR      CS_POSCUR                                                        
     C                   EVAL      ACCREF=*OFF                                                      
     C                   EVAL      @PEFLD=*BLANKS                                                   
     C                   EVAL      @PEFMT=RECORD                                                    
     C                   EVAL      @PEFLD=FIELD                                                     
                                                                                                    
 01   * Laetitia Recherche des clients (begin)                                                      
 02  C                   IF        FIELD='PSUCUST'                                                  
 02  C                   CALL      'CO0650'                                                         
 02  C                   PARM                    @PCIAS                                             
 02  C                   PARM      *BLANKS       @PCUST                                             
 02  C                   PARM      *BLANKS       @PEERR                                             
 03  C                   IF        @PCUST <>PSUCUST                                                 
 03  C                   EVAL      PSUCUST=@PCUST                                                   
 03  C                   EVAL      ZXOPT2='CHK'                                                     
 03  C                   EVAL      ERRGRL=*ON                                                       
 03  C     ERRGRL        CABEQ     *ON           HELPT                                              
 03  C                   ENDIF                                                                      
 03  C                   ENDIF                                                                      
      * laetitia (fin)                                                                              
     C                   IF        FIELD='CCCFMT'                                                   
     C                   EVAL      @PEFMT=*BLANKS                                                   
     C                   EVAL      @PEFLD=*BLANKS                                                   
     C                   EVAL      @PEFLD='CFMT'                                                    
     C                   ENDIF                                                                      
     C                   IF        FIELD='SUFOPCI'                                                  
     C                   EVAL      @PEFMT=*BLANKS                                                   
     C                   EVAL      @PEFLD=*BLANKS                                                   
     C                   EVAL      @PEFLD='OPCI      '                                              
     C                   ENDIF                                                                      
     C                   CALL      'MMPROM'                                     Query-Aut-F4   X    
     C                   PARM      *BLANKS       @PEOPT                         PARM Qry-F4         
     C                   PARM      SDSPGM        @PEPGM                         PARM Qry-F4         
     C                   PARM                    @PEFMT                         PARM Qry-F4         
     C                   PARM                    @PEFLD                         PARM Qry-F4         
     C                   PARM      *BLANKS       @PEERR                         PARM Qry-F4         
      * Si el dato no tiene soporte F4 avisamos                                                     
     C                   IF        @PEERR>'0'                                                       
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      WRK40=*ON                                                        
     C                   EVAL      MSGER='ADP0304'                                                  
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           HELPT                                              
      * Si no han realizado ninguna selección no tocamos nada                                       
     C                   IF        @PEERR='A'                                                       
     C                   EVAL      ERRGRL=*ON                                                       
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           HELPT                                              
     C                   IF        FIELD='CCCFMT'                                                   
     C*                  EVAL      ERRGRL=*ON                                                       
     C                   EVAL      CCCFMT=@PEOPT                                                    
     C                   ENDIF                                                                      
     C                   IF        FIELD='SUFOPCI'                                                  
     C*                  EXSR      CS_POSCUR                                                        
     C                   EVAL      ZXNRR00=SFLPOS1+CSRFILA-9                                        
     C                   IF        SFLDROP=*ON                                                      
     C                   EVAL      ZXNRR00=SFLPOS1+(CSRFILA-9)/2                                    
     C                   ENDIF                                                                      
     C     ZXNRR00       CHAIN     SUFD                               81                            
     C                   IF        CHAIN=*OFF                                                       
     C                   EVAL      SUFOPCI=@PEOPT                                                   
     C                   EVAL      SFLNXC=*ON                                                       
     C                   UPDATE    SUFD                                                             
     C                   EVAL      ERRGRL=*ON                                                       
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
     C     HELPT         TAG                                                                        
     C     ERRGRL        CABEQ     *ON           SFLCMDT                                            
     C                   EXSR      CS_CLRK                                                          
     C                   IF        ZXFMT<>CCCFMT                                                    
     C                   EVAL      ACCREF=*ON                                                       
     C                   EVAL      ZXCOUNT=1                                                        
     C     CCCFMT        CASEQ     ' '           S01CLR                                             
     C     CCCFMT        CASEQ     '0'           S01CLR                                             
     C     CCCFMT        CASEQ     '1'           S01CLR                                             
     C     CCCFMT        CASEQ     '2'           S02CLR                                             
09022C     CCCFMT        CASEQ     '3'           S03CLR                                             
     C                   CAS                     S01CLR                                             
     C                   ENDCS                                                                      
     C                   ENDIF                                                                      
      * F05=REFRESCAR PANTALLA                                                                      
     C                   WHEN      REFRES=*ON                                                       
     C                   EXSR      CS_RSTFK                                                         
     C                   EVAL      ZXOPT2='CLR'                                                     
      * F13=SETUP DEL PROGRAMA                                                                      
     C                   WHEN      SETUP=*ON                                                        
     C                   EVAL      ZXOPT='PA0CLR'                                                   
     C                   EVAL      ZXCOUNT=SFLPOS1                                                  
      * F14=TREBALLAR AMB EL SPOOL                                                                  
     C                   WHEN      WRKSPL=*ON                                                       
     C                   EVAL      ACCREF=*OFF                                                      
     C                   CLEAR                   ZXQCMD                                             
     C                   EVAL                    ZXQCMD='WRKSPLF'                                   
     C                   CALL      'QCMDEXC'                                                        
     C                   PARM                    ZXQCMD                                             
     C                   PARM                    ZXLOGC                                             
      * F16=TREBALLAR AMB TREBALLS SOTMESOS                                                         
     C                   WHEN      WRKSBM=*ON                                                       
     C                   EVAL      ACCREF=*OFF                                                      
     C                   CLEAR                   ZXQCMD                                             
     C                   EVAL                    ZXQCMD='WRKSBMJOB'                                 
     C                   CALL      'QCMDEXC'                                                        
     C                   PARM                    ZXQCMD                                             
     C                   PARM                    ZXLOGC                                             
      * F22=TREBALLAR AMB TRANSCRIPTORS                                                             
     C                   WHEN      WRKWTR=*ON                                                       
     C                   EVAL      ACCREF=*OFF                                                      
     C                   CLEAR                   ZXQCMD                                             
     C                   EVAL                    ZXQCMD='WRKWTR'                                    
     C                   CALL      'QCMDEXC'                                                        
     C                   PARM                    ZXQCMD                                             
     C                   PARM                    ZXLOGC                                             
      * PAGINAR                                                                                     
     C                   WHEN      ROLLUP=*ON                                                       
     C                   EVAL      ACCREF=*OFF                                                      
     C                   EVAL      ZXOPT2='INZ'                                                     
     C                   EVAL      CSRFILA=0                                                        
     C                   EVAL      CSRCOLU=0                                                        
     C                   ENDSL                                                                      
                                                                                                    
     C     SFLCMDT       TAG                                                                        
     C                   IF        ERRGRL=*ON AND ACCREF=*ON                                        
     C                   EVAL      ACCREF=*OFF                                                      
     C                   ENDIF                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **************************************************************                                
      * COMMON SUBRUTINE (CS_) :                                  *                                 
      * SUBRUTINA VALIDACIÓ DEL SFL: FORMAT SFL I OPCIONS          *                                
      *------------------------------------------------------------*                                
     C     CS_SFLCHK     BEGSR                                                                      
     C                   EVAL      ACCREF=*ON                                                       
      * Validación del posicionamiento de cabecera                                                  
     C                   IF        CCCFMT='1'                                                       
     C*                  EVAL      PSUDLGA=PSUDLG1                                                  
     C                   ENDIF                                                                      
                                                                                                    
     C                   IF        CCCFMT='2'                                                       
     C*                  EVAL      PSUDLGA=PSUDLG2                                                  
     C                   ENDIF                                                                      
                                                                                                    
     C                   IF        PSUCUST <> *BLANKS OR PSUTPED<>*BLANKS                           
     C                             OR PSUDLGA <> *BLANKS                                            
     C                             OR PSUNPCO <> *BLANKS                                            
09022C                             OR PSUFPED <> *BLANKS                                            
                                                                                                    
09022C                   IF        PSUFPED<>*BLANKS                                                 
09022C                   EVAL                    @PVAN=*ZEROS                                       
09022C                   CALL      'MM2510'                                                         
09022C                   PARM                    @PVAN                                              
09022C                   PARM      PSUFPED       @PVAA                                              
09022C                   PARM      ZZFMFF        @PFMI                                              
09022C                   PARM      ZZFMFF        @PFMF                                              
09022C                   PARM      ZZFMFS        @PSEP                                              
09022C                   PARM      ' '           @PEERR                                             
09022C                   IF        @PEERR<>*BLANKS                                                  
09022C                   EVAL      ZXFMT=CCCFMT                                                     
09022C                   EVAL      ERRGRL=*ON                                                       
09022C                   EVAL      WRK45=*ON                                                        
09022C                   EVAL      MSGER='MSG0065'                                                  
09022C                   ENDIF                                                                      
09022C                   EVAL      ZXFPED=@PVAN                                                     
09022C                   ENDIF                                                                      
09022C     ERRGRL        CABEQ     *ON           SFLCHKT                                            
      * Si el artículo ya estaba protegido no resituo si no tocan algo distinto                     
      * a lo protegido                                                                              
     C                   IF        INDPRO1=*ON                                                      
     C                   IF        INDPRO2=*ON                                                      
     C                   IF        PSUCUST=*BLANKS                                                  
     C                   GOTO      SFLCHKAT                                                         
     C                   ENDIF                                                                      
     C                   ELSE                                                                       
     C                   IF        PSUTPED=*BLANKS AND PSUNPCO=*BLANKS                              
     C                   GOTO      SFLCHKAT                                                         
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
                                                                                                    
     C                   EVAL      ZXCOUNT=1                                                        
     C                   EXSR      CS_CLRK                                                          
     C                   EVAL      S0NPCO=PSUNPCO                                                   
     C                   EVAL      S0TPED=PSUTPED                                                   
     C                   EVAL      S0CUST=PSUCUST                                                   
     C                   EVAL      S0DLGA=PSUDLGA                                                   
     C                   EVAL      S0FPED=ZXFPED                                                    
09022C*                  EVAL      S0FPED=PSUFPED                                                   
                                                                                                    
     C                   EVAL      ZXCUST=PSUCUST                                                   
     C                   EVAL      ZXDLGA=PSUDLGA                                                   
     C                   EVAL      ZXTPED=PSUTPED                                                   
09022C                   EVAL      ZXNPCO=PSUNPCO                                                   
09022C*                  EVAL      ZXFPED=PSUFPED                                                   
                                                                                                    
     C                   EVAL      ZXOPT2='CLR'                                                     
     C     ERRGRL        CABEQ     *ON           SFLCHKT                                            
     C                   ENDIF                                                                      
     C     SFLCHKAT      TAG                                                                        
                                                                                                    
      * Validacion clase de subarchivo (FORMAT DE LA PANTALLA)                                      
     C                   SELECT                                                                     
     C                   WHEN      ZXFMT<>CCCFMT                                                    
     C                   EVAL      @PEFLD=*BLANKS                                                   
     C                   EVAL      @PEOPT=*BLANKS                                                   
     C                   EVAL      @PEFMT=*BLANKS                                                   
     C                   EVAL      @PEFLD='CFMT'                                                    
     C                   EVAL      @PEOPT=CCCFMT                                                    
     C                   CALL      'MMPROM'                                     Query-Aut-F4   X    
     C                   PARM                    @PEOPT                         PARM Qry-F4         
     C                   PARM      SDSPGM        @PEPGM                         PARM Qry-F4         
     C                   PARM                    @PEFMT                         PARM Qry-F4         
     C                   PARM                    @PEFLD                         PARM Qry-F4         
     C                   PARM      'V'           @PEERR                         PARM Qry-F4         
                                                                                                    
     C                   IF        @PEERR>'0'                                                       
     C                   EVAL      ZXFMT=CCCFMT                                                     
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      WRK40=*ON                                                        
     C                   EVAL      MSGER='ASG1003'                                                  
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           SFLCHKT                                            
      * Si el subarchivo es valido continuo                                                         
     C                   EVAL      ZXCOUNT=1                                                        
     C                   EVAL      ZXOPT1='S01'                                                     
     C                   EVAL      ZXOPT2='CLR'                                                     
     C                   IF        CCCFMT=' '                                                       
     C                   EXSR      CS_CLRK                                                          
     C                   EVAL      ZXOPT1='S01'                                                     
     C                   ENDIF                                                                      
                                                                                                    
     C                   IF        CCCFMT='0'                                                       
     C                   EXSR      CS_CLRK                                                          
     C                   EVAL      ZXOPT1='S01'                                                     
     C                   ENDIF                                                                      
                                                                                                    
     C                   IF        CCCFMT='1'                                                       
     C                   EXSR      CS_CLRK                                                          
     C                   EVAL      ZXOPT1='S01'                                                     
     C                   ENDIF                                                                      
                                                                                                    
     C                   IF        CCCFMT='2'                                                       
     C                   EXSR      CS_CLRK                                                          
     C                   EVAL      ZXOPT1='S02'                                                     
     C                   ENDIF                                                                      
09022C                   IF        CCCFMT='3'                                                       
09022C                   EXSR      CS_CLRK                                                          
09022C                   EVAL      ZXOPT1='S03'                                                     
09022C                   ENDIF                                                                      
                                                                                                    
     C                   OTHER                                                                      
     C                   EXSR      CS_CHKOPT                                                        
     C     ERRGRL        CABEQ     *ON           SFLCHKT                                            
     C                   ENDSL                                                                      
                                                                                                    
     C     SFLCHKT       TAG                                                                        
     C                   IF        ERRGRL=*ON AND ACCREF=*ON                                        
     C                   EVAL      ACCREF=*OFF                                                      
     C                   ENDIF                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **************************************************************                                
      * COMMON SUBRUTINE (CS_) :                                  *                                 
      * SUBRUTINA DE 1er REGISTRE DE PANTALLA DE SUBARXIUS         *                                
      *------------------------------------------------------------*                                
     C     CS_RSTFK      BEGSR                                                                      
     C                   EVAL      S0NPCO=ZXNPCO_1                                                  
     C                   EVAL      S0CUST=ZXCUST_1                                                  
     C                   EVAL      S0TPED=ZXTPED_1                                                  
     C                   EVAL      S0DLGA=ZXDLGA_1                                                  
     C     RSTFKT        ENDSR                                                                      
      **************************************************************                                
      * COMMON SUBRUTINE (CS_) :                                  *                                 
      * SUBRUTINA DE NETEJA DE CAMPS DE POSIBLES CLAUS             *                                
      *------------------------------------------------------------*                                
     C     CS_CLRK       BEGSR                                                                      
     C                   CLEAR                   S0NPCO                                             
     C                   CLEAR                   S0CUST                                             
     C                   CLEAR                   S0TPED                                             
     C                   CLEAR                   S0DLGA                                             
09022C                   CLEAR                   S0FPED                                             
     C     CLRKT         ENDSR                                                                      
      **************************************************************                                
      * COMMON SUBRUTINE (CS_) :                                  *                                 
      * SUBRUTINA DE TRATAMIENTO DE OPCIONES EN SUBARCHIVO         *                                
      *------------------------------------------------------------*                                
     C     CS_CHKOPT     BEGSR                                                                      
      * Validacion clase de subarchivo                                                              
     C                   EVAL      @PEFLD=*BLANKS                                                   
     C                   EVAL      @PEOPT=*BLANKS                                                   
     C                   EVAL      @PEFMT=*BLANKS                                                   
     C                   EVAL      @PEFLD='CFMT'                                                    
     C                   EVAL      @PEOPT=CCCFMT                                                    
     C                   CALL      'MMPROM'                                     Query-Aut-F4   X    
     C                   PARM                    @PEOPT                         PARM Qry-F4         
     C                   PARM      SDSPGM        @PEPGM                         PARM Qry-F4         
     C                   PARM                    @PEFMT                         PARM Qry-F4         
     C                   PARM                    @PEFLD                         PARM Qry-F4         
     C                   PARM      'V'           @PEERR                         PARM Qry-F4         
                                                                                                    
     C                   IF        @PEERR>'0'                                                       
     C                   EVAL      ZXFMT=CCCFMT                                                     
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      WRK40=*ON                                                        
     C                   EVAL      MSGER='ASG1003'                                                  
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           CHKOPTT                                            
      * VALIDACIO DE LES OPCIONS DE DETALL DEL SFL                                                  
     C                   EVAL      ACCREF=*OFF                                                      
     C                   EVAL      EOF=*OFF                                                         
     C                   IF        SFLDSP=*ON                                                       
                                                                                                    
     C                   DO        *HIVAL                                                           
     C                   READC     SUFD                                   82                        
     C                   IF        EOF=*ON                                                          
     C                   LEAVE                                                                      
     C                   ENDIF                                                                      
     C                   EVAL      ACCREF=*ON                                                       
     C                   EVAL      ZXOPT2='CLR'                                                     
      * Validacion opciones de subarchivo                                                           
     C                   EVAL      SFLNXC=*OFF                                                      
     C                   IF        SUFOPCI=*BLANKS                                                  
     C                   GOTO      TNEXOPC                                                          
     C                   ELSE                                                                       
     C                   EVAL      ZXCOUNT=ZXNRR00                                                  
     C                   ENDIF                                                                      
                                                                                                    
     C                   EVAL      @PEFLD=*BLANKS                                                   
     C                   EVAL      @PEFMT=*BLANKS                                                   
     C                   EVAL      @PEFLD='OPCI'                                                    
     C                   EVAL      @PEOPT=SUFOPCI                                                   
     C                   EVAL      @PEPGM=SDSPGM                                                    
     C                   EXSR      CS_SECMDOP                                                       
     C                   IF        ERRGRL=*ON                                                       
     C                   EVAL      WRK41=*ON                                                        
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TNEXOPC                                            
                                                                                                    
     C                   SELECT                                                                     
                                                                                                    
     C                   WHEN      @PEOPT=' 2' OR @PEOPT='2 '                   MODIFICAR           
     C                   CALL      'CM0086'                                                         
     C                   PARM      SUFCIAS       @PECIAS                                            
     C                   PARM      SUFDLGA       @PEDLGA                                            
     C                   PARM      SUFNPCO       @PENPCO                                            
     C                   PARM      SUFTPED       @PETPED                                            
     C                   PARM      SUFDATP       @PEDATP                                            
     C                   PARM      SUFNOPL       @PENOPL                                            
     C                   PARM      SUFTDOC       @PEERR                                             
     C                   EVAL      SUFOPCI=*BLANKS                                                  
     C                   EVAL      SFLNXC=*OFF                                                      
                                                                                                    
     C                   WHEN      @PEOPT='2C'                                                      
     C                   CALL      'CO0051'                                                         
     C                   PARM      SUFCIAS       @PECIAS                                            
     C                   PARM      SUFCUST       @PECUST                                            
     C                   PARM      '2 '          @PEOPT                                             
     C                   PARM      'S'           @PEERR                                             
     C                   EVAL      SFLNXC=*OFF                                                      
                                                                                                    
     C                   WHEN      @PEOPT='RK'                                                      
     C                   CALL      'CM2520'                                                         
     C                   PARM      SUFCIAS       @PECIAS                                            
     C                   PARM      SUFCUST       @PECUST                                            
     C                   PARM      ZZDLGA        @PEDLGA                                            
     C                   PARM                    @PENPCO                                            
     C                   PARM                    @PETPED                                            
     C                   PARM                    @PEDATP                                            
     C                   PARM                    @PENOPL                                            
     C                   PARM      '2'           @PEERR                                             
     C                   EVAL      SFLNXC=*OFF                                                      
FQ446                                                                                               
FQ446C                   WHEN      @PEOPT='CC'                                  MODIFICAR           
FQ446C                   IF        ZZCTBP=' '                                                       
FQ446C                   CALL      'CM0400'                                                         
FQ446C                   PARM      SUFCUST       @PECUST                                            
FQ446C                   PARM      00000000      @PEDATD                                            
FQ446C                   PARM      99999999      @PEDATH                                            
FQ446C                   PARM      *BLANKS       @PEERR                                             
FQ446C                   ELSE                                                                       
FQ446C                   CALL      'CAR500'                                                         
FQ446C                   PARM      SUFCUST       @PECUST                                            
FQ446C                   PARM      *BLANKS       @PEERR                                             
FQ446C                   ENDIF                                                                      
FQ446                                                                                               
FQ446C                   WHEN      @PEOPT='PR'                                  MODIFICAR           
FQ446C                   MOVEL     *DATE         @PEANYY                                            
FQ446C*                  EVAL      @PEANYY=@PEANYY-1                                                
FQ446C                   CALL      'CO0077'                                                         
FQ446C                   PARM      SUFCIAS       @PECIAS                                            
FQ446C                   PARM      ZZDLGA        @PEDLGA                                            
FQ446C                   PARM      SUFCUST       @PECUST                                            
FQ446C                   PARM                    @PEANYY                                            
FQ446C                   PARM      *BLANKS       @PETNEX                                            
FQ446C                   PARM      *BLANKS       @PEMONE                                            
FQ446C                   PARM      *BLANKS       @PETMIL                                            
FQ446C                   PARM      ' '           @PEERR                                             
                                                                                                    
     C                   ENDSL                                                                      
                                                                                                    
     C     TNEXOPC       TAG                                                                        
     C                   UPDATE    SUFD                                                             
     C                   IF        ERRGRL=*ON                                                       
     C                   EVAL      ZXOPT2='DSP'                                                     
     C                   EVAL      ZXCOUNT=ZXNRR00                                                  
     C                   EXSR      CS_POSCER0                                                       
     C                   LEAVE                                                                      
     C                   ENDIF                                                                      
     C                   ENDDO                                                                      
      * Si existen errores entonces mantengo la posicion del primer error                           
      * y muestro pantalla                                                                          
     C                   ENDIF                                                                      
     C                   IF        ERRGRL=*OFF                                                      
     C                   EXSR      CS_RSTFK                                                         
     C                   EXSR      CS_POSCER0                                                       
     C                   ENDIF                                                                      
     C     CHKOPTT       ENDSR                                                                      
      **************************************************************                                
      * COMMON SUBRUTINE (CS_) :                                  *                                 
      * SUBRUTINA DE POSICIONAMENT DEL CURSOR                      *                                
      *------------------------------------------------------------*                                
     C     CS_POSCUR     BEGSR                                                                      
     C* Línea de subarchivo donde se encuentra el cursor                                            
     C     SFLPOCUR      DIV       256           CSRFILA                                            
     C                   MVR                     CSRCOLU                                            
     C                   ENDSR                                                                      
      **************************************************************                                
      * COMMON SUBRUTINE (CS_) :                                  *                                 
      * SUBRUTINA DE POSICIONAMENT DEL CURSOR                      *                                
      *------------------------------------------------------------*                                
     C     CS_POSCER0    BEGSR                                                                      
     C* Línea de subarchivo donde se posiciona cursor si error en opción                            
     C                   IF        ZXLIPAG<>0                                                       
     C                   IF        SFLDROP=*OFF                                                     
     C                   EVAL      ZXLIPAG=ZXLIPAG*2                                                
     C                   ENDIF                                                                      
     C     ZXCOUNT       DIV       ZXLIPA2       ZXAU15                                             
     C                   MVR                     CSRFILA                                            
     C                   IF        CSRFILA=0 AND ZXAU15>0                                           
     C                   EVAL      CSRFILA=ZXLIPA2                                                  
     C                   ENDIF                                                                      
     C                   IF        SFLDROP=*ON                                                      
     C                   MULT      2             CSRFILA                                            
     C                   ENDIF                                                                      
     C                   IF        SFLDROP=*OFF                                                     
     C                   EVAL      CSRFILA=CSRFILA+9-1                                              
     C                   ELSE                                                                       
     C                   EVAL      CSRFILA=CSRFILA+9-2                                              
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
     C                   IF        CSRFILA<=0                                                       
     C                   EVAL      CSRFILA=9                                                        
     C                   ENDIF                                                                      
     C                   EVAL      CSRCOLU=4                                                        
     C                   RESET                   ZXLIPA2                                            
      *                                                                                             
     C                   ENDSR                                                                      
      **************************************************************                                
      * COMMON SUBRUTINE (CS_) :                                  *                                 
      * SUBRUTINA VISUALITZACIÓ SFL                                *                                
      *------------------------------------------------------------*                                
     C     CS_SFLDSP     BEGSR                                                                      
     C                   EVAL      ZXOPT2='CMD'                                                     
      * Posicionament en el subarxiu si no s'ha realitzat cap acció                                 
     C                   IF        ACCREF=*OFF AND SFLDSP=*ON                                       
     C                   EVAL      SUFRCDN=ZXCOUNT                                                  
     C                   ENDIF                                                                      
                                                                                                    
     C                   IF        INDPRO1=*OFF                                                     
     C                   CLEAR                   PSUCUST                                            
     C*                  CLEAR                   PSUDLG1                                            
     C                   ENDIF                                                                      
                                                                                                    
     C                   IF        INDPRO2=*OFF                                                     
     C*                  CLEAR                   PSUDLG2                                            
     C                   CLEAR                   PSUTPED                                            
     C                   ENDIF                                                                      
09022C                   IF        INDPRO3=*OFF                                                     
09022C                   CLEAR                   PSUFPED                                            
09022C                   ENDIF                                                                      
                                                                                                    
     C                   CLEAR                   PSUNPCO                                            
                                                                                                    
     C                   WRITE     SUFP                                         SI REGS             
     C                   EXFMT     SUFC                                                             
     C* Guardem el nº de registre que es visualitza actualment per no                               
     C* canviar de pàgina si no fan res                                                             
     C                   EVAL      ZXCOUNT=SFLPOS1                                                  
     C                   EVAL      ERRGRL=*OFF                                                      
     C                   EVAL      MSGER=*BLANKS                                                    
     C                   MOVEA     ZXZERO10      *IN(40)                                            
     C                   MOVEA     ZXZERO10      *IN(50)                                            
     C     SFLDSPT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA PER MOURE CAMPS AL SFL                           *                                
      *------------------------------------------------------------*                                
     C     S01MFP        BEGSR                                                                      
     C                   EVAL      SUFOPCI=*BLANKS                                                  
     C                   EVAL      SFLNXC=*OFF                                                      
FQ665C                   IF        S0RDEN='1'                                                       
FQ665C                   SETON                                        67                            
FQ665C                   ELSE                                                                       
FQ665C                   SETOFF                                       67                            
FQ665C                   ENDIF                                                                      
      * Campos para vista 1                                                                         
                                                                                                    
     C                   IF        ZXFILE='1'                                                       
     C                   EVAL      S11TALB='1'                                                      
     C                   ELSE                                                                       
     C                   EVAL      S11TALB=' '                                                      
     C                   ENDIF                                                                      
     C                   EVAL      S11TPED=S0TPED                                                   
     C                   EVAL      S11CUST=S0CUST                                                   
     C                   EVAL      S11REFE=S0REFE                                                   
     C                   EVAL      S11STCO=S0STCO                                                   
     C                   EVAL      S11NPCO=S0NPCO                                                   
                                                                                                    
     C                   EVAL      @PVAA=*BLANKS                                                    
     C                   CALL      'MM2510'                                                         
     C                   PARM      S0FPED        @PVAN                                              
     C                   PARM                    @PVAA                                              
     C                   PARM      'YYMD'        @PFMI                                              
     C                   PARM      ZZFMFF        @PFMF                                              
     C                   PARM      ZZFMFS        @PSEP                                              
     C                   PARM      ' '           @PEERR                                             
     C                   EVAL      S11FPED=@PVAA                                                    
                                                                                                    
     C*                  EVAL      @PVAA=*BLANKS                                                    
     C*                  CALL      'MM2510'                                                         
     C*                  PARM      S0FREP        @PVAN                                              
     C*                  PARM                    @PVAA                                              
     C*                  PARM      'YYMD'        @PFMI                                              
     C*                  PARM      ZZFMFF        @PFMF                                              
     C*                  PARM      ZZFMFS        @PSEP                                              
     C*                  PARM      ' '           @PEERR                                             
     C*                  EVAL      S11FREP=@PVAA                                                    
                                                                                                    
     C*                  EVAL      S11LOGE=S0LOGE                                                   
     C*                  EVAL      S11TPOR=S0TPOR                                                   
     C                   EVAL      S11MONE=S0MONE                                                   
                                                                                                    
     C                   EVAL      @PVAA=*BLANKS                                                    
     C                   CALL      'MM2510'                                                         
     C                   PARM      S0FPED        @PVAN                                              
     C                   PARM                    @PVAA                                              
     C                   PARM      'YYMD'        @PFMI                                              
     C                   PARM      ZZFMFF        @PFMF                                              
     C                   PARM      ZZFMFS        @PSEP                                              
     C                   PARM      ' '           @PEERR                                             
     C                   EVAL      S11FPED=@PVAA                                                    
      * Campos para doblar                                                                          
     C                   EVAL      S012DES1=S0DES1                                                  
                                                                                                    
FQ365C                   IF        S0RCON <> *BLANKS                                                
FQ365C                   MOVEL     S0RCON        ZXRCON                                             
FQ365C                   EVAL      @PVAA=*BLANKS                                                    
FQ365C                   CALL      'MM2510'                                                         
FQ365C                   PARM      ZXRCON        @PVAN                                              
FQ365C                   PARM                    @PVAA                                              
FQ365C                   PARM      'YYMD'        @PFMI                                              
FQ365C                   PARM      ZZFMFF        @PFMF                                              
FQ365C                   PARM      ZZFMFS        @PSEP                                              
FQ365C                   PARM      ' '           @PEERR                                             
FQ365C                   MOVEL     'conf:'       S012RCON                                           
FQ365C                   MOVE      @PVAA         S012RCON                                           
FQ365C                   ELSE                                                                       
FQ365C                   MOVEL     *BLANKS       S012RCON                                           
FQ365C                   ENDIF                                                                      
FQ665                                                                                               
FQ665 * Importe Documento                                                                           
FQ665C                   EXSR      CS_DATORDD                                                       
FQ665C                   EVAL      PXALPH = *BLANKS                                                 
FQ665C                   EVAL      PXNUM = ZXDOCUM                                                  
FQ665C                   CALL      'PRD650'                                                         
FQ665C                   PARM                    PXNUM                          CAMP NUMÈRIC        
FQ665C                   PARM                    PXALPH                         CAMP ALFANUMÈRIC    
FQ665C                   PARM                    PXFLDD                         Nº CARACT. VISUA    
FQ665C                   PARM      0             PXDCCD                         Nº DECIMALS         
FQ665C                   PARM                    PXFMD1                         AJUST DECIMAL (.    
FQ665C                   PARM      'K'           PXEDTC                         CODI EDICIO(4,M,    
FQ665C                   PARM                    PXNMER                         RETORN ERROR        
FQ665C                   PARM                    PXTIPA                         TIPO AJUSTE (0,1    
FQ665C                   MOVE      PXALPH        S012IMPO                                           
FQ665                                                                                               
                                                                                                    
     C                   EXSR      CS_KEYPF                                                         
     C                   EVAL      SUFDATA=W1DATAV1                                                 
     C                   EVAL      SUFDAT2=W1DAT2                                                   
                                                                                                    
     C     S01MFPT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA PER MOURE CAMPS AL SFL                           *                                
      *------------------------------------------------------------*                                
     C     S02MFP        BEGSR                                                                      
     C                   EVAL      SUFOPCI=*BLANKS                                                  
     C                   EVAL      SFLNXC=*OFF                                                      
FQ665C                   IF        S0RDEN='1'                                                       
FQ665C                   SETON                                        67                            
FQ665C                   ELSE                                                                       
FQ665C                   SETOFF                                       67                            
FQ665C                   ENDIF                                                                      
      * Campos para vista 1                                                                         
     C                   IF        ZXFILE='1'                                                       
     C                   EVAL      S21TALB='1'                                                      
     C                   ELSE                                                                       
     C                   EVAL      S21TALB=' '                                                      
     C                   ENDIF                                                                      
     C                   EVAL      S21NPCO=S0NPCO                                                   
     C                   EVAL      S21CUST=S0CUST                                                   
     C                   EVAL      S21TPED=S0TPED                                                   
     C                   EVAL      S21MONE=S0MONE                                                   
     C                   EVAL      S21REFE=S0REFE                                                   
     C                   EVAL      S21STCO=S0STCO                                                   
                                                                                                    
     C                   EVAL      @PVAA=*BLANKS                                                    
     C                   CALL      'MM2510'                                                         
     C                   PARM      S0FPED        @PVAN                                              
     C                   PARM                    @PVAA                                              
     C                   PARM      'YYMD'        @PFMI                                              
     C                   PARM      ZZFMFF        @PFMF                                              
     C                   PARM      ZZFMFS        @PSEP                                              
     C                   PARM      ' '           @PEERR                                             
     C                   EVAL      S21FPED=@PVAA                                                    
                                                                                                    
     C*                  EVAL      @PVAA=*BLANKS                                                    
     C*                  CALL      'MM2510'                                                         
     C*                  PARM      S0FREP        @PVAN                                              
     C*                  PARM                    @PVAA                                              
     C*                  PARM      'YYMD'        @PFMI                                              
     C*                  PARM      ZZFMFF        @PFMF                                              
     C*                  PARM      ZZFMFS        @PSEP                                              
     C*                  PARM      ' '           @PEERR                                             
     C*                  EVAL      S21FREP=@PVAA                                                    
                                                                                                    
      * Campos para doblar                                                                          
     C                   EVAL      S022DES1=S0DES1                                                  
FQ665                                                                                               
FQ665 * Importe Documento                                                                           
FQ665C                   EXSR      CS_DATORDD                                                       
FQ665C                   EVAL      PXALPH = *BLANKS                                                 
FQ665C                   EVAL      PXNUM = ZXDOCUM                                                  
FQ665C                   CALL      'PRD650'                                                         
FQ665C                   PARM                    PXNUM                          CAMP NUMÈRIC        
FQ665C                   PARM                    PXALPH                         CAMP ALFANUMÈRIC    
FQ665C                   PARM                    PXFLDD                         Nº CARACT. VISUA    
FQ665C                   PARM      0             PXDCCD                         Nº DECIMALS         
FQ665C                   PARM                    PXFMD1                         AJUST DECIMAL (.    
FQ665C                   PARM      'K'           PXEDTC                         CODI EDICIO(4,M,    
FQ665C                   PARM                    PXNMER                         RETORN ERROR        
FQ665C                   PARM                    PXTIPA                         TIPO AJUSTE (0,1    
FQ665C                   MOVE      PXALPH        S022IMPO                                           
FQ665                                                                                               
     C                   EXSR      CS_KEYPF                                                         
                                                                                                    
     C                   EVAL      SUFDATA=W2DATAV1                                                 
     C                   EVAL      SUFDAT2=W2DAT2                                                   
                                                                                                    
     C     S02MFPT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA QUE SELECCIONA REGISTROS DE SUBARCHIVO           *                                
      *------------------------------------------------------------*                                
     C     CS_SELSFL     BEGSR                                                                      
     C                   EVAL      ZXSELSFL=0                                                       
     C                   IF        INDPRO1=*ON AND S0CUST<>@PCUST                                   
     C                   EVAL      ZXSELSFL=1                                                       
     C                   GOTO      SELSFLRT                                                         
     C                   ENDIF                                                                      
                                                                                                    
     C                   IF        INDPRO2=*ON AND S0TPED<>@PTPED                                   
     C                   EVAL      ZXSELSFL=1                                                       
     C                   GOTO      SELSFLRT                                                         
     C                   ENDIF                                                                      
                                                                                                    
     C                   IF        ZXTRAB<>*BLANKS AND S0TRAB<>ZXTRAB                               
     C                   EVAL      ZXSELSFL=1                                                       
     C                   GOTO      SELSFLRT                                                         
     C                   ENDIF                                                                      
                                                                                                    
     C                   IF        S0STCO='90'                                                      
     C                   EVAL      ZXSELSFL=1                                                       
     C                   GOTO      SELSFLRT                                                         
     C                   ENDIF                                                                      
FQ365                                                                                               
FQ365C*07049             IF        S0STCO = '10' And S0RCON = *BLANKS                               
FQ365C*07049             EVAL      ZXSELSFL=1                                                       
FQ365C*07049             GOTO      SELSFLRT                                                         
FQ365C*07049             ENDIF                                                                      
                                                                                                    
     C                   IF        (S0REXC=*BLANKS)                                                 
     C                             OR (S0REXC='1' AND S0RAUT='1')                                   
     C                   EVAL      ZXSELSFL=1                                                       
     C                   GOTO      SELSFLRT                                                         
     C                   ENDIF                                                                      
                                                                                                    
     C                   IF        (ZXTDOC='0' AND ZXFILE='1')                                      
     C                             OR (ZXTDOC='1' AND ZXFILE=' ')                                   
     C                   EVAL      ZXSELSFL=1                                                       
     C                   GOTO      SELSFLRT                                                         
     C                   ENDIF                                                                      
                                                                                                    
     C                   IF        ZXDLGA1<>*BLANKS AND S0DLGA<>ZXDLGA1                             
     C                   EVAL      ZXSELSFL=1                                                       
     C                   GOTO      SELSFLRT                                                         
     C                   ENDIF                                                                      
FH002C*                                                                                             
FH002C* SELECCION POR GESTOR DE RIESGOS                                                             
FH002C*                                                                                             
FH002C*    --------------------------------------                                                   
FH002C                   IF        ZXGCSC<>'*         '                                             
FH002C*    --------------------------------------                                                   
FH002C                   EVAL      XZGCSC=*BLANKS                                                   
FH002C     KCOCLIN       CHAIN     COCLIN                                                           
FH002C                   IF        NOT %FOUND(COCLIN)                                               
FH002C                   EVAL      ZXSELSFL=1                                                       
FH002C                   GOTO      SELSFLRT                                                         
FH002C                   ENDIF                                                                      
2310BC*                  EVAL      OKCONO=100                                                       
2310BC*                  EVAL      OKCUNO=S0CUNO                                                    
2310BC*                  EVAL      OKDIVI=ZXDIVI                                                    
2310BC*    KZAQCDV00     CHAIN(N)  ZAQCDV00                                                         
2310BC*                  IF        %FOUND(ZAQCDV00)                                                 
2310BC*                  EVAL      XZGCSC=%SUBST(OKFL10:1:10)                                       
2310BC*                  ENDIF                                                                      
2310BC                   EVAL      R0CONO=100                                                       
2310BC                   EVAL      R0CUNO=S0CUNO                                                    
2310BC                   EVAL      R0DIVI=ZXDIVI                                                    
2310BC     KZQGSRK00     CHAIN(N)  ZQGSRK00                                                         
2310BC                   IF        %FOUND(ZQGSRK00)                                                 
2310BC                   EVAL      XZGCSC=R0GEST                                                    
2310BC                   ENDIF                                                                      
FH002C                   IF        XZGCSC<>ZXGCSC                                                   
FH002C                   EVAL      ZXSELSFL=1                                                       
FH002C                   GOTO      SELSFLRT                                                         
FH002C                   ENDIF                                                                      
FH002C*    --------------------------------------                                                   
FH002C                   ENDIF                                                                      
FH002C*    --------------------------------------                                                   
PG615 *                                                                                             
E7394 *PG615c                   exsr      ChkCustomer                                               
E7394c                   eval      bLckAlb   =*off                                                  
PG615c                   if        bLckAlb   =*on                                                   
PG615c                   eval      ZXSELSFL=1                                                       
PG615c                   endif                                                                      
PG615 *                                                                                             
                                                                                                    
     C     SELSFLRT      ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA QUE GUARDA LAS CLAVES DE TODOS TIPOS DE SFL      *                                
      *------------------------------------------------------------*                                
     C     CS_KEYPF      BEGSR                                                                      
     C                   EVAL      SUFDATA=*BLANKS                                                  
     C                   EVAL      SUFCIAS=S0CIAS                                                   
     C                   EVAL      SUFDLGA=S0DLGA                                                   
     C                   EVAL      SUFNPCO=S0NPCO                                                   
     C                   EVAL      SUFTPED=S0TPED                                                   
     C                   EVAL      SUFDATP=S0DATP                                                   
     C                   EVAL      SUFNOPL=S0nopl                                                   
     C                   EVAL      SUFIDIO=S0IDIO                                                   
     C                   EVAL      SUFCUST=S0CUST                                                   
     C                   IF        ZXFILE=' '                                                       
     C                   EVAL      SUFTDOC='0'                                                      
     C                   ELSE                                                                       
     C                   EVAL      SUFTDOC='1'                                                      
     C                   ENDIF                                                                      
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VALIDACIÓ DELS CMD'S                             *                                
      *------------------------------------------------------------*                                
     C     CS_SECCMD     BEGSR                                                                      
      * Validacion de seguridad teclas de función                                                   
     C                   EVAL      @PEFLD=*BLANKS                                                   
     C                   EVAL      @PEOPT=*BLANKS                                                   
     C                   EVAL      @PEFMT=*BLANKS                                                   
     C                   EVAL      @PEFLD='OPCI'                                                    
     C                   EVAL      @PEPGM=*BLANKS                                                   
     C                   EVAL      @PEPGM=SDSPGM                                                    
     C                   IF        CREATE=*ON                                                       
     C                   EVAL      @PEOPT='1 '                                                      
     C                   ENDIF                                                                      
     C                   EXSR      CS_SECMDOP                                                       
     C     ERRGRL        CABEQ     *ON           SECCMDT                                            
     C     SECCMDT       ENDSR                                                                      
FQ665 **************************************************************                                
FQ665 * SUBRUTINA DE OBTENCION DATOS GENERALES DE ORDENES   DETALL *                                
FQ665 *------------------------------------------------------------*                                
FQ665C     CS_DATORDD    BEGSR                                                                      
FQ665                                                                                               
FQ665C                   EVAL      ZXDOCUM=0                                                        
FQ665                                                                                               
FQ665C                   EVAL      ZXMONE1=S0MONE                                                   
FQ665C                   EVAL      ZXFLCD1=S0DATP                                                   
FQ665C                   EVAL      ZXDTPP1=S0DTPP                                                   
FQ665C     KCOCLIN       CHAIN     COCLIN                             81                            
FQ665 * Obtenemos tiva del clientes                                                                 
FQ665C                   EVAL      PECIAS=@PCIAS                                                    
FQ665C                   EVAL      PECTAB='TIV2'                                                    
FQ665C                   EVAL      PECLTA=*BLANKS                                                   
FQ665C                   EVAL      PECLTA=S0TIVA                                                    
FQ665C     KPMTABD       CHAIN     PMTABD                             81                            
FQ665C                   EVAL      ZXTIVC=PEBL61                                                    
FQ665C                   EVAL      ZXBL65I=PEBL65                                                   
FQ665C                   EVAL      MBCIAS=S0CIAS                                                    
FQ665C                   EVAL      MBMONE=S0MON4                                                    
FQ665C                   IF        INDFRA=*ON AND S0TGR2='2'                                        
FQ665C                   EVAL      C_S0CIAS=S0CIAS                                                  
FQ665C                   EVAL      C_S0GRP2=S0GRP2                                                  
FQ665C                   EVAL      C_S0CUST=S0GRP2                                                  
FQ665C     KCOCLIN9F     CHAIN     COCLIN09                           81                            
FQ665C                   EVAL      MBMONE=C_S0MON4                                                  
FQ665C                   EVAL      ZXMON4=C_S0MON4                                                  
FQ665C                   ENDIF                                                                      
FQ665C     KMSDIV0       CHAIN     MSDIV0                             81                            
FQ665C                   IF        CHAIN=*OFF                                                       
FQ665C                   EVAL      XZDECM=MBDECI                                                    
FQ665C                   EVAL      XZAJUM=MBAJUD                                                    
FQ665C                   ENDIF                                                                      
FQ665                                                                                               
FQ665C                   EVAL      S5CIAS=S0CIAS                                                    
FQ665C                   EVAL      S5DLGA=S0DLGA                                                    
FQ665C                   EVAL      S5NPCO=S0NPCO                                                    
FQ665C                   EVAL      S5DATP=S0DATP                                                    
FQ665C                   EVAL      S5NOPL=S0NOPL                                                    
FQ665C                   EVAL      S5TPED=S0TPED                                                    
FQ665C     KCODEPE08     SETLL     CODEPE08                                                         
FQ665C     KCODEPE08     READE     CODEPE08                               83                        
FQ665                                                                                               
FQ665C                   DOW       READ1=*OFF                                                       
FQ665C                   IF        S5TLIN<'1'                                                       
FQ665C                   EVAL      ZXUNIM1=S5UNIM                                                   
FQ665C                   EVAL      ZXUNDC1=S5UNDP                                                   
FQ665C                   EVAL      ZXARTI1=S5ARTI                                                   
FQ665C                   EVAL      ZXVARI1=S5VARI                                                   
FQ665C                   EVAL      ZXMODE1=S5MODE                                                   
FQ665C                   EVAL      ZXCANS1=S5CANT-S5CANS                                            
FQ665C                   EVAL      ZXPRCC1=S5PREC                                                   
FQ665C                   EVAL      ZXCADC1=S5CADP                                                   
FQ665C                   EVAL      ZXDTO11=S5DTO1                                                   
FQ665C                   EVAL      ZXDTO21=S5DTO2                                                   
FQ665C                   EVAL      ZXDTO31=S5DTO3                                                   
FQ665C                   EVAL      ZXDTO41=S5DTO4                                                   
FQ665C                   EVAL      ZXTIVA1=S5TIVA                                                   
FQ665C                   EVAL      ZXECOP1=S5ECOP                                                   
FQ665 * Vemos si hay cantidad confirmada                                                            
FQ665C                   IF        S5CANC<>*ZEROS                                                   
FQ665C                   EVAL      ZXCANS1=S5CANC-S5CANS                                            
FQ665C                   ENDIF                                                                      
FQ665 * Vemos si hay precio confirmado                                                              
FQ665C                   IF        S5PRCC<>*ZEROS                                                   
FQ665C                   EVAL      ZXPRCC1=S5PRCC                                                   
FQ665C                   EVAL      ZXMONE1=S5MONC                                                   
FQ665C                   EVAL      ZXCADC1=S5CADC                                                   
FQ665C                   EVAL      ZXUNDC1=S5UNDC                                                   
FQ665C                   EVAL      ZXDTO11=S5DT1C                                                   
FQ665C                   EVAL      ZXDTO21=S5DT2C                                                   
FQ665C                   EVAL      ZXDTO31=S5DT3C                                                   
FQ665C                   EVAL      ZXDTO41=S5DT4C                                                   
FQ665C                   ENDIF                                                                      
FQ665                                                                                               
FQ665C                   EXSR      CS_CALDET                                                        
FQ665C                   EVAL      ZXDOCUM=ZXDOCUM+ZXBIMP1                                          
FQ665C                   ENDIF                                                                      
FQ665C     KCODEPE08     READE     CODEPE08                               83                        
FQ665C                   ENDDO                                                                      
FQ665                                                                                               
FQ665C                   ENDSR                                                                      
FQ665 **************************************************************                                
FQ665 * SUBRUTINA DE CALCULOS DE NETOS                             *                                
FQ665 *------------------------------------------------------------*                                
FQ665C     CS_CALDET     BEGSR                                                                      
FQ665* Ecotaxe                                                                                     
FQ665C                   EVAL      XZTAXE=0                                                         
FQ665C                   IF        ZXECOP1<>*BLANKS                                                 
FQ665C                   CALL      'MN0398'                                                         
FQ665C                   PARM                    @PCIAS                                             
FQ665C                   PARM      ZXECOP1       @PEECOP                                            
FQ665C                   PARM      ZXFLCD1       @PEFLCD                                            
FQ665C                   PARM      0             @PETAXE                                            
FQ665C                   EVAL      XZTAXE=@PETAXE                                                   
FQ665C                   END                                                                        
FQ665 * Obtenemos cambio de MONEDA                                                                  
FQ665C                   EVAL      ZXMONE2=S0MON4                                                   
FQ665 *                                                                                             
FQ665C                   IF        INDFRA=*ON AND S0TGR2='2'                                        
FQ665C                   EVAL      ZXMONE2=ZXMON4                                                   
FQ665C                   ENDIF                                                                      
FQ665C                   EXSR      CS_ZXCOCAM                                                       
FQ665                                                                                               
FQ665C                   EVAL      XZAUXI=*ZEROS                                                    
FQ665C                   EVAL      MBMONE=ZXMONE1                                                   
FQ665C                   EVAL      XZDECI=XZDECM                                                    
FQ665C                   EVAL      XZAJUD=XZAJUM                                                    
FQ665                                                                                               
FQ665 * Buscamos en PMUNAL UNIDADES ALTERNATIVAS                                                    
FQ665                                                                                               
FQ665C                   EVAL      XZCOFU=1                                                         
FQ665 *                  IF        ZXUNIM<>ZXUNDC1                                                  
FQ665C                   IF        ZXUNIM1<>ZXUNDC1                                                 
FQ665C                   EVAL      XZCIAS=@PCIAS                                                    
FQ665C                   EVAL      XZARTI=ZXARTI1                                                   
FQ665C                   EVAL      XZVARI=ZXVARI1                                                   
FQ665C                   EVAL      XZMODE=ZXMODE1                                                   
FQ665C                   EVAL      ZXCA10=ZXCANS1                                                   
FQ665C                   EVAL      ZXCA11=ZXCANS1                                                   
FQ665C                   EVAL      ZXUN10=ZXUNIM1                                                   
FQ665C                   EVAL      ZXUN11=ZXUNDC1                                                   
FQ665C* CAMBIO de unidades                                                                          
FQ665C/COPY *LIBL/QSRDSRC,SRD021                                                                    
FQ665C                   ENDIF                                                                      
FQ665                                                                                               
FQ665 * Calculamos el precio de nueva linea o modificada                                            
FQ665                                                                                               
FQ665C                   EVAL      XZCANT=ZXCANS1                                                   
FQ665C                   EVAL      XZPREC=ZXPRCC1                                                   
FQ665C                   EVAL      XZCADP=ZXCADC1                                                   
FQ665C                   EVAL      XZDTO1=ZXDTO11                                                   
FQ665C                   EVAL      XZDTO2=ZXDTO21                                                   
FQ665C                   EVAL      XZDTO3=ZXDTO31                                                   
FQ665C                   EVAL      XZDTO4=ZXDTO41                                                   
FQ665C/COPY *LIBL/QSRDSRC,SRD022ECO                                                                 
FQ665C                   EVAL      XZAUXI=XZAUXI*ZXCOCAMB1                                          
FQ665C                   EVAL      ZXBIMP1ECO=XZAUXI                                                
FQ665C                   EVAL      ZXBIMPOECO=XZAUXI                                                
FQ665C/COPY *LIBL/QSRDSRC,SRD022                                                                    
FQ665                                                                                               
FQ665C                   EVAL      XZAUXI=XZAUXI*ZXCOCAMB1                                          
FQ665C                   EVAL      ZXBIMP1=XZAUXI                                                   
FQ665C                   EVAL      ZXBIMPO=XZAUXI                                                   
FQ665 * Buscamos en % de IVA                                                                        
FQ665                                                                                               
FQ665C                   EVAL      MVTIVA=ZXTIVA1                                                   
FQ665C                   EVAL      MVPABI=ZXPABI                                                    
FQ665C                   EVAL      MVFLCD=ZXFLCD1                                                   
FQ665C     KMSIVAS       SETGT     MSIVAS                                                           
FQ665C     KMSIVASA      READPE    MSIVAS                                 83                        
FQ665                                                                                               
FQ665C                   SELECT                                                                     
FQ665C                   WHEN      ZXTIVC=' '                                                       
FQ665C                   EVAL      MVPIV2=*ZEROS                                                    
FQ665C                   WHEN      ZXTIVC='0'                                                       
FQ665C                   EVAL      MVPIV1=*ZEROS                                                    
FQ665C                   EVAL      MVPIV2=*ZEROS                                                    
FQ665C                   ENDSL                                                                      
FQ665                                                                                               
FQ665 * Calculamos el DTOPP                                                                         
FQ665C                   IF        ZXDTPP1>*ZEROS                                                   
FQ665C                   EVAL      XZAUXI=XZAUXI*ZXDTPP1                                            
FQ665C     XZAUXI        DIV(H)    100           XZAUXI                                             
FQ665C                   EVAL      ZXBIMP1=ZXBIMP1-XZAUXI                                           
FQ665C                   ENDIF                                                                      
FQ665* Ecotaxe                                                                                     
FQ665C                   EVAL      ZXBIMP1=ZXBIMP1+ZXBIMP1ECO                                       
FQ665C                   EVAL      ZXBIMPO=ZXBIMPO+ZXBIMPOECO                                       
FQ665 * Calculamos el IVA                                                                           
FQ665C                   EVAL      XZAUXI=ZXBIMP1*MVPIV1                                            
FQ665C     XZAUXI        DIV(H)    100           XZAUXI                                             
FQ665C                   EVAL      ZXIIVA1=XZAUXI                                                   
FQ665 * Calculamos el Recargo de equivalencia                                                       
FQ665C                   EVAL      XZAUXI=ZXBIMP1*MVPIV2                                            
FQ665C     XZAUXI        DIV(H)    100           XZAUXI                                             
FQ665C                   EVAL      ZXIIVA2=XZAUXI                                                   
FQ665 * Calculamos el IVA en EUROS                                                                  
FQ665C                   EVAL      ZXBIMP1=ZXBIMP1+ZXIIVA1+ZXIIVA2                                  
FQ665C                   EVAL      XZAUXI=ZXBIMP1                                                   
FQ665C* AJUSTE Y DECIMALES                                                                          
FQ665C/COPY *LIBL/QSRDSRC,SRD001                                                                    
FQ665C                   EVAL      ZXBIMP1=XZAUXI                                                   
FQ665                                                                                               
FQ665 * Omitimos BASE o IVA segun tipo de IVA                                                       
FQ665                                                                                               
FQ665C                   IF        MVOMTB>='1'                                                      
FQ665C                   EVAL      ZXBIMP1=ZXBIMP1-ZXBIMPO                                          
FQ665C                   ENDIF                                                                      
FQ665C                   IF        MVOMTI>='1'                                                      
FQ665C                   EVAL      ZXBIMP1=ZXBIMP1-ZXIIVA1                                          
FQ665C                   EVAL      ZXBIMP1=ZXBIMP1-ZXIIVA2                                          
FQ665C                   ENDIF                                                                      
FQ665C                   ENDSR                                                                      
FQ665 **************************************************************                                
FQ665 * SUBRUTINA CLACULO DE COEFICIENTE DE CAMBIO                   *                              
FQ665 *------------------------------------------------------------*                                
FQ665C     CS_ZXCOCAM    BEGSR                                                                      
FQ665 * Búsqueda del cambio para moneda de visualización según SETUP.                               
FQ665C                   EVAL      @PDATA=ZXFLCD1                                                   
FQ665C                   TIME                    @PHORA                                             
FQ665C                   IF        @PDATA=*ZEROS                                                    
FQ665C                   EVAL      @PDATA=ZZDATS                                                    
FQ665C                   ENDIF                                                                      
FQ665                                                                                               
FQ665C                   IF        @PDATA=*ZEROS                                                    
FQ665C                   EVAL      @PDATA=*DATE                                                     
FQ665C                   ENDIF                                                                      
FQ665 * Debo tener en cuenta si existe cambio confirmado                                            
FQ665 * para dicha moneda o no existe dicho cambio confirmado                                       
FQ665C                   EVAL      ZXCOCAMB1=1                                                      
FQ665C                   IF        ZXMONE2<>ZXMONE1                                                 
FQ665C                   CALL      'MM2555'                                                         
FQ665C                   PARM                    @PCIAS                                             
FQ665C                   PARM      ZXMONE1       @PMON1                                             
FQ665C                   PARM      ZXMONE2       @PMON2                                             
FQ665C                   PARM                    @PDATA                                             
FQ665C                   PARM                    @PHORA                                             
FQ665C                   PARM      0             @PCMCOCO                                           
FQ665C                   PARM      0             @PCMCCCO                                           
FQ665C                   PARM      *BLANKS       @PEERR                                             
FQ665C                   EVAL      ZXCOCAMB1=@PCMCCCO                                               
FQ665C                   ENDIF                                                                      
FQ665                                                                                               
FQ665C                   ENDSR                                                                      
09022 **************************************************************                                
09022 * SUBRUTINA CONTROL DEL SFL S03                              *                                
09022 *------------------------------------------------------------*                                
09022C     S03MAIN       BEGSR                                                                      
09022C                   DOW       ZXOPT1='S03'                                                     
09022C     ZXOPT2        CASEQ     'CLR'         S03CLR                                             
09022C     ZXOPT2        CASEQ     'INZ'         S03INZ                                             
09022C     ZXOPT2        CASEQ     'DSP'         S03DSP                                             
09022C     ZXOPT2        CASEQ     'CMD'         S03CMD                                             
09022C     ZXOPT2        CASEQ     'CHK'         S03CHK                                             
09022C                   ENDCS                                                                      
09022C                   ENDDO                                                                      
09022C                   ENDSR                                                                      
09022 **************************************************************                                
09022 * SUBRUTINA INICIALITZACIÓ I CARREGA DEL SFL                 *                                
09022 *------------------------------------------------------------*                                
09022C     S03INZ        BEGSR                                                                      
09022C                   EVAL      ZXOPT2='DSP'                                                     
09022C                   EXSR      CS_SFLIN1                                                        
09022                                                                                               
09022C                   DOW       ZXLOP00 < ZXLIPAG                                                
09022C                   EVAL      ZXFILE=' '                                                       
09022C                   EXSR      CS_READ03                                                        
09022C* Cargo el máximo de 204 registros                                                            
09022C                   IF        ZXNRR00>ZXSFLSIZ                                                 
09022C                   EVAL      EOF=*ON                                                          
09022C                   ENDIF                                                                      
09022C                   IF        EOF=*ON                                                          
09022C                   LEAVE                                                                      
09022C                   ENDIF                                                                      
09022                                                                                               
09022C                   EXSR      CS_SELSFL                                                        
09022C                   IF        ZXSELSFL=1                                                       
09022C                   GOTO      TNEXRE03                                                         
09022C                   ENDIF                                                                      
09022                                                                                               
09022C                   IF        INDPRO3=*ON AND S0TPED<>@PTPED                                   
09022C                   GOTO      TNEXRE03                                                         
09022C                   ENDIF                                                                      
09022                                                                                               
09022C                   EVAL      ZXNRR00=ZXNRR00 + 1                                              
09022C                   EVAL      ZXLOP00=ZXLOP00 + 1                                              
09022C                   EXSR      CS_MOVFP                                                         
09022C                   EXSR      CS_SAVFK                                                         
09022C                   WRITE     SUFD                                                             
09022C     TNEXRE03      TAG                                                                        
09022C                   ENDDO                                                                      
09022C* LESTURA DEL FICHERO DE ALBARANES DIRECTOS                                                   
09022C                   EXSR      CS_SETLL3B                                                       
09022C                   EXSR      S03INZB                                                          
09022                                                                                               
09022 *                                                                                             
09022C                   EXSR      CS_SFLIN2                                                        
09022C     S03INZT       ENDSR                                                                      
09022 **************************************************************                                
09022 * SUBRUTINA INICIALITZACIÓ I CARREGA DEL SFL                 *                                
09022 *------------------------------------------------------------*                                
09022C     S03INZB       BEGSR                                                                      
09022C                   EVAL      ZXOPT2='DSP'                                                     
09022                                                                                               
09022C                   DOW       ZXLOP00 < ZXLIPAG                                                
09022C                   EVAL      ZXFILE='1'                                                       
09022C                   EXSR      CS_READ03B                                                       
09022C* Cargo el máximo de 204 registros                                                            
09022C                   IF        ZXNRR00>ZXSFLSIZ                                                 
09022C                   EVAL      EOF=*ON                                                          
09022C                   ENDIF                                                                      
09022C                   IF        EOF=*ON                                                          
09022C                   LEAVE                                                                      
09022C                   ENDIF                                                                      
09022                                                                                               
09022C                   EXSR      CS_SELSFL                                                        
09022C                   IF        ZXSELSFL=1                                                       
09022C                   GOTO      TNEXRE03B                                                        
09022C                   ENDIF                                                                      
09022                                                                                               
09022C                   IF        INDPRO2=*ON AND S0TPED<>@PTPED                                   
09022C                   GOTO      TNEXRE03B                                                        
09022C                   ENDIF                                                                      
09022                                                                                               
09022C                   EVAL      ZXNRR00=ZXNRR00 + 1                                              
09022C                   EVAL      ZXLOP00=ZXLOP00 + 1                                              
09022C                   EXSR      CS_MOVFP                                                         
09022C                   EXSR      CS_SAVFK                                                         
09022C                   WRITE     SUFD                                                             
09022C     TNEXRE03B     TAG                                                                        
09022C                   ENDDO                                                                      
09022                                                                                               
09022C     S03INZBT      ENDSR                                                                      
09022 **************************************************************                                
09022 * SUBRUTINA CONTROL DEL SFL S03                              *                                
09022 *------------------------------------------------------------*                                
09022C     CS_READ03     BEGSR                                                                      
09022                                                                                               
09022C     KCOCAPE0      READE     COCAPE38                               82                        
09022                                                                                               
09022C     READ03T       ENDSR                                                                      
09022 **************************************************************                                
09022 * SUBRUTINA CONTROL DEL SFL S03                              *                                
09022 *------------------------------------------------------------*                                
09022C     CS_READ03B    BEGSR                                                                      
09022                                                                                               
09022C     KCMA0400      READE     CMA04034                               82                        
09022                                                                                               
09022C     READ03BT      ENDSR                                                                      
09022 **************************************************************                                
09022 * SUBRUTINA VISUALITZACIÓ SFL                                *                                
09022 *------------------------------------------------------------*                                
09022C     S03DSP        BEGSR                                                                      
09022C                   EVAL      ZXOPT2='CMD'                                                     
09022C                   IF        ZZNPGM=' '                                                       
09022C                   EVAL      PPPCMD1='CMD3041'                                                
09022C                   ELSE                                                                       
09022C                   EVAL      PPPCMD1='CMD3041'                                                
09022C                   ENDIF                                                                      
09022C                   EVAL      SUFHED1='HCM0850'                                                
09022                                                                                               
09022C                   EXSR      CS_SFLDSP                                    SI REGS             
09022C     S03DSPT       ENDSR                                                                      
09022 **************************************************************                                
09022 * SUBRUTINA VALIDACIÓ DELS CMD'S                             *                                
09022 *------------------------------------------------------------*                                
09022C     S03CMD        BEGSR                                                                      
09022C                   EVAL      ZXOPT2='CHK'                                                     
09022C                   EXSR      CS_SFLCMD                                                        
09022C     S03CMDT       ENDSR                                                                      
09022 **************************************************************                                
09022 * SUBRUTINA VALIDACIÓ DEL SFL: FORMAT SFL I OPCIONS          *                                
09022 *------------------------------------------------------------*                                
09022C     S03CHK        BEGSR                                                                      
09022C                   EVAL      ZXOPT2='DSP'                                                     
09022                                                                                               
09022 * SUBRUTINA COMÚ DE VALIDACIÓ DEL SFL                                                         
09022C                   EXSR      CS_SFLCHK                                                        
09022                                                                                               
09022C     S03CHKT       ENDSR                                                                      
09022 **************************************************************                                
09022 * SUBRUTINA DE NETEJA DEL SFL                                *                                
09022 *------------------------------------------------------------*                                
09022C     S03CLR        BEGSR                                                                      
09022C                   EVAL      ZXOPT2='INZ'                                                     
09022C                   EVAL      CCCFMT='3'                                                       
09022C                   MOVEA     ZXZERO10      *IN(90)                                            
09022C                   EVAL      INPOS03=*ON                                                      
09022C                   EXSR      CS_SFLCLR                                                        
09022C                   EXSR      CS_SETLL03                                                       
09022C     S03CLRT       ENDSR                                                                      
09022 **************************************************************                                
09022 * SUBRUTINA CONTROL DEL SFL S022                              *                               
09022 *------------------------------------------------------------*                                
09022C     CS_SETLL03    BEGSR                                                                      
09022C                   EVAL      S0DLGA=ZXDLGA                                                    
09022C                   EVAL      S0NPCO=ZXNPCO                                                    
09022C                   EVAL      S0TPED=ZXTPED                                                    
09022C                   EVAL      S0FPED=ZXFPED                                                    
09022                                                                                               
09022C     KCOCAPE38     SETLL     COCAPE38                                                         
09022                                                                                               
09022C     SETLL03       ENDSR                                                                      
09022 **************************************************************                                
09022 * SUBRUTINA CONTROL DEL SFL S022                              *                               
09022 *------------------------------------------------------------*                                
09022C     CS_SETLL3B    BEGSR                                                                      
09022C                   EVAL      S0DLGA=ZXDLGA                                                    
09022C                   EVAL      S0NPCO=ZXNPCO                                                    
09022C                   EVAL      S0TPED=ZXTPED                                                    
09022C                   EVAL      S0FRRR=ZXFPED                                                    
09022                                                                                               
09022C     KCMA04034     SETLL     CMA04034                                                         
09022                                                                                               
09022C     SETLL33B      ENDSR                                                                      
09022 **************************************************************                                
09022 * SUBRUTINA PER MOURE CAMPS AL SFL                           *                                
09022 *------------------------------------------------------------*                                
09022C     S03MFP        BEGSR                                                                      
09022C                   EVAL      SUFOPCI=*BLANKS                                                  
09022C                   EVAL      SFLNXC=*OFF                                                      
FQ665C                   IF        S0RDEN='1'                                                       
FQ665C                   SETON                                        67                            
FQ665C                   ELSE                                                                       
FQ665C                   SETOFF                                       67                            
FQ665C                   ENDIF                                                                      
09022 * Campos para vista 1                                                                         
09022                                                                                               
09022C                   IF        ZXFILE='1'                                                       
09022C                   EVAL      S31TALB='1'                                                      
09022C                   ELSE                                                                       
09022C                   EVAL      S31TALB=' '                                                      
09022C                   ENDIF                                                                      
09022C                   EVAL      S31TPED=S0TPED                                                   
09022C                   EVAL      S31CUST=S0CUST                                                   
09022C                   EVAL      S31REFE=S0REFE                                                   
09022C                   EVAL      S31STCO=S0STCO                                                   
09022C                   EVAL      S31NPCO=S0NPCO                                                   
09022                                                                                               
09022C                   EVAL      @PVAA=*BLANKS                                                    
09022C                   CALL      'MM2510'                                                         
09022C                   PARM      S0FPED        @PVAN                                              
09022C                   PARM                    @PVAA                                              
09022C                   PARM      'YYMD'        @PFMI                                              
09022C                   PARM      ZZFMFF        @PFMF                                              
09022C                   PARM      ZZFMFS        @PSEP                                              
09022C                   PARM      ' '           @PEERR                                             
09022C                   EVAL      S31FPED=@PVAA                                                    
09022                                                                                               
09022C                   EVAL      S31MONE=S0MONE                                                   
09022                                                                                               
09022C                   EVAL      @PVAA=*BLANKS                                                    
09022C                   CALL      'MM2510'                                                         
09022C                   PARM      S0FPED        @PVAN                                              
09022C                   PARM                    @PVAA                                              
09022C                   PARM      'YYMD'        @PFMI                                              
09022C                   PARM      ZZFMFF        @PFMF                                              
09022C                   PARM      ZZFMFS        @PSEP                                              
09022C                   PARM      ' '           @PEERR                                             
09022C                   EVAL      S31FPED=@PVAA                                                    
09022 * Campos para doblar                                                                          
09022C                   EVAL      S032DES1=S0DES1                                                  
09022                                                                                               
FQ365C                   IF        S0RCON <> *BLANKS                                                
FQ365C                   MOVEL     S0RCON        ZXRCON                                             
FQ365C                   EVAL      @PVAA=*BLANKS                                                    
FQ365C                   CALL      'MM2510'                                                         
FQ365C                   PARM      ZXRCON        @PVAN                                              
FQ365C                   PARM                    @PVAA                                              
FQ365C                   PARM      'YYMD'        @PFMI                                              
FQ365C                   PARM      ZZFMFF        @PFMF                                              
FQ365C                   PARM      ZZFMFS        @PSEP                                              
FQ365C                   PARM      ' '           @PEERR                                             
FQ365C                   MOVEL     'conf:'       S032RCON                                           
FQ365C                   MOVE      @PVAA         S032RCON                                           
FQ365C                   ELSE                                                                       
FQ365C                   MOVEL     *BLANKS       S032RCON                                           
FQ365C                   ENDIF                                                                      
FQ665                                                                                               
FQ665 * Importe Documento                                                                           
FQ665C                   EXSR      CS_DATORDD                                                       
FQ665C                   EVAL      PXALPH = *BLANKS                                                 
FQ665C                   EVAL      PXNUM = ZXDOCUM                                                  
FQ665C                   CALL      'PRD650'                                                         
FQ665C                   PARM                    PXNUM                          CAMP NUMÈRIC        
FQ665C                   PARM                    PXALPH                         CAMP ALFANUMÈRIC    
FQ665C                   PARM                    PXFLDD                         Nº CARACT. VISUA    
FQ665C                   PARM      0             PXDCCD                         Nº DECIMALS         
FQ665C                   PARM                    PXFMD1                         AJUST DECIMAL (.    
FQ665C                   PARM      'K'           PXEDTC                         CODI EDICIO(4,M,    
FQ665C                   PARM                    PXNMER                         RETORN ERROR        
FQ665C                   PARM                    PXTIPA                         TIPO AJUSTE (0,1    
FQ665C                   MOVE      PXALPH        S032IMPO                                           
FQ665                                                                                               
09022                                                                                               
09022C                   EXSR      CS_KEYPF                                                         
09022C                   EVAL      SUFDATA=W3DATAV1                                                 
09022C                   EVAL      SUFDAT2=W3DAT2                                                   
09022                                                                                               
09022C     S03MFPT       ENDSR                                                                      
PG615 ******************************************************************************************    
PG615 * ChkCustomer                                                                                 
PG615 *  Valida flag bloquejos per Albará, a nivell de client                                       
PG615 *-----------------------------------------------------------------------------------------    
PG615c     ChkCustomer   begsr                                                                      
PG615 *                                                                                             
PG615c                   eval      bLckAlb   =*off                                                  
PG615 *                                                                                             
PG615c     kcoclin       chain     coclin                                                           
PG615c                   if        s0babb='1'                                                       
PG615c                   eval      bLckAlb   =*on                                                   
PG615c                   else                                                                       
PG615c                   eval      bLckAlb   =*off                                                  
PG615c                   endif                                                                      
PG615 *                                                                                             
PG615c                   endsr                                                                      
      ******************************************************************************************    
     C* validación de opciones                                                                      
      ******************************************************************************************    
     C/COPY *LIBL/QSRDSRC,SRD030                                                                    
