      *                 DDS ADP 400.             23/12/98  13:14                                    
      * Copyright (c)   ASTRAL GRUP. All Rights Reserved.                                           
      * Aplic PUR       astral Grup, S.A. COMPRAS                                                   
      * File  COPROD01  PROMOCIONES COMERCIALES. DETALLE                                            
      * Type  LF                                                                                    
     A          R RCOPROD                   PFILE(COPROD)                                           
     A          K X5CIAS                                                                            
     A          K X5CUST                                                                            
     A          K X5PROM                                                                            
