      **************************************************************                                
      * APLICACIÓ: MÒDUL DE LOGISTICA                              *                                
      **************************************************************                                
      * TITOL: DO0010  © FLUIDRA SERVICES                          *                                
      * DATA CREACIO:  05/04/2005                                  *                                
      * FUNCIO DEL PROGRAMA: Mantenimiento de Parámetres Flu.Direct*                                
      *                                                            *                                
      * DOCUMENTACIO:                                              *                                
      *                                                            *                                
      * ZXOPT1 = NOM DEL PROCÉS                                    *                                
      *        - SN = SUBFITXER N.          N=[01,02,...,99]       *                                
      *        - N TAMBÉ EQUIVAL AL NÚMERO DE FORMAT DEL SFL       *                                
      *          I COINCIDEIX AMB EL Nº DE LÒGIC (ESSENT N=00 EL   *                                
      *          FITXER FÍSIC)                                     *                                
      * ZXOPT2 = RUTINA DINTRE DEL PROCÉS                          *                                
      *        - 'INZ'= INICILITZAR                                *                                
      *        - 'DSP'= VISUALITZA DE PANTALLA                     *                                
      *        - 'CHK'= VALIDACIÓ DE LA PANTALLA                   *                                
      *        - 'CLR'= NETEJA DEL SFL                             *                                
      *        - 'UPD"= ACTUALITZACIONS DELS FITXERS               *                                
      *                                                            *                                
      * ZXNNN00= Últim nº de registre carregat en subarxiu         *                                
      * ZXNRR00= Numerador de registres de subarxiu                *                                
      * ZXCOUNT= ZXNRR00 del 1er registre de la últ. pag.          *                                
      *          que visualizaba el usuario                        *                                
      * ZXLOP00= Numerador de registres en carrega de pantalla     *                                
      * SUFRCDN= SFLRCDNBR del subarxiu                            *                                
      * PREFIXE DE CAMP: CCC- (CAMP COMÚ DE CAPÇALERA: CAMP QUE EL *                                
      *        SEU CONTINGUT NO VARIA EN LES ALTRES CAPÇALERES DE  *                                
      *        L'APLICACIÓ. P.EX.: NOM DEL PGM O DEL TREBALL)      *                                
      *                                                            *                                
      * CS_(NOM): COMMON SUBRUTINE (COL·LOCADES FINAL PGM)        *                                 
      * @PE(NOM) : PARAMETRES D'EXPORTACIÓ                         *                                
      **************************************************************                                
      * ORGANIZACIÓN DEL FICHERO  EDPAR2                           *                                
      * CIRCUITO                                                   *                                
      *  TREG     DESCRIPCIÓN                                      *                                
      *  =====    ===============================================  *                                
      *    0    - CARGAMOS PRIORIDADES A NIVEL DE EMPRESA          *                                
      *    1    - VERIFICAR SI EXISTE A NIVEL DE PROVEEDOR         *                                
      *    2    - VERIFICAR SI EXISTE A NIVEL DE ARTICULO          *                                
      *    3    - VERIFICAR SI EXISTE A NIVEL DE FAM/SUBF          *                                
      *    4    - VERIFICAR SI EXISTE A NIVEL DE FAM/TARIFA        *                                
      *    5    - VERIFICAR SI EXISTE A NIVEL DE CLIENTE           *                                
      *                                                            *                                
      *    A    - CARGAMOS PRIORIDADES A NIVEL DE DELEGACIÓN       *                                
      *    B    - VERIFICAR SI EXISTE A NIVEL DE  DLGA/ PROVEEDOR  *                                
      *    C    - VERIFICAR SI EXISTE A NIVEL DE  DLGA/ ARTICULO   *                                
      *    D    - VERIFICAR SI EXISTE A NIVEL DE  DLGA/ FAMILIA    *                                
      *    E    - VERIFICAR SI EXISTE A NIVEL DE  DLGA/ FAM-SUBF   *                                
      *    F    - VERIFICAR SI EXISTE A NIVEL DE  DLGA/ FAM-TARIFA *                                
      *    G    - VERIFICAR SI EXISTE A NIVEL DE  DLGA/ CLIENTE    *                                
FGI25 *    M    - Verificar excepción a nivel categorización articulo  MTO/MTS                      
      **************************************************************                                
                                                                                                    
F-2OL * DATA DE MODIFICACIÓ: 24/11/2021  MARCA: F-2OL              *                                
F-2OL * AUTOR: David Grau                                          *                                
F-2OL * DOCUMENTACIÓ: 2OL- Obrir a més d'un OL                     *                                
F-2OL **************************************************************                                
FGI25 */ Date : 20/06/2025    Marca: FGI25         Moficicació: OLFGI-25                            
FGI25 */ Descripció: EXCEPCIÓN DOM EN ITALIA                                                        
FGI25 */ Autor: MMontana                                                                            
FGI25 */  Nueva excepción por categorización del articulo: MTO/MTS                                  
FGI25 */  Nueva excepción por categorización del articulo: MTO/MTS                                  
FGI25 */////////////////////////////////////////////////////////////////////////////////////////    
     H DATEDIT(*YMD/)                                                                               
     FDO0010FM  CF   E             WORKSTN INFDS(SFLDS)                                             
     F                                     SFILE(SUFD:ZXNRR00)                                      
     FEDPARM    UF   E           K DISK                                                             
     FEDPAR2    IF   E           K DISK                                                             
     FPMEMPR    IF   E           K DISK                                                             
     FMSSGGA    IF   E           K DISK                                                             
     FPMSETP    UF A E           K DISK                                                             
                                                                                                    
      * ESTRUCTURA DE LA INFDS                                                                      
     D                SDS                                                                           
     D  SDSPGM                 1     10                                                             
     D    CCCPGM                     10    OVERLAY(SDSPGM)                                          
     D  SDSJOB               244    253                                                             
     D    CCCJOB                     10    OVERLAY(SDSJOB)                                          
     D  SDSUSR               254    263                                                             
     D  SDSJNBR              264    269                                                             
                                                                                                    
      * AREA DE DADES D'INFORMACIÓ ARXIU                                                            
     D  SFLDS          DS                                                                           
     D    SFLPOCUR           370    371B 0                                                          
     D    SFLPOS1            378    379B 0                                                          
     D    SFLRCD         *RECORD                                                                    
                                                                                                    
      * AREA DE DADES LOCAL I INICIALITZACIO DE VALORS COMUNS                                       
     D DSLDA         E DS                  EXTNAME(PURLDADS)                                        
     D    CCCDEEM                    30    OVERLAY(ZZDEEM)                                          
                                                                                                    
      * AREA DE PARAMETRES DE PROGRAMA                                                              
     D  DO0010       E DS                  EXTNAME(DO0010DS)                                        
                                                                                                    
      * PLANTILLA D'INDICADORS DEL PROGRAMA (ELS RESERVATS NO SURTEN)                               
      * ELS DE TREBALL ES PODEN REDENOMINAR MITJANÇANT OVERLAY                                      
     D  INDICADORS   E DS                  BASED(INDICADORP)                                        
     D                                     EXTNAME(INDDS:RIND0199)                                  
     D     INPOS01   E                     EXTFLD(SETL01)                                           
     D     INPOS02   E                     EXTFLD(SETL02)                                           
     D     VLDCMDKEY E                     EXTFLD(WRK74)                                            
     D     ROLLDOWN  E                     EXTFLD(WRK77)                                            
     D  INDICADORP     S               *   INZ(%ADDR(*IN))                                          
                                                                                                    
      * CONTROL DEL FLUXE DEL PROGRAMA AMB INICIALITZACIÓ DE POSIC. INICIAL                         
     D                 DS                                                                           
     D  ZXOPT                  1      6    INZ('S01CLR')                                            
     D    ZXOPT1               1      3                                                             
     D    ZXOPT2               4      6                                                             
FQ710 *                                                                                             
FQ710 * PARÀMETRES PEL PRD650 I CAMPS DE TREBALL ASSOCIATS                                          
FQ710 * VALOR NUMÈRIC                                                                               
FQ710D   PXNUM         S             29  9                                                          
FQ710 * VALOR ALFANUMÈRIC                                                                           
FQ710D   PXALPH        S             29                                                             
FQ710 * LONGITUD TOTAL DEL CAMP (Nº CARÀCTERS INCLÒS CODI EDICIÓ)                                   
FQ710D   PXFLDD        S              2  0 INZ(20)                                                  
FQ710 * Nº DE DECIMALS DEL CAMP                                                                     
FQ710D  PXDCCD         S              1  0                                                          
FQ710 * TIPUS DE FORMAT DECIMAL (.,)                                                                
FQ710D  PXFMD1         S                   LIKE(ZZFMD1)INZ                                          
FQ710 * CODI D'EDICIÓ (4,M,Q,Z)                                                                     
FQ710D  PXEDTC         S                   LIKE(ZZEDTC)INZ('M')                                     
FQ710D  PXEDT2         S                   LIKE(ZZEDTC)INZ('K')                                     
FQ710 * RETORN CODI D'ERROR                                                                         
FQ710D  PXNMER         S              1  0 INZ(0)                                                   
FQ710 * TIPUS D'AJUST DECIMAL (0=MIG 1=PER SOBRE 2=PER SOTA)                                        
FQ710D  PXTIPA         S                   LIKE(ZZAJUD)                                             
FQ710                                                                                               
                                                                                                    
      * ESTRUCTURA DE DADES PELS DIFERENTS FORMATS DE SUBARXIU                                      
      * W1DATA -> S01D                                                                              
     D                 DS                                                                           
     D  W1DATA                 1     74                                                             
     D    S01CIAS              1      3                                                             
     D    S01DLGA              5      9                                                             
     D    S01ADOM             12     12                                                             
     D    S01PEXP             15     17                                                             
     D    S01OBSO             21     21                                                             
     D    S01EPPE             27     27                                                             
     D    S01EPRV             33     33                                                             
     D    S01EART             38     38                                                             
     D    S01EFAM             42     42                                                             
     D    S01EFAS             49     49                                                             
     D    S01EFAT             55     55                                                             
     D    S01ECLI             63     63                                                             
     D    S01ADFT             69     74                                                             
                                                                                                    
      * EXPORTACIÓ DE PARÀMETRES                                                                    
     D    @PECIAS      S                   LIKE(T3CIAS) INZ                                         
     D    @PEDLGA      S                   LIKE(T3DLGA) INZ                                         
     D                                                                                              
     D @PEPRIO         S                   LIKE(T4PRIO)                                             
     D @PEPRVR         S                   LIKE(T4PRVR)                                             
     D @PEARVT         S                   LIKE(T4ARVT)                                             
     D @PEFAMT         S                   LIKE(T4FAMT)                                             
     D @PETREG         S                   LIKE(T4TREG)                                             
     D @PECIA2         S                   LIKE(T4CIA1)                                             
     D @PEMAGA         S                   LIKE(T4MAGA)                                             
     D                                                                                              
     D                                                                                              
     D    @PEOPT       S                   LIKE(SUFOPCI)INZ                                         
     D    @PEPGM       S                   LIKE(SDSPGM) INZ                                         
     D    @PEFMT       S                   LIKE(RECORD) INZ                                         
     D    @PEFLD       S                   LIKE(FIELD)  INZ                                         
     D    @PEERR       S              1                 INZ                                         
                                                                                                    
     D* SERIES A UTILITZAR EN PROGRAMA                                                              
     DSSSECPA          S              1A   DIM(10)                                                  
                                                                                                    
     D* DEFINICIO DE CAMPS DE TREBALL                                                               
     D  ZXNRR00        S                   LIKE(SUFRCDN)INZ                                         
     D  ZXNNN00        S                   LIKE(SUFRCDN)INZ                                         
     D  ZXLOP00        S                   LIKE(SUFRCDN)INZ                                         
     D  ZXCOUNT        S                   LIKE(SUFRCDN)INZ(1)                                      
     D  ZXFMT          S                   LIKE(CCCFMT) INZ                                         
     D  ZXAU15         S             15  0                                                          
     D  ZXSELSFL       S              1  0                                                          
     D  ZXSEMF         S              1                                                             
                                                                                                    
     D* Los Campos que vienen a continuacion guardan los valores                                    
     D* de la primera clave con que se cargo el subarchivo y a partir de                            
     D* los cuales se realizara cualquier accion de refrescar segun                                 
     D* ACCREF 1=SI 0=NO                                                                            
     D  ZXCIAS_1       S                   LIKE(T3CIAS) INZ                                         
     D  ZXDLGA_1       S                   LIKE(T3DLGA) INZ                                         
                                                                                                    
      * El valor ZXCOMCAR marcara cuando se deben guardar los valores                               
      * de primera clave anteriores                                                                 
     D  ZXCOMCAR       S              1  0                                                          
      * Campos de uso para trabajar con la API QCMDEXC                                              
     D  ZXQCMD         S            150                                                             
     D  ZXLOGC         S             15  5 INZ(150)                                                 
      * El valor ZXLIPAG tiene el numero de registros a cargar despues de                           
      * un Clear de subfichero                                                                      
     D  ZXLIPAG        S                   LIKE(SUFRCDN)INZ(12)                                     
     D  ZXLIPA2        S                   LIKE(SUFRCDN)INZ(12)                                     
     D  ZXNUPAG        S                   LIKE(SUFRCDN)                                            
     D  ZXRESTO        S                   LIKE(SUFRCDN)                                            
      * Definicion de posición del cursor en subarchivo                                             
     D  ZXLINEA        S              3  0                                                          
     D  ZXCOLU         S              3  0                                                          
      * Definicion de algunas constantes                                                            
     D  ZXZERO10       S             10A   INZ(*ALL'0')                                             
      *                                                                                             
      *                                                                                             
     D  T3AMPL         DS                                                                           
     D     T3OPL1              1      3                                                             
     D     T3OPL2              4      6                                                             
     D     T3RESE              7      7                                                             
     D     T3RTRE              8      8                                                             
     D     T3LVIR              9     11                                                             
     D     T3VFYB             12     12                                                             
     D     T3ADOM             14     14                                                             
     D     T3PNFE             16     18                                                             
                                                                                                    
      **************************************************************                                
      * RUTINA PRINCIPAL DEL PGM : DISTRIBUCIÓ DEL PAS PELS 3 SFL  *                                
      *------------------------------------------------------------*                                
     C     ZXOPT1        DOWNE     'END'                                                            
     C     ZXOPT1        CASEQ     'PA0'         PA0MAIN                        SETUP DEL PGM       
     C     ZXOPT1        CASEQ     'S01'         S01MAIN                        FMT. PER ARTICLE    
     C                   ENDCS                                                                      
     C                   ENDDO                                                                      
     C                   SETON                                        LR                            
      **************************************************************                                
      * SUBRUTINA INICIAL. DEFINICIO DE TOTS ELS PARÀMETRES        *                                
      * GENERALS DEL PROGRAMA.                                     *                                
      *------------------------------------------------------------*                                
     C     *INZSR        BEGSR                                                                      
      *                                                                                             
      * DEFINICIO DE LES KLIST DEL PGM                                                              
      *                                                                                             
     C     KEDPARM0      KLIST                                                                      
     C                   KFLD                    T3CIAS                                             
      *                                                                                             
     C     KEDPARM       KLIST                                                                      
     C                   KFLD                    T3CIAS                                             
     C                   KFLD                    T3DLGA                                             
      *                                                                                             
     C     KMSSETP       KLIST                                                                      
     C                   KFLD                    PICIAS                                             
     C                   KFLD                    PIPROG                                             
     C                   KFLD                    PIUSU1                                             
      *                                                                                             
     C     KPMEMPR       KLIST                                                                      
     C                   KFLD                    P7CIAS                                             
     C                   KFLD                    P7DLGA                                             
      *                                                                                             
     C     KEDPAR2       KLIST                                                                      
     C                   KFLD                    T4CIA1                                             
     C                   KFLD                    T4TREG                                             
     C                   KFLD                    T4DLGA                                             
      *                                                                                             
                                                                                                    
      * RECUPERACIÓ DE LA LDA DE COMPRES                                                            
     C     *DTAARA       DEFINE    PURLDA        DSLDA                                              
     C                   IN        DSLDA                                                            
                                                                                                    
     C                   EVAL      Z1ASTE='*'                                                       
      *                                                                                             
      * CAPÇALERES D'OPCIONS DEL SFL  (CODIS D'ARXIU DE MISSATGES)                                  
      *                                                                                             
FGI25C*                  EVAL      SUFOPC1='ODO0010'                                                
FGI25c                   eval      SUFOPC1='ODO0012'                                                
     C                   EVAL      SUFOPC2='ODO0011'                                                
      *                                                                                             
      * TITOLS DE PANTALLES (CODIS D'ARXIU DE MISSATGES)                                            
      *                                                                                             
     C                   EVAL      CCCCTIT='TDO0010'                                                
      *                                                                                             
      * ACTIVEM EL SFLDSPCTL                                                                        
      *                                                                                             
     C                   EVAL      SFLCTL=*ON                                                       
      *                                                                                             
      * VALORES COMUNES                                                                             
      *                                                                                             
     C                   EVAL      PICIAS=ZZCIAS                                                    
     C                   EVAL      PIPROG=SDSPGM                                                    
     C                   EVAL      PIUSU1=ZZUSUA                                                    
                                                                                                    
      * RECUPEREM DEL FITXER DE SETUP EL FORMAT QUE EM DE MOSTRAR PER OMISIÓ                        
     C     KMSSETP       CHAIN (N) PMSETP                             81                            
     C                   CLEAR                   DO0010                                             
     C     PIDATR        CAT       DO0010:0      DO0010                                             
     C                   EVAL      ZXFMT=MÑS001                                                     
                                                                                                    
     C* RECUPEREM ELS VALORS DE L'AREA DE PARÀMETRES DE PROGRAMA                                    
     C                   IF        CHAIN=*OFF                                                       
     C                   SELECT                                                                     
     C                   WHEN      MÑS001=' ' OR MÑS001='0'                                         
     C                   EVAL      ZXOPT='S01CLR'                                                   
     C                   WHEN      MÑS001='1'                                                       
     C                   EVAL      ZXOPT='S01CLR'                                                   
     C                   ENDSL                                                                      
     C                   ENDIF                                                                      
                                                                                                    
     C                   EVAL      ERRGRL=*ON                                                       
      *                                                                                             
      * SEGURIDAD DEL MENU                                                                          
      *                                                                                             
     C                   CALL      'SV0275'                                                         
     C                   PARM                    SDSPGM                                             
     C                   PARM                    @PMERROR          1                                
     C                   IF        @PMERROR='1'                                                     
     C                   EVAL      ZXOPT='END   '                                                   
     C                   ENDIF                                                                      
      *                                                                                             
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA INICIAL PARA PANTALLA PA0                        *                                
      *------------------------------------------------------------*                                
     C     PA0MAIN       BEGSR                                                                      
     C                   DOW       ZXOPT1='PA0'                                                     
     C     ZXOPT2        CASEQ     'CLR'         PA0CLR                                             
     C     ZXOPT2        CASEQ     'INZ'         PA0INZ                                             
     C     ZXOPT2        CASEQ     'DSP'         PA0DSP                                             
     C     ZXOPT2        CASEQ     'CMD'         PA0CMD                                             
     C     ZXOPT2        CASEQ     'CHK'         PA0CHK                                             
     C     ZXOPT2        CASEQ     'UPD'         PA0UPD                                             
     C                   ENDCS                                                                      
     C                   ENDDO                                                                      
     C     PA0MAINT      ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA DE NETEJA DE PA0                                 *                                
      *------------------------------------------------------------*                                
     C     PA0CLR        BEGSR                                                                      
     C                   EVAL      ZXOPT2='INZ'                                                     
     C     *NOKEY        CLEAR     *ALL          RPMSETP                                            
     C                   MOVEA     ZXZERO10      *IN(40)                                            
     C                   MOVEA     ZXZERO10      *IN(50)                                            
     C                   EVAL      CSRFILA=0                                                        
     C                   EVAL      CSRCOLU=0                                                        
     C     PA0CLRT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA DE INICI DE PA0                                 *                                 
      *------------------------------------------------------------*                                
     C     PA0INZ        BEGSR                                                                      
     C     KMSSETP       CHAIN (N) PMSETP                             81                            
     C                   CLEAR                   DO0010                                             
     C     PIDATR        CAT       DO0010:0      DO0010                                             
     C                   EXSR      CS_MOVFP                                                         
                                                                                                    
     C                   EVAL      ZXOPT2='DSP'                                                     
     C     PA0INZT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VISUALITZACIÓ DE PA0                             *                                
      *------------------------------------------------------------*                                
     C     PA0DSP        BEGSR                                                                      
     C                   EVAL      ZXOPT2='CMD'                                                     
     C                   EVAL      PPPCMD1='CMD3031'                                                
     C                   EXFMT     PA0                                                              
     C                   EVAL      ERRGRL=*OFF                                                      
     C                   EVAL      MSGER=*BLANKS                                                    
     C                   MOVEA     ZXZERO10      *IN(40)                                            
     C                   MOVEA     ZXZERO10      *IN(50)                                            
                                                                                                    
     C                   EVAL      CSRFILA=0                                                        
     C                   EVAL      CSRCOLU=0                                                        
     C     PA0DSPT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VALIDACIÓ DELS CMD'S                             *                                
      *------------------------------------------------------------*                                
     C     PA0CMD        BEGSR                                                                      
     C                   EVAL      ZXOPT2='CHK'                                                     
                                                                                                    
     C                   SELECT                                                                     
                                                                                                    
      * F03=FINALITZAR                                                                              
     C                   WHEN      EXIT=*ON                                                         
     C                   EVAL      ZXOPT1='END'                                                     
                                                                                                    
      * F04=AJUDA DE CAMPS                                                                          
     C                   WHEN      HELP=*ON                                                         
     C                   EVAL      ZXOPT2='DSP'                                                     
     C                   EXSR      CS_POSCUR                                                        
     C                   EVAL      @PEFLD=*BLANKS                                                   
     C                   EVAL      @PEFMT=*BLANKS                                                   
     C                   EVAL      @PEFLD=FIELD                                                     
     C                   IF        FIELD='PA0SBAJ'                                                  
     C                   EVAL      @PEFLD='SINO'                                                    
     C                   CALL      'MMPROM'                                     Query-Aut-F4   X    
     C                   PARM      *BLANKS       @PEOPT                         PARM Qry-F4         
     C                   PARM      *BLANKS       @PEPGM                         PARM Qry-F4         
     C                   PARM      *BLANKS       @PEFMT                         PARM Qry-F4         
     C                   PARM                    @PEFLD                         PARM Qry-F4         
     C                   PARM      *BLANKS       @PEERR                         PARM Qry-F4         
                                                                                                    
     C                   IF        @PEERR>'0'                                                       
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='ADP0304'                                                  
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TPA0F4                                             
      * Si no han realizado ninguna selección no tocamos nada                                       
     C                   IF        @PEERR='A'                                                       
     C                   EVAL      ERRGRL=*ON                                                       
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TPA0F4                                             
     C                   IF        FIELD='PA0SBAJ'                                                  
     C                   EVAL      PA0SBAJ=@PEOPT                                                   
     C                   ENDIF                                                                      
     C                   GOTO      TPA0F4                                                           
     C                   ENDIF                                                                      
     C                   EVAL      @PEFMT=RECORD                                                    
                                                                                                    
     C                   IF        FIELD='PA0S001'                                                  
     C                   EVAL      @PEFMT=*BLANKS                                                   
     C                   EVAL      @PEFLD=*BLANKS                                                   
     C                   EVAL      @PEFLD='CFMT'                                                    
     C                   ENDIF                                                                      
                                                                                                    
     C                   CALL      'MMPROM'                                     Query-Aut-F4   X    
     C                   PARM      *BLANKS       @PEOPT                         PARM Qry-F4         
     C                   PARM      SDSPGM        @PEPGM                         PARM Qry-F4         
     C                   PARM                    @PEFMT                         PARM Qry-F4         
     C                   PARM                    @PEFLD                         PARM Qry-F4         
     C                   PARM      *BLANKS       @PEERR                         PARM Qry-F4         
                                                                                                    
      * Si no han realizado ninguna selección no tocamos nada                                       
     C                   IF        @PEERR='A'                                                       
     C                   EVAL      ERRGRL=*ON                                                       
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TPA0F4                                             
      *                                                                                             
     C                   IF        FIELD='PA0S001'                                                  
     C                   EVAL      PA0S001=@PEOPT                                                   
     C                   ENDIF                                                                      
                                                                                                    
     C     TPA0F4        TAG                                                                        
     C     ERRGRL        CABEQ     *ON           PA0CMDT                                            
                                                                                                    
     C                   ENDSL                                                                      
                                                                                                    
     C     PA0CMDT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VALIDACIÓ DE PANTALLA PA0                        *                                
      *------------------------------------------------------------*                                
     C     PA0CHK        BEGSR                                                                      
     C                   EVAL      ZXOPT2='UPD'                                                     
                                                                                                    
      * VALIDACIO DE LES OPCIONS DE DETALL DE PA0                                                   
     C* Validación de PA0S001                                                                       
     C                   EVAL      @PEFMT=*BLANKS                                                   
     C                   EVAL      @PEFLD=*BLANKS                                                   
     C                   EVAL      @PEOPT=*BLANKS                                                   
     C                   EVAL      @PEOPT=PA0S001                                                   
     C                   EVAL      @PEFLD='CFMT'                                                    
     C                   CALL      'MMPROM'                                     Query-Aut-F4   X    
     C                   PARM                    @PEOPT                         PARM Qry-F4         
     C                   PARM      SDSPGM        @PEPGM                         PARM Qry-F4         
     C                   PARM                    @PEFMT                         PARM Qry-F4         
     C                   PARM                    @PEFLD                         PARM Qry-F4         
     C                   PARM      'V'           @PEERR                         PARM Qry-F4         
                                                                                                    
     C                   IF        @PEERR>='0' AND PA0S001<>*BLANKS                                 
     C                             AND PA0S001<>'0'                                                 
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      WRK40=*ON                                                        
     C                   EVAL      MSGER='ASG1003'                                                  
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TPA0CHK                                            
                                                                                                    
     C                   EVAL      @PEFMT=*BLANKS                                                   
     C                   EVAL      @PEFLD=*BLANKS                                                   
     C                   EVAL      @PEOPT=*BLANKS                                                   
     C                   EVAL      @PEOPT=PA0SBAJ                                                   
     C                   EVAL      @PEFLD='SINO'                                                    
     C                   CALL      'MMPROM'                                     Query-Aut-F4   X    
     C                   PARM                    @PEOPT                         PARM Qry-F4         
     C                   PARM      *BLANKS       @PEPGM                         PARM Qry-F4         
     C                   PARM                    @PEFMT                         PARM Qry-F4         
     C                   PARM                    @PEFLD                         PARM Qry-F4         
     C                   PARM      'V'           @PEERR                         PARM Qry-F4         
                                                                                                    
     C                   IF        @PEERR>='0'                                                      
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      WRK42=*ON                                                        
     C                   EVAL      MSGER='ASG1003'                                                  
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TPA0CHK                                            
     C     TPA0CHK       TAG                                                                        
     C                   IF        ERRGRL=*ON                                                       
     C                   EVAL      ZXOPT2='DSP'                                                     
     C                   ENDIF                                                                      
                                                                                                    
     C     PA0CHKT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA ACTUALITZACIO PANTALLA PA0                        *                               
      *------------------------------------------------------------*                                
     C     PA0UPD        BEGSR                                                                      
      * Actualización datos de PMSETUP                                                              
     C                   DOU       LCKRCD=*OFF                                                      
     C     KMSSETP       CHAIN     PMSETP                             8180                          
     C                   ENDDO                                                                      
     C                   CLEAR                   PIDATR                                             
     C                   EXSR      CS_MOVPF                                                         
     C     DO0010        CAT       PIDATR:0      PIDATR                                             
     C                   EVAL      PIDAT8=ZZDATS                                                    
     C                   TIME                    PIHORA                                             
     C                   EVAL      PIPANT=SDSJOB                                                    
     C                   EVAL      PIUSUA=SDSUSR                                                    
                                                                                                    
     C                   IF        CHAIN=*OFF                                                       
     C                   UPDATE    RPMSETP                                                          
     C                   ELSE                                                                       
     C                   EVAL      PIDAT1=PIDAT8                                                    
     C                   WRITE     RPMSETP                                                          
     C                   ENDIF                                                                      
                                                                                                    
     C                   EVAL      ZXOPT='S01CLR'                                                   
     C                   EVAL      ZXFMT='0'                                                        
                                                                                                    
     C* Limpieza de parametros de subarchivo                                                        
     C****               EVAL      ZXCOUNT=1                                                        
     C                   EVAL      ACCREF=*ON                                                       
     C                   EXSR      CS_CLRK                                                          
                                                                                                    
     C                   SELECT                                                                     
     C                   WHEN      PA0S001=' ' OR PA0S001='0'                                       
     C                   EVAL      ZXOPT='S01CLR'                                                   
     C                   WHEN      PA0S001='1'                                                      
     C                   EVAL      ZXOPT='S01CLR'                                                   
     C                   ENDSL                                                                      
                                                                                                    
     C                   EVAL      ERRGRL=*ON                                                       
     C     PA0UPDT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA CONTROL DEL SFL S01                              *                                
      *------------------------------------------------------------*                                
     C     S01MAIN       BEGSR                                                                      
     C                   DOW       ZXOPT1='S01'                                                     
     C     ZXOPT2        CASEQ     'CLR'         S01CLR                                             
     C     ZXOPT2        CASEQ     'INZ'         S01INZ                                             
     C     ZXOPT2        CASEQ     'DSP'         S01DSP                                             
     C     ZXOPT2        CASEQ     'CMD'         S01CMD                                             
     C     ZXOPT2        CASEQ     'CHK'         S01CHK                                             
     C                   ENDCS                                                                      
     C                   ENDDO                                                                      
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA DE NETEJA DEL SFL                                *                                
      *------------------------------------------------------------*                                
     C     S01CLR        BEGSR                                                                      
     C                   EVAL      ZXOPT='S01INZ'                                                   
     C                   EVAL      CCCFMT='1'                                                       
     C                   MOVEA     ZXZERO10      *IN(90)                                            
     C                   EVAL      INPOS01=*ON                                                      
     C                   EXSR      CS_SFLCLR                                                        
     C                   MOVEL     ZZCIAS        T3CIAS                                             
     C     KEDPARM       SETLL     EDPARM                                                           
     C     S01CLRT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA INICIALITZACIÓ I CARREGA DEL SFL                 *                                
      *------------------------------------------------------------*                                
     C     S01INZ        BEGSR                                                                      
     C                   EVAL      ZXOPT2='DSP'                                                     
     C                   EXSR      CS_SFLIN1                                                        
      *                                                                                             
     C                   DOW       ZXLOP00 < ZXLIPAG                                                
     C     KEDPARM0      READE(N)  EDPARM                                 82                        
     C                   IF        EOF=*ON                                                          
     C                   LEAVE                                                                      
     C                   ENDIF                                                                      
     C                   EXSR      CS_SELSFL                                                        
     C                   IF        ZXSELSFL=1                                                       
     C                   GOTO      TNEXRE01                                                         
     C                   ENDIF                                                                      
      *                                                                                             
     C                   EVAL      ZXNRR00=ZXNRR00 + 1                                              
     C                   EVAL      ZXLOP00=ZXLOP00 + 1                                              
     C                   EXSR      CS_MOVFP                                                         
     C                   EXSR      CS_SAVFK                                                         
     C                   WRITE     SUFD                                                             
     C     TNEXRE01      TAG                                                                        
     C                   ENDDO                                                                      
      *                                                                                             
     C                   EXSR      CS_SFLIN2                                                        
     C     S01INZT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VISUALITZACIÓ SFL                                *                                
      *------------------------------------------------------------*                                
     C     S01DSP        BEGSR                                                                      
     C                   EVAL      ZXOPT2='CMD'                                                     
     C                   EVAL      PPPCMD1='CMD3004'                                                
     C                   EVAL      SUFHED1='HDO0010'                                                
     C                   EXSR      CS_SFLDSP                                    SI REGS             
     C     S01DSPT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VALIDACIÓ DELS CMD'S                             *                                
      *------------------------------------------------------------*                                
     C     S01CMD        BEGSR                                                                      
     C                   EVAL      ZXOPT2='CHK'                                                     
     C                   EXSR      CS_SFLCMD                                                        
     C     S01CMDT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VALIDACIÓ DEL SFL: FORMAT SFL I OPCIONS          *                                
      *------------------------------------------------------------*                                
     C     S01CHK        BEGSR                                                                      
     C                   EVAL      ZXOPT2='DSP'                                                     
      * SUBRUTINA COMÚ DE VALIDACIÓ DEL SFL                                                         
     C                   EXSR      CS_SFLCHK                                                        
     C     S01CHKT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VALIDACIÓ DELS CMD'S                             *                                
      *------------------------------------------------------------*                                
     C     CS_SECCMD     BEGSR                                                                      
      * Validacion clase de subarchivo                                                              
     C                   EVAL      @PEFLD=*BLANKS                                                   
     C                   EVAL      @PEOPT=*BLANKS                                                   
     C                   EVAL      @PEFMT=*BLANKS                                                   
     C                   EVAL      @PEFLD='OPCI'                                                    
     C                   EVAL      @PEPGM=*BLANKS                                                   
     C                   EVAL      @PEPGM=SDSPGM                                                    
     C                   IF        CREATE=*ON                                                       
     C                   EVAL      @PEOPT='1 '                                                      
     C                   ENDIF                                                                      
     C                   EXSR      CS_SECMDOP                                                       
     C     ERRGRL        CABEQ     *ON           SECCMDT                                            
     C     SECCMDT       ENDSR                                                                      
      **************************************************************                                
      * COMMON SUBRUTINE (CS_) :                                  *                                 
      * SUBRUTINA DE NETEJA DEL SFL                                *                                
      *------------------------------------------------------------*                                
     C     CS_SFLCLR     BEGSR                                                                      
     C                   EVAL      SFLDSP=*OFF                                                      
     C                   EVAL      SFLCTL=*OFF                                                      
     C                   EVAL      SFLCLR=*ON                                                       
     C                   WRITE     SUFC                                                             
     C                   EVAL      SFLDSP=*ON                                                       
     C                   EVAL      SFLCTL=*ON                                                       
     C                   EVAL      SFLCLR=*OFF                                                      
     C                   CLEAR                   SUFRCDN                        SFLRCDNBR           
     C                   RESET                   ZXNRR00                        ULT.NRR             
     C                   RESET                   ZXNNN00                        ULT.NRR             
     C                   EVAL      ZXFMT=CCCFMT                                                     
      * Inicialitza la variable que indica inici de carrega de subarxiu                             
     C                   EVAL      ZXCOMCAR=0                                                       
     C                   MOVEA     ZXZERO10      *IN(40)                                            
     C                   MOVEA     ZXZERO10      *IN(50)                                            
     C     SFLCLRT       ENDSR                                                                      
      **************************************************************                                
      * COMMON SUBRUTINE (CS_) :                                  *                                 
      * SUBRUTINA INICIALITZACIÓ DEL SFL (1º PART)                 *                                
      *------------------------------------------------------------*                                
     C     CS_SFLIN1     BEGSR                                                                      
     C                   RESET                   ZXLOP00                                            
     C                   RESET                   ZXLIPAG                                            
     C                   CLEAR                   PSUDLGA                                            
     C                   EVAL      ZXNRR00=ZXNNN00                                                  
     C                   IF        ACCREF=*ON                                                       
     C                   RESET                   ZXNRR00                                            
     C     ZXCOUNT       DIV       ZXLIPAG       ZXNUPAG                                            
     C                   MVR                     ZXRESTO                                            
     C                   IF        ZXRESTO>0 OR ZXNUPAG=0                                           
     C                   EVAL      ZXNUPAG=ZXNUPAG+1                                                
     C                   ENDIF                                                                      
     C                   EVAL      ZXLIPAG=ZXNUPAG*ZXLIPAG                                          
     C                   ENDIF                                                                      
     C                   RESET                   ZXNNN00                        ULT.NRR             
     C                   EVAL      SFLEND=*OFF                                                      
     C                   EVAL      EOF=*OFF                                                         
     C     SFLIN1T       ENDSR                                                                      
      **************************************************************                                
      * COMMON SUBRUTINE (CS_) :                                  *                                 
      * SUBRUTINA DE MOURE CAMPS                                   *                                
      *------------------------------------------------------------*                                
     C     CS_MOVFP      BEGSR                                                                      
     C                   EVAL      SUFDATA=*BLANKS                                                  
      *                                                                                             
     C                   SELECT                                                                     
     C                   WHEN      ZXOPT1='S01'                                                     
     C                   EVAL      SUFOPCI=*BLANKS                                                  
     C                   EVAL      SFLNXC=*OFF                                                      
     C                   EXSR      S01MFP                                                           
      *                                                                                             
     C                   WHEN      ZXOPT1='PA0'                                                     
     C                   EVAL      PA0S001=MÑS001                                                   
     C                   EVAL      PA0SBAJ=MÑSBAJ                                                   
      *                                                                                             
     C                   ENDSL                                                                      
      *                                                                                             
     C                   ENDSR                                                                      
      **************************************************************                                
      * COMMON SUBRUTINE (CS_) :                                  *                                 
      * SUBRUTINA DE MOURE CAMPS a FICHERO                         *                                
      *------------------------------------------------------------*                                
     C     CS_MOVPF      BEGSR                                                                      
     C                   EVAL      SUFDATA=*BLANKS                                                  
      *                                                                                             
     C                   SELECT                                                                     
     C                   WHEN      ZXOPT1='PA0'                                                     
     C                   EVAL      MÑSBAJ=PA0SBAJ                                                   
     C                   EVAL      MÑS001=PA0S001                                                   
     C                   ENDSL                                                                      
      *                                                                                             
     C                   ENDSR                                                                      
      **************************************************************                                
      * COMMON SUBRUTINE (CS_) :                                  *                                 
      * GUARDO LA CLAU DE POSICIONAMENT DEL PRIMER REGISTRE DESPRES*                                
      * DE LA NETEJA DEL SUBARXIU                                  *                                
      *------------------------------------------------------------*                                
     C     CS_SAVFK      BEGSR                                                                      
     C                   IF        ZXCOMCAR=0                                                       
      *                                                                                             
     C                   EVAL      ZXCIAS_1=T3CIAS                                                  
     C                   EVAL      ZXDLGA_1=T3DLGA                                                  
     C                   EVAL      ZXCOMCAR=1                                                       
      *                                                                                             
     C                   ENDIF                                                                      
     C     CS_SAVFKT     ENDSR                                                                      
      **************************************************************                                
      * COMMON SUBRUTINE (CS_) :                                  *                                 
      * SUBRUTINA INICIALITZACIÓ DEL SFL  (2ª PART)                *                                
      *------------------------------------------------------------*                                
     C     CS_SFLIN2     BEGSR                                                                      
     C                   EVAL      ZXNNN00=ZXNRR00                                                  
     C                   EVAL      SUFRCDN=ZXNRR00                                                  
     C                   EVAL      ACCREF=*ON                                   SFLRCDNBR           
     C                   IF        EOF=*ON                                                          
     C                   EVAL      SFLEND=*ON                                                       
     C                   ENDIF                                                                      
      *                                                                                             
     C                   IF        ZXNRR00=0                                                        
     C                   EVAL      CSRFILA=0                                                        
     C                   EVAL      CSRCOLU=0                                                        
     C                   EVAL      SFLDSP=*OFF                                                      
     C                   ELSE                                                                       
     C                   EVAL      SFLDSP=*ON                                                       
     C                   ENDIF                                                                      
      *                                                                                             
     C                   IF        ZXCOUNT>ZXNNN00                                                  
     C                   EVAL      CSRFILA=0                                                        
     C                   EVAL      CSRCOLU=0                                                        
     C                   ENDIF                                                                      
     C     SFLIN2T       ENDSR                                                                      
      **************************************************************                                
      * COMMON SUBRUTINE (CS_) :                                  *                                 
      * SUBRUTINA VALIDACIÓ DELS CMD'S                             *                                
      *------------------------------------------------------------*                                
     C     CS_SFLCMD     BEGSR                                                                      
     C                   IF        VLDCMDKEY=*OFF                                                   
     C                   GOTO      SFLCMDT                                                          
     C                   ENDIF                                                                      
     C                   EVAL      ACCREF=*ON                                                       
     C                   EXSR      CS_SECCMD                                                        
     C     ERRGRL        CABEQ     *ON           SFLCMDT                                            
     C                   SELECT                                                                     
      * F03=SORTIR DEL PROGRAMA                                                                     
     C                   WHEN      EXIT=*ON                                                         
     C                   EVAL      ZXOPT1='END'                                                     
      * F04=AJUDA DE PANTALLA                                                                       
     C                   WHEN      HELP=*ON                                                         
     C                   EVAL      ZXOPT2='DSP'                                                     
     C                   EXSR      CS_POSCUR                                                        
     C                   EVAL      ACCREF=*OFF                                                      
     C                   EVAL      @PEFLD=*BLANKS                                                   
     C                   EVAL      @PEFMT=RECORD                                                    
     C                   EVAL      @PEFLD=FIELD                                                     
      *                                                                                             
     C                   IF        FIELD='CCCFMT'                                                   
     C                   EVAL      @PEFMT=*BLANKS                                                   
     C                   EVAL      @PEFLD=*BLANKS                                                   
     C                   EVAL      @PEFLD='CFMT'                                                    
     C                   ENDIF                                                                      
     C                   IF        FIELD='SUFOPCI'                                                  
     C                   EVAL      @PEFMT=*BLANKS                                                   
     C                   EVAL      @PEFLD=*BLANKS                                                   
     C                   EVAL      @PEFLD='OPCI'                                                    
     C                   ENDIF                                                                      
     C                   CALL      'MMPROM'                                     Query-Aut-F4   X    
     C                   PARM      *BLANKS       @PEOPT                         PARM Qry-F4         
     C                   PARM      SDSPGM        @PEPGM                         PARM Qry-F4         
     C                   PARM                    @PEFMT                         PARM Qry-F4         
     C                   PARM                    @PEFLD                         PARM Qry-F4         
     C                   PARM      *BLANKS       @PEERR                         PARM Qry-F4         
      * Si el dato no tiene soporte F4 avisamos                                                     
     C                   IF        @PEERR>'0'                                                       
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      WRk40=*ON                                                        
     C                   EVAL      MSGER='ADP0304'                                                  
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           HELPT                                              
      * Si no han realizado ninguna selección no tocamos nada                                       
     C                   IF        @PEERR='A'                                                       
     C                   EVAL      ERRGRL=*ON                                                       
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           HELPT                                              
     C                   IF        FIELD='CCCFMT'                                                   
     C*****              EVAL      ERRGRL=*ON                                                       
     C                   EVAL      CCCFMT=@PEOPT                                                    
     C                   ENDIF                                                                      
     C                   IF        FIELD='SUFOPCI'                                                  
      *                  EXSR      CS_POSCUR                                                        
     C                   EVAL      ZXNRR00=SFLPOS1+CSRFILA-9                                        
     C     ZXNRR00       CHAIN     SUFD                               81                            
     C                   IF        CHAIN=*OFF                                                       
     C                   EVAL      SUFOPCI=@PEOPT                                                   
     C                   EVAL      SFLNXC=*ON                                                       
     C                   UPDATE    SUFD                                                             
     C                   EVAL      ERRGRL=*ON                                                       
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
     C     HELPT         TAG                                                                        
     C     ERRGRL        CABEQ     *ON           SFLCMDT                                            
     C                   EXSR      CS_CLRK                                                          
     C                   IF        ZXFMT<>CCCFMT                                                    
     C                   EVAL      ACCREF=*ON                                                       
     C                   EVAL      ZXCOUNT=1                                                        
     C     CCCFMT        CASEQ     ' '           S01CLR                                             
     C     CCCFMT        CASEQ     '0'           S01CLR                                             
     C     CCCFMT        CASEQ     '1'           S01CLR                                             
     C                   CAS                     S01CLR                                             
     C                   ENDCS                                                                      
     C                   ENDIF                                                                      
      * F05=REFRESCAR PANTALLA                                                                      
     C                   WHEN      REFRES=*ON                                                       
     C                   EXSR      CS_RSTFK                                                         
     C                   EVAL      ZXOPT2='CLR'                                                     
      * F06=CREAR REGISTRE                                                                          
     C                   WHEN      CREATE=*ON                                                       
     C                   EVAL      @PEOPT='1 '                                                      
     C                   CALL      'ED0053'                                                         
     C                   PARM      ZZCIAS        @PECIAS                                            
     C                   PARM      *BLANKS       @PEDLGA                                            
     C                   PARM      '1 '          @PEOPT                                             
     C                   PARM      *BLANKS       @PEERR                                             
     C                   EXSR      CS_RSTFK                                                         
     C                   EVAL      ZXOPT2='CLR'                                                     
      * F13=SETUP DEL PROGRAMA                                                                      
     C                   WHEN      SETUP=*ON                                                        
     C                   EVAL      ZXOPT='PA0CLR'                                                   
     C                   EVAL      ZXCOUNT=SFLPOS1                                                  
      * F09=LINEA DE MANDATO                                                                        
     C                   WHEN      *IN09=*ON                                                        
     C                   EVAL      ZXOPT2='DSP'                                                     
     C                   CALL      'QCMD'                                                           
      * PAGINAR                                                                                     
     C                   WHEN      ROLLUP=*ON                                                       
     C                   EVAL      ACCREF=*OFF                                                      
     C                   EVAL      ZXOPT2='INZ'                                                     
     C                   EVAL      CSRFILA=0                                                        
     C                   EVAL      CSRCOLU=0                                                        
      * PAGINAR                                                                                     
     C                   WHEN      ROLLDOWN=*ON                                                     
     C                   EVAL      ZXSEMF=*BLANKS                                                   
     C                   EXSR      CS_RSTFK                                                         
     C                   EXSR      CS_ROLLDOWN                                                      
     C                   EVAL      ACCREF=*OFF                                                      
     C                   EVAL      ZXOPT2='CLR'                                                     
     C                   EVAL      CSRFILA=0                                                        
     C                   EVAL      CSRCOLU=0                                                        
     C                   ENDSL                                                                      
      *                                                                                             
     C     SFLCMDT       TAG                                                                        
     C                   IF        ERRGRL=*ON AND ACCREF=*ON                                        
     C                   EVAL      ACCREF=*OFF                                                      
     C                   ENDIF                                                                      
      *                                                                                             
     C                   ENDSR                                                                      
      **************************************************************                                
      * COMMON SUBRUTINE (CS_) :                                  *                                 
      * SUBRUTINA VALIDACIÓ DEL SFL: FORMAT SFL I OPCIONS          *                                
      *------------------------------------------------------------*                                
     C     CS_SFLCHK     BEGSR                                                                      
     C                   EVAL      ACCREF=*ON                                                       
     C                   SELECT                                                                     
      * Validación del posicionamiento de cabecera                                                  
     C                   WHEN      PSUDLGA <> *BLANKS                                               
     C                   EVAL      ERRGRL=*OFF                                                      
     C                   EVAL      CSRCOLU=0                                                        
     C                   EVAL      CSRFILA=0                                                        
     C                   EVAL      ZXCOUNT=1                                                        
     C                   EXSR      CS_CLRK                                                          
     C                   MOVEL     ZZCIAS        T3CIAS                                             
     C                   EVAL      T3DLGA=PSUDLGA                                                   
     C                   EVAL      ZXOPT2='CLR'                                                     
      *                                                                                             
      * Validacion clase de subarchivo (FORMAT DE LA PANTALLA)                                      
     C                   WHEN      ZXFMT<>CCCFMT                                                    
     C                   EVAL      @PEFLD=*BLANKS                                                   
     C                   EVAL      @PEOPT=*BLANKS                                                   
     C                   EVAL      @PEFMT=*BLANKS                                                   
     C                   EVAL      @PEFLD='CFMT'                                                    
     C                   EVAL      @PEOPT=CCCFMT                                                    
     C                   CALL      'MMPROM'                                     Query-Aut-F4   X    
     C                   PARM                    @PEOPT                         PARM Qry-F4         
     C                   PARM      SDSPGM        @PEPGM                         PARM Qry-F4         
     C                   PARM                    @PEFMT                         PARM Qry-F4         
     C                   PARM                    @PEFLD                         PARM Qry-F4         
     C                   PARM      'V'           @PEERR                         PARM Qry-F4         
      *                                                                                             
     C                   IF        @PEERR>'0'                                                       
     C                   EVAL      ZXFMT=CCCFMT                                                     
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      WRk40=*ON                                                        
     C                   EVAL      MSGER='ASV1003'                                                  
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           SFLCHKT                                            
      * Si el subarchivo es valido continuo                                                         
     C                   EVAL      ZXCOUNT=1                                                        
     C                   EVAL      ZXOPT1='S01'                                                     
     C                   EVAL      ZXOPT2='CLR'                                                     
     C                   IF        CCCFMT=' ' OR CCCFMT='0'                                         
     C                   EXSR      CS_CLRK                                                          
     C                   EVAL      ZXOPT1='S01'                                                     
     C                   ENDIF                                                                      
      *                                                                                             
     C                   IF        CCCFMT='1'                                                       
     C                   EXSR      CS_CLRK                                                          
     C                   EVAL      ZXOPT1='S01'                                                     
     C                   ENDIF                                                                      
      *                                                                                             
     C                   OTHER                                                                      
     C                   EXSR      CS_CHKOPT                                                        
     C     ERRGRL        CABEQ     *ON           SFLCHKT                                            
     C                   ENDSL                                                                      
      *                                                                                             
     C     SFLCHKT       TAG                                                                        
     C                   IF        ERRGRL=*ON AND ACCREF=*ON                                        
     C                   EVAL      ACCREF=*OFF                                                      
     C                   ENDIF                                                                      
      *                                                                                             
     C                   ENDSR                                                                      
      **************************************************************                                
      * COMMON SUBRUTINE (CS_) :                                  *                                 
      * SUBRUTINA DE 1er REGISTRE DE PANTALLA DE SUBARXIUS         *                                
      *------------------------------------------------------------*                                
     C     CS_RSTFK      BEGSR                                                                      
     C                   EVAL      T3CIAS=ZXCIAS_1                                                  
     C                   EVAL      T3DLGA=ZXDLGA_1                                                  
     C     RSTFKT        ENDSR                                                                      
      **************************************************************                                
      * COMMON SUBRUTINE (CS_) :                                  *                                 
      * SUBRUTINA DE NETEJA DE CAMPS DE POSIBLES CLAUS             *                                
      *------------------------------------------------------------*                                
     C     CS_CLRK       BEGSR                                                                      
     C                   CLEAR                   T3CIAS                                             
     C                   CLEAR                   T3DLGA                                             
     C     CLRKT         ENDSR                                                                      
      **************************************************************                                
      * COMMON SUBRUTINE (CS_) :                                  *                                 
      * SUBRUTINA DE TRATAMIENTO DE OPCIONES EN SUBARCHIVO         *                                
      *------------------------------------------------------------*                                
     C     CS_CHKOPT     BEGSR                                                                      
      * Validacion clase de subarchivo                                                              
     C                   EVAL      @PEFLD=*BLANKS                                                   
     C                   EVAL      @PEOPT=*BLANKS                                                   
     C                   EVAL      @PEFMT=*BLANKS                                                   
     C                   EVAL      @PEFLD='CFMT'                                                    
     C                   EVAL      @PEOPT=CCCFMT                                                    
     C                   CALL      'MMPROM'                                     Query-Aut-F4   X    
     C                   PARM                    @PEOPT                         PARM Qry-F4         
     C                   PARM      SDSPGM        @PEPGM                         PARM Qry-F4         
     C                   PARM                    @PEFMT                         PARM Qry-F4         
     C                   PARM                    @PEFLD                         PARM Qry-F4         
     C                   PARM      'V'           @PEERR                         PARM Qry-F4         
      *                                                                                             
     C                   IF        @PEERR>'0'                                                       
     C                   EVAL      ZXFMT=CCCFMT                                                     
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      WRk40=*ON                                                        
     C                   EVAL      MSGER='ASV1003'                                                  
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           CHKOPTT                                            
      *                                                                                             
      * VALIDACIO DE LES OPCIONS DE DETALL DEL SFL                                                  
      *                                                                                             
     C                   EVAL      ACCREF=*OFF                                                      
     C                   EVAL      EOF=*OFF                                                         
     C                   IF        SFLDSP=*ON                                                       
      *                                                                                             
     C                   DO        *HIVAL                                                           
     C                   READC     SUFD                                   82                        
     C                   IF        EOF=*ON                                                          
     C                   LEAVE                                                                      
     C                   ENDIF                                                                      
     C                   EVAL      ACCREF=*ON                                                       
     C****               EXSR      CS_RSTFK                                                         
     C                   EVAL      ZXOPT2='CLR'                                                     
      * Validacion opciones de subarchivo                                                           
     C                   EVAL      SFLNXC=*OFF                                                      
     C                   IF        SUFOPCI=*BLANKS                                                  
     C                   GOTO      TNEXOPC                                                          
     C                   ELSE                                                                       
     C                   EVAL      ZXCOUNT=ZXNRR00                                                  
     C                   ENDIF                                                                      
     C                   EVAL      @PEFLD=*BLANKS                                                   
     C                   EVAL      @PEFMT=*BLANKS                                                   
     C                   EVAL      @PEFLD='OPCI'                                                    
     C                   EVAL      @PEOPT=SUFOPCI                                                   
     C                   EVAL      @PEPGM=SDSPGM                                                    
     C                   EXSR      CS_SECMDOP                                                       
     C                   IF        ERRGRL=*ON                                                       
     C                   EVAL      WRK41=*ON                                                        
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TNEXOPC                                            
      *                                                                                             
     C                   EVAL      T3CIAS=SUFCIAS                                                   
     C                   EVAL      T3DLGA=SUFDLGA                                                   
     C     KEDPARM       CHAIN(N)  EDPARM                             81                            
     C                   IF        CHAIN=*ON                                                        
FQ798C                             OR (SUFBAJA='*' AND (                                            
FQ798C                                @PEOPT=' 2' OR @PEOPT='2 '                MODIFICAR           
FQ798C                             OR @PEOPT=' 3' OR @PEOPT='3 '                MODIFICAR           
FQ798C                             OR @PEOPT=' 4' OR @PEOPT='4 '))              MODIFICAR           
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      WRK41=*ON                                                        
     C                   EVAL      SFLNXC=*ON                                                       
     C                   EVAL      MSGER='MSG0064'                                                  
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TNEXOPC                                            
      *                                                                                             
     C                   SELECT                                                                     
      *                                                                                             
     C                   WHEN      @PEOPT='FD'                                  MODIFICAR           
     C                   CALL      'ED0053'                                                         
     C                   PARM      SUFCIAS       @PECIAS                                            
     C                   PARM      SUFDLGA       @PEDLGA                                            
     C                   PARM      SUFOPCI       @PEOPT                                             
     C                   PARM      *BLANKS       @PEERR                                             
     C                   EVAL      SUFOPCI=*BLANKS                                                  
     C                   EVAL      SFLNXC=*OFF                                                      
      *                                                                                             
     C                   WHEN      @PEOPT=' 2' OR @PEOPT='2 '                   MODIFICAR           
     C                             OR @PEOPT=' 3' OR @PEOPT='3 '                MODIFICAR           
     C                             OR @PEOPT=' 4' OR @PEOPT='4 '                MODIFICAR           
     C                             OR @PEOPT=' 5' OR @PEOPT='5 '                MODIFICAR           
     C                   CALL      'DO0053'                                                         
     C                   PARM      SUFCIAS       @PECIAS                                            
     C                   PARM      SUFDLGA       @PEDLGA                                            
     C                   PARM      SUFOPCI       @PEOPT                                             
     C                   PARM      *BLANKS       @PEERR                                             
     C                   EVAL      SUFOPCI=*BLANKS                                                  
     C                   EVAL      SFLNXC=*OFF                                                      
      * PRIORIDAD POR ALMACEN                                                                       
     C                   WHEN      @PEOPT='15'                                  MODIFICAR           
     C                   CALL      'DO0020'                                                         
     C                   PARM      SUFCIAS       @PECIAS                                            
     C                   PARM      SUFDLGA       @PEDLGA                                            
     C                   PARM      0             @PEPRIO                                            
     C                   PARM      *BLANKS       @PEPRVR                                            
     C                   PARM      *BLANKS       @PEARVT                                            
     C                   PARM      *BLANKS       @PEFAMT                                            
     C                   PARM      '0'           @PETREG                                            
     C                   PARM      ZZCIAS        @PECIA2                                            
     C                   PARM      *BLANKS       @PEMAGA                                            
     C                   PARM      SUFOPCI       @PEOPT                                             
     C                   PARM      *BLANKS       @PEERR                                             
     C                   EVAL      SUFOPCI=*BLANKS                                                  
     C                   EVAL      SFLNXC=*OFF                                                      
      * EXCEPCIÓN PROVEEDOR                                                                         
     C                   WHEN      @PEOPT='17'                                  MODIFICAR           
     C                   CALL      'DO0030'                                                         
     C                   PARM      SUFCIAS       @PECIAS                                            
     C                   PARM      SUFDLGA       @PEDLGA                                            
     C                   PARM      'B'           @PETREG                                            
     C                   PARM      SUFOPCI       @PEOPT                                             
     C                   PARM      *BLANKS       @PEERR                                             
     C                   EVAL      SUFOPCI=*BLANKS                                                  
     C                   EVAL      SFLNXC=*OFF                                                      
      * EXCEPCIÓN ARTICULO                                                                          
     C                   WHEN      @PEOPT='18'                                  MODIFICAR           
     C                   CALL      'DO0030'                                                         
     C                   PARM      SUFCIAS       @PECIAS                                            
     C                   PARM      SUFDLGA       @PEDLGA                                            
     C                   PARM      'C'           @PETREG                                            
     C                   PARM      SUFOPCI       @PEOPT                                             
     C                   PARM      *BLANKS       @PEERR                                             
     C                   EVAL      SUFOPCI=*BLANKS                                                  
     C                   EVAL      SFLNXC=*OFF                                                      
      * EXCEPCIÓN FAMILIA                                                                           
F-2OLC*                  WHEN      @PEOPT='19'                                  MODIFICAR           
F-2OLC*                  CALL      'DO0030'                                                         
F-2OLC*                  PARM      SUFCIAS       @PECIAS                                            
F-2OLC*                  PARM      SUFDLGA       @PEDLGA                                            
F-2OLC*                  PARM      'D'           @PETREG                                            
F-2OLC*                  PARM      SUFOPCI       @PEOPT                                             
F-2OLC*                  PARM      *BLANKS       @PEERR                                             
F-2OLC*                  EVAL      SUFOPCI=*BLANKS                                                  
F-2OLC*                  EVAL      SFLNXC=*OFF                                                      
FGI25 *                                                                                             
FGI25 * New Exception MTO/MTS                                                                       
FGI25c                   when      @PEOPT='19'                                  MODIFICAR           
FGI25c                   call      'DO0030'                                                         
FGI25c                   parm      SUFCIAS       @PECIAS                                            
FGI25c                   parm      SUFDLGA       @PEDLGA                                            
FGI25c                   parm      'M'           @PETREG                                            
FGI25c                   parm      SUFOPCI       @PEOPT                                             
FGI25c                   parm      *blanks       @PEERR                                             
FGI25c                   eval      SUFOPCI=*blanks                                                  
FGI25c                   eval      SFLNXC=*off                                                      
      * EXCEPCIÓN FAMILIA/SUBFAMILIA                                                                
     C                   WHEN      @PEOPT='20'                                  MODIFICAR           
     C                   CALL      'DO0042'                                                         
     C                   PARM      SUFCIAS       @PECIAS                                            
     C                   PARM      SUFDLGA       @PEDLGA                                            
     C*                  PARM      'E'           @PETREG                                            
     C*                  PARM      SUFOPCI       @PEOPT                                             
     C*                  PARM      *BLANKS       @PEERR                                             
     C                   EVAL      SUFOPCI=*BLANKS                                                  
     C                   EVAL      SFLNXC=*OFF                                                      
      * EXCEPCIÓN FAMILIA TARIFA                                                                    
F-2OLC*                  WHEN      @PEOPT='21'                                  MODIFICAR           
F-2OLC*                  CALL      'DO0030'                                                         
F-2OLC*                  PARM      SUFCIAS       @PECIAS                                            
F-2OLC*                  PARM      SUFDLGA       @PEDLGA                                            
F-2OLC*                  PARM      'F'           @PETREG                                            
F-2OLC*                  PARM      SUFOPCI       @PEOPT                                             
F-2OLC*                  PARM      *BLANKS       @PEERR                                             
F-2OLC*                  EVAL      SUFOPCI=*BLANKS                                                  
F-2OLC*                  EVAL      SFLNXC=*OFF                                                      
      * EXCEPCIÓN CLIENTE                                                                           
     C                   WHEN      @PEOPT='22'                                  MODIFICAR           
     C                   CALL      'DO0030'                                                         
     C                   PARM      SUFCIAS       @PECIAS                                            
     C                   PARM      SUFDLGA       @PEDLGA                                            
     C                   PARM      'G'           @PETREG                                            
     C                   PARM      SUFOPCI       @PEOPT                                             
     C                   PARM      *BLANKS       @PEERR                                             
     C                   EVAL      SUFOPCI=*BLANKS                                                  
     C                   EVAL      SFLNXC=*OFF                                                      
      * EXCEPCIÓN PROCEDENCIA DE PEDIDO                                                             
     C                   WHEN      @PEOPT='16'                                  MODIFICAR           
     C                   CALL      'DO0030'                                                         
     C                   PARM      SUFCIAS       @PECIAS                                            
     C                   PARM      SUFDLGA       @PEDLGA                                            
     C                   PARM      'H'           @PETREG                                            
     C                   PARM      SUFOPCI       @PEOPT                                             
     C                   PARM      *BLANKS       @PEERR                                             
     C                   EVAL      SUFOPCI=*BLANKS                                                  
     C                   EVAL      SFLNXC=*OFF                                                      
      *                                                                                             
     C                   ENDSL                                                                      
      *                                                                                             
     C     TNEXOPC       TAG                                                                        
     C                   UPDATE    SUFD                                                             
     C                   IF        ERRGRL=*ON                                                       
     C                   EVAL      ZXOPT2='DSP'                                                     
     C                   EVAL      ZXCOUNT=ZXNRR00                                                  
     C                   EXSR      CS_POSCER0                                                       
     C                   LEAVE                                                                      
     C                   ENDIF                                                                      
     C                   ENDDO                                                                      
      * Si existen errores entonces mantengo la posicion del primer error                           
      * y muestro pantalla                                                                          
     C                   ENDIF                                                                      
                                                                                                    
     C                   IF        ERRGRL=*OFF                                                      
     C                   EXSR      CS_RSTFK                                                         
     C                   EXSR      CS_POSCER0                                                       
     C                   ENDIF                                                                      
     C     CHKOPTT       ENDSR                                                                      
      **************************************************************                                
      * COMMON SUBRUTINE (CS_) :                                  *                                 
      * SUBRUTINA DE POSICIONAMENT DEL CURSOR                      *                                
      *------------------------------------------------------------*                                
     C     CS_POSCUR     BEGSR                                                                      
     C* Línea de subarchivo donde se encuentra el cursor                                            
     C     SFLPOCUR      DIV       256           CSRFILA                                            
     C                   MVR                     CSRCOLU                                            
     C                   ENDSR                                                                      
      **************************************************************                                
      * COMMON SUBRUTINE (CS_) :                                  *                                 
      * SUBRUTINA DE POSICIONAMENT DEL CURSOR                      *                                
      *------------------------------------------------------------*                                
     C     CS_POSCER0    BEGSR                                                                      
     C* Línea de subarchivo donde se posiciona cursor si error en opción                            
     C                   IF        ZXLIPAG<>0                                                       
     C     ZXCOUNT       DIV       ZXLIPA2       ZXAU15                                             
     C                   MVR                     CSRFILA                                            
     C                   IF        CSRFILA=0 AND ZXAU15>0                                           
     C                   EVAL      CSRFILA=ZXLIPA2                                                  
     C                   ENDIF                                                                      
     C                   EVAL      CSRFILA=CSRFILA+9-1                                              
     C                   ENDIF                                                                      
     C                   EVAL      CSRCOLU=4                                                        
     C                   IF        CSRFILA<=0                                                       
     C                   EVAL      CSRFILA=0                                                        
     C                   EVAL      CSRCOLU=0                                                        
     C                   ENDIF                                                                      
      *                                                                                             
     C                   ENDSR                                                                      
      **************************************************************                                
      * COMMON SUBRUTINE (CS_) :                                  *                                 
      * SUBRUTINA VISUALITZACIÓ SFL                                *                                
      *------------------------------------------------------------*                                
     C     CS_SFLDSP     BEGSR                                                                      
     C                   EVAL      ZXOPT2='CMD'                                                     
      * Posicionament en el subarxiu si no s'ha realitzat cap acció                                 
     C                   IF        ACCREF=*OFF AND SFLDSP=*ON                                       
     C                   EVAL      SUFRCDN=ZXCOUNT                                                  
     C                   ENDIF                                                                      
      *                                                                                             
     C                   CLEAR                   PSUDLGA                                            
     C                   WRITE     SUFP                                         SI REGS             
     C                   EXFMT     SUFC                                                             
     C* Guardem el nº de registre que es visualitza actualment per no                               
     C* canviar de pàgina si no fan res                                                             
     C                   EVAL      ZXCOUNT=SFLPOS1                                                  
     C                   EVAL      ERRGRL=*OFF                                                      
     C                   EVAL      MSGER=*BLANKS                                                    
     C                   MOVEA     ZXZERO10      *IN(40)                                            
     C                   MOVEA     ZXZERO10      *IN(50)                                            
     C     SFLDSPT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA PER MOURE CAMPS AL SFL                           *                                
      *------------------------------------------------------------*                                
     C     S01MFP        BEGSR                                                                      
     C                   EVAL      SUFOPCI=*BLANKS                                                  
     C                   EVAL      SFLNXC=*OFF                                                      
     C                   MOVEL     T3CIAS        S01CIAS                                            
     C                   EVAL      S01DLGA=T3DLGA                                                   
     C                   EVAL      SUFBAJA=' '                                                      
     C                   IF        T3BAJA='1'                                                       
     C                   EVAL      SUFBAJA='*'                                                      
     C                   ENDIF                                                                      
                                                                                                    
     C                   EVAL      P7CIAS=T3CIAS                                                    
     C                   EVAL      P7DLGA=T3DLGA                                                    
     C     KPMEMPR       CHAIN     PMEMPR                             81                            
     C                   EVAL      S01OBSO=T3OBSO                                                   
      * Puntos de Expedición                                                                        
     C                   EVAL      PXALPH = *BLANKS                                                 
     C                   EVAL      PXNUM = T3PEXP                                                   
     C                   CALL      'PRD650'                                                         
     C                   PARM                    PXNUM                          CAMP NUMÈRIC        
     C                   PARM                    PXALPH                         CAMP ALFANUMÈRIC    
     C                   PARM                    PXFLDD                         Nº CARACT. VISUA    
     C                   PARM      0             PXDCCD                         Nº DECIMALS         
     C                   PARM                    PXFMD1                         AJUST DECIMAL (.    
     C                   PARM      '4'           PXEDTC                         CODI EDICIO(4,M,    
     C                   PARM                    PXNMER                         RETORN ERROR        
     C                   PARM                    PXTIPA                         TIPO AJUSTE (0,1    
     C                   MOVE      PXALPH        S01PEXP                                            
      *                                                                                             
     C                   EVAL      S01ADOM=T3ADOM                                                   
     C                                                                                              
     C                   EVAL      T4CIA1=T3CIAS                                                    
     C                   EVAL      T4TREG='H'                                                       
     C                   EVAL      T4DLGA=T3DLGA                                                    
     C     KEDPAR2       CHAIN     EDPAR2                                                           
     C                   IF        %FOUND                                                           
     C                   EVAL      S01EPPE='1'                                                      
     C                   ENDIF                                                                      
      *                                                                                             
     C                   EVAL      S01EPPE=' '                                                      
     C                   EVAL      S01EPRV=' '                                                      
     C                   EVAL      S01EART=' '                                                      
     C                   EVAL      S01EFAM=' '                                                      
     C                   EVAL      S01EFAS=' '                                                      
     C                   EVAL      S01EFAT=' '                                                      
     C                   EVAL      S01ECLI=' '                                                      
     C                   EVAL      S01ADFT=' '                                                      
     C                                                                                              
      *                                                                                             
     C                   EXSR      CS_KEYPF                                                         
     C                   EVAL      SUFDATA=W1DATA                                                   
     C     S01MFPT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA QUE GUARDA LAS CLAVES DE TODOS TIPOS DE SFL      *                                
      *------------------------------------------------------------*                                
     C     CS_KEYPF      BEGSR                                                                      
     C                   EVAL      SUFCIAS=T3CIAS                                                   
     C                   EVAL      SUFDLGA=T3DLGA                                                   
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA QUE SELECCIONA REGISTROS DE SUBARCHIVO           *                                
      *------------------------------------------------------------*                                
     C     CS_SELSFL     BEGSR                                                                      
     C                   EVAL      ZXSELSFL=0                                                       
                                                                                                    
     C**                 IF        MÑSBAJ<='0' AND PPDSAC>'0'                                       
     C**                 EVAL      ZXSELSFL=1                                                       
     C**                 GOTO      SELSFLRT                                                         
     C**                 ENDIF                                                                      
                                                                                                    
     C     SELSFLRT      ENDSR                                                                      
      **************************************************************                                
      * Busca nueva situación del SFL.                             *                                
      *------------------------------------------------------------*                                
     C     CS_ROLLDOWN   BEGSR                                                                      
      *                                                                                             
     C                   RESET                   ZXLOP00                                            
     C                   RESET                   ZXLIPAG                                            
     C                   EVAL      ZXCOUNT=1                                                        
      *                                                                                             
     C                   IF        ZXSEMF=*BLANKS                                                   
     C                   EVAL      ZXLIPAG=ZXLIPAG+1                                                
     C                   ENDIF                                                                      
      *                                                                                             
     C                   SELECT                                                                     
     C                   WHEN      CCCFMT='1'                                                       
     C     KEDPARM       SETGT     EDPARM                                                           
     C                   ENDSL                                                                      
      *                                                                                             
     C                   DOW       ZXLOP00 < ZXLIPAG                                                
     C                   SELECT                                                                     
     C                   WHEN      CCCFMT='1'                                                       
     C                   READP(N)  EDPARM                                 82                        
     C                   ENDSL                                                                      
      *                                                                                             
     C                   IF        EOF=*ON                                                          
     C                   LEAVE                                                                      
     C                   ENDIF                                                                      
     C                   EXSR      CS_SELSFL                                                        
     C                   IF        ZXSELSFL=1                                                       
     C                   GOTO      TNEXDOWN                                                         
     C                   ENDIF                                                                      
     C                   EVAL      ZXLOP00=ZXLOP00+1                                                
     C     TNEXDOWN      TAG                                                                        
     C                   ENDDO                                                                      
      *                                                                                             
     C                   IF        ZXSEMF=*BLANKS AND                                               
     C                             EOF=*ON        AND                                               
     C                             ZXLOP00=1                                                        
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='MSG0114'                                                  
     C                   ENDIF                                                                      
     C                   EVAL      ZXCOMCAR=0                                                       
     C                   EXSR      CS_SAVFK                                                         
     C                   EVAL      ZXSEMF=*BLANKS                                                   
      *                                                                                             
     C                   ENDSR                                                                      
      ******************************************************************************************    
     C* validación de opciones                                                                      
      ******************************************************************************************    
     C/COPY *LIBL/QSRDSRC,SRD030                                                                    
