      **************************************************************                                
      * APLICACIÓ: MÒDUL DE LOGISTICA                              *                                
      **************************************************************                                
      * TITOL: DO0030  © FLUIDRA                                   *                                
      * DATA CREACIO:  16/01/2014                                  *                                
      * FUNCIO DEL PROGRAMA: DOM - MANTENIMIENTO PRIORIDADES POR   *                                
      *                      CIAS/ALMACEN                          *                                
      *                      ( * NIVEL DE DELEGACIÓN * )           *                                
      *   TRATAMOS TODAS LAS EXCEPCIONES                           *                                
      * DOCUMENTACIO:                                              *                                
      *                                                            *                                
      * ZXOPT1 = NOM DEL PROCÉS                                    *                                
      *        - SN = SUBFITXER N.          N=[01,02,...,99]       *                                
      *        - N TAMBÉ EQUIVAL AL NÚMERO DE FORMAT DEL SFL       *                                
      *          I COINCIDEIX AMB EL Nº DE LÒGIC (ESSENT N=00 EL   *                                
      *          FITXER FÍSIC)                                     *                                
      * ZXOPT2 = RUTINA DINTRE DEL PROCÉS                          *                                
      *        - 'INZ'= INICILITZAR                                *                                
      *        - 'DSP'= VISUALITZA DE PANTALLA                     *                                
      *        - 'CHK'= VALIDACIÓ DE LA PANTALLA                   *                                
      *        - 'CLR'= NETEJA DEL SFL                             *                                
      *        - 'UPD"= ACTUALITZACIONS DELS FITXERS               *                                
      *                                                            *                                
      * ZXNNN00= Últim nº de registre carregat en subarxiu         *                                
      * ZXNRR00= Numerador de registres de subarxiu                *                                
      * ZXCOUNT= ZXNRR00 del 1er registre de la últ. pag.          *                                
      *          que visualizaba el usuario                        *                                
      * ZXLOP00= Numerador de registres en carrega de pantalla     *                                
      * SUFRCDN= SFLRCDNBR del subarxiu                            *                                
      * PREFIXE DE CAMP: CCC- (CAMP COMÚ DE CAPÇALERA: CAMP QUE EL *                                
      *        SEU CONTINGUT NO VARIA EN LES ALTRES CAPÇALERES DE  *                                
      *        L'APLICACIÓ. P.EX.: NOM DEL PGM O DEL TREBALL)      *                                
      *                                                            *                                
      * CS_(NOM): COMMON SUBRUTINE (COL·LOCADES FINAL PGM)        *                                 
      * @PE(NOM) : PARAMETRES D'EXPORTACIÓ                         *                                
      **************************************************************                                
      * ORGANIZACIÓN DEL FICHERO  EDPAR2                           *                                
      * CIRCUITO                                                   *                                
      *  TREG     DESCRIPCIÓN                                      *                                
      *  =====    ===============================================  *                                
      *    0    - CARGAMOS PRIORIDADES A NIVEL DE EMPRESA          *                                
      *    1    - VERIFICAR SI EXISTE A NIVEL DE PROVEEDOR         *                                
      *    2    - VERIFICAR SI EXISTE A NIVEL DE ARTICULO          *                                
      *    3    - VERIFICAR SI EXISTE A NIVEL DE FAM/SUBF          *                                
      *    4    - VERIFICAR SI EXISTE A NIVEL DE FAM/TARIFA        *                                
      *    5    - VERIFICAR SI EXISTE A NIVEL DE CLIENTE           *                                
      *                                                            *                                
      *    A    - CARGAMOS PRIORIDADES A NIVEL DE DELEGACIÓN       *                                
      *    B    - VERIFICAR SI EXISTE A NIVEL DE  DLGA/ PROVEEDOR  *                                
      *    C    - VERIFICAR SI EXISTE A NIVEL DE  DLGA/ ARTICULO   *                                
      *    D    - VERIFICAR SI EXISTE A NIVEL DE  DLGA/ FAMILIA    *                                
      *    E    - VERIFICAR SI EXISTE A NIVEL DE  DLGA/ FAM-SUBF   *                                
      *    F    - VERIFICAR SI EXISTE A NIVEL DE  DLGA/ FAM-TARIFA *                                
      *    G    - VERIFICAR SI EXISTE A NIVEL DE  DLGA/ CLIENTE    *                                
      *    H    - VERIFICAR SI EXISTE A NIVEL DE  DLGA/ PROCED.PED.*                                
FGI25 *    M    - Verificar excepción a nivel categorización articulo  MTO/MTS                      
      **************************************************************                                
 F-2OL**************************************************************                                
 F-2OL* DATA DE MODIFICACIÓ: 18/02/2022  MARCA: F-2OL              *                                
 F-2OL* AUTOR: DGrau                                               *                                
 F-2OL* DOCUMENTACIÓ: Arreglar subfile se posiciones en 1 registro *                                
 F-2OL* y añadimos el situar                                       *                                
 F-2OL**************************************************************                                
F-2OL **************************************************************                                
P0549 * DATA DE MODIFICACIÓ: 16/05/2022  MARCA: IT244              *                                
P0549 * AUTOR: David Grau                                          *                                
P0549 * DOCUMENTACIÓ: 2ª FASE 2OL                                  *                                
P0549 **************************************************************                                
FGI25 */ Date : 20/06/2025    Marca: FGI25         Moficicació: OLFGI-25                            
FGI25 */ Descripció: EXCEPCIÓN DOM EN ITALIA                                                        
FGI25 */ Autor: MMontana                                                                            
FGI25 */  Nueva excepción por categorización del articulo: MTO/MTS                                  
FGI25 */////////////////////////////////////////////////////////////////////////////////////////    
     H DATEDIT(*YMD/)                                                                               
     FDO0030FM  CF   E             WORKSTN INFDS(SFLDS)                                             
     F                                     SFILE(SUFD:ZXNRR00)                                      
     FEDPAR2    UF   E           K DISK                                                             
     FPMEMPR    IF   E           K DISK                                                             
     FMSARTI00  IF   E           K DISK                                                             
     FPUPROV    IF   E           K DISK                                                             
     FMSFAMI    IF   E           K DISK                                                             
     FPMTABD    IF   E           K DISK                                                             
     FCOCLIN    IF   E           K DISK                                                             
     FMSSGGA    IF   E           K DISK                                                             
     FPMSETP    UF A E           K DISK                                                             
FGI25fgmtabd00  if   e           k disk                                                             
                                                                                                    
      * ESTRUCTURA DE LA INFDS                                                                      
     D                SDS                                                                           
     D  SDSPGM                 1     10                                                             
     D    CCCPGM                     10    OVERLAY(SDSPGM)                                          
     D  SDSJOB               244    253                                                             
     D    CCCJOB                     10    OVERLAY(SDSJOB)                                          
     D  SDSUSR               254    263                                                             
     D  SDSJNBR              264    269                                                             
                                                                                                    
      * AREA DE DADES D'INFORMACIÓ ARXIU                                                            
     D  SFLDS          DS                                                                           
     D    SFLPOCUR           370    371B 0                                                          
     D    SFLPOS1            378    379B 0                                                          
     D    SFLRCD         *RECORD                                                                    
                                                                                                    
      * AREA DE DADES LOCAL I INICIALITZACIO DE VALORS COMUNS                                       
     D DSLDA         E DS                  EXTNAME(PURLDADS)                                        
     D    CCCDEEM                    30    OVERLAY(ZZDEEM)                                          
                                                                                                    
      * AREA DE PARAMETRES DE PROGRAMA                                                              
     D  DO0030       E DS                  EXTNAME(DO0030DS)                                        
                                                                                                    
      * PLANTILLA D'INDICADORS DEL PROGRAMA (ELS RESERVATS NO SURTEN)                               
      * ELS DE TREBALL ES PODEN REDENOMINAR MITJANÇANT OVERLAY                                      
     D  INDICADORS   E DS                  BASED(INDICADORP)                                        
     D                                     EXTNAME(INDDS:RIND0199)                                  
     D     INPOS01   E                     EXTFLD(SETL01)                                           
     D     INPOS02   E                     EXTFLD(SETL02)                                           
     D     VLDCMDKEY E                     EXTFLD(WRK74)                                            
     D     ROLLDOWN  E                     EXTFLD(WRK77)                                            
     D  INDICADORP     S               *   INZ(%ADDR(*IN))                                          
                                                                                                    
      * CONTROL DEL FLUXE DEL PROGRAMA AMB INICIALITZACIÓ DE POSIC. INICIAL                         
     D                 DS                                                                           
     D  ZXOPT                  1      6    INZ('S01CLR')                                            
     D    ZXOPT1               1      3                                                             
     D    ZXOPT2               4      6                                                             
      *                                                                                             
      * PARÀMETRES PEL PRD650 I CAMPS DE TREBALL ASSOCIATS                                          
      * VALOR NUMÈRIC                                                                               
     D   PXNUM         S             29  9                                                          
      * VALOR ALFANUMÈRIC                                                                           
     D   PXALPH        S             29                                                             
      * LONGITUD TOTAL DEL CAMP (Nº CARÀCTERS INCLÒS CODI EDICIÓ)                                   
     D   PXFLDD        S              2  0 INZ(20)                                                  
      * Nº DE DECIMALS DEL CAMP                                                                     
     D  PXDCCD         S              1  0                                                          
      * TIPUS DE FORMAT DECIMAL (.,)                                                                
     D  PXFMD1         S                   LIKE(ZZFMD1)INZ                                          
      * CODI D'EDICIÓ (4,M,Q,Z)                                                                     
     D  PXEDTC         S                   LIKE(ZZEDTC)INZ('M')                                     
     D  PXEDT2         S                   LIKE(ZZEDTC)INZ('K')                                     
      * RETORN CODI D'ERROR                                                                         
     D  PXNMER         S              1  0 INZ(0)                                                   
      * TIPUS D'AJUST DECIMAL (0=MIG 1=PER SOBRE 2=PER SOTA)                                        
     D  PXTIPA         S                   LIKE(ZZAJUD)                                             
      *                                                                                             
      *                                                                                             
      * ESTRUCTURA DE DADES PELS DIFERENTS FORMATS DE SUBARXIU                                      
      * B - EXCEPCIÓN PROVEEDOR (VISTA B)                                                           
      * W1DATA -> S01D                                                                              
     D                 DS                                                                           
     D  WBDATA                 1     74                                                             
     D    SB1PRVR              1     10                                                             
     D    SB1DESC             12     50                                                             
      *    C    -  NIVEL DE  DLGA/ ARTICULO   *                                                     
     D                 DS                                                                           
     D  WCDATA                 1     74                                                             
     D    SC1ARVT              1     25                                                             
     D    SC1DESC             27     60                                                             
      *    D    -  DLGA/ FAMILIA    *                                                               
     D                 DS                                                                           
     D  WDDATA                 1     74                                                             
     D    SD1FAMI              1      6                                                             
     D    SD1DESC              8     60                                                             
      *    E    -  DLGA/ FAM-SUBF   *                                                               
     D                 DS                                                                           
     D  WEDATA                 1     74                                                             
     D    SE1SFAM              1      7                                                             
     D    SE1DESC             10     60                                                             
      *    F    -  DLGA/ FAM-TARIFA *                                                               
     D                 DS                                                                           
     D  WFDATA                 1     74                                                             
     D    SF1FAMT              1      6                                                             
     D    SF1DESC              8     60                                                             
      *    G    -  DLGA/ CLIENTE    *                                                               
     D                 DS                                                                           
     D  WGDATA                 1     74                                                             
     D    SG1CUST              1     10                                                             
     D    SG1DESC             12     60                                                             
                                                                                                    
      * EXPORTACIÓ DE PARÀMETRES                                                                    
     D    @PCIAS       S                   LIKE(T4CIA1)                                             
     D    @PDLGA       S                   LIKE(T4DLGA)                                             
     D    @PTREG       S                   LIKE(T4TREG)                                             
     D    @POPCI       S              2A                                                            
     D    @PERRO       S              1A                                                            
     D                                                                                              
      * EXPORTACIÓ DE PARÀMETRES                                                                    
     D    @PECIAS      S                   LIKE(T4CIA1) INZ                                         
     D    @PEDLGA      S                   LIKE(T4DLGA)                                             
     D    @PEARVT      S                   LIKE(T4ARVT)                                             
     D    @PEFAMT      S                   LIKE(T4FAMT)                                             
     D    @PEPRVR      S                   LIKE(T4PRVR)                                             
     D    @PETREG      S                   LIKE(T4TREG)                                             
     D    @PEPRIO      S                   LIKE(T4PRIO)                                             
F-2OLD    @PECIA2      S                   LIKE(T4CIA2)                                             
     D    @PEMAGA      S                   LIKE(T4MAGA)                                             
     D    @PEOPT       S                   LIKE(SUFOPCI)INZ                                         
     D    @PEPGM       S                   LIKE(SDSPGM) INZ                                         
     D    @PEFMT       S                   LIKE(RECORD) INZ                                         
     D    @PEFLD       S                   LIKE(FIELD)  INZ                                         
     D    @PEERR       S              1                 INZ                                         
                                                                                                    
     D* SERIES A UTILITZAR EN PROGRAMA                                                              
     DSSSECPA          S              1A   DIM(10)                                                  
                                                                                                    
     D* DEFINICIO DE CAMPS DE TREBALL                                                               
     D  ZXNRR00        S                   LIKE(SUFRCDN)INZ                                         
     D  ZXNNN00        S                   LIKE(SUFRCDN)INZ                                         
     D  ZXLOP00        S                   LIKE(SUFRCDN)INZ                                         
     D  ZXCOUNT        S                   LIKE(SUFRCDN)INZ(1)                                      
     D  ZXFMT          S                   LIKE(CCCFMT) INZ                                         
     D  ZXAU15         S             15  0                                                          
     D  ZXSELSFL       S              1  0                                                          
     D  ZXSEMF         S              1                                                             
                                                                                                    
     D* Los Campos que vienen a continuacion guardan los valores                                    
     D* de la primera clave con que se cargo el subarchivo y a partir de                            
     D* los cuales se realizara cualquier accion de refrescar segun                                 
     D* ACCREF 1=SI 0=NO                                                                            
     D  ZXCIAS_1       S                   LIKE(T4CIA1) INZ                                         
     D  ZXFAMT_1       S              6A                                                            
     D  ZXPRVR_1       S             10A                                                            
     D  ZXARVT_1       S             25A                                                            
     D  ZXMAGA_1       S              5A                                                            
     D  ZXDLGA_1       S              5A                                                            
     D  ZXPRIO_1       S                   LIKE(T4PRIO) INZ                                         
                                                                                                    
      * El valor ZXCOMCAR marcara cuando se deben guardar los valores                               
      * de primera clave anteriores                                                                 
     D  ZXCOMCAR       S              1  0                                                          
      * Campos de uso para trabajar con la API QCMDEXC                                              
     D  ZXQCMD         S            150                                                             
     D  ZXLOGC         S             15  5 INZ(150)                                                 
      * El valor ZXLIPAG tiene el numero de registros a cargar despues de                           
      * un Clear de subfichero                                                                      
     D  ZXLIPAG        S                   LIKE(SUFRCDN)INZ(12)                                     
     D  ZXLIPA2        S                   LIKE(SUFRCDN)INZ(12)                                     
     D  ZXNUPAG        S                   LIKE(SUFRCDN)                                            
     D  ZXRESTO        S                   LIKE(SUFRCDN)                                            
      * Definicion de posición del cursor en subarchivo                                             
     D  ZXLINEA        S              3  0                                                          
     D  ZXCOLU         S              3  0                                                          
      * Definicion de algunas constantes                                                            
     D  ZXZERO10       S             10A   INZ(*ALL'0')                                             
      **************************************************************                                
      * RUTINA PRINCIPAL DEL PGM : DISTRIBUCIÓ DEL PAS PELS 3 SFL  *                                
      *------------------------------------------------------------*                                
     C     ZXOPT1        DOWNE     'END'                                                            
     C     ZXOPT1        CASEQ     'PA0'         PA0MAIN                        SETUP DEL PGM       
     C     ZXOPT1        CASEQ     'S01'         S01MAIN                        FMT. PER ARTICLE    
     C                   ENDCS                                                                      
     C                   ENDDO                                                                      
     C                   SETON                                        LR                            
      **************************************************************                                
      * SUBRUTINA INICIAL. DEFINICIO DE TOTS ELS PARÀMETRES        *                                
      * GENERALS DEL PROGRAMA.                                     *                                
      *------------------------------------------------------------*                                
     C     *INZSR        BEGSR                                                                      
      *                                                                                             
      * DEFINICIO DE LES KLIST DEL PGM                                                              
      *                                                                                             
FGI25 *                                                                                             
FGI25c     kgmtabd00     klist                                                                      
FGI25c                   kfld                    t1ctab                                             
FGI25c                   kfld                    t1cele                                             
FGI25 *                                                                                             
     C     KPUPROV       KLIST                                                                      
     C                   KFLD                    C0CIAS                                             
     C                   KFLD                    C0PRVR                                             
      *                                                                                             
     C     KPMEMPR       KLIST                                                                      
     C                   KFLD                    P7CIAS                                             
     C                   KFLD                    P7DLGA                                             
      *                                                                                             
     C     KMSSETP       KLIST                                                                      
     C                   KFLD                    PICIAS                                             
     C                   KFLD                    PIPROG                                             
     C                   KFLD                    PIUSU1                                             
      *                                                                                             
     C     KMSARTI00     KLIST                                                                      
     C                   KFLD                    M5CIAS                                             
     C                   KFLD                    M5ARTI                                             
     C                   KFLD                    M5VARI                                             
     C                   KFLD                    M5MODE                                             
      *                                                                                             
     C     KCOCLIN       KLIST                                                                      
     C                   KFLD                    S0CIAS                                             
     C                   KFLD                    S0CUST                                             
      *                                                                                             
     C     KPMTABD       KLIST                                                                      
     C                   KFLD                    PECIAS                                             
     C                   KFLD                    PECTAB                                             
     C                   KFLD                    PECLTA                                             
      *                                                                                             
     C     KMSFAMI       KLIST                                                                      
     C                   KFLD                    MNCIAS                                             
     C                   KFLD                    MNFMIL                                             
     C                   KFLD                    MNSMIL                                             
      *                                                                                             
     C     KEDPAR2       KLIST                                                                      
     C                   KFLD                    T4CIA1                                             
     C                   KFLD                    T4TREG                                             
     C                   KFLD                    T4DLGA                                             
      *********************************************************                                     
      * ENTRADA PARÁMETROS                                                                          
      *********************************************************                                     
     C     *ENTRY        PLIST                                                                      
     C                   PARM                    @PCIAS                                             
     C                   PARM                    @PDLGA                                             
     C                   PARM                    @PTREG                                             
     C                   PARM                    @POPCI                                             
     C                   PARM                    @PERRO                                             
      *                                                                                             
      * RECUPERACIÓ DE LA LDA DE COMPRES                                                            
      *                                                                                             
     C     *DTAARA       DEFINE    PURLDA        DSLDA                                              
     C                   IN        DSLDA                                                            
                                                                                                    
     C                   EVAL      Z1ASTE='*'                                                       
      *                                                                                             
      * CAPÇALERES D'OPCIONS DEL SFL  (CODIS D'ARXIU DE MISSATGES)                                  
      *                                                                                             
     C                   EVAL      SUFOPC1='ODO0030'                                                
     C                   EVAL      SUFOPC2=*BLANKS                                                  
      *                                                                                             
      * TITOLS DE PANTALLES (CODIS D'ARXIU DE MISSATGES)                                            
      *                                                                                             
     C                   EVAL      CCCCTIT='TDO0030'                                                
      *                                                                                             
      * ACTIVEM EL SFLDSPCTL                                                                        
      *                                                                                             
     C                   EVAL      SFLCTL=*ON                                                       
      *                                                                                             
      * VALORES COMUNES                                                                             
      *                                                                                             
     C                   EVAL      PICIAS=ZZCIAS                                                    
     C                   EVAL      PIPROG=SDSPGM                                                    
     C                   EVAL      PIUSU1=ZZUSUA                                                    
     C                                                                                              
     C                   EVAL      P7CIAS=ZZCIAS                                                    
     C                   EVAL      C0CIAS=ZZCIAS                                                    
     C                   EVAL      M5CIAS=ZZCIAS                                                    
     C                   EVAL      PECIAS=ZZCIAS                                                    
     C                   EVAL      T4CIA1=ZZCIAS                                                    
     C                   EVAL      T4TREG=@PTREG                                                    
     C                   EVAL      T4DLGA=@PDLGA                                                    
                                                                                                    
      * RECUPEREM DEL FITXER DE SETUP EL FORMAT QUE EM DE MOSTRAR PER OMISIÓ                        
     C     KMSSETP       CHAIN (N) PMSETP                             81                            
     C                   CLEAR                   DO0030                                             
     C     PIDATR        CAT       DO0030:0      DO0030                                             
     C                   EVAL      ZXFMT=MÑS001                                                     
                                                                                                    
     C* RECUPEREM ELS VALORS DE L'AREA DE PARÀMETRES DE PROGRAMA                                    
     C                   IF        CHAIN=*OFF                                                       
     C                   SELECT                                                                     
     C                   WHEN      MÑS001=' ' OR MÑS001='0'                                         
     C                   EVAL      ZXOPT='S01CLR'                                                   
     C                   WHEN      MÑS001='1'                                                       
     C                   EVAL      ZXOPT='S01CLR'                                                   
     C                   ENDSL                                                                      
     C                   ENDIF                                                                      
     C                   EVAL      ERRGRL=*ON                                                       
      *                                                                                             
      * SEGURIDAD DEL MENU                                                                          
      *                                                                                             
     C                   CALL      'SV0275'                                                         
     C                   PARM                    SDSPGM                                             
     C                   PARM                    @PMERROR          1                                
     C                   IF        @PMERROR='1'                                                     
     C                   EVAL      ZXOPT='END   '                                                   
     C                   ENDIF                                                                      
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA INICIAL PARA PANTALLA PA0                        *                                
      *------------------------------------------------------------*                                
     C     PA0MAIN       BEGSR                                                                      
     C                   DOW       ZXOPT1='PA0'                                                     
     C     ZXOPT2        CASEQ     'CLR'         PA0CLR                                             
     C     ZXOPT2        CASEQ     'INZ'         PA0INZ                                             
     C     ZXOPT2        CASEQ     'DSP'         PA0DSP                                             
     C     ZXOPT2        CASEQ     'CMD'         PA0CMD                                             
     C     ZXOPT2        CASEQ     'CHK'         PA0CHK                                             
     C     ZXOPT2        CASEQ     'UPD'         PA0UPD                                             
     C                   ENDCS                                                                      
     C                   ENDDO                                                                      
     C     PA0MAINT      ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA DE NETEJA DE PA0                                 *                                
      *------------------------------------------------------------*                                
     C     PA0CLR        BEGSR                                                                      
     C                   EVAL      ZXOPT2='INZ'                                                     
     C     *NOKEY        CLEAR     *ALL          RPMSETP                                            
     C                   MOVEA     ZXZERO10      *IN(40)                                            
     C                   MOVEA     ZXZERO10      *IN(50)                                            
     C                   EVAL      CSRFILA=0                                                        
     C                   EVAL      CSRCOLU=0                                                        
     C     PA0CLRT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA DE INICI DE PA0                                 *                                 
      *------------------------------------------------------------*                                
     C     PA0INZ        BEGSR                                                                      
     C     KMSSETP       CHAIN (N) PMSETP                             81                            
     C                   CLEAR                   DO0030                                             
     C     PIDATR        CAT       DO0030:0      DO0030                                             
     C                   EXSR      CS_MOVFP                                                         
                                                                                                    
     C                   EVAL      ZXOPT2='DSP'                                                     
     C     PA0INZT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VISUALITZACIÓ DE PA0                             *                                
      *------------------------------------------------------------*                                
     C     PA0DSP        BEGSR                                                                      
     C                   EVAL      ZXOPT2='CMD'                                                     
     C                   EVAL      PPPCMD1='CMD3031'                                                
     C                   EXFMT     PA0                                                              
     C                   EVAL      ERRGRL=*OFF                                                      
     C                   EVAL      MSGER=*BLANKS                                                    
     C                   MOVEA     ZXZERO10      *IN(40)                                            
     C                   MOVEA     ZXZERO10      *IN(50)                                            
                                                                                                    
     C                   EVAL      CSRFILA=0                                                        
     C                   EVAL      CSRCOLU=0                                                        
     C     PA0DSPT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VALIDACIÓ DELS CMD'S                             *                                
      *------------------------------------------------------------*                                
     C     PA0CMD        BEGSR                                                                      
     C                   EVAL      ZXOPT2='CHK'                                                     
                                                                                                    
     C                   SELECT                                                                     
                                                                                                    
      * F03=FINALITZAR                                                                              
     C                   WHEN      EXIT=*ON                                                         
     C                   EVAL      ZXOPT1='END'                                                     
                                                                                                    
      * F04=AJUDA DE CAMPS                                                                          
     C                   WHEN      HELP=*ON                                                         
     C                   EVAL      ZXOPT2='DSP'                                                     
     C                   EXSR      CS_POSCUR                                                        
     C                   EVAL      @PEFLD=*BLANKS                                                   
     C                   EVAL      @PEFMT=*BLANKS                                                   
     C                   EVAL      @PEFLD=FIELD                                                     
     C                   IF        FIELD='PA0SBAJ'                                                  
     C                   EVAL      @PEFLD='SINO'                                                    
     C                   CALL      'MMPROM'                                     Query-Aut-F4   X    
     C                   PARM      *BLANKS       @PEOPT                         PARM Qry-F4         
     C                   PARM      *BLANKS       @PEPGM                         PARM Qry-F4         
     C                   PARM      *BLANKS       @PEFMT                         PARM Qry-F4         
     C                   PARM                    @PEFLD                         PARM Qry-F4         
     C                   PARM      *BLANKS       @PEERR                         PARM Qry-F4         
                                                                                                    
     C                   IF        @PEERR>'0'                                                       
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='ADP0304'                                                  
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TPA0F4                                             
      * Si no han realizado ninguna selección no tocamos nada                                       
     C                   IF        @PEERR='A'                                                       
     C                   EVAL      ERRGRL=*ON                                                       
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TPA0F4                                             
     C                   IF        FIELD='PA0SBAJ'                                                  
     C                   EVAL      PA0SBAJ=@PEOPT                                                   
     C                   ENDIF                                                                      
     C                   GOTO      TPA0F4                                                           
     C                   ENDIF                                                                      
     C                   EVAL      @PEFMT=RECORD                                                    
                                                                                                    
     C                   IF        FIELD='PA0S001'                                                  
     C                   EVAL      @PEFMT=*BLANKS                                                   
     C                   EVAL      @PEFLD=*BLANKS                                                   
     C                   EVAL      @PEFLD='CFMT'                                                    
     C                   ENDIF                                                                      
                                                                                                    
     C                   CALL      'MMPROM'                                     Query-Aut-F4   X    
     C                   PARM      *BLANKS       @PEOPT                         PARM Qry-F4         
     C                   PARM      SDSPGM        @PEPGM                         PARM Qry-F4         
     C                   PARM                    @PEFMT                         PARM Qry-F4         
     C                   PARM                    @PEFLD                         PARM Qry-F4         
     C                   PARM      *BLANKS       @PEERR                         PARM Qry-F4         
                                                                                                    
      * Si no han realizado ninguna selección no tocamos nada                                       
     C                   IF        @PEERR='A'                                                       
     C                   EVAL      ERRGRL=*ON                                                       
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TPA0F4                                             
      *                                                                                             
     C                   IF        FIELD='PA0S001'                                                  
     C                   EVAL      PA0S001=@PEOPT                                                   
     C                   ENDIF                                                                      
                                                                                                    
     C     TPA0F4        TAG                                                                        
     C     ERRGRL        CABEQ     *ON           PA0CMDT                                            
                                                                                                    
     C                   ENDSL                                                                      
                                                                                                    
     C     PA0CMDT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VALIDACIÓ DE PANTALLA PA0                        *                                
      *------------------------------------------------------------*                                
     C     PA0CHK        BEGSR                                                                      
     C                   EVAL      ZXOPT2='UPD'                                                     
                                                                                                    
      * VALIDACIO DE LES OPCIONS DE DETALL DE PA0                                                   
     C* Validación de PA0S001                                                                       
     C                   EVAL      @PEFMT=*BLANKS                                                   
     C                   EVAL      @PEFLD=*BLANKS                                                   
     C                   EVAL      @PEOPT=*BLANKS                                                   
     C                   EVAL      @PEOPT=PA0S001                                                   
     C                   EVAL      @PEFLD='CFMT'                                                    
     C                   CALL      'MMPROM'                                     Query-Aut-F4   X    
     C                   PARM                    @PEOPT                         PARM Qry-F4         
     C                   PARM      SDSPGM        @PEPGM                         PARM Qry-F4         
     C                   PARM                    @PEFMT                         PARM Qry-F4         
     C                   PARM                    @PEFLD                         PARM Qry-F4         
     C                   PARM      'V'           @PEERR                         PARM Qry-F4         
                                                                                                    
     C                   IF        @PEERR>='0' AND PA0S001<>*BLANKS                                 
     C                             AND PA0S001<>'0'                                                 
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      WRK40=*ON                                                        
     C                   EVAL      MSGER='ASG1003'                                                  
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TPA0CHK                                            
                                                                                                    
     C                   EVAL      @PEFMT=*BLANKS                                                   
     C                   EVAL      @PEFLD=*BLANKS                                                   
     C                   EVAL      @PEOPT=*BLANKS                                                   
     C                   EVAL      @PEOPT=PA0SBAJ                                                   
     C                   EVAL      @PEFLD='SINO'                                                    
     C                   CALL      'MMPROM'                                     Query-Aut-F4   X    
     C                   PARM                    @PEOPT                         PARM Qry-F4         
     C                   PARM      *BLANKS       @PEPGM                         PARM Qry-F4         
     C                   PARM                    @PEFMT                         PARM Qry-F4         
     C                   PARM                    @PEFLD                         PARM Qry-F4         
     C                   PARM      'V'           @PEERR                         PARM Qry-F4         
                                                                                                    
     C                   IF        @PEERR>='0'                                                      
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      WRK42=*ON                                                        
     C                   EVAL      MSGER='ASG1003'                                                  
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TPA0CHK                                            
     C     TPA0CHK       TAG                                                                        
     C                   IF        ERRGRL=*ON                                                       
     C                   EVAL      ZXOPT2='DSP'                                                     
     C                   ENDIF                                                                      
                                                                                                    
     C     PA0CHKT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA ACTUALITZACIO PANTALLA PA0                        *                               
      *------------------------------------------------------------*                                
     C     PA0UPD        BEGSR                                                                      
      * Actualización datos de PMSETUP                                                              
     C                   DOU       LCKRCD=*OFF                                                      
     C     KMSSETP       CHAIN     PMSETP                             8180                          
     C                   ENDDO                                                                      
     C                   CLEAR                   PIDATR                                             
     C                   EXSR      CS_MOVPF                                                         
     C     DO0030        CAT       PIDATR:0      PIDATR                                             
     C                   EVAL      PIDAT8=ZZDATS                                                    
     C                   TIME                    PIHORA                                             
     C                   EVAL      PIPANT=SDSJOB                                                    
     C                   EVAL      PIUSUA=SDSUSR                                                    
                                                                                                    
     C                   IF        CHAIN=*OFF                                                       
     C                   UPDATE    RPMSETP                                                          
     C                   ELSE                                                                       
     C                   EVAL      PIDAT1=PIDAT8                                                    
     C                   WRITE     RPMSETP                                                          
     C                   ENDIF                                                                      
                                                                                                    
     C                   EVAL      ZXOPT='S01CLR'                                                   
     C                   EVAL      ZXFMT='0'                                                        
                                                                                                    
     C* Limpieza de parametros de subarchivo                                                        
     C                   EVAL      ACCREF=*ON                                                       
     C                   EXSR      CS_CLRK                                                          
                                                                                                    
     C                   SELECT                                                                     
     C                   WHEN      PA0S001=' ' OR PA0S001='0'                                       
     C                   EVAL      ZXOPT='S01CLR'                                                   
     C                   WHEN      PA0S001='1'                                                      
     C                   EVAL      ZXOPT='S01CLR'                                                   
     C                   ENDSL                                                                      
                                                                                                    
     C                   EVAL      ERRGRL=*ON                                                       
     C     PA0UPDT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA CONTROL DEL SFL S01                              *                                
      *------------------------------------------------------------*                                
     C     S01MAIN       BEGSR                                                                      
     C                   DOW       ZXOPT1='S01'                                                     
     C     ZXOPT2        CASEQ     'CLR'         S01CLR                                             
     C     ZXOPT2        CASEQ     'INZ'         S01INZ                                             
     C     ZXOPT2        CASEQ     'DSP'         S01DSP                                             
     C     ZXOPT2        CASEQ     'CMD'         S01CMD                                             
     C     ZXOPT2        CASEQ     'CHK'         S01CHK                                             
     C                   ENDCS                                                                      
     C                   ENDDO                                                                      
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA DE NETEJA DEL SFL                                *                                
      *------------------------------------------------------------*                                
     C     S01CLR        BEGSR                                                                      
     C                   EVAL      ZXOPT='S01INZ'                                                   
     C                   EVAL      CCCFMT='1'                                                       
     C                   MOVEA     ZXZERO10      *IN(90)                                            
     C                   EVAL      INPOS01=*ON                                                      
     C                   EXSR      CS_SFLCLR                                                        
F-2OLC                   EVAL      T4CIA1=ZZCIAS                                                    
IT244C*                  IF        @Ptreg =16                                                       
IT244C*                  ENDIF                                                                      
F-2OLC                   EVAL      T4TREG=@PTREG                                                    
F-2OLC                   EVAL      T4DLGA=@PDLGA                                                    
F-2OL *                                                                                             
F-2OLC     KEDPAR2       SETLL     EDPAR2                                                           
     C     S01CLRT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA INICIALITZACIÓ I CARREGA DEL SFL                 *                                
      *------------------------------------------------------------*                                
     C     S01INZ        BEGSR                                                                      
F-2OLC                   EVAL      ZXOPT2='DSP'                                                     
F-2OLC                   EXSR      CS_SFLIN1                                                        
F-2OL                                                                                               
F-2OLC                   DOW       ZXLOP00 < ZXLIPAG                                                
F-2OLC     KEDPAR2       READE     EDPAR2                                 82                        
F-2OLC                   IF        EOF=*ON                                                          
F-2OLC                   LEAVE                                                                      
F-2OLC                   ENDIF                                                                      
F-2OLC                   EXSR      CS_SELSFL                                                        
F-2OL *                                                                                             
F-2OL *  situar                                                                                     
      *_ H _________                                                                                
F-2OLC                   IF        PSUCLAV <> *blanks                                               
FGI25 *IT244C                   IF        @PTREG ='H'                                               
FGI25c                   if        @ptreg='H' or @ptreg='M'                                         
IT244C                   IF        T4FAMT<PSUCLAV                                                   
IT244C                   ITER                                                                       
IT244c                   else                                                                       
IT244C                   EVAL      PSUCLAV  =*BLANKS                                                
IT244C                   endif                                                                      
IT244C                   endif                                                                      
IT244C                   endif                                                                      
      *_____________                                                                                
      *_ C     _____                                                                                
F-2OLC                   IF        PSUCLAV <> *blanks                                               
IT244C                   IF        @PTREG ='C'                                                      
IT244C                   IF        T4ARVT<PSUCLAV                                                   
IT244C                   ITER                                                                       
IT244c                   else                                                                       
IT244C                   EVAL      PSUCLAV  =*BLANKS                                                
IT244C                   endif                                                                      
IT244C                   endif                                                                      
IT244C                   endif                                                                      
      *_____________                                                                                
      *_____________                                                                                
      *_ B o G _____                                                                                
F-2OLC*                  IF        T4PRVR<>PSUCLAV                                                  
IT244C                   IF        @PTREG ='B' OR @PTREG='G'                                        
F-2OLC                   IF        T4PRVR<PSUCLAV                                                   
F-2OLC                   ITER                                                                       
F-2OLc                   else                                                                       
F-2OLC                   EVAL      PSUCLAV  =*BLANKS                                                
F-2OLC                   ENDIF                                                                      
F-2OLC                   ENDIF                                                                      
F-2OL *  situar                                                                                     
F-2OLC                   IF        ZXSELSFL<1                                                       
F-2OLC                   EVAL      ZXNRR00=ZXNRR00 + 1                                              
F-2OLC                   EVAL      ZXLOP00=ZXLOP00 + 1                                              
F-2OLC                   EXSR      CS_MOVFP                                                         
F-2OLC                   EXSR      CS_SAVFK                                                         
F-2OLC                   WRITE     SUFD                                                             
F-2OLC                   ENDIF                                                                      
F-2OLC                   ENDDO                                                                      
F-2OL                                                                                               
F-2OLC                   EXSR      CS_SFLIN2                                                        
     C     S01INZT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VISUALITZACIÓ SFL                                *                                
      *------------------------------------------------------------*                                
     C     S01DSP        BEGSR                                                                      
     C                   EVAL      ZXOPT2='CMD'                                                     
     C                   EVAL      PPPCMD1='CMD3004'                                                
     C                   EVAL      SUFHED1='HDO0030'                                                
     C                   MOVEA     ZXZERO10      *IN(50)                                            
     C                   SELECT                                                                     
      * POR PROVEEDOR                                                                               
     C                   WHEN      @PTREG='B'                                                       
     C                   EVAL      WRK50=*ON                                                        
     C                   EVAL      SUFHED1='HDO0030'                                                
      * POR ARTICULO                                                                                
     C                   WHEN      @PTREG='C'                                                       
     C                   EVAL      WRK51=*ON                                                        
     C                   EVAL      SUFHED1='HDO003C'                                                
      * POR FAMILIA                                                                                 
     C                   WHEN      @PTREG='D'                                                       
     C                   EVAL      WRK52=*ON                                                        
     C                   EVAL      SUFHED1='HDO003D'                                                
      * POR FAMILIA/SUBFAMILIA                                                                      
     C                   WHEN      @PTREG='E'                                                       
     C                   EVAL      WRK53=*ON                                                        
     C                   EVAL      SUFHED1='HDO003E'                                                
     C                                                                                              
      * POR FAMILIA TARIFA                                                                          
     C                   WHEN      @PTREG='F'                                                       
     C                   EVAL      WRK54=*ON                                                        
     C                   EVAL      SUFHED1='HDO003F'                                                
      * POR FAMILIA TARIFA                                                                          
     C                   WHEN      @PTREG='G'                                                       
     C                   EVAL      WRK55=*ON                                                        
     C                   EVAL      SUFHED1='HDO0031'                                                
      * POR PROCEDENCIA DE PEDIDO                                                                   
     C                   WHEN      @PTREG='H'                                                       
     C                   EVAL      WRK56=*ON                                                        
     C                   EVAL      SUFHED1='HDO030A'                                                
FGI25 * POR MTO/MTS                                                                                 
FGI25C                   WHEN      @PTREG='M'                                                       
FGI25C                   EVAL      WRK57=*ON                                                        
FGI25C                   EVAL      SUFHED1='HDO030B'                                                
     C                   ENDSL                                                                      
     C                   EXSR      CS_SFLDSP                                    SI REGS             
     C     S01DSPT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VALIDACIÓ DELS CMD'S                             *                                
      *------------------------------------------------------------*                                
     C     S01CMD        BEGSR                                                                      
     C                   EVAL      ZXOPT2='CHK'                                                     
     C                   EXSR      CS_SFLCMD                                                        
     C     S01CMDT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VALIDACIÓ DEL SFL: FORMAT SFL I OPCIONS          *                                
      *------------------------------------------------------------*                                
     C     S01CHK        BEGSR                                                                      
     C                   EVAL      ZXOPT2='DSP'                                                     
      * SUBRUTINA COMÚ DE VALIDACIÓ DEL SFL                                                         
     C                   EXSR      CS_SFLCHK                                                        
     C     S01CHKT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VALIDACIÓ DELS CMD'S                             *                                
      *------------------------------------------------------------*                                
     C     CS_SECCMD     BEGSR                                                                      
      * Validacion clase de subarchivo                                                              
     C                   EVAL      @PEFLD=*BLANKS                                                   
     C                   EVAL      @PEOPT=*BLANKS                                                   
     C                   EVAL      @PEFMT=*BLANKS                                                   
     C                   EVAL      @PEFLD='OPCI'                                                    
     C                   EVAL      @PEPGM=*BLANKS                                                   
     C                   EVAL      @PEPGM=SDSPGM                                                    
     C                   IF        CREATE=*ON                                                       
     C                   EVAL      @PEOPT='1 '                                                      
     C                   ENDIF                                                                      
     C                   EXSR      CS_SECMDOP                                                       
     C     ERRGRL        CABEQ     *ON           SECCMDT                                            
     C     SECCMDT       ENDSR                                                                      
      **************************************************************                                
      * COMMON SUBRUTINE (CS_) :                                  *                                 
      * SUBRUTINA DE NETEJA DEL SFL                                *                                
      *------------------------------------------------------------*                                
     C     CS_SFLCLR     BEGSR                                                                      
     C                   EVAL      SFLDSP=*OFF                                                      
     C                   EVAL      SFLCTL=*OFF                                                      
     C                   EVAL      SFLCLR=*ON                                                       
     C                   WRITE     SUFC                                                             
     C                   EVAL      SFLDSP=*ON                                                       
     C                   EVAL      SFLCTL=*ON                                                       
     C                   EVAL      SFLCLR=*OFF                                                      
     C                   CLEAR                   SUFRCDN                        SFLRCDNBR           
     C                   RESET                   ZXNRR00                        ULT.NRR             
     C                   RESET                   ZXNNN00                        ULT.NRR             
     C                   EVAL      ZXFMT=CCCFMT                                                     
      * Inicialitza la variable que indica inici de carrega de subarxiu                             
     C                   EVAL      ZXCOMCAR=0                                                       
     C                   MOVEA     ZXZERO10      *IN(40)                                            
     C                   MOVEA     ZXZERO10      *IN(50)                                            
     C     SFLCLRT       ENDSR                                                                      
      **************************************************************                                
      * COMMON SUBRUTINE (CS_) :                                  *                                 
      * SUBRUTINA INICIALITZACIÓ DEL SFL (1º PART)                 *                                
      *------------------------------------------------------------*                                
     C     CS_SFLIN1     BEGSR                                                                      
     C                   RESET                   ZXLOP00                                            
     C                   RESET                   ZXLIPAG                                            
F-2OLC*                  CLEAR                   PSUCLAV                                            
F-2OLC                   EVAL      ZXNRR00=ZXNNN00                                                  
     C                   IF        ACCREF=*ON                                                       
     C                   RESET                   ZXNRR00                                            
     C     ZXCOUNT       DIV       ZXLIPAG       ZXNUPAG                                            
     C                   MVR                     ZXRESTO                                            
     C                   IF        ZXRESTO>0 OR ZXNUPAG=0                                           
     C                   EVAL      ZXNUPAG=ZXNUPAG+1                                                
     C                   ENDIF                                                                      
     C                   EVAL      ZXLIPAG=ZXNUPAG*ZXLIPAG                                          
     C                   ENDIF                                                                      
     C                   RESET                   ZXNNN00                        ULT.NRR             
     C                   EVAL      SFLEND=*OFF                                                      
     C                   EVAL      EOF=*OFF                                                         
     C     SFLIN1T       ENDSR                                                                      
      **************************************************************                                
      * COMMON SUBRUTINE (CS_) :                                  *                                 
      * SUBRUTINA DE MOURE CAMPS                                   *                                
      *------------------------------------------------------------*                                
     C     CS_MOVFP      BEGSR                                                                      
F-2OLC*                  EVAL      SUFDATA=*BLANKS                                                  
      *                                                                                             
     C                   SELECT                                                                     
     C                   WHEN      ZXOPT1='S01'                                                     
     C                   EVAL      SUFOPCI=*BLANKS                                                  
     C                   EVAL      SFLNXC=*OFF                                                      
     C                   EXSR      S01MFP                                                           
      *                                                                                             
     C                   WHEN      ZXOPT1='PA0'                                                     
     C                   EVAL      PA0S001=MÑS001                                                   
     C                   EVAL      PA0SBAJ=MÑSBAJ                                                   
      *                                                                                             
     C                   ENDSL                                                                      
      *                                                                                             
     C                   ENDSR                                                                      
      **************************************************************                                
      * COMMON SUBRUTINE (CS_) :                                  *                                 
      * SUBRUTINA DE MOURE CAMPS a FICHERO                         *                                
      *------------------------------------------------------------*                                
     C     CS_MOVPF      BEGSR                                                                      
F-2OLC*                  EVAL      SUFDATA=*BLANKS                                                  
      *                                                                                             
     C                   SELECT                                                                     
     C                   WHEN      ZXOPT1='PA0'                                                     
     C                   EVAL      MÑSBAJ=PA0SBAJ                                                   
     C                   EVAL      MÑS001=PA0S001                                                   
     C                   ENDSL                                                                      
      *                                                                                             
     C                   ENDSR                                                                      
      **************************************************************                                
      * COMMON SUBRUTINE (CS_) :                                  *                                 
      * GUARDO LA CLAU DE POSICIONAMENT DEL PRIMER REGISTRE DESPRES*                                
      * DE LA NETEJA DEL SUBARXIU                                  *                                
      *------------------------------------------------------------*                                
     C     CS_SAVFK      BEGSR                                                                      
     C                   IF        ZXCOMCAR=0                                                       
      *                                                                                             
F-2OL *                  EVAL      ZXCIAS_1=T4CIA1                                                  
F-2OLC*                  EVAL      ZXPRIO_1=T4PRIO                                                  
F-2OLC*                  EVAL      ZXMAGA_1=T4MAGA                                                  
     C                   EVAL      ZXCOMCAR=1                                                       
      *                                                                                             
     C                   ENDIF                                                                      
     C     CS_SAVFKT     ENDSR                                                                      
      **************************************************************                                
      * COMMON SUBRUTINE (CS_) :                                  *                                 
      * SUBRUTINA INICIALITZACIÓ DEL SFL  (2ª PART)                *                                
      *------------------------------------------------------------*                                
     C     CS_SFLIN2     BEGSR                                                                      
     C                   EVAL      ZXNNN00=ZXNRR00                                                  
     C                   EVAL      SUFRCDN=ZXNRR00                                                  
     C                   EVAL      ACCREF=*ON                                   SFLRCDNBR           
     C                   IF        EOF=*ON                                                          
     C                   EVAL      SFLEND=*ON                                                       
     C                   ENDIF                                                                      
      *                                                                                             
     C                   IF        ZXNRR00=0                                                        
     C                   EVAL      CSRFILA=0                                                        
     C                   EVAL      CSRCOLU=0                                                        
     C                   EVAL      SFLDSP=*OFF                                                      
     C                   ELSE                                                                       
     C                   EVAL      SFLDSP=*ON                                                       
     C                   ENDIF                                                                      
      *                                                                                             
     C                   IF        ZXCOUNT>ZXNNN00                                                  
     C                   EVAL      CSRFILA=0                                                        
     C                   EVAL      CSRCOLU=0                                                        
     C                   ENDIF                                                                      
      *                                                                                             
     C                   EVAL      P7DLGA=@PDLGA                                                    
     C     KPMEMPR       CHAIN     PMEMPR                                                           
     C                   EVAL      SUCDLGA=@PDLGA                                                   
     C                   EVAL      SUCDESC=P7DESC                                                   
      *                                                                                             
      *                                                                                             
     C     SFLIN2T       ENDSR                                                                      
      **************************************************************                                
      * COMMON SUBRUTINE (CS_) :                                  *                                 
      * SUBRUTINA VALIDACIÓ DELS CMD'S                             *                                
      *------------------------------------------------------------*                                
     C     CS_SFLCMD     BEGSR                                                                      
     C                   IF        VLDCMDKEY=*OFF                                                   
     C                   GOTO      SFLCMDT                                                          
     C                   ENDIF                                                                      
     C                   EVAL      ACCREF=*ON                                                       
     C                   EXSR      CS_SECCMD                                                        
     C     ERRGRL        CABEQ     *ON           SFLCMDT                                            
     C                   SELECT                                                                     
      * F03=SORTIR DEL PROGRAMA                                                                     
     C                   WHEN      EXIT=*ON                                                         
     C                   EVAL      ZXOPT1='END'                                                     
      * F04=AJUDA DE PANTALLA                                                                       
     C                   WHEN      HELP=*ON                                                         
     C                   EVAL      ZXOPT2='DSP'                                                     
     C                   EXSR      CS_POSCUR                                                        
     C                   EVAL      ACCREF=*OFF                                                      
     C                   EVAL      @PEFLD=*BLANKS                                                   
     C                   EVAL      @PEFMT=RECORD                                                    
     C                   EVAL      @PEFLD=FIELD                                                     
      *                                                                                             
     C                   IF        FIELD='CCCFMT'                                                   
     C                   EVAL      @PEFMT=*BLANKS                                                   
     C                   EVAL      @PEFLD=*BLANKS                                                   
     C                   EVAL      @PEFLD='CFMT'                                                    
     C                   ENDIF                                                                      
      *                                                                                             
     C                   IF        FIELD='SUFOPCI'                                                  
     C                   EVAL      @PEFMT=*BLANKS                                                   
     C                   EVAL      @PEFLD=*BLANKS                                                   
     C                   EVAL      @PEFLD='OPCI'                                                    
     C                   ENDIF                                                                      
     C                   CALL      'MMPROM'                                     Query-Aut-F4   X    
     C                   PARM      *BLANKS       @PEOPT                         PARM Qry-F4         
     C                   PARM      SDSPGM        @PEPGM                         PARM Qry-F4         
     C                   PARM                    @PEFMT                         PARM Qry-F4         
     C                   PARM                    @PEFLD                         PARM Qry-F4         
     C                   PARM      *BLANKS       @PEERR                         PARM Qry-F4         
      * Si el dato no tiene soporte F4 avisamos                                                     
     C                   IF        @PEERR>'0'                                                       
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      WRk40=*ON                                                        
     C                   EVAL      MSGER='ADP0304'                                                  
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           HELPT                                              
      * Si no han realizado ninguna selección no tocamos nada                                       
     C                   IF        @PEERR='A'                                                       
     C                   EVAL      ERRGRL=*ON                                                       
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           HELPT                                              
     C                   IF        FIELD='CCCFMT'                                                   
     C*****              EVAL      ERRGRL=*ON                                                       
     C                   EVAL      CCCFMT=@PEOPT                                                    
     C                   ENDIF                                                                      
     C                   IF        FIELD='SUFOPCI'                                                  
      *                  EXSR      CS_POSCUR                                                        
     C                   EVAL      ZXNRR00=SFLPOS1+CSRFILA-9                                        
     C     ZXNRR00       CHAIN     SUFD                               81                            
     C                   IF        CHAIN=*OFF                                                       
     C                   EVAL      SUFOPCI=@PEOPT                                                   
     C                   EVAL      SFLNXC=*ON                                                       
     C                   UPDATE    SUFD                                                             
     C                   EVAL      ERRGRL=*ON                                                       
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
     C     HELPT         TAG                                                                        
     C     ERRGRL        CABEQ     *ON           SFLCMDT                                            
     C                   EXSR      CS_CLRK                                                          
     C                   IF        ZXFMT<>CCCFMT                                                    
     C                   EVAL      ACCREF=*ON                                                       
     C                   EVAL      ZXCOUNT=1                                                        
     C     CCCFMT        CASEQ     ' '           S01CLR                                             
     C     CCCFMT        CASEQ     '0'           S01CLR                                             
     C     CCCFMT        CASEQ     '1'           S01CLR                                             
     C                   CAS                     S01CLR                                             
     C                   ENDCS                                                                      
     C                   ENDIF                                                                      
      * F05=REFRESCAR PANTALLA                                                                      
     C                   WHEN      REFRES=*ON                                                       
     C                   EXSR      CS_RSTFK                                                         
     C                   EVAL      ZXOPT2='CLR'                                                     
      * F06=CREAR REGISTRE                                                                          
     C                   WHEN      CREATE=*ON                                                       
     C                   EVAL      @PEOPT='1 '                                                      
     C                   CALL      'DO0035'                                                         
     C                   PARM      ZZCIAS        @PECIAS                                            
     C                   PARM      SUFPRIO       @PEPRIO                                            
     C                   PARM      @PDLGA        @PEDLGA                                            
     C                   PARM      *BLANKS       @PEPRVR                                            
     C                   PARM      *BLANKS       @PEARVT                                            
     C                   PARM      *BLANKS       @PEFAMT                                            
     C                   PARM      @PTREG        @PETREG                                            
     C                   PARM      ZZCIAS        @PECIA2                                            
     C                   PARM      *BLANKS       @PEMAGA                                            
     C                   PARM      '1 '          @POPCI                                             
     C                   PARM      *BLANKS       @PERRO                                             
     C                   EXSR      CS_RSTFK                                                         
     C                   EVAL      ZXOPT2='CLR'                                                     
      * F13=SETUP DEL PROGRAMA                                                                      
     C                   WHEN      SETUP=*ON                                                        
     C                   EVAL      ZXOPT='PA0CLR'                                                   
     C                   EVAL      ZXCOUNT=SFLPOS1                                                  
      * F09=LINEA DE MANDATO                                                                        
     C                   WHEN      *IN09=*ON                                                        
     C                   EVAL      ZXOPT2='DSP'                                                     
     C                   CALL      'QCMD'                                                           
      * PAGINAR                                                                                     
     C                   WHEN      ROLLUP=*ON                                                       
     C                   EVAL      ACCREF=*OFF                                                      
     C                   EVAL      ZXOPT2='INZ'                                                     
     C                   EVAL      CSRFILA=0                                                        
     C                   EVAL      CSRCOLU=0                                                        
      * PAGINAR                                                                                     
     C                   WHEN      ROLLDOWN=*ON                                                     
     C                   EVAL      ZXSEMF=*BLANKS                                                   
     C                   EXSR      CS_RSTFK                                                         
     C                   EXSR      CS_ROLLDOWN                                                      
     C                   EVAL      ACCREF=*OFF                                                      
     C                   EVAL      ZXOPT2='CLR'                                                     
     C                   EVAL      CSRFILA=0                                                        
     C                   EVAL      CSRCOLU=0                                                        
     C                   ENDSL                                                                      
      *                                                                                             
     C     SFLCMDT       TAG                                                                        
     C                   IF        ERRGRL=*ON AND ACCREF=*ON                                        
     C                   EVAL      ACCREF=*OFF                                                      
     C                   ENDIF                                                                      
      *                                                                                             
     C                   ENDSR                                                                      
      **************************************************************                                
      * COMMON SUBRUTINE (CS_) :                                  *                                 
      * SUBRUTINA VALIDACIÓ DEL SFL: FORMAT SFL I OPCIONS          *                                
      *------------------------------------------------------------*                                
     C     CS_SFLCHK     BEGSR                                                                      
     C                   EVAL      ACCREF=*ON                                                       
     C                   SELECT                                                                     
      *                                                                                             
F-2OL * Validación del posicionamiento de cabecera                                                  
F-2OLC                   WHEN      PSUCLAV <> *BLANKS                                               
F-2OLC                   EVAL      ERRGRL=*OFF                                                      
F-2OLC                   EVAL      CSRCOLU=0                                                        
F-2OLC                   EVAL      CSRFILA=0                                                        
F-2OLC                   EVAL      ZXCOUNT=1                                                        
F-2OLC                   EXSR      CS_CLRK                                                          
F-2OLC                   EVAL      T4PRVR=PSUCLAV                                                   
F-2OLC                   EVAL      ZXOPT2='CLR'                                                     
F-2OL                                                                                               
      * Validacion clase de subarchivo (FORMAT DE LA PANTALLA)                                      
      *                                                                                             
     C                   WHEN      ZXFMT<>CCCFMT                                                    
     C                   EVAL      @PEFLD=*BLANKS                                                   
     C                   EVAL      @PEOPT=*BLANKS                                                   
     C                   EVAL      @PEFMT=*BLANKS                                                   
     C                   EVAL      @PEFLD='CFMT'                                                    
     C                   EVAL      @PEOPT=CCCFMT                                                    
     C                   CALL      'MMPROM'                                     Query-Aut-F4   X    
     C                   PARM                    @PEOPT                         PARM Qry-F4         
     C                   PARM      SDSPGM        @PEPGM                         PARM Qry-F4         
     C                   PARM                    @PEFMT                         PARM Qry-F4         
     C                   PARM                    @PEFLD                         PARM Qry-F4         
     C                   PARM      'V'           @PEERR                         PARM Qry-F4         
      *                                                                                             
     C                   IF        @PEERR>'0'                                                       
     C                   EVAL      ZXFMT=CCCFMT                                                     
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      WRk40=*ON                                                        
     C                   EVAL      MSGER='ASV1003'                                                  
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           SFLCHKT                                            
      * Si el subarchivo es valido continuo                                                         
     C                   EVAL      ZXCOUNT=1                                                        
     C                   EVAL      ZXOPT1='S01'                                                     
     C                   EVAL      ZXOPT2='CLR'                                                     
     C                   IF        CCCFMT=' ' OR CCCFMT='0'                                         
     C                   EXSR      CS_CLRK                                                          
     C                   EVAL      ZXOPT1='S01'                                                     
     C                   ENDIF                                                                      
      *                                                                                             
     C                   IF        CCCFMT='1'                                                       
     C                   EXSR      CS_CLRK                                                          
     C                   EVAL      ZXOPT1='S01'                                                     
     C                   ENDIF                                                                      
      *                                                                                             
     C                   OTHER                                                                      
     C                   EXSR      CS_CHKOPT                                                        
     C     ERRGRL        CABEQ     *ON           SFLCHKT                                            
     C                   ENDSL                                                                      
      *                                                                                             
     C     SFLCHKT       TAG                                                                        
     C                   IF        ERRGRL=*ON AND ACCREF=*ON                                        
     C                   EVAL      ACCREF=*OFF                                                      
     C                   ENDIF                                                                      
      *                                                                                             
     C                   ENDSR                                                                      
      **************************************************************                                
      * COMMON SUBRUTINE (CS_) :                                  *                                 
      * SUBRUTINA DE 1er REGISTRE DE PANTALLA DE SUBARXIUS         *                                
      *------------------------------------------------------------*                                
     C     CS_RSTFK      BEGSR                                                                      
     C                   EVAL      T4CIA1=ZXCIAS_1                                                  
     C                   EVAL      T4MAGA=ZXMAGA_1                                                  
     C                   EVAL      T4PRIO=ZXPRIO_1                                                  
FGI25c                   eval      t4famt=zxfamt_1                                                  
     C     RSTFKT        ENDSR                                                                      
      **************************************************************                                
      * COMMON SUBRUTINE (CS_) :                                  *                                 
      * SUBRUTINA DE NETEJA DE CAMPS DE POSIBLES CLAUS             *                                
      *------------------------------------------------------------*                                
     C     CS_CLRK       BEGSR                                                                      
     C                   CLEAR                   T4CIA1                                             
     C                   CLEAR                   T4PRIO                                             
     C                   CLEAR                   T4MAGA                                             
FGI25c                   clear                   t4famt                                             
     C     CLRKT         ENDSR                                                                      
      **************************************************************                                
      * COMMON SUBRUTINE (CS_) :                                  *                                 
      * SUBRUTINA DE TRATAMIENTO DE OPCIONES EN SUBARCHIVO         *                                
      *------------------------------------------------------------*                                
     C     CS_CHKOPT     BEGSR                                                                      
      * Validacion clase de subarchivo                                                              
     C                   EVAL      @PEFLD=*BLANKS                                                   
     C                   EVAL      @PEOPT=*BLANKS                                                   
     C                   EVAL      @PEFMT=*BLANKS                                                   
     C                   EVAL      @PEFLD='CFMT'                                                    
     C                   EVAL      @PEOPT=CCCFMT                                                    
     C                   CALL      'MMPROM'                                     Query-Aut-F4   X    
     C                   PARM                    @PEOPT                         PARM Qry-F4         
     C                   PARM      SDSPGM        @PEPGM                         PARM Qry-F4         
     C                   PARM                    @PEFMT                         PARM Qry-F4         
     C                   PARM                    @PEFLD                         PARM Qry-F4         
     C                   PARM      'V'           @PEERR                         PARM Qry-F4         
      *                                                                                             
     C                   IF        @PEERR>'0'                                                       
     C                   EVAL      ZXFMT=CCCFMT                                                     
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      WRk40=*ON                                                        
     C                   EVAL      MSGER='ASV1003'                                                  
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           CHKOPTT                                            
      *                                                                                             
      * VALIDACIO DE LES OPCIONS DE DETALL DEL SFL                                                  
      *                                                                                             
     C                   EVAL      ACCREF=*OFF                                                      
     C                   EVAL      EOF=*OFF                                                         
     C                   IF        SFLDSP=*ON                                                       
      *                                                                                             
     C                   DO        *HIVAL                                                           
     C                   READC     SUFD                                   82                        
     C                   IF        EOF=*ON                                                          
     C                   LEAVE                                                                      
     C                   ENDIF                                                                      
     C                   EVAL      ACCREF=*ON                                                       
     C****               EXSR      CS_RSTFK                                                         
     C                   EVAL      ZXOPT2='CLR'                                                     
      * Validacion opciones de subarchivo                                                           
     C                   EVAL      SFLNXC=*OFF                                                      
     C                   IF        SUFOPCI=*BLANKS                                                  
     C                   GOTO      TNEXOPC                                                          
     C                   ELSE                                                                       
     C                   EVAL      ZXCOUNT=ZXNRR00                                                  
     C                   ENDIF                                                                      
     C                   EVAL      @PEFLD=*BLANKS                                                   
     C                   EVAL      @PEFMT=*BLANKS                                                   
     C                   EVAL      @PEFLD='OPCI'                                                    
     C                   EVAL      @PEOPT=SUFOPCI                                                   
     C                   EVAL      @PEPGM=SDSPGM                                                    
     C                   EXSR      CS_SECMDOP                                                       
     C                   IF        ERRGRL=*ON                                                       
     C                   EVAL      WRK41=*ON                                                        
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TNEXOPC                                            
      *                                                                                             
     C                   EVAL      T4PRIO=SUFPRIO                                                   
     C     KEDPAR2       CHAIN(N)  EDPAR2                             81                            
     C                   IF        CHAIN=*ON                                                        
     C                             OR (SUFBAJA='*' AND (                                            
     C                                @PEOPT=' 2' OR @PEOPT='2 '                MODIFICAR           
     C                             OR @PEOPT=' 3' OR @PEOPT='3 '                MODIFICAR           
     C                             OR @PEOPT='15'                               MODIFICAR           
     C                             OR @PEOPT=' 4' OR @PEOPT='4 '))              MODIFICAR           
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      WRK41=*ON                                                        
     C                   EVAL      SFLNXC=*ON                                                       
     C                   EVAL      MSGER='MSG0064'                                                  
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TNEXOPC                                            
      *                                                     *                                       
      *                                                     *                                       
      *                                                     *                                       
     C                   SELECT                                                                     
     C                   WHEN      @PEOPT=' 2' OR @PEOPT='2 '                   MODIFICAR           
     C                             OR @PEOPT=' 3' OR @PEOPT='3 '                MODIFICAR           
     C                             OR @PEOPT=' 4' OR @PEOPT='4 '                MODIFICAR           
     C                             OR @PEOPT=' 5' OR @PEOPT='5 '                MODIFICAR           
     C                   CALL      'DO0035'                                                         
     C                   PARM      ZZCIAS        @PECIAS                                            
     C                   PARM      SUFPRIO       @PEPRIO                                            
     C                   PARM      @PDLGA        @PEDLGA                                            
     C                   PARM      SUFPRVR       @PEPRVR                                            
     C                   PARM      SUFARVT       @PEARVT                                            
     C                   PARM      SUFFAMT       @PEFAMT                                            
     C                   PARM      @PTREG        @PETREG                                            
     C                   PARM      ZZCIAS        @PECIA2                                            
     C                   PARM      SUFMAGA       @PEMAGA                                            
     C                   PARM      SUFOPCI       @PEOPT                                             
     C                   PARM      *BLANKS       @PEERR                                             
     C                   EVAL      SUFOPCI=*BLANKS                                                  
     C                   EVAL      SFLNXC=*OFF                                                      
      *                                                                                             
     C                   WHEN      @PEOPT='15'                                  MODIFICAR           
     C                   CALL      'DO0020'                                                         
     C                   PARM      ZZCIAS        @PECIAS                                            
     C                   PARM      @PDLGA        @PEDLGA                                            
     C                   PARM      SUFPRIO       @PEPRIO                                            
     C                   PARM      SUFPRVR       @PEPRVR                                            
     C                   PARM      SUFARVT       @PEARVT                                            
     C                   PARM      SUFFAMT       @PEFAMT                                            
     C                   PARM      @PTREG        @PETREG                                            
     C                   PARM      ZZCIAS        @PECIA2                                            
     C                   PARM      SUFMAGA       @PEMAGA                                            
     C                   PARM      SUFOPCI       @PEOPT                                             
     C                   PARM      *BLANKS       @PEERR                                             
     C                   EVAL      SUFOPCI=*BLANKS                                                  
     C                   EVAL      SFLNXC=*OFF                                                      
     C                   ENDSL                                                                      
      *                                                                                             
     C     TNEXOPC       TAG                                                                        
     C                   UPDATE    SUFD                                                             
     C                   IF        ERRGRL=*ON                                                       
     C                   EVAL      ZXOPT2='DSP'                                                     
     C                   EVAL      ZXCOUNT=ZXNRR00                                                  
     C                   EXSR      CS_POSCER0                                                       
     C                   LEAVE                                                                      
     C                   ENDIF                                                                      
     C                   ENDDO                                                                      
      * Si existen errores entonces mantengo la posicion del primer error                           
      * y muestro pantalla                                                                          
     C                   ENDIF                                                                      
                                                                                                    
     C                   IF        ERRGRL=*OFF                                                      
     C                   EXSR      CS_RSTFK                                                         
     C                   EXSR      CS_POSCER0                                                       
     C                   ENDIF                                                                      
                                                                                                    
     C     CHKOPTT       ENDSR                                                                      
      **************************************************************                                
      * COMMON SUBRUTINE (CS_) :                                  *                                 
      * SUBRUTINA DE POSICIONAMENT DEL CURSOR                      *                                
      *------------------------------------------------------------*                                
     C     CS_POSCUR     BEGSR                                                                      
     C* Línea de subarchivo donde se encuentra el cursor                                            
     C     SFLPOCUR      DIV       256           CSRFILA                                            
     C                   MVR                     CSRCOLU                                            
     C                   ENDSR                                                                      
      **************************************************************                                
      * COMMON SUBRUTINE (CS_) :                                  *                                 
      * SUBRUTINA DE POSICIONAMENT DEL CURSOR                      *                                
      *------------------------------------------------------------*                                
     C     CS_POSCER0    BEGSR                                                                      
     C* Línea de subarchivo donde se posiciona cursor si error en opción                            
     C                   IF        ZXLIPAG<>0                                                       
     C     ZXCOUNT       DIV       ZXLIPA2       ZXAU15                                             
     C                   MVR                     CSRFILA                                            
     C                   IF        CSRFILA=0 AND ZXAU15>0                                           
     C                   EVAL      CSRFILA=ZXLIPA2                                                  
     C                   ENDIF                                                                      
     C                   EVAL      CSRFILA=CSRFILA+9-1                                              
     C                   ENDIF                                                                      
     C                   EVAL      CSRCOLU=4                                                        
     C                   IF        CSRFILA<=0                                                       
     C                   EVAL      CSRFILA=0                                                        
     C                   EVAL      CSRCOLU=0                                                        
     C                   ENDIF                                                                      
      *                                                                                             
     C                   ENDSR                                                                      
      **************************************************************                                
      * COMMON SUBRUTINE (CS_) :                                  *                                 
      * SUBRUTINA VISUALITZACIÓ SFL                                *                                
      *------------------------------------------------------------*                                
     C     CS_SFLDSP     BEGSR                                                                      
     C                   EVAL      ZXOPT2='CMD'                                                     
      * Posicionament en el subarxiu si no s'ha realitzat cap acció                                 
     C                   IF        ACCREF=*OFF AND SFLDSP=*ON                                       
     C                   EVAL      SUFRCDN=ZXCOUNT                                                  
     C                   ENDIF                                                                      
      *                                                                                             
F-2OLC                   CLEAR                   PSUCLAV                                            
     C                   WRITE     SUFP                                         SI REGS             
     C                   EXFMT     SUFC                                                             
     C* Guardem el nº de registre que es visualitza actualment per no                               
     C* canviar de pàgina si no fan res                                                             
     C                   EVAL      ZXCOUNT=SFLPOS1                                                  
     C                   EVAL      ERRGRL=*OFF                                                      
     C                   EVAL      MSGER=*BLANKS                                                    
     C                   MOVEA     ZXZERO10      *IN(40)                                            
     C*                  MOVEA     ZXZERO10      *IN(50)                                            
     C     SFLDSPT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA PER MOURE CAMPS AL SFL                           *                                
      *------------------------------------------------------------*                                
     C     S01MFP        BEGSR                                                                      
     C                   EVAL      SUFOPCI=*BLANKS                                                  
     C                   EVAL      SFLNXC=*OFF                                                      
      *                  MOVEL     T4CIA1        S01CIAS                                            
     C                   EVAL      SUFBAJA=T4BAJA                                                   
     C                   IF        T4BAJA='1'                                                       
     C                   EVAL      SUFBAJA='*'                                                      
     C                   ENDIF                                                                      
     C                   SELECT                                                                     
      * POR PROVEEDOR                                                                               
     C                   WHEN      @PTREG='B'                                                       
     C                   EVAL      C0PRVR=T4PRVR                                                    
     C     KPUPROV       CHAIN     PUPROV                                                           
     C                   EVAL      SB1PRVR=C0PRVR                                                   
     C                   EVAL      SB1DESC=C0DES1                                                   
     C                   EVAL      SUFDATA=WBDATA                                                   
      * POR ARTICULO                                                                                
     C                   WHEN      @PTREG='C'                                                       
     C                   EVAL      M5ARTI=%SUBST(T4ARVT:1:15)                                       
     C                   EVAL      M5VARI=%SUBST(T4ARVT:16:3)                                       
     C                   EVAL      M5MODE=%SUBST(T4ARVT:19:3)                                       
     C     KMSARTI00     CHAIN     MSARTI00                                                         
     C                   EVAL      SC1ARVT=T4ARVT                                                   
     C                   EVAL      SC1DESC=M5DES1                                                   
     C                   EVAL      SUFDATA=WCDATA                                                   
     C                                                                                              
      * POR FAMILIA                                                                                 
     C                   WHEN      @PTREG='D'                                                       
     C                   EVAL      PECTAB='FMIL'                                                    
     C                   EVAL      PECLTA=%TRIM(T4FAMT)                                             
     C     KPMTABD       CHAIN     PMTABD                                                           
     C                   EVAL      SD1FAMI=%TRIM(T4FAMT)                                            
     C                   EVAL      SD1DESC=PEDESC                                                   
     C                   EVAL      SUFDATA=WDDATA                                                   
      * POR FAMILIA/SUBFAMILIA                                                                      
     C                   WHEN      @PTREG='E'                                                       
     C                   EVAL      MNFMIL=%SUBST(T4FAMT:1:3)                                        
     C                   EVAL      MNSMIL=%SUBST(T4FAMT:4:3)                                        
     C     KMSFAMI       CHAIN     MSFAMI                                                           
     C                   EVAL      SE1SFAM=%SUBST(T4FAMT:1:3)+' '+                                  
     C                                     %SUBST(T4FAMT:4:3)                                       
     C                   EVAL      SE1DESC=MNDES1                                                   
     C                   EVAL      SUFDATA=WEDATA                                                   
     C                                                                                              
      * POR FAMILIA TARIFA                                                                          
     C                   WHEN      @PTREG='F'                                                       
     C                   EVAL      PECTAB='CSFA'                                                    
     C                   EVAL      PECLTA=%TRIM(T4FAMT)                                             
     C     KPMTABD       CHAIN     PMTABD                                                           
     C                   IF        NOT%FOUND                                                        
     C                   EVAL      PECTAB='CSF2'                                                    
     C     KPMTABD       CHAIN     PMTABD                                                           
     C                   ENDIF                                                                      
     C                   EVAL      SF1FAMT=%TRIM(T4FAMT)                                            
     C                   EVAL      SF1DESC=PEDESC                                                   
     C                   EVAL      SUFDATA=WFDATA                                                   
      * POR CLIENTE                                                                                 
     C                   WHEN      @PTREG='G'                                                       
     C                   EVAL      S0CIAS=@PCIAS                                                    
F-2OLC                   EVAL      S0CUST=T4PRVR                                                    
     C     KCOCLIN       CHAIN     COCLIN                                                           
     C                   EVAL      SG1CUST=S0CUST                                                   
     C                   EVAL      SG1DESC=S0DES1                                                   
     C                   EVAL      SUFDATA=WGDATA                                                   
      * POR PROCEDENCIA DE PEDIDO                                                                   
     C                   WHEN      @PTREG='H'                                                       
     C                   EVAL      PECTAB='PPED'                                                    
     C                   EVAL      PECLTA=%TRIM(T4FAMT)                                             
     C     KPMTABD       CHAIN     PMTABD                                                           
     C                   EVAL      SF1FAMT=%TRIM(T4FAMT)                                            
     C                   EVAL      SF1DESC=PEDESC                                                   
     C                   EVAL      SUFDATA=WFDATA                                                   
FGI25 * POR PROCEDENCIA DE PEDIDO                                                                   
FGI25C                   when      @ptreg='M'                                                       
FGI25C                   eval      t1ctab='MTSO'                                                    
FGI25C                   eval      t1cele=%trim(t4famt)                                             
FGI25C     kgmtabd00     chain     gmtabd00                                                         
FGI25C                   eval      SF1FAMT=%trim(t4famt)                                            
FGI25C                   EVAL      SF1DESC=t1desc                                                   
FGI25C                   EVAL      SUFDATA=WFDATA                                                   
     C                   ENDSL                                                                      
      *                                                                                             
     C                   EXSR      CS_KEYPF                                                         
      *                  EVAL      SUFDATA=W1DATA                                                   
     C     S01MFPT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA QUE GUARDA LAS CLAVES DE TODOS TIPOS DE SFL      *                                
      *------------------------------------------------------------*                                
     C     CS_KEYPF      BEGSR                                                                      
     C                   EVAL      SUFPRIO=T4PRIO                                                   
F-2OLC                   EVAL      SUFTREG=T4TREG                                                   
F-2OLC                   EVAL      SUFDLGA=T4DLGA                                                   
F-2OLC                   EVAL      SUFPRVR=T4PRVR                                                   
FGI25c                   eval      suffamt=t4famt                                                   
F-2OLc*    T4ARVT                                                                                   
     C                   EVAL      SUFARVT=T4ARVT                                                   
     C                   EVAL      SUFFAMT=T4FAMT                                                   
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA QUE SELECCIONA REGISTROS DE SUBARCHIVO           *                                
      *------------------------------------------------------------*                                
     C     CS_SELSFL     BEGSR                                                                      
                                                                                                    
     C                   EVAL      ZXSELSFL=0                                                       
     C                   IF        T4PRIO<>0                                                        
     C                   EVAL      ZXSELSFL=1                                                       
     C                   GOTO      SELSFLRT                                                         
     C                   ENDIF                                                                      
                                                                                                    
     C                   IF        T4TREG<>@PTREG                                                   
     C                   EVAL      ZXSELSFL=1                                                       
     C                   GOTO      SELSFLRT                                                         
     C                   ENDIF                                                                      
                                                                                                    
     C                   IF        T4DLGA<>@PDLGA                                                   
     C                   EVAL      ZXSELSFL=1                                                       
     C                   GOTO      SELSFLRT                                                         
     C                   ENDIF                                                                      
                                                                                                    
     C     SELSFLRT      ENDSR                                                                      
      **************************************************************                                
      * Busca nueva situación del SFL.                             *                                
      *------------------------------------------------------------*                                
     C     CS_ROLLDOWN   BEGSR                                                                      
      *                                                                                             
     C                   RESET                   ZXLOP00                                            
     C                   RESET                   ZXLIPAG                                            
F-2OLC*                  RESET                   ZXNRR00                                            
     C                   EVAL      ZXCOUNT=1                                                        
      *                                                                                             
     C                   IF        ZXSEMF=*BLANKS                                                   
     C                   EVAL      ZXLIPAG=ZXLIPAG+1                                                
     C                   ENDIF                                                                      
      *                                                                                             
     C                   SELECT                                                                     
     C                   WHEN      CCCFMT='1'                                                       
F-2OLC     KEDPAR2       SETGT     EDPAR2                                                           
F-2OLC*    KEDPAR2       SETLL     EDPAR2                                                           
     C                   ENDSL                                                                      
      *                                                                                             
     C                   DOW       ZXLOP00 < ZXLIPAG                                                
     C                   SELECT                                                                     
     C                   WHEN      CCCFMT='1'                                                       
F-2OLC                   READP(N)  EDPAR2                                 82                        
F-2OLC                   EVAL      ZXNRR00=ZXNRR00 + 1                                              
     C                   ENDSL                                                                      
F-2OL *                                                                                             
      *                                                                                             
F-2OL *                                                                                             
F-2OL *                                                                                             
     C                   IF        EOF=*ON                                                          
     C                   LEAVE                                                                      
     C                   ENDIF                                                                      
F-2OL *                                                                                             
     C                   EXSR      CS_SELSFL                                                        
     C                   IF        ZXSELSFL=1                                                       
     C                   GOTO      TNEXDOWN                                                         
     C                   ENDIF                                                                      
     C                   EVAL      ZXLOP00=ZXLOP00+1                                                
     C     TNEXDOWN      TAG                                                                        
     C                   ENDDO                                                                      
      *                                                                                             
     C                   IF        ZXSEMF=*BLANKS AND                                               
     C                             EOF=*ON        AND                                               
     C                             ZXLOP00=1                                                        
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='MSG0114'                                                  
     C                   ENDIF                                                                      
     C                   EVAL      ZXCOMCAR=0                                                       
     C                   EXSR      CS_SAVFK                                                         
     C                   EVAL      ZXSEMF=*BLANKS                                                   
      *                                                                                             
     C                   ENDSR                                                                      
      ******************************************************************************************    
     C* validación de opciones                                                                      
      ******************************************************************************************    
     C/COPY *LIBL/QSRDSRC,SRD030                                                                    
