      **************************************************************                                
      * APLICACIÓ: MÒDUL DE LOGISTICA                              *                                
      **************************************************************                                
      * TITOL: DO0053  © FLUIDRA SERVICES                          *                                
      * DATA CREACIO:  18/03/2010                                  *                                
      * FUNCIO DEL PROGRAMA: Mantenimiento Parámetros LOGÍSTICOS   *                                
      * (DSP/CRT/DLT/CPY/CHG)          (COPIA AMPLIADA ED0053)     *                                
      * DOCUMENTACIO:                                              *                                
      *                                                            *                                
      * ZXOPT1 = NOM DEL PROCÉS                                    *                                
      *        - PN = FORMAT DE PANTALLA N.(N=[01,02,...,99])      *                                
      *        - WN = WINDOWS N.(N=[01,02,...,99])                 *                                
      * ZXOPT2 = RUTINA DINTRE DEL PROCÉS                          *                                
      *        - 'INZ'= INICILITZAR                                *                                
      *        - 'DSP'= VISUALITZAR LA PANTALLA                    *                                
      *        - 'CMD'= VALIDACIÓ DE LES TECLES DE FUNCIÓ          *                                
      *        - 'CHK'= VALIDACIÓ DE LA PANTALLA                   *                                
      *        - 'CLR'= NETEJA LA PANTALLA                         *                                
      *        - 'UPD'= ACTUALITZACIONS DELS FITXERS               *                                
      *                                                            *                                
      **************************************************************                                
      * DATA DE MODIFICACIÓ: 17/11/2014  MARCA: C2238              *                                
      * AUTOR: JMARTINEZP                                          *                                
      * DOCUMENTACIÓ: OMITIR FLUIDRA EXPRESS                       *                                
      **************************************************************                                
NAP45* DATA DE MODIFICACIÓ: 03/06/2022  MARCA: NAP45              *                                
NAP45* AUTOR:        Raul Fernández                               *                                
NAP45* DOCUMENTACIÓ: Coger Coenvío por defecto de dlga= ' '       *                                
NAP45**************************************************************                                
FGI25 */ Date : 20/06/2025    Marca: FGI25         Moficicació: OLFGI-25                            
FGI25 */ Descripció: EXCEPCIÓN DOM EN ITALIA                                                        
FGI25 */ Autor: MMontana                                                                            
FGI25 */  Nueva excepción por categorización del articulo: MTO/MTS                                  
FGI25 */////////////////////////////////////////////////////////////////////////////////////////    
HDC74 */ Date : 25/02/2026    Marca: HDC74         Moficicació: NIHDC-74                            
HDC74 */ Descripció: Coenvio 3/4                                                                    
HDC74 */ Autor: MMontana                                                                            
HDC74 */  Es detecta solapament en la posició del nou parm. Es canvia a pos 61                      
HDC74 */////////////////////////////////////////////////////////////////////////////////////////    
SE257* DATA DE MODIFICACIÓ: 24/02/2026     MARCA: SE257           *                                
SE257* AUTOR              : Lluís Albert Grau                     *                                
SE257* DOCUMENTACIO       : Múltiples cargos por albaran.         *                                
SE257*                      Añadir múltiples líneas de            *                                
SE257*                      Portes/Cargo pedido en mismo albarán  *                                
SE257*                      AS400.                                *                                
SE257*                      SLE-257 / RITM0102095                 *                                
SE257**************************************************************                                
     H DATEDIT(*YMD/)                                                                               
                                                                                                    
     FDO0053FM  CF   E             WORKSTN INFDS(FMTDS)                                             
     FEDPARM    UF A E           K DISK    INFDS(FMFDS) INFSR(*PSSR)                                
     FEDPAR2    UF A E           K DISK                                                             
     FCODIST    IF   E           K DISK                                                             
     FPMEMPR    IF   E           K DISK                                                             
     FPMTAB2    IF   E           K DISK                                                             
     FMSARTI00  IF   E           K DISK                                                             
     FPMTABD    IF   E           K DISK                                                             
     FEDHPAR    O    E           K DISK                                                             
     FCODEPE    IF   E           K DISK                                                             
     FCOCAPE    IF   E           K DISK                                                             
FGI25fmsalma    if   e           k disk                                                             
                                                                                                    
     D* AREA DE DADES DE PROGRAMA I INICIALITZACIO DE VALORS COMUNS                                 
     D                SDS                                                                           
     D  SDSPGM                 1     10                                                             
     D    CCCPGM                     10    OVERLAY(SDSPGM)                                          
     D  SDSJOB               244    253                                                             
     D    CCCJOB                     10    OVERLAY(SDSJOB)                                          
     D  SDSUSR               254    263                                                             
     D  SDSJNBR              264    269                                                             
      *                                                                                             
      * PARÀMETRES PEL PRD650 I CAMPS DE TREBALL ASSOCIATS                                          
      * VALOR NUMÈRIC                                                                               
     D   PXNUM         S             29  9                                                          
      * VALOR ALFANUMÈRIC                                                                           
     D   PXALPH        S             29                                                             
      * LONGITUD TOTAL DEL CAMP (Nº CARÀCTERS INCLÒS CODI EDICIÓ)                                   
     D   PXFLDD        S              2  0 INZ(20)                                                  
      * Nº DE DECIMALS DEL CAMP                                                                     
     D  PXDCCD         S              1  0                                                          
      * TIPUS DE FORMAT DECIMAL (.,)                                                                
     D  PXFMD1         S                   LIKE(ZZFMD1)INZ                                          
      * CODI D'EDICIÓ (4,M,Q,Z)                                                                     
     D  PXEDT1         S                   LIKE(ZZEDTC)INZ('4')                                     
     D  PXEDTC         S                   LIKE(ZZEDTC)INZ('M')                                     
     D  PXEDT2         S                   LIKE(ZZEDTC)INZ('K')                                     
      * RETORN CODI D'ERROR                                                                         
     D  PXNMER         S              1  0 INZ(0)                                                   
      * TIPUS D'AJUST DECIMAL (0=MIG 1=PER SOBRE 2=PER SOTA)                                        
     D  PXTIPA         S                   LIKE(ZZAJUD)                                             
                                                                                                    
      * AREA DE DADES LOCAL I INICIALITZACIO DE VALORS COMUNS                                       
     D DSLDA         E DS                  EXTNAME(PURLDADS)                                        
     D    CCCDEEM                    30    OVERLAY(ZZDEEM)                                          
                                                                                                    
     D* AREA DE DADES D'INFORMACIÓ ARXIU                                                            
     D  FMTDS          DS                                                                           
     D    FMTPOCUR           370    371B 0                                                          
     D    FMTPOS             378    379B 0                                                          
     D    FMTRCD         *RECORD                                                                    
     D  FMFDS          DS                                                                           
     D    FMFFILE        *FILE                                                                      
     D    FMFSTS         *STATUS                                                                    
                                                                                                    
     D* CONTROL DEL FLUXE DEL PROGRAMA                                                              
     D                 DS                                                                           
     D  ZXOPT                  1      6                                                             
     D    ZXOPT1               1      3                                                             
     D    ZXOPT2               4      6                                                             
                                                                                                    
     D* Descomposicion de FIELD para tomar la parte del diccionario                                 
     D                 DS                                                                           
     D  FIELD                  1     10                                                             
     D    ZXFMTO               1      3                                                             
     D    ZXFIE4               4      7                                                             
      * PLANTILLA D'INDICADORS DEL PROGRAMA (ELS RESERVATS NO SURTEN)                               
     D  INDICADORS   E DS                  BASED(INDICADORP)                                        
     D                                     EXTNAME(INDDS:RIND0199)                                  
     D    INDCHG                      1    OVERLAY(WRK25)                                           
     D    INDCPY                      1    OVERLAY(WRK26)                                           
     D    INDDLT                      1    OVERLAY(WRK27)                                           
     D    INDDSP                      1    OVERLAY(WRK28)                                           
     D    INDCRT                      1    OVERLAY(WRK29)                                           
     D    INDPROT                     1    OVERLAY(SETL00)                                          
     D  INDICADORP     S               *   INZ(%ADDR(*IN))                                          
                                                                                                    
     D                 DS                                                                           
     D  ZXPOSCUR               1      4  2                                                          
     D    ZXPOSX               1      2  0                                                          
     D    ZXPOSY               3      4  0                                                          
      * Definicion de algunas constantes                                                            
     D  ZXZERO10       C                   '0000000000'                                             
      *IMPORTACIÓ DE PARÀMETRES                                                                     
                                                                                                    
     D  @PCIAS         S                   LIKE(T3CIAS)                                             
     D  @PDLGA         S                   LIKE(T3DLGA)                                             
     D  @POPCI         S              2                                                             
     D  @PERRO         S              1                                                             
     D  @PCLTA         S             10    INZ                                                      
     D  @PCTAB         S             10    INZ                                                      
                                                                                                    
FGI25D bDoomV3         s               n   inz(*off)                                                
FGI25 *                                                                                             
     D  @PFILE         S             10                                                             
     D  @PPGM          S             10                                                             
     D  @POBJE         S             10                                                             
     D  @PTOBJ         S             10                                                             
     D  @JOBD          S             10                                                             
     D  @TIPD          S             10                                                             
                                                                                                    
      *EXPORTACIÓ DE PARÀMETRES                                                                     
                                                                                                    
     D    @PEOPT       S              2                                                             
     D    @PEPGM       S                   LIKE(SDSPGM) INZ                                         
     D    @PEFMT       S                   LIKE(RECORD) INZ                                         
     D    @PEFLD       S                   LIKE(FIELD)  INZ                                         
     D    @PEERR       S              1                 INZ                                         
     D  ZXLIMP         S                   LIKE(T3LIMP)                                             
     D  ZXLIME         S                   LIKE(T3LIME)                                             
     D  ZXPRIM         S              1  0                                                          
     D                                                                                              
     D                 DS                                                                           
     D  ZXARVM                 1     25                                                             
     D    ZXARTI               1     15                                                             
     D    ZXVARI              16     18                                                             
     D    ZXMODE              19     21                                                             
     D                                                                                              
      *                                                                                             
SE257D                 DS                                                                           
SE257D  ZXARMP                 1     25                                                             
SE257D    ZXARTI2              1     15                                                             
SE257D    ZXVARI2             16     18                                                             
SE257D    ZXMODE2             19     21                                                             
SE257D                                                                                              
SE257 *                                                                                             
     D  T3AMPL         DS                                                                           
     D     T3OPL1              1      3                                                             
     D     T3OPL2              4      6                                                             
     D     T3RESE              7      7                                                             
     D     T3RTRE              8      8                                                             
     D     T3LVIR              9     11                                                             
     D     T3VFYB             12     12                                                             
     D     T3ADOM             14     14                                                             
     D     T3PNFE             16     18                                                             
C2238D     T3OFEX             19     19                                                             
HDC74d     T3MTOS             61     65                                                             
HDC74 *FGI25d     T3MTOS             40     44                                                      
                                                                                                    
      * DEFINICIO DE CAMPS DE TREBALL                                                               
     D  Z_P            S              2  0 INZ(1)                                                   
     D  ZXPTRETORN     S              6A   INZ                                                      
NAP45D  ZXOCOE         S              1                                                             
      *                                                                                             
     D                 DS                                                                           
     D  P7AMPL                 1    100                                                             
     D    P7AUTS              59     59                                                             
     D    P7ZOAU              60     62                                                             
     D    P7ZOAL              63     65                                                             
     D    P7ZONR              66     68                                                             
     D    P7OCOE              93     93                                                             
      *                                                                                             
     IRPMTAB2                                                                                       
     I              PECIAS                      XXCIAS                                              
      **************************************************************                                
      * RUTINA PRINCIPAL DEL PGM : DISTRIBUCIÓ DEL PAS PELS FMTS   *                                
      *------------------------------------------------------------*                                
     C     ZXOPT1        DOWNE     'END'                                                            
     C     ZXOPT1        CASEQ     'P10'         P10MAIN                                            
     C     ZXOPT1        CASEQ     'P2A'         P2AMAIN                                            
     C     ZXOPT1        CASEQ     'P30'         P30MAIN                                            
     C     ZXOPT1        CASEQ     'P40'         P40MAIN                                            
     C                   CAS                     P2AMAIN                                            
     C                   ENDCS                                                                      
     C                   ENDDO                                                                      
     C                   SETON                                        LR                            
      **************************************************************                                
      * SUBRUTINA INICIAL                                          *                                
      *------------------------------------------------------------*                                
     C     *INZSR        BEGSR                                                                      
                                                                                                    
      * Entrada de parámetros                                                                       
     C     *ENTRY        PLIST                                                                      
     C                   PARM                    @PCIAS                                             
     C                   PARM                    @PDLGA                                             
     C                   PARM                    @POPCI                                             
     C                   PARM                    @PERRO                                             
FGI25 *                                                                                             
FGI25C     kmsalma       klist                                                                      
FGI25C                   kfld                    m0cias                                             
FGI25C                   kfld                    m0maga                                             
      *                                                                                             
     C     KPMEMPR       KLIST                                                                      
     C                   KFLD                    P7CIAS                                             
     C                   KFLD                    P7DLGA                                             
      *                                                                                             
     C     KEDPARM       KLIST                                                                      
     C                   KFLD                    T3CIAS                                             
     C                   KFLD                    T3DLGA                                             
                                                                                                    
     C     KPMTAB2       KLIST                                                                      
     C                   KFLD                    PECTAB                                             
     C                   KFLD                    PECLTA                                             
      *                                                                                             
                                                                                                    
     C     KPMTABD       KLIST                                                                      
     C                   KFLD                    PECIAS                                             
     C                   KFLD                    PECTAB                                             
     C                   KFLD                    PECLTA                                             
                                                                                                    
     C     KMSARTI00     KLIST                                                                      
     C                   KFLD                    M5CIAS                                             
     C                   KFLD                    M5ARTI                                             
     C                   KFLD                    M5VARI                                             
     C                   KFLD                    M5MODE                                             
                                                                                                    
     C     KEDPAR2       KLIST                                                                      
     C                   KFLD                    T4CIA1                                             
     C                   KFLD                    T4TREG                                             
     C                   KFLD                    T4DLGA                                             
     C                   KFLD                    T4PRVR                                             
     C                   KFLD                    T4ARVT                                             
     C                   KFLD                    T4FAMT                                             
                                                                                                    
     C     KCODIST       KLIST                                                                      
     C                   KFLD                    S2CIAS                                             
     C                   KFLD                    S2CSTO                                             
                                                                                                    
      * RECUPERACIÓ DE LA LDA DE COMPRES                                                            
     C     *DTAARA       DEFINE    PURLDA        DSLDA                                              
     C                   IN        DSLDA                                                            
                                                                                                    
      * TITOLS DE PANTALLES (CODIS D'ARXIU DE MISSATGES)                                            
     C                   EVAL      CCCCTIT='TDO0010'                                                
                                                                                                    
      * VALORES COMUNES                                                                             
     C                   EVAL      T3CIAS=@PCIAS                                                    
     C                   EVAL      T3DLGA=@PDLGA                                                    
     C                   EVAL      M5CIAS=@PCIAS                                                    
     C                   EVAL      PECIAS=@PCIAS                                                    
     C                   EVAL      T4CIA1=@PCIAS                                                    
     C                   EVAL      T4TREG=*BLANKS                                                   
     C                   EVAL      T4DLGA=@PDLGA                                                    
     C                   EVAL      T4PRVR=*BLANKS                                                   
     C                   EVAL      T4ARVT=*BLANKS                                                   
     C                   EVAL      T4FAMT=*BLANKS                                                   
      *                                                                                             
      * ENS POSICIONEM EN EL FORMAT DE PANT. SEGONS NECESSITAT.                                     
      * POR DEFECTO IREMOS A LA 2ª PANTALLA                                                         
     C                   EVAL      INDCHG=*ON                                                       
     C                   EVAL      ZXOPT='P2ACLR'                                                   
                                                                                                    
     C                   SELECT                                                                     
      * CRT                                                                                         
     C                   WHEN      @POPCI=' 1' OR @POPCI='1 '                                       
     C                   EVAL      ZXOPT='P10CLR'                                                   
     C                   EVAL      INDCRT=*ON                                                       
                                                                                                    
     C                   WHEN      @POPCI='1B'                                                      
     C                   EVAL      ZXOPT='P2ACLR'                                                   
     C                   EVAL      INDCRT=*ON                                                       
      * CPY                                                                                         
     C                   WHEN      @POPCI=' 3' OR @POPCI='3 '                                       
     C                   EVAL      ZXOPT='P30CLR'                                                   
     C                   EVAL      INDCPY=*ON                                                       
      * DLT                                                                                         
     C                   WHEN      @POPCI=' 4' OR @POPCI='4 '                                       
     C                   EVAL      ZXOPT='P40CLR'                                                   
     C                   EVAL      INDDLT=*ON                                                       
      * DSP                                                                                         
     C                   WHEN      @POPCI=' 5' OR @POPCI='5 '                                       
     C                   EVAL      INDDSP=*ON                                                       
     C                   EVAL      INDPROT=*ON                                                      
     C                   ENDSL                                                                      
                                                                                                    
     C                   EVAL      ZXPRIM=1                                                         
FGI25* Recuperar si estamos en Doom v3                                                             
FGI25C                   EVAL      P7CIAS=@PCIAS                                                    
FGI25C                   EVAL      P7DLGA=' '                                                       
FGI25c                   eval      bDoomV3 = *off                                                   
FGI25C     KPMEMPR       CHAIN     PMEMPR                                                           
FGI25C                   if        %found                                                           
FGI25c                   eval      bDoomV3 = (%subst(p7amp2:11:1) = '1')                            
FGI25C                   endif                                                                      
                                                                                                    
     C                   EVAL      SETL01=*ON                                                       
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA CONTROL DEL FMT P10                              *                                
      *------------------------------------------------------------*                                
     C     P10MAIN       BEGSR                                                                      
     C                   DOW       ZXOPT1='P10'                                                     
     C     ZXOPT2        CASEQ     'CLR'         P10CLR                                             
     C     ZXOPT2        CASEQ     'INZ'         P10INZ                                             
     C     ZXOPT2        CASEQ     'DSP'         P10DSP                                             
     C     ZXOPT2        CASEQ     'CMD'         P10CMD                                             
     C     ZXOPT2        CASEQ     'CHK'         P10CHK                                             
     C     ZXOPT2        CASEQ     'UPD'         P10UPD                                             
     C                   ENDCS                                                                      
     C                   ENDDO                                                                      
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA INICIALITZACIÓ DEL FMT P10                       *                                
      *------------------------------------------------------------*                                
     C     P10CLR        BEGSR                                                                      
      * ENS ENCARREGUEM QUE EL PROPER PAS SIGUI VISUALITZAR P10                                     
     C                   EVAL      ZXOPT2='INZ'                                                     
     C                   MOVEA     ZXZERO10      *IN(30)                                            
     C                   MOVEA     ZXZERO10      *IN(40)                                            
     C                   MOVEA     ZXZERO10      *IN(50)                                            
     C                   MOVEA     ZXZERO10      *IN(60)                                            
     C                   EVAL      CSRFILA=0                                                        
     C                   EVAL      CSRCOLU=0                                                        
     C                   RESET                   Z_P                                                
     C     P10CLRT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA INICIALITZACIÓ DEL FMT P10                       *                                
      *------------------------------------------------------------*                                
     C     P10INZ        BEGSR                                                                      
      * ENS ENCARREGUEM QUE EL PROPER PAS SIGUI VISUALITZAR P10                                     
     C                   EVAL      ZXOPT2='DSP'                                                     
     C     P10INZT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VISUALITZACIÓ DEL FMT P10                        *                                
      *------------------------------------------------------------*                                
     C     P10DSP        BEGSR                                                                      
      * ENS ENCARREGUEM QUE EL PROPER PAS SIGUI COMPROVAR ENTRADA CMD                               
     C                   EVAL      ZXOPT2='CMD'                                                     
     C                   EVAL      PPPCMD1='CMD7801'                                                
     C                   EXFMT     P10                                                              
     C                   MOVEA     ZXZERO10      *IN(30)                                            
     C                   MOVEA     ZXZERO10      *IN(40)                                            
     C                   MOVEA     ZXZERO10      *IN(50)                                            
     C                   MOVEA     ZXZERO10      *IN(60)                                            
     C                   EVAL      ERRGRL=*OFF                                                      
     C                   EVAL      MSGER=*BLANKS                                                    
     C     P10DSPT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VALIDACIÓ DELS CAMPS DEL FMT P10                 *                                
      *------------------------------------------------------------*                                
     C     P10CMD        BEGSR                                                                      
     C                   EVAL      ZXOPT2='CHK'                                                     
      *VALIDACIONES TECLAS DE FUNCION                                                               
     C                   SELECT                                                                     
      * FINALITZAR EL PROGRAMA                                                                      
     C                   WHEN      EXIT=*ON                                                         
     C                   EVAL      ZXOPT1='END'                                                     
      * SOL·LICITUD AJUDA                                                                           
     C                   WHEN      HELP=*ON                                                         
     C                   EVAL      ZXOPT2='DSP'                                                     
     C                   EXSR      CS_POCUR2                                                        
                                                                                                    
     C                   WHEN      RETRO=*ON                                                        
     C                   EVAL      ZXOPT1='END'                                                     
     C                   ENDSL                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VALIDACIÓ DELS CAMPS DEL FMT P10                 *                                
      *------------------------------------------------------------*                                
     C     P10CHK        BEGSR                                                                      
     C                   EVAL      ZXOPT2='UPD'                                                     
                                                                                                    
      * Delegación debe existir                                                                     
     C                   EVAL      P7CIAS=@PCIAS                                                    
     C                   EVAL      P7DLGA=P10DLGA                                                   
     C     KPMEMPR       CHAIN     PMEMPR                             81                            
     C                   IF        CHAIN=*ON                                                        
     C                   EVAL      WRK40=*ON                                                        
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='ASG1003'                                                  
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP10CHK                                            
                                                                                                    
      * No puede existir                                                                            
     C                   EVAL      T3DLGA=P10DLGA                                                   
     C     KEDPARM       CHAIN (N) EDPARM                             81                            
     C                   IF        CHAIN=*OFF                                                       
     C                   EVAL      WRK40=*ON                                                        
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='ASG1003'                                                  
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP10CHK                                            
                                                                                                    
     C     TP10CHK       TAG                                                                        
     C                   IF        ERRGRL=*ON                                                       
     C                   EVAL      ZXOPT2='DSP'                                                     
     C                   ENDIF                                                                      
                                                                                                    
     C     P10CHKT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA DE ACTUALIZACION DATOS DE  P10                   *                                
      *------------------------------------------------------------*                                
     C     P10UPD        BEGSR                                                                      
      * PASA A LAS PANTALLAS P2X                                                                    
     C                   EVAL      ZXOPT='P2ACLR'                                                   
     C                   EVAL      T3DLGA=P10DLGA                                                   
     C     P10UPDT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA CONTROL DEL FMT P2A                              *                                
      *------------------------------------------------------------*                                
     C     P2AMAIN       BEGSR                                                                      
     C                   EVAL      ZXOPT1='P2A'                                                     
     C                   DOW       ZXOPT1='P2A'                                                     
     C     ZXOPT2        CASEQ     'CLR'         P2ACLR                                             
     C     ZXOPT2        CASEQ     'INZ'         P2AINZ                                             
     C     ZXOPT2        CASEQ     'DSP'         P2ADSP                                             
     C     ZXOPT2        CASEQ     'CMD'         P2ACMD                                             
     C     ZXOPT2        CASEQ     'CHK'         P2ACHK                                             
     C     ZXOPT2        CASEQ     'UPD'         P2AUPD                                             
     C                   ENDCS                                                                      
     C                   ENDDO                                                                      
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA LIMPIEZA  DE P2A                                 *                                
      *------------------------------------------------------------*                                
     C     P2ACLR        BEGSR                                                                      
     C                   EVAL      ZXOPT2='INZ'                                                     
     C                   MOVEA     ZXZERO10      *IN(30)                                            
     C                   MOVEA     ZXZERO10      *IN(40)                                            
     C                   MOVEA     ZXZERO10      *IN(50)                                            
     C                   MOVEA     ZXZERO10      *IN(60)                                            
     C                   EVAL      CSRFILA=0                                                        
     C                   EVAL      CSRCOLU=0                                                        
     C                   MOVE      *BLANKS       MSGER                                              
     C     P2ACLRT       ENDSR                                                                      
      *                                                                                             
      **************************************************************                                
      * SUBRUTINA INICIALITZACIÓ DEL FMT P2A                       *                                
      *------------------------------------------------------------*                                
     C     P2AINZ        BEGSR                                                                      
      *                                                                                             
     C                   EVAL      ZXOPT2='DSP'                                                     
     C     *NOKEY        CLEAR     *ALL          REDPARM                                            
     C     KEDPARM       CHAIN     EDPARM                             81                            
     C     KEDPAR2       CHAIN     EDPAR2                             81                            
     C                   EXSR      P2AMFP                                                           
      * En el caso de altas se pasan los valores por defecto de PURLDA                              
                                                                                                    
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA PASAR DE FICHERO A PANTALLA P2A                  *                                
      *------------------------------------------------------------*                                
     C     P2AMFP        BEGSR                                                                      
                                                                                                    
     C                   EVAL      P2ADLGA=T3DLGA                                                   
                                                                                                    
     C                   EVAL      P7CIAS=T3CIAS                                                    
     C                   EVAL      P7DLGA=T3DLGA                                                    
     C     KPMEMPR       CHAIN     PMEMPR                             81                            
     C                   IF        CHAIN=*OFF                                                       
     C                   EVAL      P2ADESC=P7DESC                                                   
     C                   ELSE                                                                       
     C                   EVAL      P2ADESC=*BLANKS                                                  
     C                   ENDIF                                                                      
NAP45*                  EVAL      P2ACOEE=P7OCOE                                                   
NAP45C                   EVAL      P2ACOEE=ZXOCOE                                                   
      *                                                                                             
     C                   EVAL      P2AOBSO=T3OBSO                                                   
     C                   EVAL      P2ASSTO=T3SSTO                                                   
     C                   EVAL      P2ANIMF=T3NIMF                                                   
     C                   EVAL      P2AOBSO=T3OBSO                                                   
     C                   EVAL      P2ASSTO=T3SSTO                                                   
     C                   EVAL      P2APEXP=T3PEXP                                                   
     C                   EVAL      P2AENIN=T3ENIN                                                   
     C                   EVAL      P2ADIBE=T3DIBE                                                   
                                                                                                    
     C                   MOVE      *BLANKS       PXALPH                                             
     C                   EVAL      PXNUM=T3LIMP                                                     
     C                   CALL      'PRD650'                                                         
     C                   PARM                    PXNUM                                              
     C                   PARM                    PXALPH                                             
     C                   PARM                    PXFLDD                                             
     C                   PARM      2             PXDCCD                                             
     C                   PARM                    PXFMD1                                             
     C                   PARM                    PXEDTC                                             
     C                   PARM                    PXNMER                                             
     C                   PARM                    PXTIPA                                             
     C                   MOVE      PXALPH        P2ALIMP                                            
                                                                                                    
     C                   MOVE      *BLANKS       PXALPH                                             
     C                   MOVE      T3PNFE        PXALPH                                             
     C                   EVAL      PXNUM=0                                                          
     C                   CALL      'PRD650'                                                         
     C                   PARM                    PXNUM                                              
     C                   PARM                    PXALPH                                             
     C                   PARM                    PXFLDD                                             
     C                   PARM      0             PXDCCD                                             
     C                   PARM                    PXFMD1                                             
     C                   PARM                    PXEDT1                                             
     C                   PARM                    PXNMER                                             
     C                   PARM                    PXTIPA                                             
     C                   EVAL      P2APNFE=PXNUM                                                    
                                                                                                    
     C                   MOVE      *BLANKS       PXALPH                                             
     C                   EVAL      PXNUM=T3LIME                                                     
     C                   CALL      'PRD650'                                                         
     C                   PARM                    PXNUM                                              
     C                   PARM                    PXALPH                                             
     C                   PARM                    PXFLDD                                             
     C                   PARM      2             PXDCCD                                             
     C                   PARM                    PXFMD1                                             
     C                   PARM                    PXEDTC                                             
     C                   PARM                    PXNMER                                             
     C                   PARM                    PXTIPA                                             
     C                   MOVE      PXALPH        P2ALIME                                            
     C                   EVAL      P2ANCLF=T3NCLF                                                   
     C                   EVAL      P2ALOGI=T3LOGI                                                   
     C                   EVAL      P2ASTCK=T3STCK                                                   
     C                   EVAL      P2AEDFO=T3EDFO                                                   
      * Si está activado el parametro de solo ED Forzada                                            
      *    Escondemos los parámetros que no se utilizan                                             
     C                   IF        P2AEDFO='1'                                                      
     C                   EVAL      WRK50=*ON                                                        
     C                   ELSE                                                                       
     C                   EVAL      WRK50=*OFF                                                       
     C                   ENDIF                                                                      
                                                                                                    
                                                                                                    
     C                   EVAL      P2AARVM=T3ARVM                                                   
SE257C                   EVAL      P2AARMP=T3ARMP                                                   
      *                                                                                             
     C                   EVAL      P2AOPL1=T3OPL1                                                   
     C*                  EVAL      P2AOPL2=T3OPL2                                                   
     C                   EVAL      P2ARESE=T3RESE                                                   
     C                   EVAL      P2ARTRE=T3RTRE                                                   
     C                   EVAL      P2ALVIR=T3LVIR                                                   
FGI25c                   eval      P2AMTOS=T3MTOS                                                   
     C                                                                                              
     C                   EVAL      P2AALMA=P7MAGA                                                   
     C                   EVAL      P2AAUTS=P7AUTS                                                   
     C                   EVAL      P2AZOAU=P7ZOAU                                                   
     C                   EVAL      P2AVFYB=T3VFYB                                                   
     C                   EVAL      P2AADOM=T3ADOM                                                   
     C                   EVAL      P2ACOEN=T4COEN                                                   
     C                   EVAL      P2ACSTO=T4CSTO                                                   
     C                                                                                              
     C                   EVAL      S2CIAS=@PCIAS                                                    
     C                   EVAL      S2CSTO=P2ACSTO                                                   
     C     KCODIST       CHAIN     CODIST                                                           
     C                   IF        %FOUND                                                           
     C                   EVAL      P2ASTOD=S2RAOS                                                   
     C                   ENDIF                                                                      
C2238C                   EVAL      P2AOFEX=T3OFEX                                                   
      *                                                                                             
      * PARA EL CASO DE COPIAS CAMBIAREMOS LA CABECERA                                              
      *                                                                                             
     C                   IF        INDCPY=*ON                                                       
     C                   EVAL      P2ADLGA=P3CDLGA                                                  
     C     *NOKEY        CLEAR     *ALL          REDPARM                                            
     C                   ENDIF                                                                      
      *                                                                                             
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VISUALITZACIÓ DEL FMT P2A                        *                                
      *------------------------------------------------------------*                                
     C     P2ADSP        BEGSR                                                                      
      * ENS ENCARREGUEM QUE EL PROPER PAS SIGUI COMPROVAR ENTRADA CMD                               
     C                   EVAL      ZXOPT2='CMD'                                                     
     C                   EVAL      PPPCMD1='CMD7801'                                                
     C                   MOVEA     ZXZERO10      *IN(60)                                            
      * Si no estem a central no visualitzo parámetres reserva especial                             
     C                   IF        @PDLGA<>*BLANKS                                                  
     C                   EVAL      WRK60=*ON                                                        
     C                   ELSE                                                                       
     C                   EVAL      WRK60=*OFF                                                       
     C                   ENDIF                                                                      
      *                                                                                             
     C                   EVAL      WRK61='0'                                                        
     C                   EVAL      WRK62='0'                                                        
     C                   IF        P2AAUTS>'0' AND P2AOPL1=' '                                      
     C                   EVAL      WRK61='1'                                                        
     C                   ENDIF                                                                      
     C                   IF        P2AAUTS>'0' AND P2AOPL1<>' '                                     
     C                   EVAL      WRK62='1'                                                        
     C                   ENDIF                                                                      
FGI25c                   eval      wrk63 = bDoomV3                                                  
      *                                                                                             
     C                   IF        SDSUSR<>'JMARTINEZ@'                                             
     C                   EXFMT     P2A                                                              
     C                   ELSE                                                                       
     C                   EXFMT     P2A_SPC                                                          
     C                   ENDIF                                                                      
     C                   MOVEA     ZXZERO10      *IN(30)                                            
     C                   MOVEA     ZXZERO10      *IN(40)                                            
     C                   MOVEA     ZXZERO10      *IN(50)                                            
     C                   MOVEA     ZXZERO10      *IN(60)                                            
     C                   EVAL      ERRGRL=*OFF                                                      
     C                   EVAL      MSGER=*BLANKS                                                    
     C                   EVAL      CSRCOLU=*ZEROS                                                   
     C                   EVAL      CSRFILA=*ZEROS                                                   
     C     P2ADSPT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VALIDACIÓ DELS CMDS DEL FMT P2A                 *                                 
      *------------------------------------------------------------*                                
     C     P2ACMD        BEGSR                                                                      
     C                   EVAL      ZXOPT2='CHK'                                                     
      *VALIDACIONES TECLAS DE FUNCION                                                               
     C                   SELECT                                                                     
      * FINALITZAR EL PROGRAMA                                                                      
     C                   WHEN      EXIT=*ON                                                         
     C                   EVAL      ZXOPT1='END'                                                     
      * SOL·LICITUD AJUDA D'ARTICLES                                                                
     C                   WHEN      HELP=*ON                                                         
     C                   EVAL      ZXOPT2='DSP'                                                     
     C                   EXSR      CS_POCUR2                                                        
     C                   EXSR      P2AF4                                                            
      * RETROCESO PANTALLA                                                                          
     C                   WHEN      RETRO=*ON                                                        
     C                   IF        INDCRT=*ON AND @POPCI<>'1B'                                      
     C                   EVAL      ZXOPT='P10CLR'                                                   
     C                   ELSE                                                                       
     C                   IF        INDCPY=*ON                                                       
     C                   EVAL      ZXOPT='P30DSP'                                                   
     C                   ELSE                                                                       
     C                   EVAL      ZXOPT='END'                                                      
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
     C                   ENDSL                                                                      
                                                                                                    
     C     TP2ACMD       TAG                                                                        
     C                   IF        ERRGRL=*ON                                                       
     C                   EVAL      ZXOPT2='DSP'                                                     
     C                   ENDIF                                                                      
                                                                                                    
     C     P2ACMDT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA DE AYUDA EN CAMPOS DEL   FMT P2A                 *                                
      *------------------------------------------------------------*                                
     C     P2AF4         BEGSR                                                                      
     C* No se permite acceso a consulta si estamos en opcion de visualizar                          
     C                   IF        INDDSP=*ON                                                       
     C                   EVAL      ERRGRL=*ON                                                       
     C                   ENDIF                                                                      
                                                                                                    
      * AYUDAS SINO                                                                                 
     C                   EVAL      @PEFLD=*BLANKS                                                   
     C                   EVAL      @PEFMT=*BLANKS                                                   
                                                                                                    
     C                   IF        FIELD='P2ANIMF'                                                  
     C                             OR FIELD='P2AOBSO'                                               
FQ726C**                           OR FIELD='P2ASSTO'                                               
FQ710C**                           OR FIELD='P2AICLD'                                               
FQ607C                             OR FIELD='P2AENIN'                                               
FQ726C                             OR FIELD='P2ANCLF'                                               
FQ726C                             OR FIELD='P2ALOGI'                                               
FQ726C                             OR FIELD='P2ASTCK'                                               
FQ726C                             OR FIELD='P2AEDFO'                                               
FH009C                             OR FIELD='P2ARESE'                                               
FH009C                             OR FIELD='P2ARTRE'                                               
     C                             OR FIELD='P2AVFYB'                                               
     C                             OR FIELD='P2AADOM'                                               
     C                             OR FIELD='P2ACOEN'                                               
C2238C                             OR FIELD='P2AOFEX'                                               
     C                   EVAL      @PEFLD='SINO'                                                    
     C                   IF        FIELD<>'P2ACOEN'                                                 
                                                                                                    
     C                   CALL      'MMPROM'                                                         
     C                   PARM      *BLANKS       @PEOPT                                             
     C                   PARM      *BLANKS       @PEPGM                                             
     C                   PARM                    @PEFMT                                             
     C                   PARM                    @PEFLD                                             
     C                   PARM      *BLANKS       @PEERR                                             
     C                   ELSE                                                                       
     C                   IF        FIELD='P2ACOEN'                                                  
     C                   EVAL      @PEFLD='COEN'                                                    
     C                   CALL      'MMPROM'                                                         
     C                   PARM      *BLANKS       @PEOPT                                             
     C                   PARM      SDSPGM        @PEPGM                                             
     C                   PARM                    @PEFMT                                             
     C                   PARM                    @PEFLD                                             
     C                   PARM      *BLANKS       @PEERR                                             
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
                                                                                                    
     C                   IF        @PEERR>'0'                                                       
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='ADP0304'                                                  
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           P2AF4T                                             
      * Si no han realizado ninguna selección no tocamos nada                                       
     C                   IF        @PEERR='A'                                                       
     C                   EVAL      ERRGRL=*ON                                                       
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           P2AF4T                                             
      *                                                                                             
     C                   IF        FIELD='P2ANIMF'                                                  
     C                   EVAL      P2ANIMF=@PEOPT                                                   
     C                   ENDIF                                                                      
      *                                                                                             
     C                   IF        FIELD='P2AOBSO'                                                  
     C                   EVAL      P2AOBSO=@PEOPT                                                   
     C                   ENDIF                                                                      
      *                                                                                             
FQ726C**                 IF        FIELD='P2ASSTO'                                                  
FQ726C**                 EVAL      P2ASSTO=@PEOPT                                                   
FQ726C**                 ENDIF                                                                      
      *                                                                                             
FQ710C*                  IF        FIELD='P2AICLD'                                                  
FQ710C*                  EVAL      P2AICLD=@PEOPT                                                   
FQ710C*                  ENDIF                                                                      
      *                                                                                             
FQ607C                   IF        FIELD='P2AENIN'                                                  
FQ607C                   EVAL      P2AENIN=@PEOPT                                                   
FQ607C                   ENDIF                                                                      
FQ607 *                                                                                             
FQ726C                   IF        FIELD='P2ANCLF'                                                  
FQ726C                   EVAL      P2ANCLF=@PEOPT                                                   
FQ726C                   ENDIF                                                                      
FQ726 *                                                                                             
FQ726C                   IF        FIELD='P2ALOGI'                                                  
FQ726C                   EVAL      P2ALOGI=@PEOPT                                                   
FQ726C                   ENDIF                                                                      
FQ726 *                                                                                             
FQ726C                   IF        FIELD='P2ASTCK'                                                  
FQ726C                   EVAL      P2ASTCK=@PEOPT                                                   
FQ726C                   ENDIF                                                                      
FQ726 *                                                                                             
FQ726C                   IF        FIELD='P2AEDFO'                                                  
FQ726C                   EVAL      P2AEDFO=@PEOPT                                                   
FQ726C                   ENDIF                                                                      
FQ726 *                                                                                             
FH009C                   IF        FIELD='P2ARESE'                                                  
FH009C                   EVAL      P2ARESE=@PEOPT                                                   
FH009C                   ENDIF                                                                      
FH009 *                                                                                             
FH009C                   IF        FIELD='P2ARTRE'                                                  
FH009C                   EVAL      P2ARTRE=@PEOPT                                                   
FH009C                   ENDIF                                                                      
C1636C                   IF        FIELD='P2AFYBE'                                                  
C1636C                   EVAL      P2AVFYB=@PEOPT                                                   
C1636C                   ENDIF                                                                      
C1636C                   IF        FIELD='P2AADOM'                                                  
C1636C                   EVAL      P2AADOM=@PEOPT                                                   
C1636C                   ENDIF                                                                      
C1636C                   IF        FIELD='P2ACOEN'                                                  
C1636C                   EVAL      P2ACOEN=@PEOPT                                                   
C1636C                   ENDIF                                                                      
C2238C                   IF        FIELD='P2AOFEX'                                                  
C2238C                   EVAL      P2AOFEX=@PEOPT                                                   
C2238C                   ENDIF                                                                      
C1636 *                                                                                             
FH009 *                                                                                             
     C                   GOTO      P2AF4T                                                           
     C                   ENDIF                                                                      
                                                                                                    
FQ726 * Ayuda parámetro Sobreestock                                                                 
FQ726C                   IF        FIELD='P2ASSTO'                                                  
FQ726C                   CALL      'MMTAB1'                                                         
FQ726C                   PARM      *BLANKS       @PCLTA                                             
FQ726C                   PARM      'EDSS'        @PCTAB                                             
FQ726C                   PARM                    @PCIAS                                             
FQ726C                   PARM      *BLANKS       @PERRO                                             
FQ726C                   IF        @PERRO=*BLANKS                                                   
FQ726C                   MOVEL(P)  @PCLTA        P2ASSTO                                            
FQ726C                   ENDIF                                                                      
FQ726C                   GOTO      P2AF4T                                                           
FQ726C                   ENDIF                                                                      
      *                                                                                             
FQ765C                                                                                              
FQ765C                   IF        FIELD='P2AARVM'                                                  
FQ765C                   EVAL      ZXARVM=P2AARVM                                                   
FQ765C                   CALL      'MM0600'                                                         
FQ765C                   PARM      ZZCIAS        @PCIAS                                             
FQ765C                   PARM                    ZXARTI                                             
FQ765C                   PARM      *BLANKS       ZXVARI                                             
FQ765C                   PARM      *BLANKS       ZXMODE                                             
FQ765C                   PARM      *BLANKS       @PEERR                                             
FQ765C                   IF        ZXARTI<>*BLANKS AND @PEERR=*BLANKS                               
FQ765C                   EVAL      P2AARVM=ZXARVM                                                   
FQ765C                   ENDIF                                                                      
FQ765C                   ENDIF                                                                      
                                                                                                    
SE257C                   IF        FIELD='P2AARMP'                                                  
SE257C                   EVAL      ZXARMP=P2AARMP                                                   
SE257C                   CALL      'MM0600'                                                         
SE257C                   PARM      ZZCIAS        @PCIAS                                             
SE257C                   PARM                    ZXARTI2                                            
SE257C                   PARM      *BLANKS       ZXVARI2                                            
SE257C                   PARM      *BLANKS       ZXMODE2                                            
SE257C                   PARM      *BLANKS       @PEERR                                             
SE257C                   IF        ZXARTI2<>*BLANKS AND @PEERR=*BLANKS                              
SE257C                   EVAL      P2AARMP=ZXARMP                                                   
SE257C                   ENDIF                                                                      
SE257C                   ENDIF                                                                      
SE257C                                                                                              
      * Ayuda parámetro STORER                                                                      
     C                   IF        FIELD='P2ACSTO'                                                  
     C                   CALL      'LC0600'                                                         
     C                   PARM                    @PCIAS                                             
     C                   PARM                    P2ACSTO                                            
     C                   PARM      *BLANKS       @PERRO                                             
     C                   GOTO      P2AF4T                                                           
     C                   ENDIF                                                                      
      *                                                                                             
      * SI NO TIENE F4 SOPORTADO DOY ERROR                                                          
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='ADP0304'                                                  
     C     ERRGRL        CABEQ     *ON           P2AF4T                                             
                                                                                                    
     C     P2AF4T        ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VALIDACIÓ DELS CAMPS DEL FMT P2A                 *                                
      *------------------------------------------------------------*                                
     C     P2ACHK        BEGSR                                                                      
     C                   EVAL      ZXOPT2='UPD'                                                     
                                                                                                    
FGI25 * Validar Almacen Check MTO/MTS                                                               
FGI25c                   eval      @peerr='0'                                                       
FGI25c                   if        p2amtos<>*blanks and bDoomV3=*on                                 
FGI25c                   eval      m0maga= p2amtos                                                  
FGI25c                   eval      m0cias= @PCIAS                                                   
FGI25c     kmsalma       chain     msalma                                                           
FGI25c                   if        not %found or m0tal1<>'8'                                        
FGI25c                   eval      @peerr='9'                                                       
FGI25c                   endif                                                                      
FGI25c                   endif                                                                      
FGI25c                   IF        @PEERR>'0'                                                       
FGI25c                   EVAL      ERRGRL=*ON                                                       
FGI25c                   EVAL      WRK41=*ON                                                        
FGI25c                   EVAL      MSGER='ASG1003'                                                  
FGI25c                   ENDIF                                                                      
FGI25c     ERRGRL        CABEQ     *ON           TP2ACHK                                            
FGI25 *                                                                                             
      * Validar No tener en cuanta Importe Mínimo en ED Forzada                                     
     C                   EVAL      @PEOPT=*BLANKS                                                   
     C                   EVAL      @PEOPT=P2ANIMF                                                   
     C                   CALL      'MMPROM'                                                         
     C                   PARM                    @PEOPT                                             
     C                   PARM      *BLANKS       @PEPGM                                             
     C                   PARM      *BLANKS       @PEFMT                                             
     C                   PARM      'SINO      '  @PEFLD                                             
     C                   PARM      'V'           @PEERR                                             
                                                                                                    
     C                   IF        @PEERR>'0'                                                       
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      WRK31=*ON                                                        
     C                   EVAL      MSGER='ASG1003'                                                  
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP2ACHK                                            
      *                                                                                             
     C                                                                                              
      * Validar Comprobar Obsoletos                                                                 
     C                   EVAL      @PEOPT=*BLANKS                                                   
     C                   EVAL      @PEOPT=P2AOBSO                                                   
     C                   CALL      'MMPROM'                                                         
     C                   PARM                    @PEOPT                                             
     C                   PARM      *BLANKS       @PEPGM                                             
     C                   PARM      *BLANKS       @PEFMT                                             
     C                   PARM      'SINO      '  @PEFLD                                             
     C                   PARM      'V'           @PEERR                                             
                                                                                                    
     C                   IF        @PEERR>'0'                                                       
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      WRK32=*ON                                                        
     C                   EVAL      MSGER='ASG1003'                                                  
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP2ACHK                                            
     C                                                                                              
FQ726 * Validar Comprobar Sobreestock                                                               
FQ726C*                  EVAL      @PEOPT=*BLANKS                                                   
FQ726C*                  EVAL      @PEOPT=P2ASSTO                                                   
FQ726C*                  CALL      'MMPROM'                                                         
FQ726C*                  PARM                    @PEOPT                                             
FQ726C*                  PARM      *BLANKS       @PEPGM                                             
FQ726C*                  PARM      *BLANKS       @PEFMT                                             
FQ726C*                  PARM      'SINO      '  @PEFLD                                             
FQ726C*                  PARM      'V'           @PEERR                                             
FQ726                                                                                               
FQ726C*                  IF        @PEERR>'0'                                                       
FQ726C*                  EVAL      ERRGRL=*ON                                                       
FQ726C*                  EVAL      WRK33=*ON                                                        
FQ726C*                  EVAL      MSGER='ASG1003'                                                  
FQ726C*                  ENDIF                                                                      
FQ726C*    ERRGRL        CABEQ     *ON           TP2ACHK                                            
     C                                                                                              
FQ710 * Validar Informar si hay otros pedidos del mismo cliente                                     
FQ710C*                  EVAL      @PEOPT=*BLANKS                                                   
FQ710C*                  EVAL      @PEOPT=P2AICLD                                                   
FQ710C*                  CALL      'MMPROM'                                                         
FQ710C*                  PARM                    @PEOPT                                             
FQ710C*                  PARM      *BLANKS       @PEPGM                                             
FQ710C*                  PARM      *BLANKS       @PEFMT                                             
FQ710C*                  PARM      'SINO      '  @PEFLD                                             
FQ710C*                  PARM      'V'           @PEERR                                             
FQ710 *                                                                                             
FQ710C*                  IF        @PEERR>'0'                                                       
FQ710C*                  EVAL      ERRGRL=*ON                                                       
FQ710C*                  EVAL      WRK34=*ON                                                        
FQ710C*                  EVAL      MSGER='ASG1003'                                                  
FQ710C*                  ENDIF                                                                      
FQ710C*    ERRGRL        CABEQ     *ON           TP2ACHK                                            
      *                                                                                             
FQ607 * Validar Entrada Incidencias en pedidos                                                      
FQ607C                   EVAL      @PEOPT=*BLANKS                                                   
FQ607C                   EVAL      @PEOPT=P2AENIN                                                   
FQ607C                   CALL      'MMPROM'                                                         
FQ607C                   PARM                    @PEOPT                                             
FQ607C                   PARM      *BLANKS       @PEPGM                                             
FQ607C                   PARM      *BLANKS       @PEFMT                                             
FQ607C                   PARM      'SINO      '  @PEFLD                                             
FQ607C                   PARM      'V'           @PEERR                                             
FQ607                                                                                               
FQ607C                   IF        @PEERR>'0'                                                       
FQ607C                   EVAL      ERRGRL=*ON                                                       
FQ607C                   EVAL      WRK36=*ON                                                        
FQ607C                   EVAL      MSGER='ASG1003'                                                  
FQ607C                   ENDIF                                                                      
FQ607C     ERRGRL        CABEQ     *ON           TP2ACHK                                            
FQ607 *                                                                                             
FQ726 * Validar que el importe por expedición sea inferior al imp pedido                            
FQ726 **                                                                                            
FQ726C                   EVAL      PXALPH=*BLANKS                                                   
FQ726C                   MOVE      P2ALIMP       PXALPH                                             
FQ726C                   EVAL      PXNUM=0                                                          
FQ726C                   CALL      'PRD650'                                                         
FQ726C                   PARM                    PXNUM                                              
FQ726C                   PARM                    PXALPH                                             
FQ726C                   PARM                    PXFLDD                                             
FQ726C                   PARM      2             PXDCCD                                             
FQ726C                   PARM                    PXFMD1                                             
FQ726C                   PARM                    PXEDTC                                             
FQ726C                   PARM                    PXNMER                                             
FQ726C                   PARM                    PXTIPA                                             
FQ726C                   EVAL      ZXLIMP=PXNUM                                                     
FQ726 **                                                                                            
FQ726C                   EVAL      PXALPH=*BLANKS                                                   
FQ726C                   MOVE      P2ALIME       PXALPH                                             
FQ726C                   EVAL      PXNUM=0                                                          
FQ726C                   CALL      'PRD650'                                                         
FQ726C                   PARM                    PXNUM                                              
FQ726C                   PARM                    PXALPH                                             
FQ726C                   PARM                    PXFLDD                                             
FQ726C                   PARM      2             PXDCCD                                             
FQ726C                   PARM                    PXFMD1                                             
FQ726C                   PARM                    PXEDTC                                             
FQ726C                   PARM                    PXNMER                                             
FQ726C                   PARM                    PXTIPA                                             
FQ726C                   EVAL      ZXLIME=PXNUM                                                     
FQ726 **                                                                                            
FQ726 **                                                                                            
FQ726 * Validar No Comprobar parámetro Cliente en ED Forzada                                        
FQ726C                   EVAL      @PEOPT=*BLANKS                                                   
FQ726C                   EVAL      @PEOPT=P2ANCLF                                                   
FQ726C                   CALL      'MMPROM'                                                         
FQ726C                   PARM                    @PEOPT                                             
FQ726C                   PARM      *BLANKS       @PEPGM                                             
FQ726C                   PARM      *BLANKS       @PEFMT                                             
FQ726C                   PARM      'SINO      '  @PEFLD                                             
FQ726C                   PARM      'V'           @PEERR                                             
FQ726                                                                                               
FQ726C                   IF        @PEERR>'0'                                                       
FQ726C                   EVAL      ERRGRL=*ON                                                       
FQ726C                   EVAL      WRK35=*ON                                                        
FQ726C                   EVAL      MSGER='ASG1003'                                                  
FQ726C                   ENDIF                                                                      
FQ726C     ERRGRL        CABEQ     *ON           TP2ACHK                                            
FQ726 *                                                                                             
FQ726 * Validar Comprobar logísticas                                                                
FQ726C                   EVAL      @PEOPT=*BLANKS                                                   
FQ726C                   EVAL      @PEOPT=P2ALOGI                                                   
FQ726C                   CALL      'MMPROM'                                                         
FQ726C                   PARM                    @PEOPT                                             
FQ726C                   PARM      *BLANKS       @PEPGM                                             
FQ726C                   PARM      *BLANKS       @PEFMT                                             
FQ726C                   PARM      'SINO      '  @PEFLD                                             
FQ726C                   PARM      'V'           @PEERR                                             
FQ726                                                                                               
FQ726C                   IF        @PEERR>'0'                                                       
FQ726C                   EVAL      ERRGRL=*ON                                                       
FQ726C                   EVAL      WRK43=*ON                                                        
FQ726C                   EVAL      MSGER='ASG1003'                                                  
FQ726C                   ENDIF                                                                      
FQ726C     ERRGRL        CABEQ     *ON           TP2ACHK                                            
FQ726 *                                                                                             
FQ726 * Validar Comprobar Stocks                                                                    
FQ726C                   EVAL      @PEOPT=*BLANKS                                                   
FQ726C                   EVAL      @PEOPT=P2ASTCK                                                   
FQ726C                   CALL      'MMPROM'                                                         
FQ726C                   PARM                    @PEOPT                                             
FQ726C                   PARM      *BLANKS       @PEPGM                                             
FQ726C                   PARM      *BLANKS       @PEFMT                                             
FQ726C                   PARM      'SINO      '  @PEFLD                                             
FQ726C                   PARM      'V'           @PEERR                                             
FQ726                                                                                               
FQ726C                   IF        @PEERR>'0'                                                       
FQ726C                   EVAL      ERRGRL=*ON                                                       
FQ726C                   EVAL      WRK41=*ON                                                        
FQ726C                   EVAL      MSGER='ASG1003'                                                  
FQ726C                   ENDIF                                                                      
FQ726C     ERRGRL        CABEQ     *ON           TP2ACHK                                            
FQ726 *                                                                                             
FQ726 * Validar Solo Entregas Directas Forzadas                                                     
FQ726C                   EVAL      @PEOPT=*BLANKS                                                   
FQ726C                   EVAL      @PEOPT=P2AEDFO                                                   
FQ726C                   CALL      'MMPROM'                                                         
FQ726C                   PARM                    @PEOPT                                             
FQ726C                   PARM      *BLANKS       @PEPGM                                             
FQ726C                   PARM      *BLANKS       @PEFMT                                             
FQ726C                   PARM      'SINO      '  @PEFLD                                             
FQ726C                   PARM      'V'           @PEERR                                             
FQ726                                                                                               
FQ726C                   IF        @PEERR>'0'                                                       
FQ726C                   EVAL      ERRGRL=*ON                                                       
FQ726C                   EVAL      WRK42=*ON                                                        
FQ726C                   EVAL      MSGER='ASG1003'                                                  
FQ726C                   ENDIF                                                                      
FQ726C     ERRGRL        CABEQ     *ON           TP2ACHK                                            
FQ726 *                                                                                             
FQ726 *  Si activo parámetro, Muestro pantalla de confirmación                                      
FQ726C                   IF        P2AEDFO='1'                                                      
FQ726C                             And T3EDFO<>'1'                                                  
FQ726C                             And ZXPRIM=1                                                     
FQ726C                   EXFMT     W01                                                              
FQ726C                   IF        *IN12                                                            
FQ726C                   EVAL      ERRGRL=*ON                                                       
FQ726C                   EVAL      WRK42=*ON                                                        
FQ726C                   ELSE                                                                       
FQ726 * Si está activado el parametro de solo ED Forzada                                            
FQ726 *    Escondemos los parámetros que no se utilizan                                             
FQ726C                   EVAL      WRK50=*ON                                                        
FQ726C                   EVAL      ZXOPT2='DSP'                                                     
FQ726C                   EVAL      ZXPRIM=0                                                         
FQ726C                   EVAL      P2ALIMP=*BLANKS                                                  
FQ726C                   EVAL      P2ASTCK=*BLANKS                                                  
FQ726C                   EVAL      P2ALIME=*BLANKS                                                  
FQ726C                   EVAL      P2ALOGI=*BLANKS                                                  
FQ726C                   EVAL      P2ADIBE=*ZEROS                                                   
FQ726C                   EVAL      P2ASSTO=*BLANKS                                                  
FQ726C                   EVAL      P2ANIMF=*BLANKS                                                  
FQ726C                   EVAL      P2AADOM=*BLANKS                                                  
FQ726C                   ENDIF                                                                      
FQ726C                   ENDIF                                                                      
FQ726C     ERRGRL        CABEQ     *ON           TP2ACHK                                            
FQ726 *                                                                                             
FQ726 *  Si desactivo parámetro, Muestro todos los parámetros                                       
FQ726C                   IF        P2AEDFO<>'1'                                                     
FQ726C                             And T3EDFO='1'                                                   
FQ726C                   EVAL      WRK50=*OFF                                                       
FQ726C                   IF        ZXPRIM=1                                                         
FQ726C                   EVAL      ZXOPT2='DSP'                                                     
FQ726C                   EVAL      ZXPRIM=0                                                         
FQ726C                   ENDIF                                                                      
FQ726C                   ENDIF                                                                      
FQ726                                                                                               
FQ726 * Validar Comprobar Sobreestock                                                               
FQ726C                   IF        P2ASSTO<>*BLANKS                                                 
FQ726C                   EVAL      PECTAB='EDSS'                                                    
FQ726C                   EVAL      PECLTA=*BLANKS                                                   
FQ726C                   EVAL      PECLTA=P2ASSTO                                                   
FQ726C     KPMTAB2       CHAIN     PMTAB2                                                           
FQ726C                   IF        Not %FOUND(PMTAB2)                                               
FQ726C                             Or %FOUND(PMTAB2) And PEBAJA='1'                                 
FQ726C                   EVAL      ERRGRL=*ON                                                       
FQ726C                   EVAL      MSGER='ASG1003'                                                  
FQ726C                   EVAL      WRK33=*ON                                                        
FQ726C                   ENDIF                                                                      
FQ726C     ERRGRL        CABEQ     *ON           TP2ACHK                                            
FQ726C                   ENDIF                                                                      
FQ765                                                                                               
FQ765C                   IF        P2AARVM<>*BLANKS                                                 
FQ765C                   EVAL      ZXARVM=P2AARVM                                                   
FQ765C                   EVAL      M5ARTI=ZXARTI                                                    
FQ765C                   EVAL      M5VARI=ZXVARI                                                    
FQ765C                   EVAL      M5MODE=ZXMODE                                                    
FQ765C     KMSARTI00     CHAIN     MSARTI00                                                         
FQ766C                   IF        %FOUND AND M5BAJA<>'1'                                           
FQ765C                   EVAL      PECTAB='TIPG'                                                    
FQ765C                   EVAL      PECLTA=M5TIPG                                                    
FQ766C     KPMTABD       CHAIN     PMTABD                             81                            
FQ765C                   IF        PEBL61<>'1' OR PEBAJA='1'                                        
FQ765C                             OR NOT%FOUND                                                     
FQ765C                   EVAL      ERRGRL=*ON                                                       
FQ765C                   EVAL      MSGER='ASG1003'                                                  
FQ765C                   EVAL      WRK51=*ON                                                        
FQ765C                   ENDIF                                                                      
SE257C                   ELSE                                                                       
SE257C                   EVAL      ERRGRL=*ON                                                       
SE257C                   EVAL      MSGER='ASG1003'                                                  
SE257C                   EVAL      WRK51=*ON                                                        
SE257C                   ENDIF                                                                      
SE257C     ERRGRL        CABEQ     *ON           TP2ACHK                                            
FQ765C                   ENDIF                                                                      
FQ765                                                                                               
SE257C                   IF        P2AARMP<>*BLANKS                                                 
SE257C                   EVAL      ZXARMP=P2AARMP                                                   
SE257C                   EVAL      M5ARTI=ZXARTI2                                                   
SE257C                   EVAL      M5VARI=ZXVARI2                                                   
SE257C                   EVAL      M5MODE=ZXMODE2                                                   
SE257C     KMSARTI00     CHAIN     MSARTI00                                                         
SE257C                   IF        %FOUND AND M5BAJA<>'1'                                           
SE257C                   EVAL      PECTAB='TIPG'                                                    
SE257C                   EVAL      PECLTA=M5TIPG                                                    
SE257C     KPMTABD       CHAIN     PMTABD                             81                            
SE257C                   IF        PEBL61<>'1' OR PEBAJA='1'                                        
SE257C                             OR NOT%FOUND                                                     
SE257C                   EVAL      ERRGRL=*ON                                                       
SE257C                   EVAL      MSGER='ASG1003'                                                  
SE257C                   EVAL      WRK57=*ON                                                        
SE257C                   ENDIF                                                                      
SE257C                   ELSE                                                                       
SE257C                   EVAL      ERRGRL=*ON                                                       
SE257C                   EVAL      MSGER='ASG1003'                                                  
SE257C                   EVAL      WRK57=*ON                                                        
SE257C                   ENDIF                                                                      
SE257C     ERRGRL        CABEQ     *ON           TP2ACHK                                            
SE257C                   ENDIF                                                                      
SE257                                                                                               
FH009 * Validar reservas especiales                                                                 
FH009C                   EVAL      @PEOPT=*BLANKS                                                   
FH009C                   EVAL      @PEOPT=P2ARESE                                                   
FH009C                   CALL      'MMPROM'                                                         
FH009C                   PARM                    @PEOPT                                             
FH009C                   PARM      *BLANKS       @PEPGM                                             
FH009C                   PARM      *BLANKS       @PEFMT                                             
FH009C                   PARM      'SINO      '  @PEFLD                                             
FH009C                   PARM      'V'           @PEERR                                             
FH009                                                                                               
FH009C                   IF        @PEERR>'0'                                                       
FH009C                   EVAL      ERRGRL=*ON                                                       
FH009C                   EVAL      WRK44=*ON                                                        
FH009C                   EVAL      MSGER='ASG1003'                                                  
FH009C                   ENDIF                                                                      
FH009C     ERRGRL        CABEQ     *ON           TP2ACHK                                            
FH009 *                                                                                             
FH009 * Validar tener en cuenta roturas para reserva especial                                       
FH009C                   EVAL      @PEOPT=*BLANKS                                                   
FH009C                   EVAL      @PEOPT=P2ARTRE                                                   
FH009C                   CALL      'MMPROM'                                                         
FH009C                   PARM                    @PEOPT                                             
FH009C                   PARM      *BLANKS       @PEPGM                                             
FH009C                   PARM      *BLANKS       @PEFMT                                             
FH009C                   PARM      'SINO      '  @PEFLD                                             
FH009C                   PARM      'V'           @PEERR                                             
FH009                                                                                               
FH009C                   IF        @PEERR>'0'                                                       
FH009C                   EVAL      ERRGRL=*ON                                                       
FH009C                   EVAL      WRK46=*ON                                                        
FH009C                   EVAL      MSGER='ASG1003'                                                  
FH009C                   ENDIF                                                                      
FH009C     ERRGRL        CABEQ     *ON           TP2ACHK                                            
FH009 *                                                                                             
FH009 *                                                                                             
C1636C                   EVAL      @PEOPT=P2AVFYB                                                   
C1636C                   CALL      'MMPROM'                                                         
C1636C                   PARM                    @PEOPT                                             
C1636C                   PARM      *BLANKS       @PEPGM                                             
C1636C                   PARM      *BLANKS       @PEFMT                                             
C1636C                   PARM      'SINO      '  @PEFLD                                             
C1636C                   PARM      'V'           @PEERR                                             
C1636                                                                                               
C1636C                   IF        @PEERR>'0'                                                       
C1636C                   EVAL      ERRGRL=*ON                                                       
C1636C                   EVAL      MSGER='ASG1003'                                                  
C1636C                   EVAL      WRK55=*ON                                                        
C1636C                   ENDIF                                                                      
C1636C     ERRGRL        CABEQ     *ON           TP2ACHK                                            
FH009 *                                                                                             
C1636C                   EVAL      @PEOPT=P2AADOM                                                   
C1636C                   CALL      'MMPROM'                                                         
C1636C                   PARM                    @PEOPT                                             
C1636C                   PARM      *BLANKS       @PEPGM                                             
C1636C                   PARM      *BLANKS       @PEFMT                                             
C1636C                   PARM      'SINO      '  @PEFLD                                             
C1636C                   PARM      'V'           @PEERR                                             
C1636                                                                                               
C1636C                   IF        @PEERR>'0'                                                       
C1636C                   EVAL      ERRGRL=*ON                                                       
C1636C                   EVAL      MSGER='ASG1003'                                                  
C1636C                   EVAL      WRK56=*ON                                                        
C1636C                   ENDIF                                                                      
C1636C     ERRGRL        CABEQ     *ON           TP2ACHK                                            
      *                                                                                             
     C                   IF        P2APNFE>P2APEXP                                                  
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='ASG1003'                                                  
     C                   EVAL      WRK45=*ON                                                        
     C     ERRGRL        CABEQ     *ON           TP2ACHK                                            
     C                   ENDIF                                                                      
      *                                                                                             
     C                   IF        P2ACSTO<>*BLANKS                                                 
     C                   EVAL      S2CIAS=@PCIAS                                                    
     C                   EVAL      S2CSTO=P2ACSTO                                                   
     C     KCODIST       CHAIN     CODIST                                                           
     C                   IF        NOT%FOUND                                                        
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='ASG1003'                                                  
     C                   EVAL      WRK58=*ON                                                        
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP2ACHK                                            
     C                   ENDIF                                                                      
     C                                                                                              
     C                                                                                              
      * V                                                                                           
     C                   EVAL      @PEOPT=*BLANKS                                                   
     C                   EVAL      @PEOPT=P2ACOEN                                                   
     C                   CALL      'MMPROM'                                                         
     C                   PARM                    @PEOPT                                             
     C                   PARM      SDSPGM        @PEPGM                                             
     C                   PARM      *BLANKS       @PEFMT                                             
     C                   PARM      'COEN      '  @PEFLD                                             
     C                   PARM      'V'           @PEERR                                             
     C                   IF        @PEERR>'0' OR                                                    
     C                             (P2ACOEN>'0' AND P2ACOEE>'0')                                    
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      WRK44=*ON                                                        
     C                   EVAL      MSGER='ASG1003'                                                  
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP2ACHK                                            
C2238                                                                                               
C2238C                   EVAL      @PEOPT=*BLANKS                                                   
C2238C                   EVAL      @PEOPT=P2AOFEX                                                   
C2238C                   CALL      'MMPROM'                                                         
C2238C                   PARM                    @PEOPT                                             
C2238C                   PARM      *BLANKS       @PEPGM                                             
C2238C                   PARM      *BLANKS       @PEFMT                                             
C2238C                   PARM      'SINO      '  @PEFLD                                             
C2238C                   PARM      'V'           @PEERR                                             
C2238C                   IF        @PEERR>'0'                                                       
C2238C                   EVAL      ERRGRL=*ON                                                       
C2238C                   EVAL      WRK39=*ON                                                        
C2238C                   EVAL      MSGER='ASG1003'                                                  
C2238C                   ENDIF                                                                      
C2238C     ERRGRL        CABEQ     *ON           TP2ACHK                                            
      *                                                                                             
     C     TP2ACHK       TAG                                                                        
     C                   IF        ERRGRL=*ON                                                       
     C                   EVAL      ZXOPT2='DSP'                                                     
     C                   ENDIF                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA DE ACTUALIZACION DEL FMT P2A                     *                                
      *------------------------------------------------------------*                                
     C     P2AUPD        BEGSR                                                                      
     C                   EVAL      ZXOPT='END'                                                      
                                                                                                    
      * En el caso de la opción de visualiza no actualizo                                           
     C                   IF        INDDSP=*ON                                                       
     C                   GOTO      P2AUPDT                                                          
     C                   ENDIF                                                                      
                                                                                                    
     C                   EVAL      T3DLGA=P2ADLGA                                                   
     C     KEDPAR2       CHAIN     EDPAR2                                                           
     C     KEDPARM       CHAIN     EDPARM                                                           
     C                   EXSR      P2AMPF                                                           
     C                   IF        %FOUND(EDPARM)                                                   
     C                   UPDATE    REDPARM                                                          
     C                   ELSE                                                                       
     C                   EVAL      T3DAT1=*DATE                                                     
     C                   WRITE     REDPARM                                                          
     C                   ENDIF                                                                      
     C                   IF        %FOUND(EDPAR2)                                                   
     C                   UPDATE    REDPAR2                                                          
     C                   ELSE                                                                       
     C                   EVAL      T4DAT1=*DATE                                                     
     C                   WRITE     REDPAR2                                                          
     C                   ENDIF                                                                      
      *                                                                                             
      * En el caso que sea una copia                                                                
      *                                                                                             
     C                   IF        INDCPY=*ON                                                       
     C                   ENDIF                                                                      
                                                                                                    
     C     P2AUPDT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA PASAR DE PANTALLA P2A A FICHERO                  *                                
      *------------------------------------------------------------*                                
     C     P2AMPF        BEGSR                                                                      
      *                                                                                             
FQ798C                                                                                              
FQ798C                   IF        %FOUND(EDPARM)                                                   
FQ798C                   IF        T3NIMF<>P2ANIMF OR                                               
FQ798C                             T3OBSO<>P2AOBSO OR                                               
FQ798C                             T3SSTO<>P2ASSTO OR                                               
FQ798C                             T3PEXP<>P2APEXP OR                                               
FQ798C                             T3ENIN<>P2AENIN OR                                               
FQ798C                             T3DIBE<>P2ADIBE OR                                               
FQ798C                             T3NCLF<>P2ANCLF OR                                               
FQ798C                             T3LOGI<>P2ALOGI OR                                               
FQ798C                             T3STCK<>P2ASTCK OR                                               
FQ798C                             T3EDFO<>P2AEDFO OR                                               
FH009C                             T3RESE<>P2ARESE OR                                               
FH009C                             T3RTRE<>P2ARTRE OR                                               
SE257C                             T3ARMP<>P2AARMP or                                               
FQ798C                             T3ARVM<>P2AARVM                                                  
C2238C                             OR T3OFEX<>P2AOFEX                                               
FQ798C                   EVAL      T3DA82=*DATE                                                     
FQ798C                   EVAL      T3USU2=SDSUSR                                                    
FQ798C                   EVAL      T3PAN2=SDSJOB                                                    
FQ798C                   TIME                    T3HO82                                             
FQ798C                   WRITE     REDHPAR                                                          
FQ798C                   ENDIF                                                                      
FQ798C                   ENDIF                                                                      
      *                                                                                             
     C                   EVAL      T3NIMF=P2ANIMF                                                   
     C                   EVAL      T3OBSO=P2AOBSO                                                   
     C                   EVAL      T3SSTO=P2ASSTO                                                   
     C                   EVAL      T3PEXP=P2APEXP                                                   
FQ710C*                  EVAL      T3ICLD=P2AICLD                                                   
FQ607C                   EVAL      T3ENIN=P2AENIN                                                   
FQ710C                   EVAL      T3DIBE=P2ADIBE                                                   
FQ710                                                                                               
FQ710C                   EVAL      PXALPH=*BLANKS                                                   
FQ710C                   MOVE      P2ALIMP       PXALPH                                             
FQ710C                   EVAL      PXNUM=0                                                          
FQ710C                   CALL      'PRD650'                                                         
FQ710C                   PARM                    PXNUM                                              
FQ710C                   PARM                    PXALPH                                             
FQ710C                   PARM                    PXFLDD                                             
FQ710C                   PARM      2             PXDCCD                                             
FQ710C                   PARM                    PXFMD1                                             
FQ710C                   PARM                    PXEDTC                                             
FQ710C                   PARM                    PXNMER                                             
FQ710C                   PARM                    PXTIPA                                             
FQ798C                   IF        T3LIMP<>PXNUM AND %FOUND(EDPARM)                                 
FQ798C                   EVAL      T3DA82=*DATE                                                     
FQ798C                   EVAL      T3USU2=SDSUSR                                                    
FQ798C                   EVAL      T3PAN2=SDSJOB                                                    
FQ798C                   TIME                    T3HO82                                             
FQ798C                   WRITE     REDHPAR                                                          
FQ798C                   ENDIF                                                                      
FQ710C                   EVAL      T3LIMP=PXNUM                                                     
FQ710                                                                                               
FQ710C                   EVAL      PXALPH=*BLANKS                                                   
FQ710C                   MOVE      P2ALIME       PXALPH                                             
FQ710C                   EVAL      PXNUM=0                                                          
FQ710C                   CALL      'PRD650'                                                         
FQ710C                   PARM                    PXNUM                                              
FQ710C                   PARM                    PXALPH                                             
FQ710C                   PARM                    PXFLDD                                             
FQ710C                   PARM      2             PXDCCD                                             
FQ710C                   PARM                    PXFMD1                                             
FQ710C                   PARM                    PXEDTC                                             
FQ710C                   PARM                    PXNMER                                             
FQ710C                   PARM                    PXTIPA                                             
FQ798C                   IF        T3LIME<>PXNUM AND %FOUND(EDPARM)                                 
FQ798C                   EVAL      T3DA82=*DATE                                                     
FQ798C                   EVAL      T3USU2=SDSUSR                                                    
FQ798C                   EVAL      T3PAN2=SDSJOB                                                    
FQ798C                   TIME                    T3HO82                                             
FQ798C                   WRITE     REDHPAR                                                          
FQ798C                   ENDIF                                                                      
FQ710C                   EVAL      T3LIME=PXNUM                                                     
FQ726C                   EVAL      T3NCLF=P2ANCLF                                                   
FQ726C                   EVAL      T3LOGI=P2ALOGI                                                   
FQ726C                   EVAL      T3STCK=P2ASTCK                                                   
FQ726C                   EVAL      T3EDFO=P2AEDFO                                                   
FQ765                                                                                               
FQ765C                   EVAL      T3ARVM=P2AARVM                                                   
SE257C                   EVAL      T3ARMP=P2AARMP                                                   
16051C                   EVAL      T3OPL1=P2AOPL1                                                   
16051C*                  EVAL      T3OPL2=P2AOPL2                                                   
FH009C                   EVAL      T3RESE=P2ARESE                                                   
FH009C                   EVAL      T3RTRE=P2ARTRE                                                   
C1369C                   EVAL      T3LVIR=P2ALVIR                                                   
C1636C                   EVAL      T3VFYB=P2AVFYB                                                   
C1636C                   EVAL      T3ADOM=P2AADOM                                                   
C2238C                   EVAL      T3OFEX=P2AOFEX                                                   
FGI25c                   if        bDoomV3 =*on                                                     
FGI25c                   eval      T3mtos=P2Amtos                                                   
FGI25c                   endif                                                                      
      *                                                                                             
FQ798C                   EVAL      T3DAT8=*DATE                                                     
FQ798C                   EVAL      T3USUA=SDSUSR                                                    
FQ798C                   EVAL      T3PANT=SDSJOB                                                    
FQ798C                   TIME                    T3HORA                                             
FQ710                                                                                               
FQ710C                   EVAL      PXALPH=*BLANKS                                                   
FQ710C                   EVAL      PXNUM=P2APNFE                                                    
FQ710C                   CALL      'PRD650'                                                         
FQ710C                   PARM                    PXNUM                                              
FQ710C                   PARM                    PXALPH                                             
FQ710C                   PARM                    PXFLDD                                             
FQ710C                   PARM      0             PXDCCD                                             
FQ710C                   PARM                    PXFMD1                                             
FQ710C                   PARM                    PXEDT1                                             
FQ710C                   PARM                    PXNMER                                             
FQ710C                   PARM                    PXTIPA                                             
     C                   MOVE      PXALPH        T3PNFE                                             
      *                                                                                             
     C                   EVAL      T4COEN=P2ACOEN                                                   
     C                   EVAL      T4CSTO=P2ACSTO                                                   
     C                   EVAL      T4DAT8=*DATE                                                     
     C                   EVAL      T4USUA=SDSUSR                                                    
     C                   EVAL      T4PANT=SDSJOB                                                    
     C                   TIME                    T4HORA                                             
     C                                                                                              
      *                                                                                             
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA CONTROL DEL FMT P30                              *                                
      *------------------------------------------------------------*                                
     C     P30MAIN       BEGSR                                                                      
     C                   DOW       ZXOPT1='P30'                                                     
     C     ZXOPT2        CASEQ     'CLR'         P30CLR                                             
     C     ZXOPT2        CASEQ     'INZ'         P30INZ                                             
     C     ZXOPT2        CASEQ     'DSP'         P30DSP                                             
     C     ZXOPT2        CASEQ     'CMD'         P30CMD                                             
     C     ZXOPT2        CASEQ     'CHK'         P30CHK                                             
     C     ZXOPT2        CASEQ     'UPD'         P30UPD                                             
     C                   ENDCS                                                                      
     C                   ENDDO                                                                      
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA LIMPIEZA  DE P30                                 *                                
      *------------------------------------------------------------*                                
     C     P30CLR        BEGSR                                                                      
     C                   EVAL      ZXOPT2='INZ'                                                     
     C                   RESET                   Z_P                                                
     C                   MOVEA     ZXZERO10      *IN(30)                                            
     C                   MOVEA     ZXZERO10      *IN(40)                                            
     C                   MOVEA     ZXZERO10      *IN(50)                                            
     C                   MOVEA     ZXZERO10      *IN(60)                                            
     C                   EVAL      CSRFILA=0                                                        
     C                   EVAL      CSRCOLU=0                                                        
     C     P30CLRT       ENDSR                                                                      
      *                                                                                             
      **************************************************************                                
      * SUBRUTINA INICIALITZACIÓ DEL FMT P30                       *                                
      *------------------------------------------------------------*                                
     C     P30INZ        BEGSR                                                                      
      *                                                                                             
     C                   EVAL      ZXOPT2='DSP'                                                     
     C     *NOKEY        CLEAR     *ALL          REDPARM                                            
     C     KEDPARM       CHAIN     EDPARM                             81                            
     C                   IF        CHAIN=*ON                                                        
     C                   EVAL      ZXOPT='END'                                                      
     C                   GOTO      P30INZT                                                          
     C                   ENDIF                                                                      
                                                                                                    
     C                   EXSR      P30MFP                                                           
                                                                                                    
     C     P30INZT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA PASAR DE FICHERO A PANTALLA P30                  *                                
      *------------------------------------------------------------*                                
     C     P30MFP        BEGSR                                                                      
      *                                                                                             
     C                   EVAL      P30DLGA=T3DLGA                                                   
     C                   EVAL      P3CDLGA=*BLANKS                                                  
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VISUALITZACIÓ DEL FMT P30                        *                                
      *------------------------------------------------------------*                                
     C     P30DSP        BEGSR                                                                      
      * ENS ENCARREGUEM QUE EL PROPER PAS SIGUI COMPROVAR ENTRADA CMD                               
     C                   EVAL      ZXOPT2='CMD'                                                     
     C                   EVAL      PPPCMD1='CMD3012'                                                
     C                   EXFMT     P30                                                              
     C                   MOVEA     ZXZERO10      *IN(30)                                            
     C                   MOVEA     ZXZERO10      *IN(40)                                            
     C                   MOVEA     ZXZERO10      *IN(50)                                            
     C                   MOVEA     ZXZERO10      *IN(60)                                            
     C                   EVAL      ERRGRL=*OFF                                                      
     C                   EVAL      MSGER=*BLANKS                                                    
     C     P30DSPT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VALIDACIÓ DELS CMDS  DEL FMT P30                 *                                
      *------------------------------------------------------------*                                
     C     P30CMD        BEGSR                                                                      
     C                   EVAL      ZXOPT2='CHK'                                                     
      *VALIDACIONES TECLAS DE FUNCION                                                               
     C                   SELECT                                                                     
      * FINALITZAR EL PROGRAMA                                                                      
     C                   WHEN      EXIT=*ON                                                         
     C                   EVAL      ZXOPT1='END'                                                     
      * SOL·LICITUD AJUDA D'ARTICLES                                                                
     C                   WHEN      HELP=*ON                                                         
     C                   EVAL      ZXOPT2='DSP'                                                     
     C                   EXSR      CS_POCUR2                                                        
      * RETROCESO PANTALLA                                                                          
     C                   WHEN      RETRO=*ON                                                        
     C                   EVAL      ZXOPT1='END'                                                     
     C                   ENDSL                                                                      
                                                                                                    
     C     TP30CMD       TAG                                                                        
     C                   IF        ERRGRL=*ON                                                       
     C                   EVAL      ZXOPT2='DSP'                                                     
     C                   ENDIF                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VALIDACIÓ DELS CAMPS DEL FMT P30                 *                                
      *------------------------------------------------------------*                                
     C     P30CHK        BEGSR                                                                      
     C                   EVAL      ZXOPT2='UPD'                                                     
                                                                                                    
      * no puede existir                                                                            
     C                   EVAL      T3DLGA=P3CDLGA                                                   
     C     KEDPARM       CHAIN (N) EDPARM                             81                            
     C                   IF        CHAIN=*OFF                                                       
     C                   EVAL      WRK40=*ON                                                        
     C                   EVAL      ERRGRL=*ON                                                       
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP30CHK                                            
      *                                                                                             
     C     TP30CHK       TAG                                                                        
     C                   IF        ERRGRL=*ON                                                       
     C                   EVAL      MSGER='MSG0008'                                                  
     C                   EVAL      ZXOPT2='DSP'                                                     
     C                   ENDIF                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA DE AYUDA PARA FMT P30                            *                                
      *------------------------------------------------------------*                                
     C     P30F4         BEGSR                                                                      
     C     P30F4T        ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA DE ACTUALIZACION DEL FMT P30                     *                                
      *------------------------------------------------------------*                                
     C     P30UPD        BEGSR                                                                      
     C                   EVAL      ZXOPT='P2ACLR'                                                   
                                                                                                    
     C                   EVAL      T3DLGA=P30DLGA                                                   
     C     P30UPDT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA CONTROL DEL FMT P40                              *                                
      *------------------------------------------------------------*                                
     C     P40MAIN       BEGSR                                                                      
     C                   DOW       ZXOPT1='P40'                                                     
     C     ZXOPT2        CASEQ     'CLR'         P40CLR                                             
     C     ZXOPT2        CASEQ     'INZ'         P40INZ                                             
     C     ZXOPT2        CASEQ     'DSP'         P40DSP                                             
     C     ZXOPT2        CASEQ     'CMD'         P40CMD                                             
     C     ZXOPT2        CASEQ     'CHK'         P40CHK                                             
     C     ZXOPT2        CASEQ     'UPD'         P40UPD                                             
     C                   ENDCS                                                                      
     C                   ENDDO                                                                      
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA LIMPIEZA  DE P40                                 *                                
      *------------------------------------------------------------*                                
     C     P40CLR        BEGSR                                                                      
     C                   EVAL      ZXOPT2='INZ'                                                     
     C                   MOVEA     ZXZERO10      *IN(30)                                            
     C                   MOVEA     ZXZERO10      *IN(40)                                            
     C                   MOVEA     ZXZERO10      *IN(50)                                            
     C                   MOVEA     ZXZERO10      *IN(60)                                            
     C                   EVAL      CSRFILA=0                                                        
     C                   EVAL      CSRCOLU=0                                                        
     C     P40CLRT       ENDSR                                                                      
      *                                                                                             
      **************************************************************                                
      * SUBRUTINA INICIALITZACIÓ DEL FMT P40                       *                                
      *------------------------------------------------------------*                                
     C     P40INZ        BEGSR                                                                      
      *                                                                                             
     C                   EVAL      ZXOPT2='DSP'                                                     
     C     *NOKEY        CLEAR     *ALL          REDPARM                                            
     C     KEDPARM       CHAIN     EDPARM                             81                            
     C                   EXSR      P40MFP                                                           
                                                                                                    
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA PASAR DE FICHERO A PANTALLA P40                  *                                
      *------------------------------------------------------------*                                
     C     P40MFP        BEGSR                                                                      
      *                                                                                             
     C                   EVAL      P40DLGA=T3DLGA                                                   
      *                                                                                             
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VISUALITZACIÓ DEL FMT P40                        *                                
      *------------------------------------------------------------*                                
     C     P40DSP        BEGSR                                                                      
      * ENS ENCARREGUEM QUE EL PROPER PAS SIGUI COMPROVAR ENTRADA CMD                               
     C                   EVAL      ZXOPT2='CMD'                                                     
     C                   EVAL      PPPCMD1='CMD3029'                                                
     C                   EXFMT     P40                                                              
     C                   MOVEA     ZXZERO10      *IN(30)                                            
     C                   MOVEA     ZXZERO10      *IN(40)                                            
     C                   MOVEA     ZXZERO10      *IN(50)                                            
     C                   MOVEA     ZXZERO10      *IN(60)                                            
     C                   EVAL      ERRGRL=*OFF                                                      
     C                   EVAL      MSGER=*BLANKS                                                    
     C     P40DSPT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VALIDACIÓ DELS CMDS  DEL FMT P40                 *                                
      *------------------------------------------------------------*                                
     C     P40CMD        BEGSR                                                                      
     C                   EVAL      ZXOPT2='CHK'                                                     
      *VALIDACIONES TECLAS DE FUNCION                                                               
     C                   SELECT                                                                     
      * FINALITZAR EL PROGRAMA                                                                      
     C                   WHEN      EXIT=*ON                                                         
     C                   EVAL      ZXOPT1='END'                                                     
      * RETROCESO PANTALLA                                                                          
     C                   WHEN      RETRO=*ON                                                        
     C                   EVAL      ZXOPT1='END'                                                     
     C                   ENDSL                                                                      
                                                                                                    
     C     TP40CMD       TAG                                                                        
     C                   IF        ERRGRL=*ON                                                       
     C                   EVAL      ZXOPT2='DSP'                                                     
     C                   ENDIF                                                                      
                                                                                                    
     C     P40CMDT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VALIDACIÓ DELS CAMPS DEL FMT P40                 *                                
      *------------------------------------------------------------*                                
     C     P40CHK        BEGSR                                                                      
     C                   EVAL      ZXOPT2='UPD'                                                     
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER ='MSG0208'                                                 
                                                                                                    
     C     TP40CHK       TAG                                                                        
     C                   IF        ERRGRL=*ON                                                       
     C                   EVAL      ZXOPT2='DSP'                                                     
     C                   ENDIF                                                                      
                                                                                                    
     C     P40CHKT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA DE AYUDA PARA FMT P40                            *                                
      *------------------------------------------------------------*                                
     C     P40F4         BEGSR                                                                      
     C     P40F4T        ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA DE ACTUALIZACION DEL FMT P40                     *                                
      *------------------------------------------------------------*                                
     C     P40UPD        BEGSR                                                                      
     C                   EVAL      ZXOPT='END'                                                      
                                                                                                    
     C                   EVAL      T3CIAS=@PCIAS                                                    
     C                   EVAL      T3DLGA=P40DLGA                                                   
     C     KEDPARM       CHAIN     EDPARM                             81                            
                                                                                                    
      * Eliminación                                                                                 
     C                   IF        CHAIN=*OFF                                                       
FQ798C*                  DELETE    REDPARM                                                          
FQ798C*                  EVAL      T3DAT8=*DATE                                                     
FQ798C*                  EVAL      T3USUA=SDSUSR                                                    
FQ798C*                  EVAL      T3PANT=SDSJOB                                                    
FQ798C*                  TIME                    T3HORA                                             
FQ798C                   EVAL      T3DA82=*DATE                                                     
FQ798C                   EVAL      T3USU2=SDSUSR                                                    
FQ798C                   EVAL      T3PAN2=SDSJOB                                                    
FQ798C                   TIME                    T3HO82                                             
FQ798C                   EVAL      T3BAJA='1'                                                       
FQ798C                   UPDATE    REDPARM                                                          
     C                   ENDIF                                                                      
     C     P40UPDT       ENDSR                                                                      
      **************************************************************                                
      * COMMON SUBRUTINE (CS_) :                                  *                                 
      * SUBRUTINA DE POSICIONAMENT DEL CURSOR                      *                                
      *------------------------------------------------------------*                                
     C     CS_POCUR2     BEGSR                                                                      
      * OBTENIM LA POSICIO DEL CURSOR                                                               
     C     FMTPOCUR      DIV       256           CSRFILA                                            
     C                   MVR                     CSRCOLU                                            
     C                   ENDSR                                                                      
      *                                                                                             
      **************************************************************                                
      * SUBRUTINA QUE CONTROLA ELS POSSIBLES ERRORS DE PROGRAMA    *                                
      *------------------------------------------------------------*                                
     C/COPY *LIBL/QSRDSRC,SRD020                                                                    
