      **************************************************************                                
      * APLICACIÓ: MÒDUL DE LOGISTICA                              *                                
      **************************************************************                                
      * TITOL: DO0035  © FLUIDRA SERVICES                          *                                
      * DATA CREACIO:  18/03/2010                                  *                                
      * FUNCIO DEL PROGRAMA: DOM - MANTENIMIENTO PRIORIDADES POR   *                                
      *                      CIAS/ALMACEN                          *                                
      *                      ( * NIVEL DE DLGA *)                  *                                
      * (DSP/CRT/DLT/CPY/CHG)                                      *                                
      * DOCUMENTACIO:                                              *                                
      *                                                            *                                
      * ZXOPT1 = NOM DEL PROCÉS                                    *                                
      *        - PN = FORMAT DE PANTALLA N.(N=[01,02,...,99])      *                                
      *        - WN = WINDOWS N.(N=[01,02,...,99])                 *                                
      * ZXOPT2 = RUTINA DINTRE DEL PROCÉS                          *                                
      *        - 'INZ'= INICILITZAR                                *                                
      *        - 'DSP'= VISUALITZAR LA PANTALLA                    *                                
      *        - 'CMD'= VALIDACIÓ DE LES TECLES DE FUNCIÓ          *                                
      *        - 'CHK'= VALIDACIÓ DE LA PANTALLA                   *                                
      *        - 'CLR'= NETEJA LA PANTALLA                         *                                
      *        - 'UPD'= ACTUALITZACIONS DELS FITXERS               *                                
      *                                                            *                                
      **************************************************************                                
      * ORGANIZACIÓN DEL FICHERO  EDPAR2                           *                                
      * CIRCUITO                                                   *                                
      *  TREG     DESCRIPCIÓN                                      *                                
      *  =====    ===============================================  *                                
      *    0    - CARGAMOS PRIORIDADES A NIVEL DE EMPRESA          *                                
      *    1    - VERIFICAR SI EXISTE A NIVEL DE PROVEEDOR         *                                
      *    2    - VERIFICAR SI EXISTE A NIVEL DE ARTICULO          *                                
      *    3    - VERIFICAR SI EXISTE A NIVEL DE FAM/SUBF          *                                
      *    4    - VERIFICAR SI EXISTE A NIVEL DE FAM/TARIFA        *                                
      *    5    - VERIFICAR SI EXISTE A NIVEL DE CLIENTE           *                                
      *                                                            *                                
      *    A    - CARGAMOS PRIORIDADES A NIVEL DE DELEGACIÓN       *                                
      *    B    - VERIFICAR SI EXISTE A NIVEL DE  DLGA/ PROVEEDOR  *                                
      *    C    - VERIFICAR SI EXISTE A NIVEL DE  DLGA/ ARTICULO   *                                
      *    D    - VERIFICAR SI EXISTE A NIVEL DE  DLGA/ FAMILIA    *                                
      *    E    - VERIFICAR SI EXISTE A NIVEL DE  DLGA/ FAM-SUBF   *                                
      *    F    - VERIFICAR SI EXISTE A NIVEL DE  DLGA/ FAM-TARIFA *                                
      *    G    - VERIFICAR SI EXISTE A NIVEL DE  DLGA/ CLIENTE    *                                
      *    H    - VERIFICAR SI EXISTE A NIVEL DE  DLGA/ PED.PROV.  *                                
FGI25 *    M    - Verificar excepción a nivel categorización articulo  MTO/MTS                      
      **************************************************************                                
C3758 * DATA DE MODIFICACIÓ: 09/11/2017  MARCA: C3758              *                                
C3758 * AUTOR: David Espuny                                        *                                
C3758 * DOCUMENTACIÓ: Añadir un parametro en llamada MM0600        *                                
C3758 *               y borrar el regitro del EDPAR4 con artículo  *                                
C3758 **************************************************************                                
FGI25 */ Date : 20/06/2025    Marca: FGI25         Moficicació: OLFGI-25                            
FGI25 */ Descripció: EXCEPCIÓN DOM EN ITALIA                                                        
FGI25 */ Autor: MMontana                                                                            
FGI25 */  Nueva excepción por categorización del articulo: MTO/MTS                                  
FGI25 */////////////////////////////////////////////////////////////////////////////////////////    
     H DATEDIT(*YMD/)                                                                               
                                                                                                    
     FDO0035FM  CF   E             WORKSTN INFDS(FMTDS)                                             
     FEDPAR2    UF A E           K DISK    INFDS(FMFDS) INFSR(*PSSR)                                
     FEDHPA2    UF A E           K DISK                                                             
C3758FEDPAR4    UF   E           K DISK                                                             
C3758FEDHPA4    IF A E           K DISK                                                             
     FPMEMPR    IF   E           K DISK                                                             
     FPMTAB2    IF   E           K DISK                                                             
     FMSARTI00  IF   E           K DISK                                                             
     FPMTABD    IF   E           K DISK                                                             
     FMSFAMI    IF   E           K DISK                                                             
     FCOCLIN    IF   E           K DISK                                                             
     FPUPROV    IF   E           K DISK                                                             
     FMSALMA    IF   E           K DISK                                                             
FGI25Fgmtabd00  if   e           k disk                                                             
                                                                                                    
      * AREA DE DADES DE PROGRAMA I INICIALITZACIO DE VALORS COMUNS                                 
     D                SDS                                                                           
     D  SDSPGM                 1     10                                                             
     D    CCCPGM                     10    OVERLAY(SDSPGM)                                          
     D  SDSJOB               244    253                                                             
     D    CCCJOB                     10    OVERLAY(SDSJOB)                                          
     D  SDSUSR               254    263                                                             
     D  SDSJNBR              264    269                                                             
      *                                                                                             
      * PARÀMETRES PEL PRD650 I CAMPS DE TREBALL ASSOCIATS                                          
      * VALOR NUMÈRIC                                                                               
     D   PXNUM         S             29  9                                                          
      * VALOR ALFANUMÈRIC                                                                           
     D   PXALPH        S             29                                                             
      * LONGITUD TOTAL DEL CAMP (Nº CARÀCTERS INCLÒS CODI EDICIÓ)                                   
     D   PXFLDD        S              2  0 INZ(20)                                                  
      * Nº DE DECIMALS DEL CAMP                                                                     
     D  PXDCCD         S              1  0                                                          
      * TIPUS DE FORMAT DECIMAL (.,)                                                                
     D  PXFMD1         S                   LIKE(ZZFMD1)INZ                                          
      * CODI D'EDICIÓ (4,M,Q,Z)                                                                     
     D  PXEDTC         S                   LIKE(ZZEDTC)INZ('M')                                     
     D  PXEDT2         S                   LIKE(ZZEDTC)INZ('K')                                     
      * RETORN CODI D'ERROR                                                                         
     D  PXNMER         S              1  0 INZ(0)                                                   
      * TIPUS D'AJUST DECIMAL (0=MIG 1=PER SOBRE 2=PER SOTA)                                        
     D  PXTIPA         S                   LIKE(ZZAJUD)                                             
                                                                                                    
      * AREA DE DADES LOCAL I INICIALITZACIO DE VALORS COMUNS                                       
     D DSLDA         E DS                  EXTNAME(PURLDADS)                                        
     D    CCCDEEM                    30    OVERLAY(ZZDEEM)                                          
                                                                                                    
     D* AREA DE DADES D'INFORMACIÓ ARXIU                                                            
     D  FMTDS          DS                                                                           
     D    FMTPOCUR           370    371B 0                                                          
     D    FMTPOS             378    379B 0                                                          
     D    FMTRCD         *RECORD                                                                    
     D  FMFDS          DS                                                                           
     D    FMFFILE        *FILE                                                                      
     D    FMFSTS         *STATUS                                                                    
                                                                                                    
     D* CONTROL DEL FLUXE DEL PROGRAMA                                                              
     D                 DS                                                                           
     D  ZXOPT                  1      6                                                             
     D    ZXOPT1               1      3                                                             
     D    ZXOPT2               4      6                                                             
                                                                                                    
     D* Descomposicion de FIELD para tomar la parte del diccionario                                 
     D                 DS                                                                           
     D  FIELD                  1     10                                                             
     D    ZXFMTO               1      3                                                             
     D    ZXFIE4               4      7                                                             
      * PLANTILLA D'INDICADORS DEL PROGRAMA (ELS RESERVATS NO SURTEN)                               
     D  INDICADORS   E DS                  BASED(INDICADORP)                                        
     D                                     EXTNAME(INDDS:RIND0199)                                  
     D    CONFIR                      1    OVERLAY(CMD10)                                           
     D    INDCHG                      1    OVERLAY(WRK25)                                           
     D    INDCPY                      1    OVERLAY(WRK26)                                           
     D    INDDLT                      1    OVERLAY(WRK27)                                           
     D    INDDSP                      1    OVERLAY(WRK28)                                           
     D    INDCRT                      1    OVERLAY(WRK29)                                           
     D    INDPROT                     1    OVERLAY(SETL00)                                          
     D  INDICADORP     S               *   INZ(%ADDR(*IN))                                          
                                                                                                    
     D                 DS                                                                           
     D  ZXPOSCUR               1      4  2                                                          
     D    ZXPOSX               1      2  0                                                          
     D    ZXPOSY               3      4  0                                                          
      * Definicion de algunas constantes                                                            
     D  ZXZERO10       C                   '0000000000'                                             
      *IMPORTACIÓ DE PARÀMETRES                                                                     
                                                                                                    
     D  @PCIAS         S                   LIKE(T4CIA1)                                             
     D  @PPRIO         S                   LIKE(T4PRIO)                                             
     D  @PDLGA         S                   LIKE(T4DLGA)                                             
     D  @PPRVR         S                   LIKE(T4PRVR)                                             
     D  @PARVT         S                   LIKE(T4ARVT)                                             
     D  @PFAMT         S                   LIKE(T4FAMT)                                             
     D  @PTREG         S                   LIKE(T4TREG)                                             
     D  @PCIA2         S                   LIKE(T4CIA1)                                             
     D  @PMAGA         S                   LIKE(T4MAGA)                                             
     D  @POPCI         S              2                                                             
     D  @PERRO         S              1                                                             
     D  @PCLTA         S             10    INZ                                                      
     D  @PCTAB         S             10    INZ                                                      
                                                                                                    
     D  @PFILE         S             10                                                             
     D  @PPGM          S             10                                                             
     D  @POBJE         S             10                                                             
     D  @PTOBJ         S             10                                                             
     D  @JOBD          S             10                                                             
     D  @TIPD          S             10                                                             
                                                                                                    
      *EXPORTACIÓ DE PARÀMETRES                                                                     
     D  @PECIAS        S                   LIKE(T4CIA1)                                             
                                                                                                    
     D    @PEOPT       S              2                                                             
     D    @PEPGM       S                   LIKE(SDSPGM) INZ                                         
     D    @PEFMT       S                   LIKE(RECORD) INZ                                         
     D    @PEFLD       S                   LIKE(FIELD)  INZ                                         
     D    @PEERR       S              1                 INZ                                         
     D  ZXPRIM         S              1  0                                                          
     D                                                                                              
     D                 DS                                                                           
     D  ZXARVM                 1     25                                                             
     D    ZXARTI               1     15                                                             
     D    ZXVARI              16     18                                                             
     D    ZXMODE              19     21                                                             
     D                                                                                              
      *                                                                                             
     D  T4AMPL         DS                                                                           
     D     T4OPL1              1      3                                                             
     D     T4OPL2              4      6                                                             
     D     T4RESE              7      7                                                             
     D     T4RTRE              8      8                                                             
     D     T4LVIR              9     11                                                             
      *                                                                                             
      * DEFINICIO DE CAMPS DE TREBALL                                                               
      *                                                                                             
     D  Z_P            S              2  0 INZ(1)                                                   
     D  ZXPTRETORN     S              6A   INZ                                                      
                                                                                                    
     D  ZXPRIO         S                   LIKE(T4PRIO)                                             
     IRPMTAB2                                                                                       
     I              PECIAS                      XXCIAS                                              
      **************************************************************                                
      * RUTINA PRINCIPAL DEL PGM : DISTRIBUCIÓ DEL PAS PELS FMTS   *                                
      *------------------------------------------------------------*                                
     C     ZXOPT1        DOWNE     'END'                                                            
     C     ZXOPT1        CASEQ     'P2B'         P2BMAIN                                            
     C     ZXOPT1        CASEQ     'P2C'         P2CMAIN                                            
     C     ZXOPT1        CASEQ     'P2D'         P2DMAIN                                            
     C     ZXOPT1        CASEQ     'P2E'         P2EMAIN                                            
     C     ZXOPT1        CASEQ     'P2F'         P2FMAIN                                            
     C     ZXOPT1        CASEQ     'P2G'         P2GMAIN                                            
     C     ZXOPT1        CASEQ     'P2H'         P2HMAIN                                            
FGI25C     ZXOPT1        CASEQ     'P2M'         P2MMAIN                                            
     C                   CAS                     P2BMAIN                                            
     C                   ENDCS                                                                      
     C                   ENDDO                                                                      
     C                   SETON                                        LR                            
      **************************************************************                                
      * SUBRUTINA INICIAL                                          *                                
      *------------------------------------------------------------*                                
     C     *INZSR        BEGSR                                                                      
                                                                                                    
      * Entrada de parámetros                                                                       
      *                                                                                             
FGI25 *                                                                                             
FGI25C     kgmtabd00     klist                                                                      
FGI25C                   kfld                    t1ctab                                             
FGI25C                   kfld                    t1cele                                             
FGI25 *                                                                                             
     C     KPMEMPR       KLIST                                                                      
     C                   KFLD                    P7CIAS                                             
     C                   KFLD                    P7DLGA                                             
C3758 *                                                                                             
C3758C     KEDPAR4       KLIST                                                                      
C3758C                   KFLD                    T6CIA1                                             
C3758C                   KFLD                    T6TREG                                             
C3758C                   KFLD                    T6DLGA                                             
C3758C                   KFLD                    T6PRVR                                             
C3758C                   KFLD                    T6ARVT                                             
      *                                                                                             
     C     KEDPAR2_A     KLIST                                                                      
     C                   KFLD                    T4CIA1                                             
     C                   KFLD                    T4TREG                                             
     C                   KFLD                    T4DLGA                                             
     C                   KFLD                    T4PRVR                                             
     C                   KFLD                    T4ARVT                                             
     C                   KFLD                    T4FAMT                                             
      *                                                                                             
     C     KEDPAR2_B     KLIST                                                                      
     C                   KFLD                    T4CIA1                                             
     C                   KFLD                    T4TREG                                             
     C                   KFLD                    T4DLGA                                             
     C                   KFLD                    T4PRVR                                             
     C                   KFLD                    T4ARVT                                             
     C                   KFLD                    T4FAMT                                             
     C                   KFLD                    T4PRIO                                             
      *                                                                                             
     C     KEDPAR2       KLIST                                                                      
     C                   KFLD                    T4CIA1                                             
     C                   KFLD                    T4TREG                                             
     C                   KFLD                    T4DLGA                                             
     C                   KFLD                    T4PRVR                                             
     C                   KFLD                    T4ARVT                                             
     C                   KFLD                    T4FAMT                                             
     C                   KFLD                    T4PRIO                                             
     C                   KFLD                    T4CIA2                                             
     C                   KFLD                    T4MAGA                                             
      *                                                                                             
     C     KPMTAB2       KLIST                                                                      
     C                   KFLD                    PECTAB                                             
     C                   KFLD                    PECLTA                                             
                                                                                                    
     C     KPMTABD       KLIST                                                                      
     C                   KFLD                    PECIAS                                             
     C                   KFLD                    PECTAB                                             
     C                   KFLD                    PECLTA                                             
                                                                                                    
     C     KMSARTI00     KLIST                                                                      
     C                   KFLD                    M5CIAS                                             
     C                   KFLD                    M5ARTI                                             
     C                   KFLD                    M5VARI                                             
     C                   KFLD                    M5MODE                                             
                                                                                                    
     C     KMSALMA       KLIST                                                                      
     C                   KFLD                    M0CIAS                                             
     C                   KFLD                    M0MAGA                                             
                                                                                                    
     C     KCOCLIN       KLIST                                                                      
     C                   KFLD                    S0CIAS                                             
     C                   KFLD                    S0CUST                                             
                                                                                                    
     C     KPUPROV       KLIST                                                                      
     C                   KFLD                    C0CIAS                                             
     C                   KFLD                    C0PRVR                                             
                                                                                                    
     C     KMSFAMI       KLIST                                                                      
     C                   KFLD                    MNCIAS                                             
     C                   KFLD                    MNFMIL                                             
     C                   KFLD                    MNSMIL                                             
      *************************************************************                                 
      * ENTRADA PARAMETROS                                                                          
      *************************************************************                                 
     C     *ENTRY        PLIST                                                                      
     C                   PARM                    @PCIAS                                             
     C                   PARM                    @PPRIO                                             
     C                   PARM                    @PDLGA                                             
     C                   PARM                    @PPRVR                                             
     C                   PARM                    @PARVT                                             
     C                   PARM                    @PFAMT                                             
     C                   PARM                    @PTREG                                             
     C                   PARM                    @PCIA2                                             
     C                   PARM                    @PMAGA                                             
     C                   PARM                    @POPCI                                             
     C                   PARM                    @PERRO                                             
     C                                                                                              
      *                                                                                             
      * RECUPERACIÓ DE LA LDA DE COMPRES                                                            
      *                                                                                             
     C     *DTAARA       DEFINE    PURLDA        DSLDA                                              
     C                   IN        DSLDA                                                            
                                                                                                    
      * TITOLS DE PANTALLES (CODIS D'ARXIU DE MISSATGES)                                            
     C                   EVAL      CCCCTIT='TDO0020'                                                
      * VALORES COMUNES                                                                             
     C                   EVAL      T4CIA1=@PCIAS                                                    
     C                   EVAL      T4TREG=@PTREG                                                    
     C                   EVAL      T4DLGA=@PDLGA                                                    
     C                   EVAL      T4FAMT=@PFAMT                                                    
     C                   EVAL      T4PRVR=@PPRVR                                                    
     C                   EVAL      T4ARVT=@PARVT                                                    
     C                   EVAL      T4PRIO=@PPRIO                                                    
     C                   EVAL      T4CIA2=@PCIA2                                                    
     C                   EVAL      T4MAGA=@PMAGA                                                    
      *                                                                                             
     C                   EVAL      S0CIAS=@PCIAS                                                    
     C                   EVAL      C0CIAS=@PCIAS                                                    
     C                   EVAL      M0CIAS=@PCIAS                                                    
     C                   EVAL      M5CIAS=@PCIAS                                                    
     C                   EVAL      PECIAS=@PCIAS                                                    
      *                                                                                             
      * ENS POSICIONEM EN EL FORMAT DE PANT. SEGONS NECESSITAT.                                     
      * POR DEFECTO IREMOS A LA 2ª PANTALLA                                                         
      *                                                                                             
     C                   EVAL      INDCHG=*ON                                                       
     C                   SELECT                                                                     
      * CRT                                                                                         
     C                   WHEN      @POPCI=' 1' OR @POPCI='1 '                                       
     C                   EVAL      INDCRT=*ON                                                       
      * DLT                                                                                         
     C                   WHEN      @POPCI=' 4' OR @POPCI='4 '                                       
     C                   EVAL      INDDLT=*ON                                                       
     C                   EVAL      INDDSP=*ON                                                       
     C                   EVAL      INDPROT=*ON                                                      
      * DSP                                                                                         
     C                   WHEN      @POPCI=' 5' OR @POPCI='5 '                                       
     C                   EVAL      INDDSP=*ON                                                       
     C                   EVAL      INDPROT=*ON                                                      
     C                   ENDSL                                                                      
      *                                                                                             
     C                   EVAL      ZXOPT='P2BCLR'                                                   
     C                   SELECT                                                                     
     C                   WHEN      @PTREG='B'                                                       
     C                   EVAL      ZXOPT='P2BCLR'                                                   
     C                   WHEN      @PTREG='C'                                                       
     C                   EVAL      ZXOPT='P2CCLR'                                                   
     C                   WHEN      @PTREG='D'                                                       
     C                   EVAL      ZXOPT='P2DCLR'                                                   
     C                   WHEN      @PTREG='E'                                                       
     C                   EVAL      ZXOPT='P2ECLR'                                                   
     C                   WHEN      @PTREG='F'                                                       
     C                   EVAL      ZXOPT='P2FCLR'                                                   
     C                   WHEN      @PTREG='G'                                                       
     C                   EVAL      ZXOPT='P2GCLR'                                                   
     C                   WHEN      @PTREG='H'                                                       
     C                   EVAL      ZXOPT='P2HCLR'                                                   
FGI25C                   when      @PTREG='M'                                                       
FGI25C                   eval      ZXOPT='P2MCLR'                                                   
     C                   ENDSL                                                                      
      *                                                                                             
     C                   EVAL      P7CIAS=ZZCIAS                                                    
     C                   EVAL      P7DLGA=@PDLGA                                                    
     C     KPMEMPR       CHAIN     PMEMPR                                                           
      *                                                                                             
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA CONTROL DEL FMT P2B                              *                                
      *------------------------------------------------------------*                                
     C     P2BMAIN       BEGSR                                                                      
     C                   EVAL      ZXOPT1='P2B'                                                     
     C                   DOW       ZXOPT1='P2B'                                                     
     C     ZXOPT2        CASEQ     'CLR'         P2BCLR                                             
     C     ZXOPT2        CASEQ     'INZ'         P2BINZ                                             
     C     ZXOPT2        CASEQ     'DSP'         P2BDSP                                             
     C     ZXOPT2        CASEQ     'CMD'         P2BCMD                                             
     C     ZXOPT2        CASEQ     'CHK'         P2BCHK                                             
     C     ZXOPT2        CASEQ     'UPD'         P2BUPD                                             
     C                   ENDCS                                                                      
     C                   ENDDO                                                                      
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA LIMPIEZA  DE P2B                                 *                                
      *------------------------------------------------------------*                                
     C     P2BCLR        BEGSR                                                                      
     C                   EVAL      ZXOPT2='INZ'                                                     
     C                   MOVEA     ZXZERO10      *IN(30)                                            
     C                   MOVEA     ZXZERO10      *IN(40)                                            
     C                   MOVEA     ZXZERO10      *IN(50)                                            
     C                   MOVEA     ZXZERO10      *IN(60)                                            
     C                   EVAL      CSRFILA=0                                                        
     C                   EVAL      CSRCOLU=0                                                        
     C                   MOVE      *BLANKS       MSGER                                              
     C                                                                                              
     C     P2BCLRT       ENDSR                                                                      
      *                                                                                             
      **************************************************************                                
      * SUBRUTINA INICIALITZACIÓ DEL FMT P2B                       *                                
      *------------------------------------------------------------*                                
     C     P2BINZ        BEGSR                                                                      
     C                   EVAL      ZXOPT2='DSP'                                                     
     C     *NOKEY        CLEAR     *ALL          REDPAR2                                            
     C     KEDPAR2       CHAIN     EDPAR2                             81                            
     C                   EXSR      P2BMFP                                                           
      * En el caso de altas se pasan los valores por defecto de PURLDA                              
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA PASAR DE FICHERO A PANTALLA P2B                  *                                
      *------------------------------------------------------------*                                
     C     P2BMFP        BEGSR                                                                      
     C                   EVAL      P2BDLGA=P7DLGA                                                   
     C                   EVAL      P2BDESC=P7DESC                                                   
     C                   EVAL      P2BPRVR=T4PRVR                                                   
     C                   EVAL      C0PRVR=T4PRVR                                                    
     C     KPUPROV       CHAIN     PUPROV                                                           
     C                   IF        %FOUND                                                           
     C                   EVAL      P2BDES1=C0DES1                                                   
     C                   ENDIF                                                                      
      *                                                                                             
     C                   IF        INDCRT=*ON                                                       
     C                   CLEAR                   P2BPRVR                                            
     C                   CLEAR                   P2BDES1                                            
     C                   ENDIF                                                                      
      *                                                                                             
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VISUALITZACIÓ DEL FMT P2B                        *                                
      *------------------------------------------------------------*                                
     C     P2BDSP        BEGSR                                                                      
      * ENS ENCARREGUEM QUE EL PROPER PAS SIGUI COMPROVAR ENTRADA CMD                               
     C                   EVAL      ZXOPT2='CMD'                                                     
     C                   EVAL      PPPCMD1='CMD7801'                                                
     C                   EXFMT     P2B                                                              
     C                   MOVEA     ZXZERO10      *IN(30)                                            
     C                   MOVEA     ZXZERO10      *IN(40)                                            
     C                   MOVEA     ZXZERO10      *IN(50)                                            
     C                   MOVEA     ZXZERO10      *IN(60)                                            
     C                   EVAL      ERRGRL=*OFF                                                      
     C                   EVAL      MSGER=*BLANKS                                                    
     C                   EVAL      CSRCOLU=*ZEROS                                                   
     C                   EVAL      CSRFILA=*ZEROS                                                   
     C     P2BDSPT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VALIDACIÓ DELS CMDS DEL FMT P2B                 *                                 
      *------------------------------------------------------------*                                
     C     P2BCMD        BEGSR                                                                      
     C                   EVAL      ZXOPT2='CHK'                                                     
      *VALIDACIONES TECLAS DE FUNCION                                                               
     C                   SELECT                                                                     
      * FINALITZAR EL PROGRAMA                                                                      
     C                   WHEN      EXIT=*ON                                                         
     C                   EVAL      ZXOPT1='END'                                                     
      * SOL·LICITUD AJUDA D'ARTICLES                                                                
     C                   WHEN      HELP=*ON                                                         
     C                   EVAL      ZXOPT2='DSP'                                                     
     C                   EXSR      CS_POCUR2                                                        
     C                   EXSR      P2BF4                                                            
      * RETROCESO PANTALLA                                                                          
     C                   WHEN      RETRO=*ON                                                        
     C                   EVAL      ZXOPT='END'                                                      
     C                   ENDSL                                                                      
                                                                                                    
     C     TP2BCMD       TAG                                                                        
     C                   IF        ERRGRL=*ON                                                       
     C                   EVAL      ZXOPT2='DSP'                                                     
     C                   ENDIF                                                                      
                                                                                                    
     C     P2BCMDT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA DE AYUDA EN CAMPOS DEL   FMT P2B                 *                                
      *------------------------------------------------------------*                                
     C     P2BF4         BEGSR                                                                      
     C* No se permite acceso a consulta si estamos en opcion de visualizar                          
     C                   IF        INDDSP=*ON                                                       
     C                   EVAL      ERRGRL=*ON                                                       
     C                   ENDIF                                                                      
                                                                                                    
      * AYUDAS                                                                                      
     C                   IF        FIELD='P2BPRVR' AND                                              
     C                             INDCRT=*ON                                                       
     C                   CALL      'PU0650'                                                         
     C                   PARM                    @PCIAS                                             
     C                   PARM                    P2BPRVR                                            
     C                   PARM      *BLANKS       @PEERR                                             
     C                   GOTO      P2BF4T                                                           
     C                   ENDIF                                                                      
      * SI NO TIENE F4 SOPORTADO DOY ERROR                                                          
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='ADP0304'                                                  
     C     ERRGRL        CABEQ     *ON           P2BF4T                                             
                                                                                                    
     C     P2BF4T        ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VALIDACIÓ DELS CAMPS DEL FMT P2B                 *                                
      *------------------------------------------------------------*                                
     C     P2BCHK        BEGSR                                                                      
     C                   EVAL      ZXOPT2='UPD'                                                     
     C                   IF        INDCRT=*ON                                                       
     C                   EVAL      T4FAMT=@PFAMT                                                    
     C                   EVAL      T4PRVR=P2BPRVR                                                   
     C                   EVAL      T4ARVT=@PARVT                                                    
     C                   EVAL      T4PRIO=@PPRIO                                                    
     C                   EVAL      T4CIA2=@PCIA2                                                    
     C                   EVAL      T4MAGA=@PMAGA                                                    
     C     KEDPAR2       CHAIN     EDPAR2                                                           
     C                   IF        %FOUND                                                           
     C                   EVAL      WRK40=*ON                                                        
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='MSG0301'                                                  
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP2BCHK                                            
     C                   ENDIF                                                                      
      *                                                                                             
     C                   EVAL      C0PRVR=P2BPRVR                                                   
     C     KPUPROV       CHAIN     PUPROV                                                           
     C                   IF        NOT%FOUND                                                        
     C                   EVAL      WRK40=*ON                                                        
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='ASG1003'                                                  
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP2BCHK                                            
     C     TP2BCHK       TAG                                                                        
     C                   IF        ERRGRL=*ON                                                       
     C                   EVAL      ZXOPT2='DSP'                                                     
     C                   ENDIF                                                                      
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA DE ACTUALIZACION DEL FMT P2B                     *                                
      *------------------------------------------------------------*                                
     C     P2BUPD        BEGSR                                                                      
     C                   EVAL      ZXOPT='END'                                                      
                                                                                                    
      * En el caso de la opción de visualiza no actualizo                                           
     C                   IF        (INDDSP=*ON AND CONFIR=*OFF)                                     
     C                             OR (INDDLT=*ON AND CONFIR=*OFF)                                  
     C                   GOTO      P2BUPDT                                                          
     C                   ENDIF                                                                      
      *                                                                                             
     C                   EVAL      T4PRVR=P2BPRVR                                                   
     C     KEDPAR2       CHAIN     EDPAR2                             81                            
      *                                                                                             
     C                   EXSR      P2BMPF                                                           
      *                                                                                             
     C                   IF        CHAIN=*OFF                                                       
     C                   UPDATE    REDPAR2                                                          
     C                   ELSE                                                                       
     C                   EVAL      T4DAT1=*DATE                                                     
     C                   WRITE     REDPAR2                                                          
     C                   ENDIF                                                                      
      *                                                                                             
     C                   IF        INDDLT=*ON                                                       
     C                   EXSR      CS_DLTREG                                                        
     C                   ENDIF                                                                      
      *                                                                                             
      * En el caso que sea una copia                                                                
      *                                                                                             
     C                   IF        INDCPY=*ON                                                       
     C                   ENDIF                                                                      
                                                                                                    
     C     P2BUPDT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA PASAR DE PANTALLA P2B A FICHERO                  *                                
      *------------------------------------------------------------*                                
     C     P2BMPF        BEGSR                                                                      
      *                                                                                             
     C                   EVAL      T4PRVR=P2BPRVR                                                   
     C                   EVAL      T4DAT8=*DATE                                                     
     C                   EVAL      T4USUA=SDSUSR                                                    
     C                   EVAL      T4PANT=SDSJOB                                                    
     C                   TIME                    T4HORA                                             
      *                                                                                             
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA CONTROL DEL FMT P2B                              *                                
      *------------------------------------------------------------*                                
     C     P2CMAIN       BEGSR                                                                      
     C                   EVAL      ZXOPT1='P2C'                                                     
     C                   DOW       ZXOPT1='P2C'                                                     
     C     ZXOPT2        CASEQ     'CLR'         P2CCLR                                             
     C     ZXOPT2        CASEQ     'INZ'         P2CINZ                                             
     C     ZXOPT2        CASEQ     'DSP'         P2CDSP                                             
     C     ZXOPT2        CASEQ     'CMD'         P2CCMD                                             
     C     ZXOPT2        CASEQ     'CHK'         P2CCHK                                             
     C     ZXOPT2        CASEQ     'UPD'         P2CUPD                                             
     C                   ENDCS                                                                      
     C                   ENDDO                                                                      
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA LIMPIEZA  DE P2C                                 *                                
      *------------------------------------------------------------*                                
     C     P2CCLR        BEGSR                                                                      
     C                   EVAL      ZXOPT2='INZ'                                                     
     C                   MOVEA     ZXZERO10      *IN(30)                                            
     C                   MOVEA     ZXZERO10      *IN(40)                                            
     C                   MOVEA     ZXZERO10      *IN(50)                                            
     C                   MOVEA     ZXZERO10      *IN(60)                                            
     C                   EVAL      CSRFILA=0                                                        
     C                   EVAL      CSRCOLU=0                                                        
     C                   MOVE      *BLANKS       MSGER                                              
     C                                                                                              
     C     P2CCLRT       ENDSR                                                                      
      *                                                                                             
      **************************************************************                                
      * SUBRUTINA INICIALITZACIÓ DEL FMT P2C                       *                                
      *------------------------------------------------------------*                                
     C     P2CINZ        BEGSR                                                                      
     C                   EVAL      ZXOPT2='DSP'                                                     
     C     *NOKEY        CLEAR     *ALL          REDPAR2                                            
     C     KEDPAR2       CHAIN     EDPAR2                             81                            
     C                   EXSR      P2CMFP                                                           
      * En el caso de altas se pasan los valores por defecto de PURLDA                              
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA PASAR DE FICHERO A PANTALLA P2C                  *                                
      *------------------------------------------------------------*                                
     C     P2CMFP        BEGSR                                                                      
     C                   EVAL      P2CDLGA=P7DLGA                                                   
     C                   EVAL      P2CDESC=P7DESC                                                   
     C                   EVAL      P2CARTI=%SUBST(T4ARVT:1:15)                                      
     C                   EVAL      P2CVARI=%SUBST(T4ARVT:16:3)                                      
     C                   EVAL      P2CMODE=%SUBST(T4ARVT:19:3)                                      
     C                   EVAL      M5ARTI=%SUBST(T4ARVT:1:15)                                       
     C                   EVAL      M5VARI=%SUBST(T4ARVT:16:3)                                       
     C                   EVAL      M5MODE=%SUBST(T4ARVT:19:3)                                       
     C     KMSARTI00     CHAIN     MSARTI00                                                         
     C                   IF        %FOUND                                                           
     C                   EVAL      P2CDES1=M5DES1                                                   
     C                   ENDIF                                                                      
      *                                                                                             
     C                   IF        INDCRT=*ON                                                       
     C                   CLEAR                   P2CARTI                                            
     C                   CLEAR                   P2CVARI                                            
     C                   CLEAR                   P2CMODE                                            
     C                   CLEAR                   P2CDES1                                            
     C                   ENDIF                                                                      
      *                                                                                             
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VISUALITZACIÓ DEL FMT P2C                        *                                
      *------------------------------------------------------------*                                
     C     P2CDSP        BEGSR                                                                      
      * ENS ENCARREGUEM QUE EL PROPER PAS SIGUI COMPROVAR ENTRADA CMD                               
     C                   EVAL      ZXOPT2='CMD'                                                     
     C                   EVAL      PPPCMD1='CMD7801'                                                
     C                   EXFMT     P2C                                                              
     C                   MOVEA     ZXZERO10      *IN(30)                                            
     C                   MOVEA     ZXZERO10      *IN(40)                                            
     C                   MOVEA     ZXZERO10      *IN(50)                                            
     C                   MOVEA     ZXZERO10      *IN(60)                                            
     C                   EVAL      ERRGRL=*OFF                                                      
     C                   EVAL      MSGER=*BLANKS                                                    
     C                   EVAL      CSRCOLU=*ZEROS                                                   
     C                   EVAL      CSRFILA=*ZEROS                                                   
     C     P2CDSPT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VALIDACIÓ DELS CMDS DEL FMT P2C                 *                                 
      *------------------------------------------------------------*                                
     C     P2CCMD        BEGSR                                                                      
     C                   EVAL      ZXOPT2='CHK'                                                     
      *VALIDACIONES TECLAS DE FUNCION                                                               
     C                   SELECT                                                                     
      * FINALITZAR EL PROGRAMA                                                                      
     C                   WHEN      EXIT=*ON                                                         
     C                   EVAL      ZXOPT1='END'                                                     
      * SOL·LICITUD AJUDA D'ARTICLES                                                                
     C                   WHEN      HELP=*ON                                                         
     C                   EVAL      ZXOPT2='DSP'                                                     
     C                   EXSR      CS_POCUR2                                                        
     C                   EXSR      P2CF4                                                            
      * RETROCESO PANTALLA                                                                          
     C                   WHEN      RETRO=*ON                                                        
     C                   EVAL      ZXOPT='END'                                                      
     C                   ENDSL                                                                      
                                                                                                    
     C     TP2CCMD       TAG                                                                        
     C                   IF        ERRGRL=*ON                                                       
     C                   EVAL      ZXOPT2='DSP'                                                     
     C                   ENDIF                                                                      
                                                                                                    
     C     P2CCMDT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA DE AYUDA EN CAMPOS DEL   FMT P2B                 *                                
      *------------------------------------------------------------*                                
     C     P2CF4         BEGSR                                                                      
     C* No se permite acceso a consulta si estamos en opcion de visualizar                          
     C                   IF        INDDSP=*ON                                                       
     C                   EVAL      ERRGRL=*ON                                                       
     C                   ENDIF                                                                      
      * AYUDAS                                                                                      
     C                   IF        FIELD='P2CARTI' OR                                               
     C                             FIELD='P2CVARI' OR                                               
     C                             FIELD='P2CMODE'                                                  
     C                   CALL      'MM0600'                                                         
     C                   PARM      ZZCIAS        @PECIAS                                            
     C                   PARM                    P2CARTI                                            
     C                   PARM                    P2CVARI                                            
     C                   PARM                    P2CMODE                                            
     C                   PARM      *BLANKS       @PERRO                                             
C3758C                   PARM      *BLANKS       @PNDTCOJ          1                                
FQ844C                   PARM      *BLANKS       @PEDESC          40                                
FQ844C                   PARM      *BLANKS       @PEPKEY          40                                
     C                   GOTO      P2CF4T                                                           
     C                   ENDIF                                                                      
      * SI NO TIENE F4 SOPORTADO DOY ERROR                                                          
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='ADP0304'                                                  
     C     ERRGRL        CABEQ     *ON           P2CF4T                                             
                                                                                                    
     C     P2CF4T        ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VALIDACIÓ DELS CAMPS DEL FMT P2C                 *                                
      *------------------------------------------------------------*                                
     C     P2CCHK        BEGSR                                                                      
     C                   EVAL      ZXOPT2='UPD'                                                     
     C                   IF        INDCRT=*ON                                                       
     C                   EVAL      T4FAMT=@PFAMT                                                    
     C                   EVAL      T4PRVR=@PPRVR                                                    
     C                   EVAL      T4ARVT=P2CARTI+P2CVARI+P2CMODE                                   
     C                   EVAL      T4PRIO=@PPRIO                                                    
     C                   EVAL      T4CIA2=@PCIA2                                                    
     C                   EVAL      T4MAGA=@PMAGA                                                    
     C     KEDPAR2       CHAIN     EDPAR2                                                           
     C                   IF        %FOUND                                                           
     C                   EVAL      WRK40=*ON                                                        
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='MSG0301'                                                  
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP2CCHK                                            
     C                   ENDIF                                                                      
     C                   EVAL      M5ARTI=P2CARTI                                                   
     C                   EVAL      M5VARI=P2CVARI                                                   
     C                   EVAL      M5MODE=P2CMODE                                                   
     C     KMSARTI00     CHAIN     MSARTI00                                                         
     C                   IF        NOT%FOUND                                                        
     C                   EVAL      WRK40=*ON                                                        
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='ASG1003'                                                  
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP2CCHK                                            
     C     TP2CCHK       TAG                                                                        
     C                   IF        ERRGRL=*ON                                                       
     C                   EVAL      ZXOPT2='DSP'                                                     
     C                   ENDIF                                                                      
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA DE ACTUALIZACION DEL FMT P2C                     *                                
      *------------------------------------------------------------*                                
     C     P2CUPD        BEGSR                                                                      
     C                   EVAL      ZXOPT='END'                                                      
                                                                                                    
      * En el caso de la opción de visualiza no actualizo                                           
     C                   IF        (INDDSP=*ON AND CONFIR=*OFF)                                     
     C                             OR (INDDLT=*ON AND CONFIR=*OFF)                                  
     C                   GOTO      P2CUPDT                                                          
     C                   ENDIF                                                                      
      *                                                                                             
     C                   EVAL      T4ARVT=P2CARTI+P2CVARI+P2CMODE                                   
     C     KEDPAR2       CHAIN     EDPAR2                             81                            
      *                                                                                             
     C                   IF        INDDLT=*OFF                                                      
     C                   EXSR      P2CMPF                                                           
      *                                                                                             
     C                   IF        CHAIN=*OFF                                                       
     C                   UPDATE    REDPAR2                                                          
     C                   ELSE                                                                       
     C                   EVAL      T4DAT1=*DATE                                                     
     C                   WRITE     REDPAR2                                                          
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
      *                                                                                             
     C                   IF        INDDLT=*ON                                                       
     C                   EXSR      CS_DLTREG                                                        
     C                   ENDIF                                                                      
                                                                                                    
     C     P2CUPDT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA PASAR DE PANTALLA P2B A FICHERO                  *                                
      *------------------------------------------------------------*                                
     C     P2CMPF        BEGSR                                                                      
      *                                                                                             
     C                   EVAL      T4ARVT=P2CARTI+P2CVARI+P2CMODE                                   
     C                   EVAL      T4DAT8=*DATE                                                     
     C                   EVAL      T4USUA=SDSUSR                                                    
     C                   EVAL      T4PANT=SDSJOB                                                    
     C                   TIME                    T4HORA                                             
      *                                                                                             
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA CONTROL DEL FMT P2D                              *                                
      *------------------------------------------------------------*                                
     C     P2DMAIN       BEGSR                                                                      
     C                   EVAL      ZXOPT1='P2D'                                                     
     C                   DOW       ZXOPT1='P2D'                                                     
     C     ZXOPT2        CASEQ     'CLR'         P2DCLR                                             
     C     ZXOPT2        CASEQ     'INZ'         P2DINZ                                             
     C     ZXOPT2        CASEQ     'DSP'         P2DDSP                                             
     C     ZXOPT2        CASEQ     'CMD'         P2DCMD                                             
     C     ZXOPT2        CASEQ     'CHK'         P2DCHK                                             
     C     ZXOPT2        CASEQ     'UPD'         P2DUPD                                             
     C                   ENDCS                                                                      
     C                   ENDDO                                                                      
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA LIMPIEZA  DE P2D                                 *                                
      *------------------------------------------------------------*                                
     C     P2DCLR        BEGSR                                                                      
     C                   EVAL      ZXOPT2='INZ'                                                     
     C                   MOVEA     ZXZERO10      *IN(30)                                            
     C                   MOVEA     ZXZERO10      *IN(40)                                            
     C                   MOVEA     ZXZERO10      *IN(50)                                            
     C                   MOVEA     ZXZERO10      *IN(60)                                            
     C                   EVAL      CSRFILA=0                                                        
     C                   EVAL      CSRCOLU=0                                                        
     C                   MOVE      *BLANKS       MSGER                                              
     C                                                                                              
     C     P2DCLRT       ENDSR                                                                      
      *                                                                                             
      **************************************************************                                
      * SUBRUTINA INICIALITZACIÓ DEL FMT P2B                       *                                
      *------------------------------------------------------------*                                
     C     P2DINZ        BEGSR                                                                      
     C                   EVAL      ZXOPT2='DSP'                                                     
     C     *NOKEY        CLEAR     *ALL          REDPAR2                                            
     C     KEDPAR2       CHAIN     EDPAR2                             81                            
     C                   EXSR      P2DMFP                                                           
      * En el caso de altas se pasan los valores por defecto de PURLDA                              
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA PASAR DE FICHERO A PANTALLA P2D                  *                                
      *------------------------------------------------------------*                                
     C     P2DMFP        BEGSR                                                                      
     C                   EVAL      P2DDLGA=P7DLGA                                                   
     C                   EVAL      P2DDESC=P7DESC                                                   
     C                   EVAL      PECIAS=@PCIAS                                                    
     C                   EVAL      PECTAB='FMIL'                                                    
     C                   EVAL      PECLTA=%TRIM(@PFAMT)                                             
     C     KPMTABD       CHAIN     PMTABD                                                           
     C                   EVAL      P2DFAMI=%TRIM(@PFAMT)                                            
     C                   EVAL      P2DDES1=PEDESC                                                   
      *                                                                                             
     C                   IF        INDCRT=*ON                                                       
     C                   CLEAR                   P2DFAMI                                            
     C                   CLEAR                   P2DDES1                                            
     C                   ENDIF                                                                      
      *                                                                                             
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VISUALITZACIÓ DEL FMT P2D                        *                                
      *------------------------------------------------------------*                                
     C     P2DDSP        BEGSR                                                                      
      * ENS ENCARREGUEM QUE EL PROPER PAS SIGUI COMPROVAR ENTRADA CMD                               
     C                   EVAL      ZXOPT2='CMD'                                                     
     C                   EVAL      PPPCMD1='CMD7801'                                                
     C                   EXFMT     P2D                                                              
     C                   MOVEA     ZXZERO10      *IN(30)                                            
     C                   MOVEA     ZXZERO10      *IN(40)                                            
     C                   MOVEA     ZXZERO10      *IN(50)                                            
     C                   MOVEA     ZXZERO10      *IN(60)                                            
     C                   EVAL      ERRGRL=*OFF                                                      
     C                   EVAL      MSGER=*BLANKS                                                    
     C                   EVAL      CSRCOLU=*ZEROS                                                   
     C                   EVAL      CSRFILA=*ZEROS                                                   
     C     P2DDSPT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VALIDACIÓ DELS CMDS DEL FMT P2D                 *                                 
      *------------------------------------------------------------*                                
     C     P2DCMD        BEGSR                                                                      
     C                   EVAL      ZXOPT2='CHK'                                                     
      *VALIDACIONES TECLAS DE FUNCION                                                               
     C                   SELECT                                                                     
      * FINALITZAR EL PROGRAMA                                                                      
     C                   WHEN      EXIT=*ON                                                         
     C                   EVAL      ZXOPT1='END'                                                     
      * SOL·LICITUD AJUDA D'ARTICLES                                                                
     C                   WHEN      HELP=*ON                                                         
     C                   EVAL      ZXOPT2='DSP'                                                     
     C                   EXSR      CS_POCUR2                                                        
     C                   EXSR      P2DF4                                                            
      * RETROCESO PANTALLA                                                                          
     C                   WHEN      RETRO=*ON                                                        
     C                   EVAL      ZXOPT='END'                                                      
     C                   ENDSL                                                                      
                                                                                                    
     C     TP2DCMD       TAG                                                                        
     C                   IF        ERRGRL=*ON                                                       
     C                   EVAL      ZXOPT2='DSP'                                                     
     C                   ENDIF                                                                      
                                                                                                    
     C     P2DCMDT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA DE AYUDA EN CAMPOS DEL   FMT P2D                 *                                
      *------------------------------------------------------------*                                
     C     P2DF4         BEGSR                                                                      
     C* No se permite acceso a consulta si estamos en opcion de visualizar                          
     C                   IF        INDDSP=*ON                                                       
     C                   EVAL      ERRGRL=*ON                                                       
     C                   ENDIF                                                                      
      * AYUDAS                                                                                      
      * CAMPOS DE AYUDA                                                                             
     C                   IF        FIELD='P2DFAMI'                                                  
     C                             AND INDCRT=*ON                                                   
     C                   EVAL      @PCLTA=*BLANKS                                                   
     C                   EVAL      @PCLTA=P2DFAMI                                                   
     C                   CALL      'MMTABL'                                                         
     C                   PARM                    @PCLTA                                             
     C                   PARM      'FMIL'        @PCTAB                                             
     C                   PARM                    @PCIAS                                             
     C                   PARM      *BLANKS       @PERRO                                             
     C                   MOVEL     @PCLTA        P2DFAMI                                            
     C                   GOTO      P2DF4T                                                           
     C                   ENDIF                                                                      
      * SI NO TIENE F4 SOPORTADO DOY ERROR                                                          
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='ADP0304'                                                  
     C     ERRGRL        CABEQ     *ON           P2DF4T                                             
                                                                                                    
     C     P2DF4T        ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VALIDACIÓ DELS CAMPS DEL FMT P2D                 *                                
      *------------------------------------------------------------*                                
     C     P2DCHK        BEGSR                                                                      
     C                   EVAL      ZXOPT2='UPD'                                                     
     C                   IF        INDCRT=*ON                                                       
     C                   EVAL      T4FAMT=P2DFAMI                                                   
     C                   EVAL      T4PRVR=@PPRVR                                                    
     C                   EVAL      T4ARVT=@PARVT                                                    
     C                   EVAL      T4PRIO=@PPRIO                                                    
     C                   EVAL      T4CIA2=@PCIA2                                                    
     C                   EVAL      T4MAGA=@PMAGA                                                    
     C     KEDPAR2       CHAIN     EDPAR2                                                           
     C                   IF        %FOUND                                                           
     C                   EVAL      WRK40=*ON                                                        
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='MSG0301'                                                  
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP2DCHK                                            
     C                   ENDIF                                                                      
      *                                                                                             
     C                   EVAL      PECIAS=@PCIAS                                                    
     C                   EVAL      PECTAB='FMIL'                                                    
     C                   EVAL      PECLTA=%TRIM(P2DFAMI)                                            
     C     KPMTABD       CHAIN     PMTABD                                                           
     C                   IF        NOT%FOUND                                                        
     C                   EVAL      WRK40=*ON                                                        
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='MSG0301'                                                  
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP2DCHK                                            
     C                   EVAL      P2DDES1=PEDESC                                                   
     C     TP2DCHK       TAG                                                                        
     C                   IF        ERRGRL=*ON                                                       
     C                   EVAL      ZXOPT2='DSP'                                                     
     C                   ENDIF                                                                      
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA DE ACTUALIZACION DEL FMT P2D                     *                                
      *------------------------------------------------------------*                                
     C     P2DUPD        BEGSR                                                                      
     C                   EVAL      ZXOPT='END'                                                      
                                                                                                    
      * En el caso de la opción de visualiza no actualizo                                           
     C                   IF        (INDDSP=*ON AND CONFIR=*OFF)                                     
     C                             OR (INDDLT=*ON AND CONFIR=*OFF)                                  
     C                   GOTO      P2DUPDT                                                          
     C                   ENDIF                                                                      
      *                                                                                             
     C                   EVAL      T4FAMT=P2DFAMI                                                   
     C     KEDPAR2       CHAIN     EDPAR2                             81                            
      *                                                                                             
     C                   EXSR      P2DMPF                                                           
      *                                                                                             
     C                   IF        CHAIN=*OFF                                                       
     C                   UPDATE    REDPAR2                                                          
     C                   ELSE                                                                       
     C                   EVAL      T4DAT1=*DATE                                                     
     C                   WRITE     REDPAR2                                                          
     C                   ENDIF                                                                      
     C                   IF        INDDLT=*ON                                                       
     C                   EXSR      CS_DLTREG                                                        
     C                   ENDIF                                                                      
     C     P2DUPDT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA PASAR DE PANTALLA P2B A FICHERO                  *                                
      *------------------------------------------------------------*                                
     C     P2DMPF        BEGSR                                                                      
      *                                                                                             
     C                   EVAL      T4FAMT=P2DFAMI                                                   
     C                   EVAL      T4DAT8=*DATE                                                     
     C                   EVAL      T4USUA=SDSUSR                                                    
     C                   EVAL      T4PANT=SDSJOB                                                    
     C                   TIME                    T4HORA                                             
      *                                                                                             
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA CONTROL DEL FMT P2E                              *                                
      *------------------------------------------------------------*                                
     C     P2EMAIN       BEGSR                                                                      
     C                   EVAL      ZXOPT1='P2E'                                                     
     C                   DOW       ZXOPT1='P2E'                                                     
     C     ZXOPT2        CASEQ     'CLR'         P2ECLR                                             
     C     ZXOPT2        CASEQ     'INZ'         P2EINZ                                             
     C     ZXOPT2        CASEQ     'DSP'         P2EDSP                                             
     C     ZXOPT2        CASEQ     'CMD'         P2ECMD                                             
     C     ZXOPT2        CASEQ     'CHK'         P2ECHK                                             
     C     ZXOPT2        CASEQ     'UPD'         P2EUPD                                             
     C                   ENDCS                                                                      
     C                   ENDDO                                                                      
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA              P2E                                 *                                
      *------------------------------------------------------------*                                
     C     P2ECLR        BEGSR                                                                      
     C                   EVAL      ZXOPT2='INZ'                                                     
     C                   MOVEA     ZXZERO10      *IN(30)                                            
     C                   MOVEA     ZXZERO10      *IN(40)                                            
     C                   MOVEA     ZXZERO10      *IN(50)                                            
     C                   MOVEA     ZXZERO10      *IN(60)                                            
     C                   EVAL      CSRFILA=0                                                        
     C                   EVAL      CSRCOLU=0                                                        
     C                   MOVE      *BLANKS       MSGER                                              
     C                                                                                              
     C     P2ECLRT       ENDSR                                                                      
      *                                                                                             
      **************************************************************                                
      * SUBRUTINA INICIALITZACIÓ DEL FMT P2B                       *                                
      *------------------------------------------------------------*                                
     C     P2EINZ        BEGSR                                                                      
     C                   EVAL      ZXOPT2='DSP'                                                     
     C     *NOKEY        CLEAR     *ALL          REDPAR2                                            
     C     KEDPAR2       CHAIN     EDPAR2                             81                            
     C                   EXSR      P2EMFP                                                           
      * En el caso de altas se pasan los valores por defecto de PURLDA                              
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA PASAR DE FICHERO A PANTALLA P2D                  *                                
      *------------------------------------------------------------*                                
     C     P2EMFP        BEGSR                                                                      
     C                   EVAL      P2EDLGA=P7DLGA                                                   
     C                   EVAL      P2EDESC=P7DESC                                                   
                                                                                                    
     C                   EVAL      MNCIAS=@PCIAS                                                    
     C                   EVAL      MNFMIL=%SUBST(@PFAMT:1:3)                                        
     C                   EVAL      MNSMIL=%SUBST(@PFAMT:4:3)                                        
     C     KMSFAMI       CHAIN     MSFAMI                                                           
     C                   EVAL      P2EFMIL=MNFMIL                                                   
     C                   EVAL      P2ESMIL=MNSMIL                                                   
     C                   EVAL      P2EDES1=MNDES1                                                   
      *                                                                                             
     C                   IF        INDCRT=*ON                                                       
     C                   CLEAR                   P2EFMIL                                            
     C                   CLEAR                   P2ESMIL                                            
     C                   CLEAR                   P2EDES1                                            
     C                   ENDIF                                                                      
      *                                                                                             
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VISUALITZACIÓ DEL FMT P2E                        *                                
      *------------------------------------------------------------*                                
     C     P2EDSP        BEGSR                                                                      
      * ENS ENCARREGUEM QUE EL PROPER PAS SIGUI COMPROVAR ENTRADA CMD                               
     C                   EVAL      ZXOPT2='CMD'                                                     
     C                   EVAL      PPPCMD1='CMD7801'                                                
     C                   EXFMT     P2E                                                              
     C                   MOVEA     ZXZERO10      *IN(30)                                            
     C                   MOVEA     ZXZERO10      *IN(40)                                            
     C                   MOVEA     ZXZERO10      *IN(50)                                            
     C                   MOVEA     ZXZERO10      *IN(60)                                            
     C                   EVAL      ERRGRL=*OFF                                                      
     C                   EVAL      MSGER=*BLANKS                                                    
     C                   EVAL      CSRCOLU=*ZEROS                                                   
     C                   EVAL      CSRFILA=*ZEROS                                                   
     C     P2EDSPT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VALIDACIÓ DELS CMDS DEL FMT P2E                 *                                 
      *------------------------------------------------------------*                                
     C     P2ECMD        BEGSR                                                                      
     C                   EVAL      ZXOPT2='CHK'                                                     
      *VALIDACIONES TECLAS DE FUNCION                                                               
     C                   SELECT                                                                     
      * FINALITZAR EL PROGRAMA                                                                      
     C                   WHEN      EXIT=*ON                                                         
     C                   EVAL      ZXOPT1='END'                                                     
      * SOL·LICITUD AJUDA D'ARTICLES                                                                
     C                   WHEN      HELP=*ON                                                         
     C                   EVAL      ZXOPT2='DSP'                                                     
     C                   EXSR      CS_POCUR2                                                        
     C                   EXSR      P2EF4                                                            
      * RETROCESO PANTALLA                                                                          
     C                   WHEN      RETRO=*ON                                                        
     C                   EVAL      ZXOPT='END'                                                      
     C                   ENDSL                                                                      
                                                                                                    
     C     TP2ECMD       TAG                                                                        
     C                   IF        ERRGRL=*ON                                                       
     C                   EVAL      ZXOPT2='DSP'                                                     
     C                   ENDIF                                                                      
                                                                                                    
     C     P2ECMDT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA DE AYUDA EN CAMPOS DEL   FMT P2E                 *                                
      *------------------------------------------------------------*                                
     C     P2EF4         BEGSR                                                                      
     C* No se permite acceso a consulta si estamos en opcion de visualizar                          
     C                   IF        INDDSP=*ON                                                       
     C                   EVAL      ERRGRL=*ON                                                       
     C                   ENDIF                                                                      
      * AYUDAS                                                                                      
      * CAMPOS DE AYUDA                                                                             
     C                   IF        (FIELD='P2EFMIL' OR                                              
     C                              FIELD='P2ESMIL')                                                
     C                             AND INDCRT=*ON                                                   
     C                   CALL      'MM0610'                                                         
     C                   PARM                    @PCIAS                                             
     C                   PARM                    P2EFMIL                                            
     C                   PARM                    P2ESMIL                                            
     C                   PARM      *BLANKS       @PERRO                                             
     C                   GOTO      P2EF4T                                                           
     C                   ENDIF                                                                      
      * SI NO TIENE F4 SOPORTADO DOY ERROR                                                          
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='ADP0304'                                                  
     C     ERRGRL        CABEQ     *ON           P2EF4T                                             
                                                                                                    
     C     P2EF4T        ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VALIDACIÓ DELS CAMPS DEL FMT P2E                 *                                
      *------------------------------------------------------------*                                
     C     P2ECHK        BEGSR                                                                      
     C                   EVAL      ZXOPT2='UPD'                                                     
     C                   IF        INDCRT=*ON                                                       
     C                   EVAL      T4FAMT=P2EFMIL+P2ESMIL                                           
     C                   EVAL      T4PRVR=@PPRVR                                                    
     C                   EVAL      T4ARVT=@PARVT                                                    
     C                   EVAL      T4PRIO=@PPRIO                                                    
     C                   EVAL      T4CIA2=@PCIA2                                                    
     C                   EVAL      T4MAGA=@PMAGA                                                    
     C     KEDPAR2       CHAIN     EDPAR2                                                           
     C                   IF        %FOUND                                                           
     C                   EVAL      WRK40=*ON                                                        
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='MSG0301'                                                  
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP2ECHK                                            
     C                   ENDIF                                                                      
      *                                                                                             
     C                   EVAL      MNCIAS=@PCIAS                                                    
     C                   EVAL      MNFMIL=P2EFMIL                                                   
     C                   EVAL      MNSMIL=P2ESMIL                                                   
     C     KMSFAMI       CHAIN     MSFAMI                                                           
     C                   IF        NOT%FOUND                                                        
     C                   EVAL      WRK40=*ON                                                        
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='MSG0301'                                                  
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP2ECHK                                            
     C                   EVAL      P2EDES1=PEDESC                                                   
     C     TP2ECHK       TAG                                                                        
     C                   IF        ERRGRL=*ON                                                       
     C                   EVAL      ZXOPT2='DSP'                                                     
     C                   ENDIF                                                                      
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA DE ACTUALIZACION DEL FMT P2E                     *                                
      *------------------------------------------------------------*                                
     C     P2EUPD        BEGSR                                                                      
     C                   EVAL      ZXOPT='END'                                                      
                                                                                                    
      * En el caso de la opción de visualiza no actualizo                                           
     C                   IF        (INDDSP=*ON AND CONFIR=*OFF)                                     
     C                             OR (INDDLT=*ON AND CONFIR=*OFF)                                  
     C                   GOTO      P2EUPDT                                                          
     C                   ENDIF                                                                      
      *                                                                                             
     C                   EVAL      T4FAMT=P2EFMIL+P2ESMIL                                           
     C     KEDPAR2       CHAIN     EDPAR2                             81                            
      *                                                                                             
     C                   EXSR      P2EMPF                                                           
      *                                                                                             
     C                   IF        CHAIN=*OFF                                                       
     C                   UPDATE    REDPAR2                                                          
     C                   ELSE                                                                       
     C                   EVAL      T4DAT1=*DATE                                                     
     C                   WRITE     REDPAR2                                                          
     C                   ENDIF                                                                      
     C                   IF        INDDLT=*ON                                                       
     C                   EXSR      CS_DLTREG                                                        
     C                   ENDIF                                                                      
     C     P2EUPDT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA PASAR DE PANTALLA P2B A FICHERO                  *                                
      *------------------------------------------------------------*                                
     C     P2EMPF        BEGSR                                                                      
      *                                                                                             
     C                   EVAL      T4FAMT=P2EFMIL+P2ESMIL                                           
     C                   EVAL      T4DAT8=*DATE                                                     
     C                   EVAL      T4USUA=SDSUSR                                                    
     C                   EVAL      T4PANT=SDSJOB                                                    
     C                   TIME                    T4HORA                                             
      *                                                                                             
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA CONTROL DEL FMT P2F                              *                                
      *------------------------------------------------------------*                                
     C     P2FMAIN       BEGSR                                                                      
     C                   EVAL      ZXOPT1='P2F'                                                     
     C                   DOW       ZXOPT1='P2F'                                                     
     C     ZXOPT2        CASEQ     'CLR'         P2FCLR                                             
     C     ZXOPT2        CASEQ     'INZ'         P2FINZ                                             
     C     ZXOPT2        CASEQ     'DSP'         P2FDSP                                             
     C     ZXOPT2        CASEQ     'CMD'         P2FCMD                                             
     C     ZXOPT2        CASEQ     'CHK'         P2FCHK                                             
     C     ZXOPT2        CASEQ     'UPD'         P2FUPD                                             
     C                   ENDCS                                                                      
     C                   ENDDO                                                                      
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA LIMPIEZA  DE P2F                                 *                                
      *------------------------------------------------------------*                                
     C     P2FCLR        BEGSR                                                                      
     C                   EVAL      ZXOPT2='INZ'                                                     
     C                   MOVEA     ZXZERO10      *IN(30)                                            
     C                   MOVEA     ZXZERO10      *IN(40)                                            
     C                   MOVEA     ZXZERO10      *IN(50)                                            
     C                   MOVEA     ZXZERO10      *IN(60)                                            
     C                   EVAL      CSRFILA=0                                                        
     C                   EVAL      CSRCOLU=0                                                        
     C                   MOVE      *BLANKS       MSGER                                              
     C                                                                                              
     C     P2FCLRT       ENDSR                                                                      
      *                                                                                             
      **************************************************************                                
      * SUBRUTINA INICIALITZACIÓ DEL FMT P2B                       *                                
      *------------------------------------------------------------*                                
     C     P2FINZ        BEGSR                                                                      
     C                   EVAL      ZXOPT2='DSP'                                                     
     C     *NOKEY        CLEAR     *ALL          REDPAR2                                            
     C     KEDPAR2       CHAIN     EDPAR2                             81                            
     C                   EXSR      P2FMFP                                                           
      * En el caso de altas se pasan los valores por defecto de PURLDA                              
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA PASAR DE FICHERO A PANTALLA P2F                  *                                
      *------------------------------------------------------------*                                
     C     P2FMFP        BEGSR                                                                      
     C                   EVAL      P2FDLGA=P7DLGA                                                   
     C                   EVAL      P2FDESC=P7DESC                                                   
     C                   EVAL      PECIAS=@PCIAS                                                    
     C                   EVAL      PECTAB='CSFA'                                                    
     C                   EVAL      PECLTA=%TRIM(@PFAMT)                                             
     C     KPMTABD       CHAIN     PMTABD                                                           
     C                   IF        NOT%FOUND                                                        
     C                   EVAL      PECTAB='CSF2'                                                    
     C     KPMTABD       CHAIN     PMTABD                                                           
     C                   ENDIF                                                                      
     C                   EVAL      P2FFAMT=%TRIM(@PFAMT)                                            
     C                   EVAL      P2FDES1=PEDESC                                                   
      *                                                                                             
     C                   IF        INDCRT=*ON                                                       
     C                   CLEAR                   P2FFAMT                                            
     C                   CLEAR                   P2FDES1                                            
     C                   ENDIF                                                                      
      *                                                                                             
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VISUALITZACIÓ DEL FMT P2F                        *                                
      *------------------------------------------------------------*                                
     C     P2FDSP        BEGSR                                                                      
      * ENS ENCARREGUEM QUE EL PROPER PAS SIGUI COMPROVAR ENTRADA CMD                               
     C                   EVAL      ZXOPT2='CMD'                                                     
     C                   EVAL      PPPCMD1='CMD7801'                                                
     C                   EXFMT     P2F                                                              
     C                   MOVEA     ZXZERO10      *IN(30)                                            
     C                   MOVEA     ZXZERO10      *IN(40)                                            
     C                   MOVEA     ZXZERO10      *IN(50)                                            
     C                   MOVEA     ZXZERO10      *IN(60)                                            
     C                   EVAL      ERRGRL=*OFF                                                      
     C                   EVAL      MSGER=*BLANKS                                                    
     C                   EVAL      CSRCOLU=*ZEROS                                                   
     C                   EVAL      CSRFILA=*ZEROS                                                   
     C     P2FDSPT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VALIDACIÓ DELS CMDS DEL FMT P2F                 *                                 
      *------------------------------------------------------------*                                
     C     P2FCMD        BEGSR                                                                      
     C                   EVAL      ZXOPT2='CHK'                                                     
      *VALIDACIONES TECLAS DE FUNCION                                                               
     C                   SELECT                                                                     
      * FINALITZAR EL PROGRAMA                                                                      
     C                   WHEN      EXIT=*ON                                                         
     C                   EVAL      ZXOPT1='END'                                                     
      * SOL·LICITUD AJUDA D'ARTICLES                                                                
     C                   WHEN      HELP=*ON                                                         
     C                   EVAL      ZXOPT2='DSP'                                                     
     C                   EXSR      CS_POCUR2                                                        
     C                   EXSR      P2FF4                                                            
      * RETROCESO PANTALLA                                                                          
     C                   WHEN      RETRO=*ON                                                        
     C                   EVAL      ZXOPT='END'                                                      
     C                   ENDSL                                                                      
                                                                                                    
     C     TP2FCMD       TAG                                                                        
     C                   IF        ERRGRL=*ON                                                       
     C                   EVAL      ZXOPT2='DSP'                                                     
     C                   ENDIF                                                                      
                                                                                                    
     C     P2FCMDT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA DE AYUDA EN CAMPOS DEL   FMT P2F                 *                                
      *------------------------------------------------------------*                                
     C     P2FF4         BEGSR                                                                      
     C* No se permite acceso a consulta si estamos en opcion de visualizar                          
     C                   IF        INDDSP=*ON                                                       
     C                   EVAL      ERRGRL=*ON                                                       
     C                   ENDIF                                                                      
      * SI NO TIENE F4 SOPORTADO DOY ERROR                                                          
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='ADP0304'                                                  
     C     ERRGRL        CABEQ     *ON           P2FF4T                                             
                                                                                                    
     C     P2FF4T        ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VALIDACIÓ DELS CAMPS DEL FMT P2F                 *                                
      *------------------------------------------------------------*                                
     C     P2FCHK        BEGSR                                                                      
     C                   EVAL      ZXOPT2='UPD'                                                     
     C                   IF        INDCRT=*ON                                                       
     C                   EVAL      T4FAMT=P2FFAMT                                                   
     C                   EVAL      T4PRVR=@PPRVR                                                    
     C                   EVAL      T4ARVT=@PARVT                                                    
     C                   EVAL      T4PRIO=@PPRIO                                                    
     C                   EVAL      T4CIA2=@PCIA2                                                    
     C                   EVAL      T4MAGA=@PMAGA                                                    
     C     KEDPAR2       CHAIN     EDPAR2                                                           
     C                   IF        %FOUND                                                           
     C                   EVAL      WRK40=*ON                                                        
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='MSG0301'                                                  
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP2FCHK                                            
     C                   ENDIF                                                                      
      *                                                                                             
     C                   EVAL      PECTAB='CSFA'                                                    
     C                   EVAL      PECLTA=P2FFAMT                                                   
     C     KPMTABD       CHAIN     PMTABD                                                           
     C                   IF        NOT%FOUND                                                        
     C                   EVAL      PECTAB='CSF2'                                                    
     C     KPMTABD       CHAIN     PMTABD                                                           
     C                   ENDIF                                                                      
     C                   IF        NOT%FOUND                                                        
     C                   EVAL      WRK40=*ON                                                        
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='MSG0301'                                                  
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP2FCHK                                            
     C                   EVAL      P2FDES1=PEDESC                                                   
     C     TP2FCHK       TAG                                                                        
     C                   IF        ERRGRL=*ON                                                       
     C                   EVAL      ZXOPT2='DSP'                                                     
     C                   ENDIF                                                                      
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA DE ACTUALIZACION DEL FMT P2F                     *                                
      *------------------------------------------------------------*                                
     C     P2FUPD        BEGSR                                                                      
     C                   EVAL      ZXOPT='END'                                                      
                                                                                                    
      * En el caso de la opción de visualiza no actualizo                                           
     C                   IF        (INDDSP=*ON AND CONFIR=*OFF)                                     
     C                             OR (INDDLT=*ON AND CONFIR=*OFF)                                  
     C                   GOTO      P2FUPDT                                                          
     C                   ENDIF                                                                      
      *                                                                                             
     C                   EVAL      T4FAMT=P2FFAMT                                                   
     C     KEDPAR2       CHAIN     EDPAR2                             81                            
      *                                                                                             
     C                   EXSR      P2FMPF                                                           
      *                                                                                             
     C                   IF        CHAIN=*OFF                                                       
     C                   UPDATE    REDPAR2                                                          
     C                   ELSE                                                                       
     C                   EVAL      T4DAT1=*DATE                                                     
     C                   WRITE     REDPAR2                                                          
     C                   ENDIF                                                                      
     C                   IF        INDDLT=*ON                                                       
     C                   EXSR      CS_DLTREG                                                        
     C                   ENDIF                                                                      
     C     P2FUPDT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA PASAR DE PANTALLA P2B A FICHERO                  *                                
      *------------------------------------------------------------*                                
     C     P2FMPF        BEGSR                                                                      
      *                                                                                             
     C                   EVAL      T4FAMT=P2FFAMT                                                   
     C                   EVAL      T4DAT8=*DATE                                                     
     C                   EVAL      T4USUA=SDSUSR                                                    
     C                   EVAL      T4PANT=SDSJOB                                                    
     C                   TIME                    T4HORA                                             
      *                                                                                             
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA CONTROL DEL FMT P2G                              *                                
      *------------------------------------------------------------*                                
     C     P2GMAIN       BEGSR                                                                      
     C                   EVAL      ZXOPT1='P2G'                                                     
     C                   DOW       ZXOPT1='P2G'                                                     
     C     ZXOPT2        CASEQ     'CLR'         P2GCLR                                             
     C     ZXOPT2        CASEQ     'INZ'         P2GINZ                                             
     C     ZXOPT2        CASEQ     'DSP'         P2GDSP                                             
     C     ZXOPT2        CASEQ     'CMD'         P2GCMD                                             
     C     ZXOPT2        CASEQ     'CHK'         P2GCHK                                             
     C     ZXOPT2        CASEQ     'UPD'         P2GUPD                                             
     C                   ENDCS                                                                      
     C                   ENDDO                                                                      
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA LIMPIEZA  DE P2G                                 *                                
      *------------------------------------------------------------*                                
     C     P2GCLR        BEGSR                                                                      
     C                   EVAL      ZXOPT2='INZ'                                                     
     C                   MOVEA     ZXZERO10      *IN(30)                                            
     C                   MOVEA     ZXZERO10      *IN(40)                                            
     C                   MOVEA     ZXZERO10      *IN(50)                                            
     C                   MOVEA     ZXZERO10      *IN(60)                                            
     C                   EVAL      CSRFILA=0                                                        
     C                   EVAL      CSRCOLU=0                                                        
     C                   MOVE      *BLANKS       MSGER                                              
     C                                                                                              
     C     P2GCLRT       ENDSR                                                                      
      *                                                                                             
      **************************************************************                                
      * SUBRUTINA INICIALITZACIÓ DEL FMT P2G                       *                                
      *------------------------------------------------------------*                                
     C     P2GINZ        BEGSR                                                                      
     C                   EVAL      ZXOPT2='DSP'                                                     
     C     *NOKEY        CLEAR     *ALL          REDPAR2                                            
     C     KEDPAR2       CHAIN     EDPAR2                             81                            
     C                   EXSR      P2GMFP                                                           
      * En el caso de altas se pasan los valores por defecto de PURLDA                              
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA PASAR DE FICHERO A PANTALLA P2G                  *                                
      *------------------------------------------------------------*                                
     C     P2GMFP        BEGSR                                                                      
     C                   EVAL      P2GDLGA=P7DLGA                                                   
     C                   EVAL      P2GDESC=P7DESC                                                   
     C                   EVAL      P2GCUST=T4PRVR                                                   
     C                   EVAL      S0CIAS=@PCIAS                                                    
     C                   EVAL      S0CUST=T4PRVR                                                    
     C     KCOCLIN       CHAIN     COCLIN                                                           
     C                   IF        %FOUND                                                           
     C                   EVAL      P2GDES1=C0DES1                                                   
     C                   ENDIF                                                                      
      *                                                                                             
     C                   IF        INDCRT=*ON                                                       
     C                   CLEAR                   P2GCUST                                            
     C                   CLEAR                   P2GDES1                                            
     C                   ENDIF                                                                      
      *                                                                                             
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VISUALITZACIÓ DEL FMT P2G                        *                                
      *------------------------------------------------------------*                                
     C     P2GDSP        BEGSR                                                                      
      * ENS ENCARREGUEM QUE EL PROPER PAS SIGUI COMPROVAR ENTRADA CMD                               
     C                   EVAL      ZXOPT2='CMD'                                                     
     C                   EVAL      PPPCMD1='CMD7801'                                                
     C                   EXFMT     P2G                                                              
     C                   MOVEA     ZXZERO10      *IN(30)                                            
     C                   MOVEA     ZXZERO10      *IN(40)                                            
     C                   MOVEA     ZXZERO10      *IN(50)                                            
     C                   MOVEA     ZXZERO10      *IN(60)                                            
     C                   EVAL      ERRGRL=*OFF                                                      
     C                   EVAL      MSGER=*BLANKS                                                    
     C                   EVAL      CSRCOLU=*ZEROS                                                   
     C                   EVAL      CSRFILA=*ZEROS                                                   
     C     P2GDSPT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VALIDACIÓ DELS CMDS DEL FMT P2G                 *                                 
      *------------------------------------------------------------*                                
     C     P2GCMD        BEGSR                                                                      
     C                   EVAL      ZXOPT2='CHK'                                                     
      *VALIDACIONES TECLAS DE FUNCION                                                               
     C                   SELECT                                                                     
      * FINALITZAR EL PROGRAMA                                                                      
     C                   WHEN      EXIT=*ON                                                         
     C                   EVAL      ZXOPT1='END'                                                     
      * SOL·LICITUD AJUDA D'ARTICLES                                                                
     C                   WHEN      HELP=*ON                                                         
     C                   EVAL      ZXOPT2='DSP'                                                     
     C                   EXSR      CS_POCUR2                                                        
     C                   EXSR      P2GF4                                                            
      * RETROCESO PANTALLA                                                                          
     C                   WHEN      RETRO=*ON                                                        
     C                   EVAL      ZXOPT='END'                                                      
     C                   ENDSL                                                                      
                                                                                                    
     C     TP2GCMD       TAG                                                                        
     C                   IF        ERRGRL=*ON                                                       
     C                   EVAL      ZXOPT2='DSP'                                                     
     C                   ENDIF                                                                      
                                                                                                    
     C     P2GCMDT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA DE AYUDA EN CAMPOS DEL   FMT P2G                 *                                
      *------------------------------------------------------------*                                
     C     P2GF4         BEGSR                                                                      
     C* No se permite acceso a consulta si estamos en opcion de visualizar                          
     C                   IF        INDDSP=*ON                                                       
     C                   EVAL      ERRGRL=*ON                                                       
     C                   ENDIF                                                                      
                                                                                                    
      * AYUDAS                                                                                      
     C                   IF        FIELD='P2GCUST' AND                                              
     C                             INDCRT=*ON                                                       
     C                   CALL      'CO0650'                                                         
     C                   PARM                    @PCIAS                                             
     C                   PARM                    P2GCUST                                            
     C                   PARM      *BLANKS       @PEERR                                             
     C                   GOTO      P2GF4T                                                           
     C                   ENDIF                                                                      
      * SI NO TIENE F4 SOPORTADO DOY ERROR                                                          
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='ADP0304'                                                  
     C     ERRGRL        CABEQ     *ON           P2GF4T                                             
                                                                                                    
     C     P2GF4T        ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VALIDACIÓ DELS CAMPS DEL FMT P2G                 *                                
      *------------------------------------------------------------*                                
     C     P2GCHK        BEGSR                                                                      
     C                   EVAL      ZXOPT2='UPD'                                                     
     C                   IF        INDCRT=*ON                                                       
     C                   EVAL      T4FAMT=@PFAMT                                                    
     C                   EVAL      T4PRVR=P2GCUST                                                   
     C                   EVAL      T4ARVT=@PARVT                                                    
     C                   EVAL      T4PRIO=@PPRIO                                                    
     C                   EVAL      T4CIA2=@PCIA2                                                    
     C                   EVAL      T4MAGA=@PMAGA                                                    
     C     KEDPAR2       CHAIN     EDPAR2                                                           
     C                   IF        %FOUND                                                           
     C                   EVAL      WRK40=*ON                                                        
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='MSG0301'                                                  
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP2GCHK                                            
     C                   ENDIF                                                                      
      *                                                                                             
     C                   EVAL      S0CUST=P2GCUST                                                   
     C     KCOCLIN       CHAIN     COCLIN                                                           
     C                   IF        NOT%FOUND                                                        
     C                   EVAL      WRK40=*ON                                                        
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='ASG1003'                                                  
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP2GCHK                                            
     C     TP2GCHK       TAG                                                                        
     C                   IF        ERRGRL=*ON                                                       
     C                   EVAL      ZXOPT2='DSP'                                                     
     C                   ENDIF                                                                      
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA DE ACTUALIZACION DEL FMT P2G                     *                                
      *------------------------------------------------------------*                                
     C     P2GUPD        BEGSR                                                                      
     C                   EVAL      ZXOPT='END'                                                      
                                                                                                    
      * En el caso de la opción de visualiza no actualizo                                           
     C                   IF        (INDDSP=*ON AND CONFIR=*OFF)                                     
     C                             OR (INDDLT=*ON AND CONFIR=*OFF)                                  
     C                   GOTO      P2GUPDT                                                          
     C                   ENDIF                                                                      
      *                                                                                             
     C                   EVAL      T4PRVR=P2GCUST                                                   
     C     KEDPAR2       CHAIN     EDPAR2                             81                            
      *                                                                                             
     C                   EXSR      P2GMPF                                                           
      *                                                                                             
     C                   IF        CHAIN=*OFF                                                       
     C                   UPDATE    REDPAR2                                                          
     C                   ELSE                                                                       
     C                   EVAL      T4DAT1=*DATE                                                     
     C                   WRITE     REDPAR2                                                          
     C                   ENDIF                                                                      
     C                   IF        INDDLT=*ON                                                       
     C                   EXSR      CS_DLTREG                                                        
     C                   ENDIF                                                                      
     C     P2GUPDT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA PASAR DE PANTALLA P2B A FICHERO                  *                                
      *------------------------------------------------------------*                                
     C     P2GMPF        BEGSR                                                                      
      *                                                                                             
     C                   EVAL      T4PRVR=P2GCUST                                                   
     C                   EVAL      T4DAT8=*DATE                                                     
     C                   EVAL      T4USUA=SDSUSR                                                    
     C                   EVAL      T4PANT=SDSJOB                                                    
     C                   TIME                    T4HORA                                             
      *                                                                                             
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA PASAR DE PANTALLA P2B A FICHERO                  *                                
      *------------------------------------------------------------*                                
     C     CS_DLTREG     BEGSR                                                                      
     C     KEDPAR2_A     SETLL     EDPAR2                                                           
     C     KEDPAR2_A     READE     EDPAR2                                                           
     C                   DOW       NOT%EOF                                                          
     C                   EVAL      T4USU3=SDSUSR                                                    
     C                   EVAL      T4PAN3=SDSJOB                                                    
     C                   TIME                    T4HO83                                             
     C                   EVAL      T4DA83=*DATE                                                     
     C                   WRITE     REDHPA2                                                          
     C                   DELETE    REDPAR2                                                          
     C     KEDPAR2_A     READE     EDPAR2                                                           
     C                   ENDDO                                                                      
C3758                                                                                               
C3758C                   EVAL      T6CIA1=T4CIA1                                                    
C3758C                   EVAL      T6TREG=T4TREG                                                    
C3758C                   EVAL      T6DLGA=T4DLGA                                                    
C3758C                   EVAL      T6PRVR=T4PRVR                                                    
C3758C                   EVAL      T6ARVT=T4ARVT                                                    
C3758C     KEDPAR4       SETLL     EDPAR4                                                           
C3758C     KEDPAR4       READE     EDPAR4                                                           
C3758C                   DOW       NOT%EOF(EDPAR4)                                                  
C3758C                   EVAL      T6USU3=SDSUSR                                                    
C3758C                   EVAL      T6PAN3=SDSJOB                                                    
C3758C                   TIME                    T6HO83                                             
C3758C                   EVAL      T6DA83=*DATE                                                     
C3758C                   WRITE     REDHPA4                                                          
C3758C                   DELETE    REDPAR4                                                          
C3758C     KEDPAR4       READE     EDPAR4                                                           
C3758C                   ENDDO                                                                      
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA CONTROL DEL FMT P2H                              *                                
      *------------------------------------------------------------*                                
     C     P2HMAIN       BEGSR                                                                      
     C                   EVAL      ZXOPT1='P2H'                                                     
     C                   DOW       ZXOPT1='P2H'                                                     
     C     ZXOPT2        CASEQ     'CLR'         P2HCLR                                             
     C     ZXOPT2        CASEQ     'INZ'         P2HINZ                                             
     C     ZXOPT2        CASEQ     'DSP'         P2HDSP                                             
     C     ZXOPT2        CASEQ     'CMD'         P2HCMD                                             
     C     ZXOPT2        CASEQ     'CHK'         P2HCHK                                             
     C     ZXOPT2        CASEQ     'UPD'         P2HUPD                                             
     C                   ENDCS                                                                      
     C                   ENDDO                                                                      
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA LIMPIEZA  DE P2H                                 *                                
      *------------------------------------------------------------*                                
     C     P2HCLR        BEGSR                                                                      
     C                   EVAL      ZXOPT2='INZ'                                                     
     C                   MOVEA     ZXZERO10      *IN(30)                                            
     C                   MOVEA     ZXZERO10      *IN(40)                                            
     C                   MOVEA     ZXZERO10      *IN(50)                                            
     C                   MOVEA     ZXZERO10      *IN(60)                                            
     C                   EVAL      CSRFILA=0                                                        
     C                   EVAL      CSRCOLU=0                                                        
     C                   MOVE      *BLANKS       MSGER                                              
     C                                                                                              
     C     P2HCLRT       ENDSR                                                                      
      *                                                                                             
      **************************************************************                                
      * SUBRUTINA INICIALITZACIÓ DEL FMT P2B                       *                                
      *------------------------------------------------------------*                                
     C     P2HINZ        BEGSR                                                                      
     C                   EVAL      ZXOPT2='DSP'                                                     
     C     *NOKEY        CLEAR     *ALL          REDPAR2                                            
     C     KEDPAR2       CHAIN     EDPAR2                             81                            
     C                   EXSR      P2HMFP                                                           
      * En el caso de altas se pasan los valores por defecto de PURLDA                              
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA PASAR DE FICHERO A PANTALLA P2H                  *                                
      *------------------------------------------------------------*                                
     C     P2HMFP        BEGSR                                                                      
     C                   EVAL      P2HDLGA=P7DLGA                                                   
     C                   EVAL      P2HDESC=P7DESC                                                   
     C                   EVAL      PECIAS=@PCIAS                                                    
     C                   EVAL      PECTAB='CSFA'                                                    
     C                   EVAL      PECLTA=%TRIM(@PFAMT)                                             
     C     KPMTABD       CHAIN     PMTABD                                                           
     C                   IF        NOT%FOUND                                                        
     C                   EVAL      PECTAB='CSF2'                                                    
     C     KPMTABD       CHAIN     PMTABD                                                           
     C                   ENDIF                                                                      
     C                   EVAL      P2HPPED=%TRIM(@PFAMT)                                            
     C                   EVAL      P2HDES1=PEDESC                                                   
      *                                                                                             
     C                   IF        INDCRT=*ON                                                       
     C                   CLEAR                   P2HPPED                                            
     C                   CLEAR                   P2HDES1                                            
     C                   ENDIF                                                                      
      *                                                                                             
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VISUALITZACIÓ DEL FMT P2H                        *                                
      *------------------------------------------------------------*                                
     C     P2HDSP        BEGSR                                                                      
      * ENS ENCARREGUEM QUE EL PROPER PAS SIGUI COMPROVAR ENTRADA CMD                               
     C                   EVAL      ZXOPT2='CMD'                                                     
     C                   EVAL      PPPCMD1='CMD7801'                                                
     C                   EXFMT     P2H                                                              
     C                   MOVEA     ZXZERO10      *IN(30)                                            
     C                   MOVEA     ZXZERO10      *IN(40)                                            
     C                   MOVEA     ZXZERO10      *IN(50)                                            
     C                   MOVEA     ZXZERO10      *IN(60)                                            
     C                   EVAL      ERRGRL=*OFF                                                      
     C                   EVAL      MSGER=*BLANKS                                                    
     C                   EVAL      CSRCOLU=*ZEROS                                                   
     C                   EVAL      CSRFILA=*ZEROS                                                   
     C     P2HDSPT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VALIDACIÓ DELS CMDS DEL FMT P2H                 *                                 
      *------------------------------------------------------------*                                
     C     P2HCMD        BEGSR                                                                      
     C                   EVAL      ZXOPT2='CHK'                                                     
      *VALIDACIONES TECLAS DE FUNCION                                                               
     C                   SELECT                                                                     
      * FINALITZAR EL PROGRAMA                                                                      
     C                   WHEN      EXIT=*ON                                                         
     C                   EVAL      ZXOPT1='END'                                                     
      * SOL·LICITUD AJUDA D'ARTICLES                                                                
     C                   WHEN      HELP=*ON                                                         
     C                   EVAL      ZXOPT2='DSP'                                                     
     C                   EXSR      CS_POCUR2                                                        
     C                   EXSR      P2HF4                                                            
      * RETROCESO PANTALLA                                                                          
     C                   WHEN      RETRO=*ON                                                        
     C                   EVAL      ZXOPT='END'                                                      
     C                   ENDSL                                                                      
                                                                                                    
     C     TP2HCMD       TAG                                                                        
     C                   IF        ERRGRL=*ON                                                       
     C                   EVAL      ZXOPT2='DSP'                                                     
     C                   ENDIF                                                                      
                                                                                                    
     C     P2HCMDT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA DE AYUDA EN CAMPOS DEL   FMT P2H                 *                                
      *------------------------------------------------------------*                                
     C     P2HF4         BEGSR                                                                      
     C* No se permite acceso a consulta si estamos en opcion de visualizar                          
     C                   IF        INDDSP=*ON                                                       
     C                   EVAL      ERRGRL=*ON                                                       
     C                   ENDIF                                                                      
      * SI NO TIENE F4 SOPORTADO DOY ERROR                                                          
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='ADP0304'                                                  
     C     ERRGRL        CABEQ     *ON           P2HF4T                                             
                                                                                                    
     C     P2HF4T        ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VALIDACIÓ DELS CAMPS DEL FMT P2H                 *                                
      *------------------------------------------------------------*                                
     C     P2HCHK        BEGSR                                                                      
     C                   EVAL      ZXOPT2='UPD'                                                     
     C                   IF        INDCRT=*ON                                                       
     C                   EVAL      T4FAMT=P2HPPED                                                   
     C                   EVAL      T4PRVR=@PPRVR                                                    
     C                   EVAL      T4ARVT=@PARVT                                                    
     C                   EVAL      T4PRIO=@PPRIO                                                    
     C                   EVAL      T4CIA2=@PCIA2                                                    
     C                   EVAL      T4MAGA=@PMAGA                                                    
     C     KEDPAR2       CHAIN     EDPAR2                                                           
     C                   IF        %FOUND                                                           
     C                   EVAL      WRK40=*ON                                                        
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='MSG0301'                                                  
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP2HCHK                                            
     C                   ENDIF                                                                      
      *                                                                                             
     C                   EVAL      PECTAB='PPED'                                                    
     C                   EVAL      PECLTA=P2HPPED                                                   
     C     KPMTABD       CHAIN     PMTABD                                                           
     C                   IF        NOT%FOUND                                                        
     C                   EVAL      WRK40=*ON                                                        
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='MSG0301'                                                  
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP2HCHK                                            
     C                   EVAL      P2HDES1=PEDESC                                                   
     C     TP2HCHK       TAG                                                                        
     C                   IF        ERRGRL=*ON                                                       
     C                   EVAL      ZXOPT2='DSP'                                                     
     C                   ENDIF                                                                      
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA DE ACTUALIZACION DEL FMT P2H                     *                                
      *------------------------------------------------------------*                                
     C     P2HUPD        BEGSR                                                                      
     C                   EVAL      ZXOPT='END'                                                      
                                                                                                    
      * En el caso de la opción de visualiza no actualizo                                           
     C                   IF        (INDDSP=*ON AND CONFIR=*OFF)                                     
     C                             OR (INDDLT=*ON AND CONFIR=*OFF)                                  
     C                   GOTO      P2HUPDT                                                          
     C                   ENDIF                                                                      
      *                                                                                             
     C                   EVAL      T4FAMT=P2HPPED                                                   
     C     KEDPAR2       CHAIN     EDPAR2                             81                            
      *                                                                                             
     C                   EXSR      P2HMPF                                                           
      *                                                                                             
     C                   IF        CHAIN=*OFF                                                       
     C                   UPDATE    REDPAR2                                                          
     C                   ELSE                                                                       
     C                   EVAL      T4DAT1=*DATE                                                     
     C                   WRITE     REDPAR2                                                          
     C                   ENDIF                                                                      
     C                   IF        INDDLT=*ON                                                       
     C                   EXSR      CS_DLTREG                                                        
     C                   ENDIF                                                                      
     C     P2HUPDT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA PASAR DE PANTALLA P2B A FICHERO                  *                                
      *------------------------------------------------------------*                                
     C     P2HMPF        BEGSR                                                                      
      *                                                                                             
     C                   EVAL      T4FAMT=P2HPPED                                                   
     C                   EVAL      T4DAT8=*DATE                                                     
     C                   EVAL      T4USUA=SDSUSR                                                    
     C                   EVAL      T4PANT=SDSJOB                                                    
     C                   TIME                    T4HORA                                             
      *                                                                                             
     C                   ENDSR                                                                      
FGI25 **************************************************************                                
FGI25 * SUBRUTINA CONTROL DEL FMT P2m                              *                                
FGI25 *------------------------------------------------------------*                                
FGI25C     P2mMAIN       BEGSR                                                                      
FGI25C                   EVAL      ZXOPT1='P2M'                                                     
FGI25C                   DOW       ZXOPT1='P2M'                                                     
FGI25C     ZXOPT2        CASEQ     'CLR'         P2mCLR                                             
FGI25C     ZXOPT2        CASEQ     'INZ'         P2mINZ                                             
FGI25C     ZXOPT2        CASEQ     'DSP'         P2mDSP                                             
FGI25C     ZXOPT2        CASEQ     'CMD'         P2mCMD                                             
FGI25C     ZXOPT2        CASEQ     'CHK'         P2mCHK                                             
FGI25C     ZXOPT2        CASEQ     'UPD'         P2mUPD                                             
FGI25C                   ENDCS                                                                      
FGI25C                   ENDDO                                                                      
FGI25C                   ENDSR                                                                      
FGI25 **************************************************************                                
FGI25 * SUBRUTINA LIMPIEZA  DE P2m                                 *                                
FGI25 *------------------------------------------------------------*                                
FGI25C     P2mCLR        BEGSR                                                                      
FGI25C                   EVAL      ZXOPT2='INZ'                                                     
FGI25C                   MOVEA     ZXZERO10      *IN(30)                                            
FGI25C                   MOVEA     ZXZERO10      *IN(40)                                            
FGI25C                   MOVEA     ZXZERO10      *IN(50)                                            
FGI25C                   MOVEA     ZXZERO10      *IN(60)                                            
FGI25C                   EVAL      CSRFILA=0                                                        
FGI25C                   EVAL      CSRCOLU=0                                                        
FGI25C                   MOVE      *BLANKS       MSGER                                              
FGI25C                                                                                              
FGI25C     P2mCLRT       ENDSR                                                                      
FGI25 *                                                                                             
FGI25 **************************************************************                                
FGI25 * SUBRUTINA INICIALITZACIÓ DEL FMT P2m                       *                                
FGI25 *------------------------------------------------------------*                                
FGI25C     P2mINZ        BEGSR                                                                      
FGI25C                   EVAL      ZXOPT2='DSP'                                                     
FGI25C     *NOKEY        CLEAR     *ALL          REDPAR2                                            
FGI25C     KEDPAR2       CHAIN     EDPAR2                             81                            
FGI25C                   EXSR      P2mMFP                                                           
FGI25 * En el caso de altas se pasan los valores por defecto de PURLDA                              
FGI25C                   ENDSR                                                                      
FGI25 **************************************************************                                
FGI25 * SUBRUTINA PASAR DE FICHERO A PANTALLA P2m                  *                                
FGI25 *------------------------------------------------------------*                                
FGI25C     P2mMFP        BEGSR                                                                      
FGI25C                   EVAL      P2mDLGA=P7DLGA                                                   
FGI25C                   EVAL      P2mDESC=P7DESC                                                   
FGI25C                   eval      t1ctab= 'MTSO'                                                   
FGI25C                   eval      t1cele=t4FAMT                                                    
FGI25C     kgmtabd00     chain     gmtabd00                                                         
FGI25C                   if        %found(gmtabd00)                                                 
FGI25C                   eval      p2mdes1=t1desc                                                   
FGI25C                   endif                                                                      
FGI25C                   eval      P2mcata=T4famt                                                   
FGI25 *                                                                                             
FGI25C                   IF        INDCRT=*ON                                                       
FGI25C                   CLEAR                   P2mcata                                            
FGI25C                   CLEAR                   P2mDES1                                            
FGI25C                   ENDIF                                                                      
FGI25 *                                                                                             
FGI25C                   ENDSR                                                                      
FGI25 **************************************************************                                
FGI25 * SUBRUTINA VISUALITZACIÓ DEL FMT P2m                        *                                
FGI25 *------------------------------------------------------------*                                
FGI25C     P2mDSP        BEGSR                                                                      
FGI25 * ENS ENCARREGUEM QUE EL PROPER PAS SIGUI COMPROVAR ENTRADA CMD                               
FGI25C                   EVAL      ZXOPT2='CMD'                                                     
FGI25C                   EVAL      PPPCMD1='CMD7801'                                                
FGI25C                   EXFMT     P2M                                                              
FGI25C                   MOVEA     ZXZERO10      *IN(30)                                            
FGI25C                   MOVEA     ZXZERO10      *IN(40)                                            
FGI25C                   MOVEA     ZXZERO10      *IN(50)                                            
FGI25C                   MOVEA     ZXZERO10      *IN(60)                                            
FGI25C                   EVAL      ERRGRL=*OFF                                                      
FGI25C                   EVAL      MSGER=*BLANKS                                                    
FGI25C                   EVAL      CSRCOLU=*ZEROS                                                   
FGI25C                   EVAL      CSRFILA=*ZEROS                                                   
FGI25C     P2mDSPT       ENDSR                                                                      
FGI25 **************************************************************                                
FGI25 * SUBRUTINA VALIDACIÓ DELS CMDS DEL FMT P2m                 *                                 
FGI25 *------------------------------------------------------------*                                
FGI25C     P2mCMD        BEGSR                                                                      
FGI25C                   EVAL      ZXOPT2='CHK'                                                     
FGI25 *VALIDACIONES TECLAS DE FUNCION                                                               
FGI25C                   SELECT                                                                     
FGI25 * FINALITZAR EL PROGRAMA                                                                      
FGI25C                   WHEN      EXIT=*ON                                                         
FGI25C                   EVAL      ZXOPT1='END'                                                     
FGI25 * SOL·LICITUD AJUDA cat articles                                                              
FGI25C                   WHEN      HELP=*ON                                                         
FGI25C                   EVAL      ZXOPT2='DSP'                                                     
FGI25C                   EXSR      CS_POCUR2                                                        
FGI25C                   EXSR      P2mF4                                                            
FGI25 * RETROCESO PANTALLA                                                                          
FGI25C                   WHEN      RETRO=*ON                                                        
FGI25C                   EVAL      ZXOPT='END'                                                      
FGI25C                   ENDSL                                                                      
FGI25                                                                                               
FGI25C     TP2mCMD       TAG                                                                        
FGI25C                   IF        ERRGRL=*ON                                                       
FGI25C                   EVAL      ZXOPT2='DSP'                                                     
FGI25C                   ENDIF                                                                      
FGI25                                                                                               
FGI25C     P2mCMDT       ENDSR                                                                      
FGI25 **************************************************************                                
FGI25 * SUBRUTINA DE AYUDA EN CAMPOS DEL   FMT P2m                 *                                
FGI25 *------------------------------------------------------------*                                
FGI25C     P2mF4         BEGSR                                                                      
FGI25C* No se permite acceso a consulta si estamos en opcion de visualizar                          
FGI25C                   IF        INDDSP=*ON                                                       
FGI25C                   EVAL      ERRGRL=*ON                                                       
FGI25C                   ENDIF                                                                      
FGI25 * SI NO TIENE F4 SOPORTADO DOY ERROR                                                          
FGI25C                   EVAL      ERRGRL=*ON                                                       
FGI25C                   EVAL      MSGER='ADP0304'                                                  
FGI25C     ERRGRL        CABEQ     *ON           P2mF4T                                             
FGI25                                                                                               
FGI25C     P2mF4T        ENDSR                                                                      
FGI25 **************************************************************                                
FGI25 * SUBRUTINA VALIDACIÓ DELS CAMPS DEL FMT P2m                 *                                
FGI25 *------------------------------------------------------------*                                
FGI25C     P2mCHK        BEGSR                                                                      
FGI25C                   EVAL      ZXOPT2='UPD'                                                     
FGI25C                   IF        INDCRT=*ON                                                       
FGI25C                   EVAL      T4FAMT=P2mcata                                                   
FGI25C                   EVAL      T4PRVR=@PPRVR                                                    
FGI25C                   EVAL      T4ARVT=@PARVT                                                    
FGI25C                   EVAL      T4PRIO=@PPRIO                                                    
FGI25C                   EVAL      T4CIA2=@PCIA2                                                    
FGI25C                   EVAL      T4MAGA=@PMAGA                                                    
FGI25C     KEDPAR2       CHAIN     EDPAR2                                                           
FGI25C                   IF        %FOUND                                                           
FGI25C                   EVAL      WRK40=*ON                                                        
FGI25C                   EVAL      ERRGRL=*ON                                                       
FGI25C                   EVAL      MSGER='MSG0301'                                                  
FGI25C                   ENDIF                                                                      
FGI25C     ERRGRL        CABEQ     *ON           TP2mCHK                                            
FGI25C                   ENDIF                                                                      
FGI25 *                                                                                             
FGI25C                   eval      t1ctab='MTSO'                                                    
FGI25C                   eval      t1cele=P2mCATA                                                   
FGI25C     kgmtabd00     chain     gmtabd00                                                         
FGI25C                   if        not %found(gmtabd00)                                             
FGI25C                   EVAL      WRK40=*ON                                                        
FGI25C                   EVAL      ERRGRL=*ON                                                       
FGI25C                   EVAL      MSGER='MSG0301'                                                  
FGI25C                   ENDIF                                                                      
FGI25C     ERRGRL        CABEQ     *ON           TP2mCHK                                            
FGI25C                   EVAL      P2HDES1=PEDESC                                                   
FGI25C     TP2mCHK       TAG                                                                        
FGI25C                   IF        ERRGRL=*ON                                                       
FGI25C                   EVAL      ZXOPT2='DSP'                                                     
FGI25C                   ENDIF                                                                      
FGI25C                   ENDSR                                                                      
FGI25 **************************************************************                                
FGI25 * SUBRUTINA DE ACTUALIZACION DEL FMT P2m                     *                                
FGI25 *------------------------------------------------------------*                                
FGI25C     P2mUPD        BEGSR                                                                      
FGI25C                   EVAL      ZXOPT='END'                                                      
FGI25                                                                                               
FGI25 * En el caso de la opción de visualiza no actualizo                                           
FGI25C                   IF        (INDDSP=*ON AND CONFIR=*OFF)                                     
FGI25C                             OR (INDDLT=*ON AND CONFIR=*OFF)                                  
FGI25C                   leavesr                                                                    
FGI25C                   ENDIF                                                                      
FGI25 *                                                                                             
FGI25C                   EVAL      T4FAMT=P2mcata                                                   
FGI25C     KEDPAR2       CHAIN     EDPAR2                             81                            
FGI25 *                                                                                             
FGI25C                   EXSR      P2mMPF                                                           
FGI25 *                                                                                             
FGI25C                   IF        CHAIN=*OFF                                                       
FGI25C                   UPDATE    REDPAR2                                                          
FGI25C                   ELSE                                                                       
FGI25C                   EVAL      T4DAT1=*DATE                                                     
FGI25C                   WRITE     REDPAR2                                                          
FGI25C                   ENDIF                                                                      
FGI25C                   IF        INDDLT=*ON                                                       
FGI25C                   EXSR      CS_DLTREG                                                        
FGI25C                   ENDIF                                                                      
FGI25C                   ENDSR                                                                      
FGI25 **************************************************************                                
FGI25 * SUBRUTINA PASAR DE PANTALLA P2m A FICHERO                  *                                
FGI25 *------------------------------------------------------------*                                
FGI25C     P2mMPF        BEGSR                                                                      
FGI25 *                                                                                             
FGI25C                   EVAL      T4FAMT=P2mcata                                                   
FGI25C                   EVAL      T4DAT8=*DATE                                                     
FGI25C                   EVAL      T4USUA=SDSUSR                                                    
FGI25C                   EVAL      T4PANT=SDSJOB                                                    
FGI25C                   TIME                    T4HORA                                             
FGI25 *                                                                                             
FGI25C                   ENDSR                                                                      
      **************************************************************                                
      * COMMON SUBRUTINE (CS_) :                                  *                                 
      * SUBRUTINA DE POSICIONAMENT DEL CURSOR                      *                                
      *------------------------------------------------------------*                                
     C     CS_POCUR2     BEGSR                                                                      
      * OBTENIM LA POSICIO DEL CURSOR                                                               
     C     FMTPOCUR      DIV       256           CSRFILA                                            
     C                   MVR                     CSRCOLU                                            
     C                   ENDSR                                                                      
      *                                                                                             
      **************************************************************                                
      * SUBRUTINA QUE CONTROLA ELS POSSIBLES ERRORS DE PROGRAMA    *                                
      *------------------------------------------------------------*                                
     C/COPY *LIBL/QSRDSRC,SRD020                                                                    
