      //  DOOM v01                                                                                 
      //           (C) Copyright Fluidra S.A. 2022. All Rights Reserved.                           
      //////////////////////////////////////////////////////////////////////////////////////////    
      //Notes sobre Simon                                                                          
      //  Per no fer debug i fer proves més ràpides, amb certa informació de per on passa i el q    
      //  fa, vaig montar el que li he dit Simon.                                                   
      //  Quan ho activem ens mostrarà un 'resum' de com ha processat la informació.                
      //              ADDENVVAR ENVVAR(SIMON_SAYS) VALUE(DBGDOOM01)                                 
      //////////////////////////////////////////////////////////////////////////////////////////    
      //  Resúm                                                                                    
      //                                                                                            
      //  - Carrega dades generals, lectura COCAPE...                                               
      //                                                                                            
      //  - Carregar articles -> CODEPE                                                             
      //    *Validar si és servicio. En cas afirmatiu el saltem: no entra en DOOM, hightway to h    
      //    *Validar si accepta ED.  Si NO accepta ED el saltem: no entra en DOOM, hightway to h    
      //                                                                                            
      //    Mirar excepcions Article-proveidor. En cas afirmatiu assignem Excepció                  
      //                                                                                            
      //    Si AddLin guardem les logístiques emprades en les línies existents                      
      //                                                                                            
      //  - Carregar magatzems ->  EDPAR2, EDPAR4... per confirmació                                
      //                                                                                            
      //           Recuperar informació del Mestre MSALMA                                           
      //                     M0TAL1, M0PRVR, ...                                                    
      //                                                                                            
      //           Segons el procés descartem el magatzem                                           
      //                                                                                            
      // El valor Ncoe es càlcula abans d'actualitzar codepe i s'utilitza el valor  Tart(n).znMa    
      // Aquest valor és la posició, en Tmag, del magatzem assignat a la línia.                     
      // És a dir, un valor 3 vol dir que aquest article s'ha assignat al magatzem que està en      
      //  la posició 3 de la taula Tmag.                                                            
      // Per altra banda tenim la taula TAmag on guardem les posicions dels magatzems assignats.    
      // Però en aquesta taula NO tenim els valors dels magatzems utilitzats per Obsolets/ArtiB     
      // els corresponents a les Excepcions. Sols tenim les posicions del procés 'normal'           
      // d'assignació.                                                                              
      // Però en el final del programa podem utilitzar-lo amb posicions reals o ficticies (Excep    
      // D'aquesta forma agrupem per logístiques, siguin Obso/ArtiB, Except o normals.              
                                                                                                    
          // Per futures modificacions/ampliacions                                                  
          //                                                                                        
          // Si s'ha d'incorporar una nova validació crear un nou 'pis' en el cub de validacions    
          // Crear un nou procediment per aquesta validació, com els existents                      
          //                                                                                        
          // Afeguir les validacions / condicions necessaries                                       
          // Recordant que                                                                          
          //       1 -> compleix condició                                                           
          //       0 -> NO compleix condició                                                        
          //     999 -> valor inicial, no s'ha tocat                                                
          //                                                                                        
          // Els parms rebuts, normalment                                                           
          //   dsArt-> Estructura amb les dades d'article. Això és un element de la taula Tart      
          //                   o de la taula Tcom (components). Aquesta estructura té tota la in    
          //                   relativa a l'article (o component). Si es necessita més info NO f    
          //                   un altre accés a msarti, modifica dsArt i carrega la info quan es    
          //                   carreguen les dades.                                                 
          //     iM -> número element Magatzems                                                     
          //                   En la taula Tmag element iM,  Tmag(iM) tenim tota la info relativ    
          //                    al magatzem. Si en necessites més NO facis un altre accés al fit    
          //                   modifica Tmag i carrega la info quan es carreguen totes les dades    
          //                                                                                        
          //                     Nota sobre afeguir pisos en el cub                                
          // El cub consta de pisos de validacions i pisos de totals (i el pis M1PROP, però això    
          // un altre guerra).                                                                      
          // Tot pis afeguit s'ha de posar ABANS dels pisos de totals.                              
          // I tota validació d'aquest pis nou s'ha de fer ABANS dels totals.                       
          // D'aquesta forma els acumulats i tota la resta hauria de funcionar igual.               
          //                                                                                        
      //                                                                                            
      //  Addicionalment necessitem coneixer si un article en un magatzem és propietat de la cia    
      //  Originalment es varen crear les marques M5SIOL i M5PROP per identificar-ho. Això ha       
      //  funcionat mentre sols existia un magatzem OL.                                             
      //  Tenim el camp M1PROP en MSSTOK que pot servir.                                            
      //  Afegim un pis en el cub de decisions per guardar el valor M1PROP. Sols per M0TAL1=8       
      //  Aquest pis estarà al final, passats els totals i passats els pisos per ME                 
      //                                                                                            
E7139 //////////////////////////////////////////////////////////////////////////////////////////    
E7139 // Date : 21/12/2022    Marca: E7139         Moficicació: FSD-99999                           
E7139 // Descripció: Varies modificacions / ampliacions                                             
E7139 //           - Ampliació del número de components                                             
E7139 //           - Tractament SobreStock                                                          
E7139 //           - Históric càlcul Doom                                                           
E7139 // Autor: MMontana                                                                            
E7139 //////////////////////////////////////////////////////////////////////////////////////////    
E7139 // Date : 10/01/2023    Marca: E7219         Moficicació: FSD-99999                           
E7139 // Descripció: Correcció p_Stock                                                              
E7139 // Autor: MMontana                                                                            
E7139 //////////////////////////////////////////////////////////////////////////////////////////    
E7223 // Date : 10/01/2023    Marca: E7223         Moficicació: FSD-99999                           
E7223 // Descripció: Forçat de línies CO0181 deixa TPE4=2.                                          
E7223 //             Si NO es pot assignar a un OL queda la línea marcada                           
E7223 // Descripció: Validació transportista: ha de permetre dos valors, 1 i 2                      
E7223 // Autor: MMontana                                                                            
E7223 //////////////////////////////////////////////////////////////////////////////////////////    
E7225 // Date : 10/01/2023    Marca: E7225         Moficicació: FSD-99999                           
E7225 // Descripció: Error SalesForce llença msgbox i entra amb coenvio a *blanks                   
E7225 // Autor: MMontana                                                                            
E7225 //////////////////////////////////////////////////////////////////////////////////////////    
E7249 // Date : 30/01/2023    Marca: E7249         Moficicació: FSD-99999                           
E7249 // Descripció: Add lectura al MITBAL per validar estat de l'article en M3                     
E7249 // Autor: MMontana                                                                            
E7249 //////////////////////////////////////////////////////////////////////////////////////////    
E7249 // Date : 03/02/2023    Marca: E7253         Moficicació: FSD-99999                           
E7249 // Descripció: TXAPU per IBERSPA                                                              
E7249 // Autor: MMontana                                                                            
E7249 //////////////////////////////////////////////////////////////////////////////////////////    
E7269 // Date : 09/02/2023    Marca: E7269         Moficicació: FSD-99999                           
E7269 // Descripció: Correcció increment iPE (contador Punts Expedició utilitzats)                  
E7269 //             Afegir info en DOOMHT                                                          
E7269 // Autor: MMontana                                                                            
E7269 //////////////////////////////////////////////////////////////////////////////////////////    
E7317 // Date : 21/02/2023    Marca: E7317         Moficicació: FSD-99999                           
E7317 // Descripció: AssignaMagResigual amb MagaObso, Error en assignació de magatzems              
E7317 // Autor: MMontana                                                                            
E7317 //////////////////////////////////////////////////////////////////////////////////////////    
E7323 // Date : 23/02/2023    Marca: E7323         Moficicació: FSD-99999                           
E7323 // Descripció: Correu d'en Fernando,                                                          
E7323 //'la gestión de OB,sobrestock, B, es escepcional y debe saltarse la validación de            
E7323 // llevarse el %'                                                                             
E7323 // Autor: MMontana                                                                            
E7323 //////////////////////////////////////////////////////////////////////////////////////////    
E7350 // Date : 06/03/2023    Marca: E7350         Moficicació: FSD-99999                           
E7350 // Descripció: gap al recuperar coenvio                                                       
E7350 // Autor: MMontana                                                                            
E7350 //////////////////////////////////////////////////////////////////////////////////////////    
E7377 // Date : 20/03/2023    Marca: E7377         Moficicació: FSD-99999                           
E7377 // Descripció: problemes amb s5ncoe en funció del s0coen.                                     
E7377 // Descripció: Add info quan hi ha errors en confirmació.                                     
E7377 // Autor: MMontana                                                                            
E7377 //////////////////////////////////////////////////////////////////////////////////////////    
E7377 // Date : 30/01/2024    Marca: SLE14         Moficicació: SLE-14                              
E7377 // Descripció: Cobrar pedido de venta pago al contado                                         
E7377 // Descripció: Canviar control lectura COCAIP (treure el not)                                 
E7377 // Autor: Lluís Albert Grau                                                                   
E7377 //////////////////////////////////////////////////////////////////////////////////////////    
E7377 // Date : 31/01/2024    Marca: SLE14         Moficicació: SLE-14                              
E7377 // Descripció: Cobrar pedido de venta pago al contado                                         
E7377 // Descripció: Canviar control lectura COCAIP i validar forma de pagament                     
E7377 // Autor: Toni Lopez                                                                          
E7377 //////////////////////////////////////////////////////////////////////////////////////////    
E7728 // Date : 27/10/2023    Marca: E7728         Moficicació: FSD-99999                           
E7728 // Descripció: Doom sobrestock                                                                
E7728 // Autor: MMontana                                                                            
E7728 //////////////////////////////////////////////////////////////////////////////////////////    
FGI25 // Date : 20/06/2025    Marca: FGI25         Moficicació: OLFGI-25                            
FGI25 // Descripció: EXCEPCIÓN DOM EN ITALIA                                                        
FGI25 // Autor: MMontana                                                                            
FGI25 //  Nueva excepción por categorización del articulo: MTO/MTS                                  
FGI25 //////////////////////////////////////////////////////////////////////////////////////////    
OLFGI // Date : 15/12/2025    Marca: OLFGI         Moficicació: OLFGI-E                             
OLFGI // Descripció: Correcció per error en número d'articles assignats per excepció en kits        
OLFGI // Autor: MMontana                                                                            
OLFGI //////////////////////////////////////////////////////////////////////////////////////////    
HDC74 // Date : 28/01/2026    Marca: HDC74         Moficicació: NIHDC-74                            
HDC74 // Descripció: Correcció per assignació total per excepció                                    
HDC74 //   Se añade control por bloqueo OL en artículos cuando assigna por excepción                
HDC74 // Autor: MMontana                                                                            
HDC74 //////////////////////////////////////////////////////////////////////////////////////////    
        ctl-opt  decedit('0,')  datedit(*ymd/)                                                      
        copyright('2022 Fluidra S.A.')                                                              
        debug option(*nodebugio:*srcstmt:*nounref)                                                  
        dftactgrp(*no)                                                                              
E7139   alwnull(*usrctl)                                                                            
        bnddir('QC2LE');                                                                            
                                                                                                    
      //////////////////////////////////////////////////////////////////////////////////////////    
      // FILES                                                                                     
      //----------------------------------------------------------------------------------------    
                                                                                                    
      //Temporals                                                                                  
      //dcl-f ed0050w usage(*update) keyed usropn;                                                  
        dcl-f do0050w usage(*update:*output) keyed usropn;                                          
      //dcl-f do005001 usage(*input) keyed rename(RDO0050W:RDO005001)                               
      //               prefix(C_) usropn;                                                           
        dcl-f do0051w usage(*update:*output) keyed usropn;                                          
        dcl-f do0052w usage(*update:*output) keyed usropn;                                          
        dcl-f do0053w usage(*update:*output) keyed usropn;                                          
      //Históric càlcul doom                                                                       
      //dcl-f doh053  usage(*input:*delete) keyed usropn;                                           
E7139   dcl-f doomht  usage(*output) keyed usropn;                                                  
      //Empreses                                                                                   
        dcl-f pmempr usage(*input) keyed;                                                           
      //Paràmetres ED                                                                              
        dcl-f edparm usage(*input) keyed;                                                           
        dcl-f edparc usage(*input) keyed;                                                           
        dcl-f edpar2 usage(*input) keyed;                                                           
        dcl-f edpar3 usage(*input) keyed;                                                           
        dcl-f edpar4 usage(*input) keyed;                                                           
      //Mestre Clients                                                                             
        dcl-f coclin usage(*input) prefix(C_) keyed;                                                
      //Pagaments a compte                                                                         
        dcl-f cocaip   usage(*input) keyed usropn;                                                  
      //Comandes Header & lines                                                                    
        dcl-f cocape usage(*update) keyed;                                                          
        dcl-f codepe usage(*update) keyed;                                                          
      //Magatzems                                                                                  
        dcl-f msalma usage(*input) keyed;                                                           
        dcl-f msalma05 usage(*input) keyed rename(RMSALMA:RMSALMA05);                               
      //Mestre del rel·lacions entre delegacions                                                   
        dcl-f msddom11 usage(*input) keyed  rename(RMSDDOM:RMSDDOM11) usropn;                       
      //dcl-f msddom12 usage(*input) keyed  rename(RMSDDOM:RMSDDOM12) usropn;                       
      //dcl-f msddom13 usage(*input) keyed  rename(RMSDDOM:RMSDDOM13) usropn;                       
      //dcl-f msddom14 usage(*input) keyed  rename(RMSDDOM:RMSDDOM14) usropn;                       
      //Mestre de divises (No valors canvi)                                                        
        dcl-f msdiv0 usage(*input) keyed;                                                           
      //Mestre Taxes (iva) per empresa                                                             
        dcl-f msivas usage(*input) keyed;                                                           
      //Unitats de mesura d'articles                                                               
        dcl-f pmunal usage(*input) keyed;                                                           
        dcl-f pmtabd usage(*input) keyed;                                                           
      //Estock per magatzem/article                                                                
        dcl-f msstok usage(*input) keyed;                                                           
        dcl-f mssto01 usage(*input) keyed;                                                          
      //Estock magatzems 7                                                                         
        dcl-f gxsto0  usage(*input) keyed usropn;                                                   
      //Mestre transportistes                                                                      
        dcl-f mstrta usage(*input) keyed;                                                           
      //Proveïdors                                                                                 
        dcl-f puprov usage(*input) keyed;                                                           
      //Lead time per Arti/Prov                                                                    
        dcl-f puprp0 usage(*input) keyed;                                                           
      //Adreça proveïdor??????                                                                     
        dcl-f gxeqpr usage(*input) keyed;                                                           
      //Llista biblioteques                                                                        
        dcl-f pmlibl usage(*input) keyed;                                                           
      //Mestre d'articles                                                                          
        dcl-f msarti   usage(*input) keyed;                                                         
      //Mestre conjunts: capçalera i detall                                                        
        dcl-f mscojc   usage(*input) keyed usropn;                                                  
        dcl-f mscojd   usage(*input) keyed usropn;                                                  
        //dcl-f puprcj   usage(*input) keyed usropn; //19/08/2022.- OL2-186                         
      //Ordres de fabricació                                                                       
        dcl-f pmcaor01 usage(*input) keyed usropn;                                                  
        dcl-f pmcaor08 usage(*input) keyed rename(RPMCAOR:RPMCAOR08)                                
                       usropn;                                                                      
        dcl-f pmdeor05 usage(*input) keyed usropn;                                                  
E7249   dcl-f mitbal00 usage(*input) keyed usropn;                                                  
E7249   dcl-f svuser usage(*input) keyed usropn;                                                    
E7249   dcl-f utcom0 usage(*input) keyed usropn;                                                    
FGI25 //Per recuperar categorització ITNO                                                          
FGI25   dcl-f zaqbal00 usage(*input) prefix(MQ:2) keyed usropn;    // MBCONO MBWHLO MBITNO          
       /////////////////////////////////////////////////////////////////////////////////////////    
       // Variables - Constants - Taules                                                           
       //---------------------------------------------------------------------------------------    
       //                                                                                           
       //Definició del cub de decisions/validacions.                                               
       // 3 dimensions:                                                                             
       //                                                                                           
       //                        /\                                                                 
       //                       /  \   Articles (linies de comanda                                  
       //           Magatzems  /    \                                                               
       //                     /      \                                                              
       //                    |\      /|                                                             
       //         Validacions| \    / |                                                             
       //                    |  \  /  |                                                             
       //                     \  \/   /                                                             
       //                      \  |  /                                                              
       //                       \ | /                                                               
       //                        \|/                                                                
       //                                                                                           
       //      Per pisos (nivells de validació)                                                     
       //                                                                                           
       //                Articles                                      Primer pis:Valida existei    
       //                                                                        article en maga    
       //                | A1 | A2 | A2 | ... | iLarti + 1                                          
       //                +----+----+----+-----+----------                                           
       //   Magatzem 1   |  1 |  1 | 0  |  0  |  2                                                  
       //             ---+----+----+----+-----+----------                                           
       //   Magatzem 2   |  1 |  1 | 1  |  1  |  4                                                  
       //             ---+----+----+----+-----+----------                                           
       //   Magatzem 3   |  0 |  1 | 1  |  1  |  3                                                  
       //             ---+----+----+----+-----+----------                                           
       //             ....                                                                          
       //                                                                                           
       //                Articles                                      Segón pis:Valida estock      
       //                                                                   disponible en maga      
       //                | A1 | A2 | A2 | ... | iLarti + 1                                          
       //                +----+----+----+-----+----------                                           
       //   Magatzem 1   |  1 |  0 | 0  |  0  |  1                                                  
       //             ---+----+----+----+-----+----------                                           
       //   Magatzem 2   |  1 |  1 | 0  |  1  |  3                                                  
       //             ---+----+----+----+-----+----------                                           
       //   Magatzem 3   |  0 |  1 | 1  |  1  |  3                                                  
       //             ---+----+----+----+-----+----------                                           
       //             ....                                                                          
       //       Tercer, quart, cinqué.... altres validacions.                                       
       //             ....                                                                          
       //                                                                                           
       //                Articles                                    Darrer pis: 'sumatori' lógi    
       //                                                                de les validacions         
       //                | A1 | A2 | A2 | ... | iLarti + 1                                          
       //                +----+----+----+-----+----------            Nota: tenim 3 pisos de Fina    
       //   Magatzem 1   |  1 |  0 | 0  |  0  |  3                                                  
       //             ---+----+----+----+-----+----------               1.- Totes les condicions    
       //   Magatzem 2   |  1 |  1 | 0  |  1  |  7                      2.- 4 condicions (fixes)    
       //             ---+----+----+----+-----+----------               3.- 3 condicions (fixes)    
       //   Magatzem 3   |  0 |  1 | 1  |  1  |  6                                                  
       //             ---+----+----+----+-----+----------            I tenim els pisos per ME       
       //             ....                                                                          
       //                                                                                           
       //   En aquest punt les decicions són independents del coenviament (S0COEN)                  
       //                                                                                           
       //                                                                                           
       //---------------------------------------------------------------------------------------    
       //Bucle mentre tinguem linies pendents d'assignar (iLPEND)                                   
       // Si queden punts d'expedició disponibles                                                   
       //   Es prioritza pel pis kFinal (totes les validacions) qui pugui servir més línies.        
       //     Si cap magatzem pot servir-ne es prioritza pel pis kFinalP1 (menys restrictiu)        
       //       Si cap magatzem pot servir-ne es prioritza pel pis kFinalP2 (menys restrictiu)      
       //         Si cap magatzem pot servir-ne es tracta com residual                              
       //                                                                                           
       // Si NO queden punts d'expedició disponibles                                                
       //   Es tracta com residual                                                                  
       //                                                                                           
       //---------------------------------------------------------------------------------------    
       //                                                                                           
       //   S'ha de tenir en compte si tenim especials (artiB o Obso) i si tenim magatzems que N    
       //      contin com PE.                                                                       
       //      En aquest cas s'ha d'assignar TOT el que es pugui a aquestos magatzems               
       //   En cas contrari, encara que tinguem especials (artiB o Obso), l'assignació es farà      
       //      per més conjunt, més agrupat.                                                        
       //                                                                                           
       //Dimensió Articles                                                                         
       //  Dimensió Magatzems                                                                      
       //    Dimensió Validacions                                                                  
       dcl-ds CArt qualified dim(kMaxArt); //                                                       
         dcl-ds CMag dim(kMaxMag); //                                                               
           CVal like(s5line) inz(999) dim(kMaxVal);                                                 
         end-ds;                                                                                    
       end-ds;                                                                                      
       //                                                                                           
       //   CArt(x).CMag(y).CVal(z)  = ....                                                        
       //                                                                                           
                                                                                                    
       //---------------------------------------------------------------------------------------    
       //                                                                                           
       //Taula Articles. Una per línia. Informació específica                                      
       //                                                                                           
       //  Tota la informació necessaria per realitzar les validacions                              
       //                                                                                           
       dcl-ds dsArt Template;                                                                       
           zArti     like(s5arti) inz;                                                              
           zVari     like(s5vari) inz;                                                              
           zMode     like(s5mode) inz;                                                              
           zTcoj     like(NDTCOJ) inz;  //Conjunt                                                   
           zLine     like(s5line) inz;  //Número de línia                                           
           zLoge     like(s5loge) inz;  //Logística actual                                          
           zNcoe     like(s5line) inz;  // Número de coenvio                                        
           zNNcoe    like(s5line) inz;  // New Número de coenvio                                    
           zPrvr     like(m0prvr) inz;  //ProveÏdor article                                         
           zFrep     like(s5frep) inz;  //data prevista                                             
           zCant     like(s5cant) inz;  // Qty comanda                                              
           zUnim     like(s5unim) inz;  // Unitat Comanda                                           
           zCan2     like(s5cant) inz;  // Qty cambiada a unitat article (m5unim)                   
           zUni2     like(m5unim) inz;  // Unitat Article                                           
           zSiol     like(m5siol) inz;  // Article Propi                                            
           zTpe4     like(s5tpe4) inz;  // FD o no FD? That's the question!                         
           zNoED     char(1) inz(*blanks);                                                          
           zProb     char(2) inz(*blanks);    // Obsolet                                            
           zImpLin   like(d2imed) inz(*zero);  //Import línia    computed                           
           zVolLin   like(xVolpes) inz(*zero);  //Volumen línia   computed                          
           zTdi1     like(s5tdi1) inz;  // adreça d'endrega?? a nivell de línia?                    
           zPesLin   like(xVolpes) inz(*zero);  //Pes línia       computed                          
           zVUnLin   like(d2volu) inz(*blanks); // Unitat volum                                     
           zCost     like(m5cosp) inz;   // Cost per càlcul Especialillos                           
           zForzado  ind inz(*off); //Indicador de línia forçada                                    
           zExcpt    ind inz(*off); //Indicador de logística per except (arti/prov)                 
           zLogFinal like(s5loge) inz;  //Logística assignada                                       
           zLogVirtual like(s5loge) inz;  //Logística virtual de la logística assignada             
           znMAG     like(s5line) inz;   //Posició del magatzem assignat                            
           //// zServ     like(@PERRO);  //Article de servei. No és necessari                       
           // i dades d'excepció, paràmetres, etc...                                                
       end-ds;                                                                                      
       dcl-ds Tart likeds(dsArt) dim(kMaxArt) ; //qualified implicit amb Likeds                     
       //                                                                                           
       //  Tart(x).zArti = ....                                                                    
       //                                                                                           
       //Taula Components                                                                          
       dcl-ds TCom likeds(dsArt) dim(kMaxCom) ; //qualified implicit amb Likeds                     
       //   TCom(x).zArti  = ....                                                                  
                                                                                                    
       //Taula Magatzems emprats. Per processar residual                                           
       dcl-s TAMag like(s5line) dim(kMaxMag) inz; //Número de línia                                 
       //Taula Auxiliar per les assignacions via Excepcions                                        
       dcl-s TauxExc like(m0maga) dim(kMaxMag) inz;                                                 
       //Var Auxiliar per les assignacions via Excepcions                                          
       dcl-s iAuxExc like(s5line) inz;                                                              
       //Taula de Nivells de validació, criteris de validació, muesgues de validació... que sé     
       dcl-s TLevel like(s5line) dim(03) inz; // Pis criteri de validació a emprar                  
       //Taula Pendents. Aquí tindrem la informació de les línies que estan pendents d'assignar    
       dcl-s Tpend like(s5line) dim(kMaxArt) inz; //Número de línia                                 
       //  Inicialment tindrem la mateixa informació... o no.                                       
       //    Els articles amb excepcions ja no formaran part d'aquesta taula                        
       //                                                                                           
       //   Element  1  2  3  4  5  6                                                               
       //   valor    1  2  3  4  5  6 ...                                                           
       //                                                                                           
       //          Despés d'assignar línies a un magatzem, tindriem (per exemple)                   
       //                                                                                           
       //   Element  1  2  3  4  5  6                                                               
       //   valor    3  5  6  4  5  6 ...                                                           
       //                                                                                           
       //          Es a dir, sols queden els elements 3, 5 i 6 pendents d'assignar                  
       //      Tart(3) -> Tart(Tpend(1)).zVal                                                       
       //                                                                                           
       //   Però tenim els elements 4, 5, 6 informats!!                                             
       //   Sip, el darrer element que s'ha d'utilitzar està indicat per la variable iLPEND         
       //                                                                                           
       //      For i = 1 to iLPEND            // Ex. Bucle per tots els pendents                    
       //         Tart(Tpend(i)).zVal  .....                                                        
                                                                                                    
       //Taula Magatzems. Informació específica                                                    
       dcl-ds Tmag dim(kMaxMag) qualified;                                                          
           zMaga     like(m0maga);     //codi magatzem                                              
           zLoge     like(m0loge);     //logística del magatzem                                     
           zPrvr     like(m0prvr);     //Proveïdor del magatzem                                     
           ztal1     like(m0tal1);     //Tipus de magatzem                                          
           zImpo     like(T5impo);     // Import mínim                                              
           zDisp     like(T5DISP);     // %disponibilitat                                           
           zMLin     like(T5MLIN);     // num max línies                                            
           zMLia     like(T5MLIA);     // num línies actuals                                        
           zMLiZ     like(T5MLIA);     // calculat: num línies actuals descomptant assignació       
           zOctL     ind inz(*off);    // Omit Control línies    t4clin                             
           zOctS     ind inz(*off);    // Omit Control Stock     t4cstk                             
           zOctC     ind inz(*off);    // Omit Control Capacitat       t4ocap                       
           zOmag     ind inz(*off);    // Omit Magatzem ???? <--- MUESGA     t4omag                 
           zOctI     ind inz(*off);    // Omit Control Import Mínim          t4oimp                 
           zCapa     like(T5capa);     // capacitat màxima                                          
           zPeso     like(T5peso);     // pes màxim                                                 
           zVolu     like(T5Volu);     // volum màxim                                               
           zhorz     like(T5horz);     // dias horitzó                                              
           zFhor     like(@pedat1);    // data calculada                                            
           zPmin     like(T5pmin);     // % sobre mínimo                                            
           zAmasi    like(t5masi);     // % línies sobre total per poder triar aquest magatzem      
           zMagEsp   ind inz(*off);    // indicador de magaEsp                                      
           zOuni     like(xVolPes);    // t4ouni                                                    
           zOpes     like(xVolPes);    // t4opes                                                    
           zairOB    like(xair01);     // obsolets B                                                
           zairOC    like(xair01);     // obsolets C                                                
           zairAB    like(xair01);     // Articles B                                                
E7139      zairSS    like(xair03);     // SS Phase3                                                 
           zaoeOB    like(xaoe01);     // obsolets B  Si 1 NO conta punt expedició                  
           zaoeOC    like(xaoe01);     // obsolets C  Si 1 NO conta punt expedició                  
           zaoeAB    like(xaoe01);     // Articles B  Si 1 NO conta punt expedició                  
E7139      zaoeSS    like(xaoe03);     // SS Phase3  Si 1 NO conta punt expedició                   
E7139      zpsMax    packed(5:2) inz;  // SS Phase3  %proteger SMax                                 
           zNlin     like(s5line);     // número de línies que compleixen condició                  
           zAssigRonda  like(s5line);   //Magatzem assignat en n ronda (1a, 2a, ...)                
           zLogVirtual like(m0loge) inz;   //logística virtual del magatzem                         
E7249      zWHLO like(MBWHLO) inz; // Codi magatzem en M3. Sols per maga TAL1=8                     
           // i dades d'excepció, paràmetres, etc...                                                
       end-ds;                                                                                      
       //                                                                                           
       //  Tmag(y).zMaga = ....                                                                    
       //                                                                                           
                                                                                                    
       //Array Logístiques. Per procés AddLin - ForcedLin                                          
       dcl-s Tlog like(m0loge) dim(kMaxMag);                                                        
       //Array Coenvios. Per procés AddLin - ForcedLin                                             
       dcl-s TnCoe like(s5line) dim(kMaxMag);                                                       
                                                                                                    
       //  Tlog(y) = ....                                                                          
       //                                                                                           
       //  Aquí guardarem les diferents logístiques de la comanda                                   
       //  Sols per AddLin, ja que la línia nova haurà d'anar a una de les logístiques emprades     
       //  en les altres línies de la comanda. En cas de no poder assignar-ho s'ha d'informar i     
       //  deixar a la logística de la capçalera.                                                   
       //                                                                                           
                                                                                                    
E7139  dcl-s ctsiED char(50);  // les passem a global                                               
E7139  dcl-s ctnoED char(50);  // les passem a global                                               
       dcl-s   cFormaPago like(pedesc) inz;                                                         
       dcl-s   cString  char(50);                                                                   
       dcl-s   cstr     char(50);                                                                   
       dcl-s   pstr pointer;                                                                        
       //Variables pel MSGBOX                                                                      
       dcl-s @pTitulo char(50);                                                                     
       dcl-s @pLongitud zoned(4:0);                                                                 
       dcl-s @pFuncion char(1);                                                                     
       dcl-s @pRetorno char(1);                                                                     
       dcl-s tJob like(@ptitulo);                                                                   
       dcl-s txurru like(DODATA); //varchar(5000);   // var pel missatge de msgbox                  
       //Constants                                                                                 
       // Mides cub                                                                                 
E7139  //     dcl-c kMaxCom const(20); // màxim components                                          
E7139  dcl-c kMaxCom const(60); // Màxim components ampliat                                         
       dcl-c kMaxVal const(14);        //Validacions (07), totals 3, ME 2, 1 per M1PROP, 1 xInci    
       dcl-c kMaxArt const(1000);      //Articles: 999 línies comanda  +1 totals per magatzem       
       dcl-c kMaxMag const(50);       //Magatzems                                                   
                                                                                                    
       // Valors : Validacions                                                                      
       dcl-c kExist      const(01); // existeix aquest article/magatzem. Sols per M0TAL1=8. Rest    
       dcl-c kDispo      const(02); // tenim disponibilitat d'aquest article/magatzem               
       dcl-c kFrep       const(03); // compleix Fecha horizonte                                     
       dcl-c kPesVol     const(04); // Pesos Volumns Unitats                                        
       dcl-c kProv       const(05); // Valida Proveïdor                                             
       dcl-c kNLin       const(06); // Compleix número de línies assignades. Sols per M0TAL1 < 7    
       dcl-c kED51       const(07); // Pot ser FD? sols per M0TAL1= 7, 8. Resta = 1                 
       // ....                                                                                      
       dcl-c kFinal      const(08); // Article/Maga supera totes les proves                         
       dcl-c kFinalP1    const(09); // Parcial 1                                                    
       dcl-c kFinalP2    const(10); // Parcial 2                                                    
       dcl-c kNoPE       const(11); // Sols per MagaEsp (ArtiB/Obso)                                
       dcl-c kFinalME    const(12);  // Sols per MagaEsp: suma lógica de kFinal + kNoContaPunt      
       dcl-c kM1PROP     const(13);  // Sols per M0TAL1= 7, 8.                                      
       dcl-c kxInci      const(14);  // Sols per M0TAL1= 7, 8-> Retorn del ED0051                   
                                                                                                    
       dcl-c kSC const('SC');   // TPED sin cargo                                                   
       dcl-c kOB const('OB');   // Obsolets B                                                       
       dcl-c kOC const('OC');  // Obsolets C                                                        
                                                                                                    
       // Simon Konstants                                                                           
       dcl-c kSS const('SIMON_SAYS');                                                               
       dcl-c kDBG const('DBGDOOM01');                                                               
                                                                                                    
       // Valors d'errors                                                                           
       dcl-c kNOError          const('0');  //Tot correcte                                          
       dcl-c kErrorTransFP     const('1');  //Transportista i/o Forma pago no acceptan ED           
       dcl-c kErrorClient      const('2');  //Client NO accepta ED                                  
       dcl-c kErrorPedCompl    const('3');  //                                                      
       dcl-c kErrorNotPossible const('4');  //No s'ha pogut assignar una línia                      
                                                                                                    
       // Valors per tipus PROCÉS                                                                   
       dcl-c kPROCsimulacio    const(1);                                                            
       dcl-c kPROCconfirmacio  const(2);                                                            
       dcl-c kPROCAddLin       const(3);                                                            
       dcl-c kPROCForcedHeader const(4);                                                            
       dcl-c kPROCForcedLin    const(5);                                                            
                                                                                                    
       // Valors dels missatges de text                                                             
       dcl-c kmsg0000 const('DOO0000'); // DOoM calculation result                                  
       dcl-c kmsg0001 const('DOO0001'); // accept FD                                                
       dcl-c kmsg0002 const('DOO0002'); // DOES NOT ACCEPT FD                                       
       dcl-c kmsg0003 const('DOO0003'); // línea/s se asignaran a                                   
       dcl-c kmsg0004 const('DOO0004'); // Está de acuerdo con el resultado?                        
       dcl-c kmsg0005 const('DOO0005'); // Press F10 to confirm                                     
       dcl-c kmsg0006 const('DOO0006'); // En caso contrario pulse F12                              
       dcl-c kmsg0007 const('DOO0007'); // ¿Desea continuar de todos modos?                         
       dcl-c kmsg0008 const('DOO0008'); // No se ha podido asignar la/s linea/s.                    
       dcl-c kmsg0009 const('DOO0009'); // Linea/s reasignada/s a logística                         
       dcl-c kmsg0010 const('DOO0010'); // Pulse Intro para continuar                               
       dcl-c kmsg0011 const('DOO0011'); // El cliente NO acepta ED                                  
       dcl-c kmsg0012 const('DOO0012'); // La SIMULACIÓN se mostrará                                
       dcl-c kmsg0013 const('DOO0013'); // Peró la confirmación NO entrará en DOM                   
       dcl-c kmsg0014 const('DOO0014'); // Cliente                                                  
       dcl-c kmsg0015 const('DOO0015'); // Transportista                                            
       dcl-c kmsg0016 const('DOO0016'); // Forma Pago                                               
       dcl-c kmsg0017 const('DOO0017'); // Alguna/s línea/s no se han podido asignar para FD        
       dcl-c kmsg0018 const('DOO0018'); // No se puede ejecutar el proceso de asignación            
       dcl-c kmsg0019 const('DOO0019'); // línea/s asignada por excepción                           
       dcl-c kmsg0020 const('DOO0020'); // Pedido completo:                                         
       dcl-c kmsg0021 const('DOO0021'); // no se han podiso asignar....                             
       dcl-c kmsg0022 const('DOO0022'); // DOoM calculation result                                  
       dcl-c kmsg0023 const('DOO0023'); // accept FD                                                
       dcl-c kmsg0024 const('DOO0024'); // DOES NOT ACCEPT FD                                       
       dcl-c kmsg0025 const('DOO0025'); // línea/s se asignaran a                                   
       dcl-c kmsg0026 const('DOO0026'); // Load default data                                        
       dcl-c kmsg0027 const('DOO0027'); // Load Items                                               
       dcl-c kmsg0028 const('DOO0028'); // Exception                                                
       dcl-c kmsg0029 const('DOO0029'); // Assigned to                                              
       dcl-c kmsg0030 const('DOO0030'); // Load Warehouses                                          
       dcl-c kmsg0031 const('DOO0031'); // Load Special Warehouses                                  
       dcl-c kmsg0032 const('DOO0032'); // Default Warehouse                                        
       dcl-c kmsg0033 const('DOO0033'); // Read                                                     
       dcl-c kmsg0034 const('DOO0034'); // Discart                                                  
       dcl-c kmsg0035 const('DOO0035'); // Service                                                  
       dcl-c kmsg0036 const('DOO0036'); // Loaded                                                   
       dcl-c kmsg0037 const('DOO0037'); // Pending                                                  
       dcl-c kmsg0038 const('DOO0038'); // Validations Item-Warehouse                               
       dcl-c kmsg0039 const('DOO0039'); // ??                                                       
       dcl-c kmsg0040 const('DOO0040'); // Special Warehouse Process                                
       dcl-c kmsg0041 const('DOO0041'); // Main Process                                             
       dcl-c kmsg0042 const('DOO0042'); // Lines                                                    
       dcl-c kmsg0043 const('DOO0043'); // Allocates residual                                       
       dcl-c kmsg0044 const('DOO0044'); // Reassign warehouse                                       
       dcl-c kmsg0045 const('DOO0045'); // Import mínim                                             
       dcl-c kmsg0046 const('DOO0046'); // Amasi                                                    
       dcl-c kmsg0047 const('DOO0047'); // % Lin                                                    
                                                                                                    
       // Valors varis                                                                              
       dcl-c k0 const('0');                                                                         
       dcl-c k1 const('1');                                                                         
       dcl-c k2 const('2');                                                                         
       dcl-c k3 const('3');                                                                         
       dcl-c k4 const('4');                                                                         
       dcl-c k5 const('5');                                                                         
       dcl-c k7 const('7');                                                                         
       dcl-c k8 const('8');                                                                         
       dcl-c kA const('A');                                                                         
       dcl-c kB const('B');                                                                         
       dcl-c kC const('C');                                                                         
       dcl-c kG const('G');                                                                         
       dcl-c kH const('H');                                                                         
       dcl-c kI const('I'); // Job Interactiu                                                       
FGI25  dcl-c kM const('M');                                                                         
E7249  dcl-c kV const('V');                                                                         
       dcl-c kZ const('Z');                                                                         
E7249                                                                                               
E7249  dcl-c k20 const('20');                                                                       
E7249  dcl-c k80 const('80');                                                                       
                                                                                                    
       dcl-c k003 const('003');                                                                     
       dcl-c k005 const('005');                                                                     
       dcl-c k019 const('019');                                                                     
       dcl-c k060 const('060');                                                                     
       // Colors, efectes, etc                                                                      
       dcl-c cNGr const(X'20');    // Normal Green                                                  
       dcl-c cRGr const(X'21');    // Reverse Green                                                 
       dcl-c cNWh const(X'22');    // Normal White                                                  
       dcl-c cRWh const(X'23');    // Reverse White                                                 
       dcl-c cUGr const(X'24');    // Underline Green                                               
       dcl-c cXGr const(X'25');    // Underline Reverse Green                                       
       dcl-c cUWh const(X'26');    // Underlin White                                                
       dcl-c cND0 const(X'27');    // NON DISPLAY                                                   
       dcl-c cNRd const(X'28');    // Normal Red                                                    
       dcl-c cRRd const(X'29');    // Reverse Red                                                   
       dcl-c cBRd const(X'2A');    // Blink Red                                                     
       dcl-c cYRd const(X'2B');    // Reverse Blink Red                                             
       dcl-c cURd const(X'2C');    // Underline Red                                                 
       dcl-c cXRd const(X'2D');    // Underline Reverse Red                                         
       dcl-c cZRd const(X'2E');    // Underline Blink Red                                           
       dcl-c cND2 const(X'2F');    // NON DISPLAY                                                   
       dcl-c cSTq const(X'30');    // ColSep Turquoise                                              
       dcl-c cWTq const(X'31');    // Reverse ColSep Turquoise                                      
       dcl-c cSYw const(X'32');    // ColSep Yellow                                                 
       dcl-c cWYw const(X'33');    // Reverse ColSep Yellow                                         
       dcl-c cUTq const(X'34');    // Underline Turquoise                                           
       dcl-c cXTq const(X'35');    // Underline Reverse Turquoise                                   
       dcl-c cUYw const(X'36');    // Underline Yellow                                              
       dcl-c cND3 const(X'37');    // NON DISPLAY SEP                                               
       dcl-c cNPk const(X'38');    // Normal Pink                                                   
       dcl-c cRPk const(X'39');    // Reverse Pink                                                  
       dcl-c cNBl const(X'3A');    // Normal Blue                                                   
       dcl-c cRBl const(X'3B');    // Reverse Blue                                                  
       dcl-c cUPk const(X'3C');    // Underline Pink                                                
       dcl-c cXPk const(X'3D');    // Underline Reverse Pink                                        
       dcl-c cUBl const(X'3E');    // Underline Blue                                                
       dcl-c cND4 const(X'3F');    // NON DISPLAY                                                   
                                                                                                    
       //Area de dades del programa                                                                
       dcl-ds Pgm psds qualified ;                                                                  
         sdsPgm char(10) ;           // Module or main procedure name                               
         status zoned(5) ;           // Status code                                                 
         PrvStsCde zoned(5) ;        // Previous status                                             
         SrcLineNbr char(8) ;        // Source line number                                          
         Routine char(8) ;           // Name of the RPG routine                                     
         Parms zoned(3) ;            // Number of parms passed to program                           
         ExceptionType char(3) ;     // Exception type                                              
         ExceptionNbr char(4) ;      // Exception number                                            
         // Exception char(7) samepos(ExceptionType) ;                                              
         Reserved1 char(4) ;         // Reserved                                                    
         MsgWrkArea char(30) ;       // Message work area                                           
         PgmLib char(10) ;           // Program library                                             
         ExceptionData char(80) ;    // Retrieved exception data                                    
         Rnx9001Exception char(4) ;  // Id of exception that caused RNX9001                         
         LastFile1 char(10) ;        // Last file operation occurred on                             
         Unused1 char(6) ;           // Unused                                                      
         DteEntered char(8) ;        // Date entered system                                         
         StrDteCentury zoned(2) ;    // Century of job started date                                 
         LastFile2 char(8) ;         // Last file operation occurred on                             
         LastFileSts char(35) ;      // Last file used status information                           
         sdsJob  char(10) ;          // Job name                                                    
         sdsUser char(10) ;          // Job user                                                    
         sdsjNbr zoned(6) ;          // Job number                                                  
         StrDte zoned(6) ;           // Job started date                                            
         PgmDte zoned(6) ;           // Date of program running                                     
         PgmTime zoned(6) ;          // Time of program running                                     
         CompileDte char(6) ;        // Date program was compiled                                   
         CompileTime char(6) ;       // Time program was compiled                                   
         CompilerLevel char(4) ;     // Level of compiler                                           
         SrcFile char(10) ;          // Source file name                                            
         SrcLib char(10) ;           // Source file library                                         
         SrcMbr char(10) ;           // Source member name                                          
         ProcPgm char(10) ;          // Program containing procedure                                
         ProcMod char(10) ;          // Module containing procedure                                 
         SrcLineNbrBin bindec(2) ;   // Source line number as binary                                
         LastFileStsBin bindec(2) ;  // Source id matching positions 228-235                        
         User char(10) ;             // Current user                                                
         ExtErrCode int(10) ;        // External error code                                         
       end-ds ;                                                                                     
                                                                                                    
     D* AREA DE DADES LOCAL I INICIALITZACIO DE VALORS COMUNS                                       
     D  DSLDA        E DS                  EXTNAME(PURLDADS)                                        
     D    CCCDEEM                    30    OVERLAY(ZZDEEM)                                          
        //PLANTILLA D'INDICADORS DEL PROGRAMA (ELS RESERVATS NO SURTEN)                             
     D  INDICADORS   E DS                  BASED(INDICADORP)                                        
     D                                     EXTNAME(INDDS:RIND0199)                                  
     D  INDICADORP     S               *   INZ(%ADDR(*IN))                                          
                                                                                                    
       //Variables                                                                                 
       dcl-s xVolpes packed(20:0);                                                                  
       dcl-s @fdarv1 char(25);                                                                      
       dcl-s @plogi packed(1:0);                                                                    
       dcl-s @porig packed(1:0);                                                                    
       dcl-s @pinte packed(1:0);                                                                    
       dcl-s @PERRO     char(1);                                                                    
       dcl-s @POMFDE    char(1);                                                                    
       dcl-s @petise    char(4);                                                                    
       dcl-s @pforce  char(1);                                                                      
       dcl-s @pline    like(s5line);                                                                
       dcl-s @pedat1 packed(8);                                                                     
       dcl-s @pedays packed(5);                                                                     
       dcl-s @Stok   packed(15:5) template;                                                         
                                                                                                    
       //Comptadors darrer element carregat                                                        
       dcl-s iLmag like(s5line) inz; // Integer Last Magatzem:darrera posició informada en magat    
       dcl-s iLmagME like(s5line) inz; // Integer Last Mag Especial: maga artiB/Obso                
       dcl-s iLarti like(s5line) inz; // Integer Last Article :darrera posició informada en arti    
       dcl-s iLpend like(s5line) inz; // Integer Last Pendent :darrera posició informada en pend    
       dcl-s iExcpt like(s5line) inz; // Integer Lin assignades per excepció                        
E7374  dcl-s iLAux  like(s5line) inz; // Integer Aux per càlcul assignats en ProcessaME             
E7374  dcl-s iArtB  like(s5line) inz; // Integer Lin assignades per ArtiB/Obso                      
       dcl-s iRonda like(s5line) inz; // Contador de Rondes                                         
       dcl-s iPE    like(s5line) inz; // Integer Contador de punts assignats                        
       dcl-s iPEnED like(s5line) inz; // Integer Contador de punts assignats no Entrega Directa     
       dcl-s iLAmag like(s5line) inz; // Integer Last Assignet Maga, per TAmag.                     
       dcl-s iLlog  like(s5line) inz; // Integer Last Assignet logistica per AddLin                 
       //Comptadors per bucles                                                                     
       dcl-s pMag  like(s5line); // position Magatzems                                              
       dcl-s pArt  like(s5line); // position Articles                                               
       dcl-s pVal  like(s5line); // position Validacions                                            
       dcl-s pPend like(s5line); // position Pendents                                               
       dcl-s iAux  like(s5line) inz(*zero);                                                         
       //Flags global ED                                                                           
       dcl-s gEDClient     ind; // Client permet ED                                                 
       dcl-s gEDProv       ind; // Proveïdor permet ED                                              
       dcl-s gEDFPag       ind; // Forma Pagament permet ED                                         
       dcl-s gEDTrans      ind; // Transportista permet ED                                          
       dcl-s gSC           ind; // Tractament especial Comanda Sin Cargo                            
       //Flags global Especials                                                                    
       dcl-s gDFTused      ind inz(*off); // S'ha utilitzat el magatzem x defecte                   
       dcl-s gTPE4         ind inz(*off); // Tenim alguna lin amb tpe4=2 ???                        
       dcl-s gExit         ind inz(*off); // Sortim                                                 
       dcl-s gChkObso      ind; // Verificar Obsolets                                               
       dcl-s gChkArtiB     ind; // Verificar Articles B                                             
E7139  dcl-s gChkSS        ind inz(*off); // Verificar SobreStock Phase3                            
       dcl-s bTenimObso    ind inz(*off); // Tenim articles Obsolets                                
       dcl-s bTenimObsoCom ind inz(*off); // Tenim articles Obsolets en Components                  
       //Var global Tipus de procés (execució)                                                     
       dcl-s gERROR char(1); //                                                                     
       dcl-s gPROC    like(s5line); // tipus de procés (simulació, confirmació, Add lin, forced.    
       dcl-s gJobType char(1); //batch / interact                                                   
       //Simon vars                                                                                
       dcl-s bSimon   ind inz(*off);                                                                
       dcl-s Simon_tx like(DODATA); //varchar(5000);                                                
       //Var global Magatzem / Logística per Default                                               
       dcl-s gDFTmaga like(m0maga); // magatzem per defecte |Dels diferents Punts d'expedició       
       dcl-s gDFTloge like(m0loge); // logística per defecte|                                       
       dcl-s gDFTlogV like(m0loge); // logística virtudal dft                                       
       dcl-s gDFTpos  like(s5line); // posició, dintre de Tmag, del magatzem per dft                
       dcl-s gDLGmaga like(m0maga); // magatzem per defecte |De la delegació                        
       dcl-s gDLGloge like(m0loge); // logística per defecte|                                       
       dcl-s gDLGlogV like(m0loge); // logística Virtual per defecte|                               
       dcl-s gMaxPEnED like(s5line); // Max. Punts Expedició NO ED                                  
       dcl-s gMaxPE    like(s5line); // Max. Punts Expedició                                        
       dcl-s gS0COEN   like(T4COEN) inz;                                                            
       dcl-s gT4COEN   like(T4COEN) inz;                                                            
FGI25  dcl-s gMTOS     like(m0maga) inz;                                                            
                                                                                                    
       dcl-s gHDRmaga like(m0maga); // magatzem de la capçalera m0maga del s0loge                   
E7139  dcl-s p_Stock like(@Stok) inz;  //Phase3 Add                                                 
                                                                                                    
E7249  dcl-s gCONO like(MBCONO) inz;                                                                
E7249  dcl-s gITNO like(MBITNO) inz;                                                                
       /////////////////////////////////////////////////////////////////////////////////////////    
       // Procediments                                                                             
       //---------------------------------------------------------------------------------------    
                                                                                                    
       //Alfanumeric To Integer                                                                    
       dcl-pr atoi int(10)  extproc('atoi');                                                        
          str      pointer  options(*string) value;                                                 
       end-pr;                                                                                      
                                                                                                    
       //Recupera variables d'entorn                                                               
       dcl-pr getenv pointer extproc('getenv');                                                     
         *n pointer value options(*string:*trim)  ;                                                 
       end-pr;                                                                                      
                                                                                                    
       //Tool per virtuals i d'altres                                                              
       dcl-pr pMM1411 extpgm('MM1411');                                                             
           @cias  like(s5cias) const;                                                               
           @maga  like(m0maga) const;                                                               
           @tipo  char(1) const;                                                                    
           @dlga  like(s0dlga) const;                                                               
           @resp  like(@peresp);                                                                    
       end-pr;                                                                                      
                                                                                                    
       //MsgBox: tool per mostrar info                                                             
       dcl-pr pMSGBOX        extpgm('MSGBOX');                                                      
         *n like(@pTitulo) const ;                        // Title                                  
         *n pointer const;                                // Pointer to message                     
         *n like(@pLongitud) const;                       // Length of message                      
         *n like(@pFuncion) const;                        // Function keys                          
         *n like(@pRetorno);                              // Return Value                           
         *n ind const;                                    // Optional: Text adjust                  
       end-pr;                                                                                      
                                                                                                    
       //Suma dies laborables a una data                                                           
       dcl-pr pCO2611 extpgm('CO2611');                                                             
         *n like(@pedat1);                                                                          
         *n like(@pedays);                                                                          
         *n like(@pedat1);                                                                          
         *n like(@perro);                                                                           
       end-pr;                                                                                      
                                                                                                    
       //Utilitat per crear files                                                                  
       dcl-pr utipgm extpgm('UTIFQTMPCL');                                                          
        @PEFILE1   char(10) const;                                                                  
        @PELOG11   char(10) const;                                                                  
        @PELOG12   char(10) const;                                                                  
        @PELOG13   char(10) const;                                                                  
        @PEFILE2   char(10) const;                                                                  
        @PELOG21   char(10) const;                                                                  
        @PELOG22   char(10) const;                                                                  
        @PELOG23   char(10) const;                                                                  
        @PEFILE3   char(10) const;                                                                  
        @PELOG31   char(10) const;                                                                  
        @PELOG32   char(10) const;                                                                  
        @PELOG33   char(10) const;                                                                  
        @PEPROGR   char(10) const;                                                                  
        @PEPARMS   char(250) const;                                                                 
       end-pr;                                                                                      
                                                                                                    
       //Recupera pendent de servir                                                                
       dcl-pr pCO2770 extpgm('CO2770');                                                             
            *n   like(@PCIAS);                                                                      
            *n   like(@PEDLGA);                                                                     
            *n   like(@PEARTI);                                                                     
            *n   like(@PEVARI);                                                                     
            *n   like(@PEMODE);                                                                     
            *n   like(@PETCOJ);                                                                     
            *n   like(@PEDATD);                                                                     
            *n   like(@PEDATH);                                                                     
            *n   like(@PECANT);                                                                     
            *n   like(@PECAN1);                                                                     
            *n   like(M0LOGE );                                                                     
            *n   like(@POMFDE);                                                                     
            *n   like(@PERRO );                                                                     
       end-pr;                                                                                      
                                                                                                    
       //Pendiente de traspasos depositos                                                          
       dcl-pr pMM2604 extpgm('MM2604');                                                             
            *n   like(@PCIAS);                                                                      
            *n   like(@PEDLGA);                                                                     
            *n   like(@PEARTI);                                                                     
            *n   like(@PEVARI);                                                                     
            *n   like(@PEMODE);                                                                     
            *n   like(@PETCOJ);                                                                     
            *n   like(@PEDATD);                                                                     
            *n   like(@PEDATH);                                                                     
            *n   like(@PECANT);                                                                     
            *n   like(@PECAN1);                                                                     
            *n   like(M1MAGA );                                                                     
            *n   like(@PETISE);                                                                     
            *n   like(@PERRO );                                                                     
       end-pr;                                                                                      
                                                                                                    
                                                                                                    
     D  @PEDLGA        S                   LIKE(S0DLGA) INZ                                         
     D  @PEARTI        S                   LIKE(M1ARTI) INZ                                         
     D  @PEVARI        S                   LIKE(M1VARI) INZ                                         
     D  @PEMODE        S                   LIKE(M1MODE) INZ                                         
     D  @PEDATD        S                   LIKE(M1DAT8) INZ                                         
     D  @PEDATH        S                   LIKE(M1DAT8) INZ                                         
     D  @PECANT        S                   LIKE(M1SACT) INZ                                         
     D  @PECAN1        S                   LIKE(M1SACT) INZ                                         
     D  @PECAN2        S                   LIKE(M1SACT) INZ                                         
C3758D  @PEUNST        S                   LIKE(S5UNIM)                                             
C3758D  @PEPBRE        S             20  5                                                          
C3758D  @PECAST        S                   LIKE(S5CANT)                                             
C3758D  @PEUPES        S                   LIKE(ZZUPES)                                             
C3758D  @PEVOLB        S             20  5                                                          
C3758D  @PEUVOL        S                   LIKE(ZZUVOL)                                             
C3758D  @PEUMED        S                   LIKE(ZZUMED)                                             
C3758D  @PENBUL        S              6  0                                                          
C3758D  @PETPAL        S              1                                                             
C3758D  @PETCT1        S              2                                                             
C3758D  @PEVTC1        S              1                                                             
     D  @PETCOJ        S              1                                                             
     D  @PINCI         S              3                                                             
                                                                                                    
     D  ZXTCOJ         S                   LIKE(NDTCOJ)                                             
     D  ZXPRVR         S                   LIKE(M5PRVR)                                             
     D  ZXSTKA         S             15  5                                                          
     D  ZXCANS0        S             15  5                                                          
     D  ZXCANE0        S             15  5                                                          
     D  ZXDEPO0        S             15  5                                                          
     D  ZXSTDD         S             15  5                                                          
     D  ZXDATD         S               D   DATFMT(*ISO)                                             
     D  ZXDATH         S               D   DATFMT(*ISO)                                             
     D  ZXCIAD         S                   LIKE(S5CIAS)                                             
     D  ZXARTTRAC      S                   LIKE(M5ARTI)                                             
     D  ZXVARTRAC      S                   LIKE(M5VARI)                                             
     D  ZXMODTRAC      S                   LIKE(M5MODE)                                             
     D  ZXARTDLGA      S             15                                                             
     D  ZXVARDLGA      S              3                                                             
     D  ZXMODDLGA      S              3                                                             
     D  ZXARVM         S             25                                                             
     D  ZXARVMPRO      S             25                                                             
     D  ZKARVM         S             25                                                             
     D  ZXARVP         S                   LIKE(C3ARVP)                                             
     D  ZXCANT         S                   LIKE(S5CANT)                                             
     D  Z0CANT         S                   LIKE(S5CANT)                                             
     D  Z1CANT         S                   LIKE(S5CANT)                                             
     D  Z2CANT         S                   LIKE(S5CANT)                                             
     D  ZXLOGE         S                   LIKE(S5LOGE)                                             
     D  XZAUXI1        S             29  9                                                          
     D  ZXCOCAMB       S             15  9                                                          
     D  @PCMCOCO       S             20  9                                                          
     D  @PCMCCCO       S             20  9                                                          
     D  @PDATA         S                   LIKE(S0DATP)                                             
     D  @PHORA         S                   LIKE(S0NOPL)                                             
     D  @PMON1         S                   LIKE(S0MONE)                                             
     D  @PMON2         S                   LIKE(S0MONE)                                             
     D  @PDTOE         S                   LIKE(S5DTO1)                                             
     D  @PEERR         S              1                 INZ                                         
     D  XZARTI         S                   LIKE(S5ARTI)                                             
     D  XZVARI         S                   LIKE(S5VARI)                                             
     D  XZMODE         S                   LIKE(S5MODE)                                             
     D  XZCIAS         S                   LIKE(S5CIAS)                                             
     D  ZXMONE2        S                   LIKE(S0MONE)                                             
     D* ZXIMPO         S                   LIKE(S5COST)                                             
     D  ZXTIVC         S              1                                                             
     D  ZXINCI         S              3                                                             
     D  ZXTCST         S                   LIKE(M5TCS1)                                             
     DSDE              S              1A   DIM(10)                                                  
      *Ecotaxe                                                                                     
     D    @PEECOP      S                   LIKE(S5ECOP)                                             
     D    @PEFLCD      S                   LIKE(S5DATP)                                             
     D    @PETAXE      S                   LIKE(S5PRCC)                                             
                                                                                                    
     D  ZXSTDL         S                   LIKE(D2VA05)                                             
     D  ZXLG05         S                   LIKE(D2VA05)                                             
     D  ZXVSTK         S                   LIKE(D2VA05)                                             
     D  ZW             S              3  0                                                          
     D  X              S              3  0                                                          
C2557D  ZXLINDFTO      S              5S 0                                                          
                                                                                                    
     D*                DS                                                                           
     D* ZXARVMX                1     25                                                             
     D*   ZXARTIX              1     15                                                             
     D*   ZXVARIX             16     18                                                             
     D*   ZXMODEX             19     21                                                             
      *                                                                                             
     D                 DS                                                                           
     D  ZXBL65I                1      5                                                             
     D    ZXPABI               1      1                                                             
      *                                                                                             
     D  S5AMPL         DS                                                                           
     D  S5NCOE                 1      2                                                             
E7377d  S5NCOI                19     20                                                             
E7377d  S5NCOF                21     22                                                             
     D    S5ECOP              24     24                                                             
                                                                                                    
     D* C0AMP2         DS                                                                           
     D*   C0PEVT               1      1                                                             
                                                                                                    
     D* C_S0AMP2       DS                                                                           
     D*   C_S0CEVT            96     96                                                             
                                                                                                    
     D* M5AMPL         DS                                                                           
     D*   M5PROB              49     50                                                             
     D*   M5NOED              63     63                                                             
                                                                                                    
     D  S0AMPL         DS                                                                           
     D*   S0COEN               1      1                                                             
     D    S0EDLG             100    100                                                             
IT228 *                                                                                             
     D T3AMPL          DS                                                                           
     D  T3OPL1                 1      3                                                             
C1636d  T3VFYB                12     12                                                             
     D  T3PNFE                16     18                                                             
     D  T3RESTO                4    100                                                             
      *                                                                                             
IT228D  @PERESP        S                   LIKE(M0MAGA)                                             
IT228D  @PEINFO        S              1                                                             
IT228D  @pedprvr       S                   LIKE(m5PRVR)                                             
IT228D  @PEdARVP       S             25                                                             
IT228D  @PEdALM1       S                   LIKE(s0DLGA)                                             
IT228D  @PEdALM2       S                   LIKE(s0DLGA)                                             
IT228 //----------------------------------------------------------------------------------------    
          dcl-pi *n;                                                                                
             @pcias like(s5cias);    //                                                             
             @pdlga like(s5dlga);    //  Clau de la comanda a processar                             
             @pnpco like(s5npco);    //                                                             
             @ptped like(s5tped);    //                                                             
             @pdatp like(s5datp);    //                                                             
             @pnopl like(s5nopl);    //                                                             
             @ppline like(s5line) ;  // número de línia Add-lin o Forced lin ED                     
          end-pi;                                                                                   
      //----------------------------------------------------------------------------------------    
      // Tipus de procés                                                                            
      //           1 ---> Simulació                                                                 
      //           2 ---> Confirmació                                                               
      //           3 ---> Add Lin                                                                   
      //           4 ---> Forced Lin                                                                
      //           5 ---> Forced Header                                                             
      //                                                                                            
      //****************************************************************************************    
      // Main Program                                                                              
      //****************************************************************************************    
      //                                                                                            
      //Generamos el/los ficheros de trabajo deseados en QTEMP                                     
      //Això és per 'conservar' la informació de decisions.                                        
      //En el nostre cas és un mal de cap: No serveixen pel càlcul i s'ha de veure com dimonis     
      // els omplim                                                                                
                                                                                                    
        utipgm('DO0050W':'DO005001':*blanks:*blanks:*blanks:*blanks:                                
                *blanks:*blanks:*blanks:*blanks:*blanks:*blanks:                                    
                *blanks:*blanks);                                                                   
                                                                                                    
        utipgm('DO0051W':'DO0051W1':*blanks:*blanks:*blanks:*blanks:                                
                *blanks:*blanks:*blanks:*blanks:*blanks:*blanks:                                    
                *blanks:*blanks);                                                                   
                                                                                                    
        utipgm('DO0052W':*blanks   :*blanks:*blanks:*blanks:*blanks:                                
                *blanks:*blanks:*blanks:*blanks:*blanks:*blanks:                                    
                *blanks:*blanks);                                                                   
                                                                                                    
        utipgm('DO0053W':*blanks   :*blanks:*blanks:*blanks:*blanks:                                
                *blanks:*blanks:*blanks:*blanks:*blanks:*blanks:                                    
                *blanks:*blanks);                                                                   
                                                                                                    
      //Abrir Ficheros QTEMP                                                                       
        OpenFiles();                                                                                
                                                                                                    
      //Carrega dades per defecte, parms generals                                                  
        if LoadDefault();                                                                           
                                                                                                    
      //Carrega les línies de la comanda, mira excepcions arti - prov, art.serveis, B, etc         
      // Si el procés es AddLin guardem les log. de les línies per emprar-les al carregar magatz    
          LoadArti();                                                                               
                                                                                                    
      //Carrega els magatzems                                                                      
      // Tots, Tots + ME, els de les logístiques emprades, mag amb mtal1=8                          
          if iLPEND > *zero;                                                                        
            LoadMaga();                                                                             
          endif;                                                                                    
                                                                                                    
      //Validacions articles - magatzems - stocks - dates ...                                      
      // Omplim els diferents nivells del cub                                                       
      // Els conjunts també es calculen                                                             
          if iLPEND > *zero;                                                                        
            ValidaTot();                                                                            
          endif;                                                                                    
                                                                                                    
      //Preprocés per especials (ArtiB/Obso)                                                       
E7139 //       if iLPEND > *zero and (gChkArtiB or bTenimObso);                                     
E7139     if iLPEND > *zero and (gChkArtiB or bTenimObso or gChkSS); //Phase3                       
E7374       // Guardem línies pendents actualment per calcular si s'han assignat                    
E7374       iLAux = iLPEND;                                                                         
            ProcessaME(); //Donem sortida a tot el que no conti com punt d'Expedició                
E7374       iArtB = iLAux - iLPEND ;                                                                
          endif;                                                                                    
                                                                                                    
        //Procés fins que estigui tot assignat o no poguem fer-ho                                  
          Dow iLPEND > *zero;                                                                       
          //Hem superat els punts d'expedició?                                                     
           select;                                                                                  
            when iLPEND > *zero and gMaxPE = iPE ; //Arribat al límit                               
            // Tot el que queda s'ha de baixar nivell de validació i intentar assignar-ho           
            // als magatzems que ja hem empleat... per ordre de prioritat, no d'assignació          
            AssignaMagResidual(); //No queden PE disponibles i tenim pendents                       
           when iLPEND > *zero and gMaxPE > iPE ; //Tenim línies pendents d'assignar                
            // Assignem per quantitat de línies que compleixen totes les condicions                 
            // Quan cap magatzem compleix totes les condicions i queden línies pendents hem         
            // de baixar nivell de validació per intentar assignar                                  
            // Es a dir: sortirem de processa amb alguna assignació i un PE disponible menys.       
             Processa(1);                                                                           
           other; // Quins other podem tenir?                                                       
            //                                                                                      
             leave;                                                                                 
           endsl;                                                                                   
         enddo;                                                                                     
        else;  // Errors en LoadDefault                                                             
        // S'han produit errors en Default. Ens assegurem que ED0050W no quedin marques que altr    
        //  programes (ED0060, etc) facin de les seves i ens remenin la comanda                     
           exec sql                                                                                 
             update ed0050w set t2forz='0', t2entd='0'                                              
               where t2line <> 0 ;                                                                  
E7223      if @pline > 0 and gPROC=kPROCForcedLin;                                                  
E7223        exec sql                                                                               
E7223          update codepe set s5tpe4=' '                                                         
E7223           where s5line= :@pline and s5cias= :@pcias and s5dlga= :@pdlga                       
E7223            and s5npco= :@pnpco and s5tped= :@ptped and s5datp= :@pdatp                        
E7223            and s5nopl= :@pnopl;                                                               
E7223      endif;                                                                                   
        endif;  // end LoadDefault                                                                  
                                                                                                    
      //Moure resultats a fitxer                                                                   
        // En aquest punt tenim la informació de les logístiques assignades en la taula d'articl    
        //  que, de fet, són línies de comanda.                                                     
        //   Passem les dades als fitxers:                                                          
        //     Primer les línies i després, si tenim logístiques ED, actualitzar capçalera.         
        // Previament mostrem el resúm de les assignacions i donem opció a cancelar-ho              
        // O mostem informació dels possibles errors/incidencies                                    
          Simon_show();     //Simon                                                                 
                                                                                                    
        if MostraResultat();                                                                        
          UpdateSO();                                                                               
E7139     SaveHst(); //Generem registre en fitxer històric DOOMHT                                   
        endif;                                                                                      
                                                                                                    
      //Tanquem fitxers                                                                            
        CloseFiles();                                                                               
                                                                                                    
      //And that's all folks!                                                                      
        *inlr = *on;                                                                                
                                                                                                    
      //////////////////////////////////////////////////////////////////////////////////////////    
      // Subrutines                                                                                
      //----------------------------------------------------------------------------------------    
        begsr *inzsr;                                                                               
                                                                                                    
     C     *DTAARA       DEFINE    PURLDA        DSLDA                                              
     C                   IN        DSLDA                                                            
     C     KPMUNAL       KLIST                                                                      
     C                   KFLD                    @pCIAS                                             
     C                   KFLD                    P6ARTI                                             
     C                   KFLD                    P6VARI                                             
     C                   KFLD                    P6MODE                                             
     C                   KFLD                    P6UNIM                                             
                                                                                                    
          // Establim valors sql                                                                    
          //exec sql SET OPTION COMMIT = *NONE,                                                     
                    //   CLOSQLCSR = *ENDMOD ;                                                      
                                                                                                    
          @pforce = *blanks;                                                                        
          @pline  = *zeros;                                                                         
          //Informem les vars amb els parms opcionals, si s'escau                                   
          //if %addr(@ppforce) <> *null;                                                            
          //  @pforce = @ppforce;       esbrinem si és forçada per la pila de programes CO0176      
          //endif;                                                                      CO0181      
          if %addr(@ppline)<> *null;                                                                
            @pline = @ppline;                                                                       
          endif;                                                                                    
          // Determinem quin procés executem                                                        
          gPROC = ChkProc();                                                                        
          // Determinem batch/online                                                                
          gJobType = qJobType();                                                                    
          // Si estem en Batch no mirem debug                                                       
          if gJobType = kI; // and gJobType<> kI;  //mod    per no executar-ho                      
            // Debug??                                                                              
            cString = kSS;                                                                          
            pstr    =  getenv(cString);                                                             
            if pstr    = *null ;                                                                    
              bSimon = *off;                                                                        
            else;                                                                                   
              cstr = %str(pstr);                                                                    
              if %len(%trim(cstr)) > 1; // = kDBG ;                                                 
                bSimon = *on;                                                                       
              endif;                                                                                
            endif;                                                                                  
          endif;                                                                                    
          // Carreguem la taula de nivells de validació per emprar                                  
          TLevel(1) = kFinal;                                                                       
          TLevel(2) = kFinalP1;                                                                     
          TLevel(3) = kFinalP2;                                                                     
        endsr;                                                                                      
                                                                                                    
                                                                                                    
      //////////////////////////////////////////////////////////////////////////////////////////    
      // Procediments Interns                                                                      
      //----------------------------------------------------------------------------------------    
                                                                                                    
      //ChkPROC: Determinem quin procés executem                                                   
         dcl-proc ChkPROC;                                                                          
         dcl-pi *n like(s5line) end-pi;                                                             
          dcl-s xRetorn like(s5line) inz;                                                           
          dcl-s xChar char(1) inz;                                                                  
                                                                                                    
          // cerquem els programes de forçat en la pila de programes                                
                                                                                                    
          exec sql                                                                                  
            SELECT 'A' INTO :xChar                                                                  
              FROM TABLE(QSYS2.STACK_INFO('*')) A                                                   
              WHERE PROGRAM_NAME IN ('CO0181', 'CO0176')                                            
              FETCH FIRST 1 ROW ONLY;                                                               
          if sqlcode = 0;  //Trobat: procés forçat                                                  
            @pforce = k1;                                                                           
          else;                                                                                     
            @pforce = k0;                                                                           
          endif;                                                                                    
                                                                                                    
          select;                                                                                   
          when @pline > 0 and @pforce = k1 ;                                                        
            xRetorn = kPROCForcedLin;                                                               
          when @pline = 0 and @pforce = k1 ;                                                        
            xRetorn = kPROCForcedHeader;                                                            
          when @pline > 0 and @pforce <>k1 ;                                                        
          //xRetorn = kPROCAddlin;                                                                  
            xRetorn = kPROCForcedLin;    // co180 i co181 com forced                                
          when @pline = 0 and @pforce <>k1 ;                                                        
            // Aquí podem tenir simulació o confirmació                                             
            // cerquem el programa de simulació en la pila de programes                             
            exec sql                                                                                
              SELECT 'A' INTO :xChar                                                                
               FROM TABLE(QSYS2.STACK_INFO('*')) A                                                  
                WHERE PROGRAM_NAME = 'ED1000'                                                       
                FETCH FIRST 1 ROW ONLY;                                                             
            if sqlcode = 0;                                                                         
              xRetorn = kPROCSimulacio;                                                             
            else;                                                                                   
              xRetorn = kPROCConfirmacio;                                                           
            endif;                                                                                  
          endsl;                                                                                    
          return xRetorn;                                                                           
                                                                                                    
         end-proc;                                                                                  
                                                                                                    
      //----------------------------------------------------------------------------------------    
      //OpenFiles: Obrim fitxers de treball                                                        
         dcl-proc OpenFiles;                                                                        
         dcl-pi *n end-pi;                                                                          
        //open ED0050W;                                                                             
          open DO0050W;                                                                             
          open DO0051W;                                                                             
          open DO0052W;                                                                             
          open DO0053W;                                                                             
          //open DO005001;                                                                          
          open GXSTO0;                                                                              
FGI25     open zaqbal00;                                                                            
FGI25     open mitbal00;                                                                            
                                                                                                    
         end-proc;                                                                                  
                                                                                                    
      //----------------------------------------------------------------------------------------    
      //CloseFiles: Pos eso                                                                        
         dcl-proc CloseFiles;                                                                       
         dcl-pi *n end-pi;                                                                          
        //close ED0050W;                                                                            
FGI25   //close DO0050W;                                                                            
FGI25   //close DO0051W;                                                                            
FGI25   //close DO0052W;                                                                            
FGI25   //close DO0053W;                                                                            
          //close DO005001;                                                                         
FGI25   //close GXSTO0;                                                                             
FGI25     close *all;                                                                               
                                                                                                    
         end-proc;                                                                                  
                                                                                                    
      //----------------------------------------------------------------------------------------    
      //LoadDefault: recuperem paràmetres generals de procés                                       
         dcl-proc LoadDefault;                                                                      
         dcl-pi *n ind;                                                                             
         end-pi;                                                                                    
         dcl-s xRetorn ind inz(*off);                                                               
                                                                                                    
E7139      ctSiED    = GetMsg(kmsg0001);                                                            
E7139      ctNoED    = GetMsg(kmsg0002);                                                            
           gERROR = kNOError  ; // valor x defecte                                                  
           chain (@pcias:@pdlga) edparm;                                                            
           if not %found(edparm) or T3baja = k1 ;                                                   
             // megda                                                                               
             return *off;                                                                           
           endif;                                                                                   
                                                                                                    
E7249      gCONO = GetCono();                                                                       
HDC74   //FGI25      gMTOS = %subst(t3ampl:40:5);                                                   
HDC74      gMTOS = %subst(t3ampl:61:5);                                                             
                                                                                                    
           gMaxPEnED = atoi(%subst(t3ampl:16:3)); // Max. punts expedició NO ED                     
           gMaxPE = t3pexp;                      // Max. punts expedició                            
           // Correcció per si de cas... parms mal informats                                        
           if gMaxPEnED = *zero;                                                                    
             gMaxPEnED = 1;                                                                         
           endif;                                                                                   
           if gMaxPE = *zero;                                                                       
             gMaxPE = 1;                                                                            
           endif;                                                                                   
           // Obsolets, Articles B...                                                               
           // Si estem en gPROC Forced mai carreguem ME                                             
           if gPROC = kPROCsimulacio or gPROC = kPROCconfirmacio or                                 
              gPROC = kPROCAddLin;                                                                  
             if T3OBSO = k1;                                                                        
               gChkObso = *on;                                                                      
             endif;                                                                                 
             if %subst(t3ampl:12:1) = k1;                                                           
               gChkArtiB = *on;                                                                     
             endif;                                                                                 
E7139        if T3SSTO = k1;                                                                        
E7139          gChkSS = *on;                                                                        
E7139        endif;                                                                                 
E7728          //E7219        gChkSS = *off; //De moment desactivat                                 
           endif;                                                                                   
                                                                                                    
           // Tractament comanda Sin Cargo                                                          
           if %subst(t3ampl: 15: 1) = k1;                                                           
             gSC = *on;                                                                             
           else;                                                                                    
             gSC = *off;                                                                            
           endif;                                                                                   
                                                                                                    
           chain(n) (@pcias:@pdlga:@pnpco:@ptped:@pdatp:@pnopl) cocape;                             
           // s0pped=99, ho hauria de validar ed3050 i no arribar a cridar-nos?                     
                                                                                                    
E7225      //Client accepta ED?                                                                     
E7225      gEDClient = *off;                                                                        
E7225      chain (s0cias:s0cust) coclin;                                                            
E7225      if %found(coclin);                                                                       
E7225        if atoi(%subst(c_s0amp2:96:1)) > 0;                                                    
E7225          gEDClient = *on;            // global Entrega Directa Client                         
E7225        endif;                                                                                 
E7225      endif;                                                                                   
           //Coenvio                                                                                
           // 1er.- del codepe                                                                      
           gS0COEN = %subst(s0ampl:1:1);                                                            
E7225      // Si no tenim coenvio cercar-ho 1er pel client                                          
E7225      if gS0COEN=*blanks;                                                                      
E7225        gS0COEN= %subst(c_s0amp4:1:1);                                                         
E7225        if gS0COEN = *blanks;                                                                  
E7350    //E7225          exec sql                                                                  
E7350    //E7225          select substr(p7ampl, 93, 1) into :gS0COEN from pmempr where              
E7350    //E7225            p7cias= :s0cias and p7dlga= :s0dlga;                                    
E7350          exec sql                                                                             
E7350            select substr(p7ampl, 93, 1) into :gS0COEN from pmempr where                       
E7350              p7cias= :s0cias and p7dlga=' '     ;                                             
E7225        endif;                                                                                 
E7225      endif;                                                                                   
                                                                                                    
           // 2on.- EDPAR2                                                                          
           chain (@pcias:*blanks:@pdlga:*blanks:*blanks:*blanks:0:0:*blanks)                        
                  edpar2;                                                                           
           if %found(edpar2);                                                                       
             gT4COEN = t4coen;                                                                      
           endif;                                                                                   
           if gT4COEN = *blanks;  // Això en teoria no hauría de passar                             
             gT4COEN = k0  ; //Mod parlat amb David B.  k2;                                         
           endif;                                                                                   
           if gS0COEN  = *blanks;                                                                   
             gS0COEN = gT4COEN;                                                                     
           endif;                                                                                   
                                                                                                    
           // Correcció de Punts Expedició, ArtiB, Obsolets per COENVIO = 1                         
           if gS0COEN  = k1;                                                                        
             gMaxPE = 1;                                                                            
             gChkObso = *off; // No es tracten Obsolets  03/08/2022 Conversa amb DavidB+LluísC      
             gChkArtiB= *off; // No es tracten ArtiB     03/08/2022 Conversa amb DavidB+LluísC      
           endif;                                                                                   
                                                                                                    
           // Correcció de Punts Expedició per Pedido Completo                                      
           if %subst(s0ampl:63:1) = k1;                                                             
             gMaxPE = 1;                                                                            
           endif;                                                                                   
                                                                                                    
           // Transportista                                                                         
           chain (s0cias:s0ttta) mstrta;                                                            
           select;                                                                                  
           when %found(mstrta) and n1noed = k1;                                                     
             gEDTrans = *off;                                                                       
           //when %found(mstrta) and n1noed <>k1;                                                   
           //  gEDTrans = *on;                                                                      
           other;                                                                                   
           //  gEDTrans = *off;                                                                     
             gEDTrans = *on;                                                                        
           endsl;                                                                                   
                                                                                                    
           chain (@pcias:s0cust) edparc;                                                            
           if %found(edparc);                                                                       
             t3limp = t4limp;                                                                       
           endif;                                                                                   
                                                                                                    
E7225      // Es mou aquest bloc per tenir la lectura del coclin unes línies abans                  
E7225      //Client accepta ED?                                                                     
E7225     // gEDClient = *off;                                                                      
E7225     // chain (s0cias:s0cust) coclin;                                                          
E7225     // if %found(coclin);                                                                     
E7225     //   if atoi(%subst(c_s0amp2:96:1)) > 0;                                                  
E7225     //     gEDClient = *on;            // global Entrega Directa Client                       
E7225     //   endif;                                                                               
E7225     // endif;                                                                                 
                                                                                                    
           //Forma Pago accepta ED?                                                                 
           open cocaip;                                                                             
           gEDFPag = *off;                                                                          
           chain (@pcias:'FPAG':s0fpag) pmtabd;                                                     
       //  if %found(pmtabd) and %subst(pebl64:7:1) = *blanks;  // k1 = no accepta SLE14            
           if %found(pmtabd) and pebaja<>'1';                   // SLE14                            
             if %subst(pebl64:7:1) = *blanks;                   // SLE14                            
               gEDFPag = *on;                                   // SLE14                            
             endif;                                             // SLE14                            
             //Validar si tenim pagaments avançats                                                  
             cFormaPago = pedesc;                                                                   
             chain (@pcias:@pdlga:@pnpco:@ptped:@pdatp:@pnopl) cocaip;                              
           //  if not %found(cocaip);   SLE14                                                       
               if %found(cocaip);    // SLE14                                                       
               gEDFPag = *on;    // global Entrega Directa Forma Pagament                           
             endif;                                                                                 
           endif;                                                                                   
           close cocaip;                                                                            
                                                                                                    
           //Magatzem de la capçalera                                                               
           chain (s0cias:s0loge) msalma05;                                                          
           if %found(msalma05) and m0baja<k1 ;                                                      
             gHDRmaga = m0maga;                                                                     
           endif;                                                                                   
                                                                                                    
           // Validacions generals                                                                  
           xRetorn = *on;                                                                           
           clear txurru;                                                                            
           select;                                                                                  
           when not gEDTrans or not gEDFPAG;                                                        
             gERROR = kErrorTransFP  ;                                                              
             xRetorn = *off;                                                                        
             //error                                                                                
           when not gEDClient and gPROC = kPROCForcedHeader; // Client no accepta ED i forcem He    
             // Demanar confirmació                                                                 
             @ptitulo = cRWh + %trim(GetMsg(kmsg0000)) + CNGr;          //warning!!                 
             Txurr_Save(GetMsg(kmsg0011) :*off:txurru);                                             
             Txurr_Save(GetMsg(kmsg0007) :*off:txurru);                                             
             Txurr_Save(*blanks          :*off:txurru);                                             
             Txurr_Save(GetMsg(kmsg0005) :*off:txurru);                                             
             @pLongitud= %len(txurru);                                                              
             @pFuncion = k2;      // F10 + F12                                                      
E7225        if gJobType = kI; // and gJobType<> kI;  //mod    per no executar-ho                   
             pMSGBOX(@pTitulo:%addr(txurru)+2:@pLongitud:@pFuncion:                                 
                    @pRetorno:*off);                                                                
E7225        else;                                                                                  
E7225         @pRetorno=k2;                                                                         
E7225        endif;                                                                                 
             if @pRetorno <> k2;  // k2= F10 confirmar                                              
               gERROR = kErrorClient  ;                                                             
               // Desmarquem la capçalera, li posem TPE4= *blanks                                   
               DesmarcaHeader();                                                                    
               xRetorn = *off;                                                                      
             else;                                                                                  
               xRetorn = *on;                                                                       
             endif;                                                                                 
           when not gEDClient and gPROC =  kPROCSimulacio;  // Avis i continuem                     
             @ptitulo = cRWh + %trim(GetMsg(kmsg0000)) + cNGr;                                      
             Txurr_Save(GetMsg(kmsg0011) :*off:txurru);                                             
             Txurr_Save(GetMsg(kmsg0012) :*off:txurru);                                             
             Txurr_Save(GetMsg(kmsg0013) :*off:txurru);                                             
             Txurr_Save(cNBl + %trim(GetMsg(kmsg0010)) + cNGr :*off:txurru);                        
             @pLongitud= %len(txurru);                                                              
             @pFuncion = k0;      // Intro                                                          
             pMSGBOX(@pTitulo:%addr(txurru)+2:@pLongitud:@pFuncion:                                 
                    @pRetorno:*off);                                                                
             xRetorn = *on;  // És un missatge informatiu, sempre continuem                         
           when not gEDClient and gPROC <> kPROCSimulacio;                                          
             gERROR = kErrorClient  ;                                                               
             xRetorn = *off;                                                                        
             //error                                                                                
          endsl;                                                                                    
          exsr info_SIMON;                                                                          
                                                                                                    
          return xRetorn;                                                                           
                                                                                                    
         //.....................................................................................    
         begsr info_SIMON;                                                                          
E7139                                                                                               
E7139      Txurr_Save(GetMsg(kmsg0026) :*on :Simon_tx);   // 'Load Default'                         
E7139      //     Client    : accepta o no                                                          
E7139      if gEDClient;                                                                            
E7139        tjob = cNWh + %trim(ctSiED) + cNGr;                                                    
E7139      else;                                                                                    
E7139        tjob = cRRd + %trim(ctNoED) + cNGr;                                                    
E7139      endif;                                                                                   
E7139      Txurr_Save(%subst(GetMsg(kmsg0014):1:7) + ' ' + s0cust + ' ' +                           
E7139         %subst(s0des1:1:30-(%len(%trim(tjob))))+ %trim(tjob):*off:                            
E7139                  Simon_tx);                                                                   
E7139      clear tjob;                                                                              
E7139      //     Fpag      : accepta o no                                                          
E7139      if gEDFPag;                                                                              
E7139        tjob = cNWh + %trim(ctSiED) + cNGr;                                                    
E7139      else;                                                                                    
E7139        tjob = cRRd + %trim(ctNoED) + cNGr;                                                    
E7139      endif;                                                                                   
E7249 *E7139      Txurr_Save(%subst(GetMsg(kmsg0016):1:10)+'  '+s0fpag+'    '+                      
E7249      Txurr_Save(%subst(GetMsg(kmsg0016):1:10)+'  '+s0fpag+'     '+                            
E7139         %subst(cFormaPago:1:30-(%len(%trim(tjob))))+ %trim(tjob):*off:                        
E7139                  Simon_tx);                                                                   
E7139      clear tjob;                                                                              
E7139      //     Transport : accepta o no                                                          
E7139      if gEDTrans;                                                                             
E7139        tjob = cNWh + %trim(ctSiED) + cNGr;                                                    
E7139      else;                                                                                    
E7139        tjob = cRRd + %trim(ctNoED) + cNGr;                                                    
E7139      endif;                                                                                   
E7139      Txurr_Save(%subst(GetMsg(kmsg0015):1:13)+' '+s0ttta+'  '+                                
E7139         %subst(n1des1:1:30-(%len(%trim(tjob))))+ %trim(tjob):*off:                            
E7139              Simon_tx);                                                                       
E7139      clear tjob;                                                                              
E7139                                                                                               
E7139    //Txurr_Save('LoadDefault':*on:Simon_tx);                                                  
E7139    //select;                                                                                  
E7139    //when gPROC = kPROCSimulacio   ;                                                          
E7139    //  tjob = 'kPROCSimulacio';                                                               
E7139    //when gPROC = kPROCConfirmacio ;                                                          
E7139    //  tjob = 'kPROCConfirmacio';                                                             
E7139    //when gPROC = kPROCForcedLin   ;                                                          
E7139    //  tjob = 'kPROCForcedLin'  ;                                                             
E7139    //when gPROC = kPROCForcedHeader;                                                          
E7139    //  tjob = 'kPROCForcedHeader';                                                            
E7139    //when gPROC = kPROCAddLin      ;                                                          
E7139    //  tjob = 'kPROCAddLin '    ;                                                             
E7139    //endsl;                                                                                   
E7139    //tjob = ' PROCÉS     -> ' + %trim(tjob) ;                                                 
E7139    //Txurr_Save(tjob:*off:Simon_tx);                                                          
E7139    //Txurr_Save('gHDRmaga    -> ' + gHDRmaga:*off:Simon_tx);                                  
E7139    //Txurr_Save('gEDFPAG     -> '+%char(gEDFPAG)+'-'+ s0fpag :*off:                           
E7139    //            Simon_tx);                                                                   
E7139    //Txurr_Save('gEDClient   -> '+%char(gEDClient)+'-'+ s0cust :*off:                         
E7139    //            Simon_tx);                                                                   
E7139    //Txurr_Save('gEDTrans    -> '+%char(gEDTrans)+'-' + s0ttta :*off:                         
E7139    //            Simon_tx);                                                                   
E7139    //Txurr_Save('gMaxPE      -> ' + %char(gmaxpe):*off:Simon_tx);                             
E7139    //Txurr_Save('gMaxPEnED   -> ' + %char(gMaxPEnED):*off:Simon_tx);                          
E7139    //Txurr_Save('gChkArtib   -> ' + %char(gChkArtiB):*off:Simon_tx);                          
E7139    //Txurr_Save('gChkObso    -> ' + %char(gChkObso):*off:Simon_tx);                           
E7139    //Txurr_Save('gChkSS      -> ' + %char(gChkSS):*off:Simon_tx); // Phase3                   
E7139    //Txurr_Save('gS0COEN     -> ' + gS0COEN:*off:Simon_tx);                                   
E7139    //Txurr_Save('gT4COEN     -> ' + gT4COEN:*off:Simon_tx);                                   
         endsr;                                                                                     
                                                                                                    
                                                                                                    
         end-proc;                                                                                  
                                                                                                    
      //----------------------------------------------------------------------------------------    
      //LoadMaga: Recuperem magatzems pel càlcul                                                   
         dcl-proc LoadMaga;                                                                         
         dcl-pi *n end-pi;                                                                          
         dcl-s bAux ind inz(*off);                                                                  
         dcl-s iAux like(s5line) inz;                                                               
                                                                                                    
                                                                                                    
         clear Tmag;                                                                                
         // Si tenim gChkArtiB o bTenimObso carreguem primer els magatzems de MSDDOM.               
         //   gChkArtiB i gChkObso són paràmetres a nivell empresa/dlga                             
         //                                                                                         
E7139    //       if bTenimObso or gChkArtiB; // Si tenim obsolets o Validar ArtiB                  
E7139    if bTenimObso or gChkArtiB or gChkSS;// Phase3 add SS // Si tenim obsolets o Validar Ar    
           LoadMagaObso(); //sense parms: sempre                                                    
         endif;                                                                                     
E7139    //Txurr_Save('LoadMaga':*on:Simon_tx);                                                     
E7139    Txurr_Save(GetMsg(kmsg0030):*on:Simon_tx); // Load Warehouses                              
                                                                                                    
         // Si estem en AddLin sols carreguem els que tinguem en les logístiques emprades           
         // Si estem en Forçatlin sols carreguem els tipus m0tal1=8 de les logístiques emprades     
         // Cerquem la llista d'opcions començant per la més restrictiva                            
                                                                                                    
         // Cerquem opcions x client  TREG = G i dlga                                               
         if LoadMagaDet(@PDLGA:kG :s0cust);                                                         
E7269      Txurr_Save('-Load-'+@PDLGA+'-Cust:'+%trim(s0cust):*off:Simon_tx);                        
           exsr infoDBG;                                                                            
           exsr ChkMagaDFLT;                                                                        
           return;                                                                                  
         endif;                                                                                     
                                                                                                    
         // Cerquem opcions x client  TREG = G i dlga *                                             
         if LoadMagaDet('*':kG :s0cust);                                                            
E7269      Txurr_Save('-Load-  *  '  +'-Cust:'+%trim(s0cust):*off:Simon_tx);                        
           exsr infoDBG;                                                                            
           exsr ChkMagaDFLT;                                                                        
           return;                                                                                  
         endif;                                                                                     
                                                                                                    
         // Cerquem opcions x proc.ped TREG = H i dlga                                              
         if LoadMagaDet(@PDLGA:kH :s0pped);                                                         
E7269      Txurr_Save('-Load-'+@PDLGA+'-PPed:'+%trim(s0pped):*off:Simon_tx);                        
           exsr infoDBG;                                                                            
           exsr ChkMagaDFLT;                                                                        
           return;                                                                                  
         endif;                                                                                     
                                                                                                    
         // Cerquem opcions x proc.ped TREG = H i dlga *                                            
         if LoadMagaDet('*':kH :s0pped);                                                            
E7269      Txurr_Save('-Load-  *  '  +'-PPed:'+%trim(s0pped):*off:Simon_tx);                        
           exsr infoDBG;                                                                            
           exsr ChkMagaDFLT;                                                                        
           return;                                                                                  
         endif;                                                                                     
                                                                                                    
         // Si NO ho trobem cerquem per dlga  TREG = 0                                              
         if LoadMagaDet(@PDLGA:k0 :'     ');                                                        
E7269      Txurr_Save('-Load-'+@PDLGA+'------':*off:Simon_tx);                                      
           exsr infoDBG;                                                                            
           exsr ChkMagaDFLT;                                                                        
           return;                                                                                  
         endif;                                                                                     
                                                                                                    
         // Si NO ho trobem cerquem per dlga = *  TREG = 0                                          
         if LoadMagaDet('*':k0 :'     ');                                                           
E7269      Txurr_Save('-Load-  *  ------':*off:Simon_tx);                                           
           exsr infoDBG;                                                                            
           exsr ChkMagaDFLT;                                                                        
           return;                                                                                  
         endif;                                                                                     
         return;                                                                                    
                                                                                                    
         begsr ChkMagaDFLT;                                                                         
         // Mirem si tenim un maga DFLT. En cas contrari forcem com DFLT el maga de Header          
         if  gDFTmaga = *blanks ;    //NO TENIM MAGA DFLT.                                          
E7139      //Txurr_Save('NO MAGA Default!':*on:Simon_tx);                                           
           iAux = iLmag; //guardem valor                                                            
           if gPROC = kPROCAddLin ;                                                                 
             Tlog(iLlog + 1) = s0loge ; //<-per enganyar a carregamagatzem i el processi            
             bAux = *off;                                                                           
           else;                                                                                    
             bAux = *on;               //<-per enganyar a carregamagatzem i el processi             
           endif;                                                                                   
           clear REDPAR2;                                                                           
           CarregaMagatzem(@pcias:gHDRmaga: bAux);                                                  
           // Com estic forçant que em carregui un magatzem és possible que NO hagi informat        
           // les variables globals                                                                 
           gDFTmaga = Tmag(iLmag).zMaga;  // magatzem i logística per defecte                       
           gDFTloge = Tmag(iLmag).zLoge;    // magatzem i logística per defecte                     
           gDFTpos  = iLmag ;    // posició, en Tmag, del magatzem per defecte                      
           gDFTlogV = Tmag(iLmag).zLogVirtual;  // log virtual x dft                                
           // Per evitar càlculs innecessaris aquest magatzem NO el tindrem en compte               
           // Solament s'utilitzarà per posar el que NO s'hagi pogut colocar en les altres opcio    
           if iLmag > iAux;                                                                         
             iLmag -= 1;                                                                            
           endif;                                                                                   
                                                                                                    
         endif;                                                                                     
         endsr;                                                                                     
                                                                                                    
                                                                                                    
         begsr infoDBG;                                                                             
E7139     Txurr_Save(%trim(GetMsg(kmsg0036)) +' ' + %editc(iLmag - iLmagME:'X')                     
E7139      :*off:Simon_tx);                                                                         
         endsr;                                                                                     
                                                                                                    
         end-proc;                                                                                  
                                                                                                    
      //----------------------------------------------------------------------------------------    
      //LoadMagaObso: Carreguem magatzems especials per Obsolets, ArtiB                            
         dcl-proc LoadMagaObso;                                                                     
         dcl-pi *n end-pi;                                                                          
         dcl-s iCnt like(s5line) inz(*zero);                                                        
                                                                                                    
         //Carreguem tots els registres de MSDDOM per cia/dlga                                      
         // Nota: limitat a deixar 20 elements per resta de Punts d'Expedició                       
                                                                                                    
         open msddom11;                                                                             
         setll (@pcias:@pdlga) msddom11;                                                            
         reade (@pcias:@pdlga) msddom11;                                                            
         dow not %eof(msddom11);                                                                    
           // Hem de guardar info separada per Obsolets i ArtiB                                     
           if xapr01 >k0; //SOLS mirem un camp prioritat. Actualment en tots 4 tenen el mateix v    
                                                                                                    
             chain (xacias:xadlg2) pmempr;                                                          
             if %found(pmempr);                                                                     
               if iLmag  < (kMaxMag - 10);                                                          
                 if CarregaMagatzem(xacias:p7maga:*on);                                             
                   // Dades específiques d'aquestos magatzems                                       
                   Tmag(iLmag).zMagEsp = *on;                                                       
                   if gChkObso;                                                                     
                     Tmag(iLmag).zairOB = xair01;                                                   
                     Tmag(iLmag).zairOC = xair02;                                                   
                     Tmag(iLmag).zaoeOB = xaoe01;                                                   
                     Tmag(iLmag).zaoeOC = xaoe02;                                                   
                   endif;                                                                           
                   if gChkArtiB;                                                                    
                     Tmag(iLmag).zairAB = xair04;                                                   
                     Tmag(iLmag).zaoeAB = xaoe04;                                                   
                   endif;                                                                           
E7139              if gChkSS;                                                                       
E7139                Tmag(iLmag).zairSS = xair03;                                                   
E7139                Tmag(iLmag).zaoeSS = xaoe03;                                                   
E7139                Tmag(iLmag).zpsMax = (atoi(%subst(xaampl:1:5)) + 1)/100;                       
E7139              endif;                                                                           
                 endif;                                                                             
               else;                                                                                
                 return; // Reservem 10 posicion pels PE de cia/dlga                                
               endif;                                                                               
             endif;                                                                                 
           endif;                                                                                   
           reade (@pcias:@pdlga) msddom11;                                                          
         enddo;                                                                                     
         // Guardem la darrera posició emprada                                                      
         iLmagME = iLmag;                                                                           
         close msddom11;                                                                            
                                                                                                    
E7139    //Txurr_Save('LoadMagaObso':*on:Simon_tx);                                                 
E7139    //Txurr_Save('MagME ' + %editc(iLmagME:'X'):*off:Simon_tx);                                
E7139    Txurr_Save(%trim(GetMsg(kmsg0031))+' '+ %editc(iLmagME:'X')                                
E7139              :*off:Simon_tx);//Special Warehouse loaded                                       
                                                                                                    
         end-proc;                                                                                  
                                                                                                    
      //----------------------------------------------------------------------------------------    
      //LoadMagaDet: Recuperem magatzems... aquí sí, finalment!                                    
      // tres parms: Dlga, treg, client (si s'escau)                                                
         dcl-proc LoadMagaDet;                                                                      
         dcl-pi *n ind;               //valor de retorn                                             
           pdlga like(t4dlga) value;      //parm rebut : dlga                                       
           ptreg like(t4treg) value;      //parm rebut : treg                                       
           pPrvr like(t4prvr) value;      //parm client/proc.ped.                                   
         end-pi;                                                                                    
         dcl-s xRetorn ind inz(*off);                                                               
         dcl-s iMag  like(s5line); // position Magatzems, var local                                 
         dcl-s CArvt like(t4arvt);                                                                  
         dcl-s CFamt like(t4famt);                                                                  
         dcl-s CPrvr like(t4prvr);      //parm client/proc.ped.                                     
         dcl-s BKiLmag  like(s5line);    //BackUp iLmag                                             
                                                                                                    
         //Monta clau en funció del tipus d'accés                                                   
         exsr MontaClau;                                                                            
                                                                                                    
         // Guardem el valor actual iLmag per saber si hem carregat magatzems                       
         BKiLmag  = iLmag ;                                                                         
         //                                                                                         
         setll (@pcias:ptreg:pdlga:CPrvr:CArvt:CFamt) edpar2;                                       
         reade (@pcias:ptreg:pdlga:CPrvr:CArvt:CFamt) edpar2;                                       
         dow not %eof(edpar2);                                                                      
           // Hem trobat registre en edpar2, per tant podem considerar que tenim dades, tot i qu    
           // ara hem de validar que les tinguem amb T4PRIO>0                                       
           if t4prio > 0;                                                                           
             exsr RtvEdpar4;                                                                        
             CarregaMagatzem(@pcias:t4maga:*off);                                                   
           endif;                                                                                   
           reade (@pcias:ptreg:pdlga:CPrvr:CArvt:CFamt) edpar2;                                     
         enddo;                                                                                     
                                                                                                    
         if iLmag > BKiLmag; //hem afegit magatzems                                                 
           xRetorn = *on;                                                                           
         else;                                                                                      
           xRetorn = *off;                                                                          
         endif;                                                                                     
                                                                                                    
         return xRetorn;                                                                            
                                                                                                    
         // sbr's de la procedure                                                                   
         //.....................................................................................    
         // Intentem recuperar dades del Edpar4                                                     
         // En aquest fitxer, en teoria, sols tindrem dades dels magatzems m0tal1=8                 
         // Tot i que hi accedim abans de llegir MSALMA, i saber si és un Tal1=8, en procés norm    
         // carreguem entre 20-24 magatzems (obsolets i parametritzats).                            
         //                                                                                         
         begsr RtvEdpar4;                                                                           
           chain (t4cia1:t4treg:t4dlga:t4prvr:t4arvt:t4famt:t4prio:1:                               
                 t4cia2:t4maga) edpar4;                                                             
           if %found(edpar4);                                                                       
             T4OIMP=T6OIMP ;   //Omitir import min.                                                 
             T4OCAP=T6OCAP ;   //Omitir capacidad                                                   
             T4CSTO=T6CSTO ;   //No hi ha informació. Tots els registres a *blanks                  
             T4DFTO=T6DFTO ;                                                                        
             T4COEN=T6COEN ;                                                                        
             T4OPES=T6OPEB ;   //zOpes                                                              
             T4OPEN=T6OPEN ;   // No utilitzat                                                      
             T4OUNI=T6OUNI ;   //zOuni                                                              
           endif;                                                                                   
                                                                                                    
         endsr;                                                                                     
         //.....................................................................................    
         begsr MontaClau;                                                                           
         select;                                                                                    
         when ptreg = kG ; // Customer                                                              
           CFamt = *blanks;                                                                         
           CPrvr = pPrvr;                                                                           
           CArvt = *blanks;                                                                         
         when ptreg = kH ; // Proc.Ped                                                              
           CFamt = pPrvr;                                                                           
           CPrvr = *blanks;                                                                         
           CArvt = *blanks;                                                                         
         when ptreg = k0 ; // Deleg                                                                 
           CFamt = *blanks;                                                                         
           CPrvr = *blanks;                                                                         
           CArvt = *blanks;                                                                         
         endsl;                                                                                     
         endsr;                                                                                     
                                                                                                    
         end-proc;                                                                                  
                                                                                                    
      //----------------------------------------------------------------------------------------    
      //CalculaData: calculem data horitzó                                                         
         dcl-proc CalculaData;                                                                      
         dcl-pi *n like(@pedat1);    // retorn                                                      
           pDays like(T5horz);       // parm rebut                                                  
         end-pi;                                                                                    
         dcl-s idat1 like(@pedat1);  // integer data 1                                              
         dcl-s idat2 like(@pedat1);  // integer data 2                                              
         dcl-s cerr  like(@perro);   // char    error                                               
         dcl-s idies like(@pedays);  // integer dies                                                
         idies = pDays;                                                                             
         idat1 = %dec(%date() : *iso);                                                              
         pCO2611(idat1:idies:idat2:cerr);                                                           
         if cerr <> *blanks;                                                                        
           idat2 = *zero;                                                                           
         endif;                                                                                     
         return idat2;                                                                              
                                                                                                    
         end-proc;                                                                                  
      //----------------------------------------------------------------------------------------    
      //CarregaMagatzem: passem les dades a la taula Tmag                                          
      // Podem venir per càrrega normal (EDPAR2) o per ME (MSDDOM11)                                
      // Si venim per ME no fem preguntes de camps EDPAR2                                           
         dcl-proc CarregaMagatzem;                                                                  
         dcl-pi *n ind;              //retorn                                                       
           picias like(t4cia1);       //parm integer cia                                            
           pcmaga like(T4maga);       //parm char  maga                                             
           pbME   ind const;          //parm BOOLEAN venim de carregar Magatzems Obsolest/ArtiB     
         end-pi;                                                                                    
         dcl-s xRetorn ind inz(*off);                                                               
                                                                                                    
           chain (picias:pcmaga) msalma;                                                            
           // Guardarem el magatzem si (el trobem, evidentment)                                     
           //   Procés de simulació o confirmació : ho carreguem TOT                                
           //   Procés Forçat (Lin o Header): sols els M0TAL1 = 8 (magatzems OL)                    
           //   Procés Afegir Lin : sols els de les logístiques de les altres línies de la coman    
           //   Magatzems Especials (ArtiB/Obso): per Addlin ha d'existir en les logístiques de     
           //      altres línies. Per la resta si arribem aquí es carreguen tots                    
           if %found(msalma) and m0baja <> k1 and                            //registre actiu       
             (( gPROC = kPROCSimulacio ) or (gPROC = kPROCConfirmacio) or    //simulació o confi    
              ( gPROC = kPROCForcedLin    and m0tal1=k8 )              or    //forced lin + OL      
              ( gPROC = kPROCForcedHeader and m0tal1=k8 )              or    //forced Head + OL     
              ( gPROC = kPROCAddLin and %lookup(m0loge:Tlog)> 0)       or  //addlin + log de lin    
              ( gPROC <>kPROCAddLin and pbME ));     //ME: obso/artiB                               
             chain (picias:pcmaga) edpar3;                                                          
             if %found(edpar3) and t5baja <> k1;                           // registre actiu        
               iLmag += 1;                                                                          
               xRetorn = *on;                                                                       
               Tmag(iLmag).zMaga = pcmaga;      // codi magatzem                                    
               Tmag(iLmag).zLoge = m0loge;     // logística magatzem                                
               Tmag(iLmag).zPrvr = m0prvr;     // proveïdor magatzem                                
               Tmag(iLmag).zTal1 = m0tal1;     // tipus magatzem                                    
               if (m0tal1 = k8 or m0tal1 = k7);                                                     
E7249            //Tmag(iLmag).zLogVirtual = Call1411(pcmaga:*blanks);                              
E7249            Tmag(iLmag).zLogVirtual = Call1411(pcmaga:*blanks:s0dlga);                         
E7249            Tmag(iLmag).zWHLO = Call1411(pcmaga:k2:*blanks); // Codi maga en M3                
               else;                                                                                
                 Tmag(iLmag).zLogVirtual = *blanks;                                                 
               endif;                                                                               
               if pbME;                                                                             
                 Tmag(iLmag).zOctI = *on ;   // Omit ctl import                                     
                 Tmag(iLmag).zOctC = *on ;   // Omit ctl capacitat                                  
                 Tmag(iLmag).zOctL = *off;   // Omit ctl lines                                      
                 Tmag(iLmag).zOctS = *off;   // Omit ctl Stock                                      
                 Tmag(iLmag).zOmag = *off;   // Omit maga ?????                                     
                 Tmag(iLmag).zOuni = *zero;                                                         
                 Tmag(iLmag).zOpes = *zero;                                                         
                 Tmag(iLmag).zAmasi= *zero       ;                                                  
               else;                                                                                
                 // Maga x Def: podem tenir, com a França, maga dflt en OL                          
                 // Per tant guardarem com DFLT                                                     
                 //     el marcat com DFLT si NO es ol                                              
                 //     el primer maga NO ol, si encara no tenim valor                              
               //if (t4dfto   = k1      and Tmag(iLmag).zTal1 <> k8) or                             
               //   (gDFTmaga = *blanks and Tmag(iLmag).zTal1 <> k8);                               
                 if (t4dfto   = k1 or gDFTmaga = *blanks) and                                       
                    (Tmag(iLmag).zTal1 <> k8 and Tmag(iLmag).zTal1 <> k7);                          
E7139              //Txurr_Save('MagaDefault:'+pcmaga:*off:Simon_tx);                               
E7139              Txurr_Save(%trim(GetMsg(kmsg0032))+': '+pcmaga                                   
E7139               :*off:Simon_tx);                                                                
                   gDFTmaga = pcmaga;     // magatzem i logística per defecte                       
                   gDFTloge = m0loge;    // magatzem i logística per defecte                        
                   gDFTpos  = iLmag ;    // posició, en Tmag, del magatzem per defecte              
                   gDFTlogV = Tmag(iLmag).zLogVirtual;  // log virtual x dft                        
                 endif;                                                                             
                 // Omit Import min                                                                 
                 Tmag(iLmag).zOctI = CheckChar(t4oimp);                                             
                 // Omit ctl capacitat                                                              
                 Tmag(iLmag).zOctC = CheckChar(t4ocap);                                             
                 // Omit Ctl Lin                                                                    
                 Tmag(iLmag).zOctL = CheckChar(t4clin);                                             
                 // Omit Control stock                                                              
                 Tmag(iLmag).zOctS = CheckChar(t4cstk);                                             
                 // Omit Maga??????                                                                 
                 Tmag(iLmag).zOmag = CheckChar(t4omag);                                             
                 Tmag(iLmag).zOuni = atoi(t4ouni);                                                  
                 Tmag(iLmag).zOpes = atoi(t4opes);                                                  
                 Tmag(iLmag).zAmasi= T5masi     ;                                                   
               endif;                                                                               
               // Comanda Sin Cargo. Prioritzem per sobre d'altres parms.                           
               if gSC and s0tped = kSC;                                                             
                 Tmag(iLmag).zOctI = *on;                                                           
               endif;                                                                               
               Tmag(iLmag).zImpo = t5impo; // Valor Imp mínim                                       
               if t5impo = 0;                                                                       
                 Tmag(iLmag).zOctI = *on;  // Si NO tenim Imp mínim Omitim ctl import               
               endif;                                                                               
               Tmag(iLmag).zDisp = t5disp;                                                          
               Tmag(iLmag).zMLin = T5MLIN;                                                          
               Tmag(iLmag).zMLia = T5MLIA;                                                          
               Tmag(iLmag).zMLiz = T5MLIA;   // var per anar incrementant les línies                
               if T5capa = 0;                                                                       
                 Tmag(iLmag).zCapa = 100;                                                           
               else;                                                                                
                 Tmag(iLmag).zCapa = T5capa;                                                        
               endif;                                                                               
               Tmag(iLmag).zPeso = T5peso;                                                          
               Tmag(iLmag).zVolu = T5Volu;                                                          
               Tmag(iLmag).zhorz = T5horz;                                                          
               Tmag(iLmag).zFhor = CalculaData(T5horz);                                             
               Tmag(iLmag).zPmin = T5pmin;                                                          
               Tmag(iLmag).zNlin  = 0 ;                                                             
               Tmag(iLmag).zAssigRonda = 0;                                                         
               //Si estem forçant Lin també el guardo com maga assignat                             
               //D'aquesta forma si arribem al procés AssignaMagResidual farà el darrer intent      
               if gPROC = kPROCForcedLin;                                                           
                 iLAmag +=1;                                                                        
                 TAmag(iLAmag) = iLmag;                                                             
               endif;                                                                               
             endif;                                                                                 
           endif;                                                                                   
                                                                                                    
           return xRetorn;                                                                          
                                                                                                    
         end-proc;                                                                                  
                                                                                                    
      //----------------------------------------------------------------------------------------    
      //CheckChar: Conversió de char a boolean                                                     
      //   Passem el valor '1' a *on   i la resta a *off                                            
         dcl-proc CheckChar;                                                                        
         dcl-pi *n ind;      // retorn bool                                                         
           pcX like(t4oimp); // parm char                                                           
         end-pi;                                                                                    
         // Vars pròpies                                                                            
         dcl-s xRetorn ind inz(*off);                                                               
                                                                                                    
           if pcX = k1;                                                                             
             xRetorn = *on;                                                                         
           endif;                                                                                   
                                                                                                    
           return xRetorn;                                                                          
                                                                                                    
         end-proc;                                                                                  
                                                                                                    
      //----------------------------------------------------------------------------------------    
      //LoadArti: Carreguem Articles (línies de comanda)                                           
      //          Validacions especifiques, dades addicionals.                                     
      //           Guardem logístiques emprades en procés AddLin                                    
                                                                                                    
         dcl-proc LoadArti;                                                                         
         dcl-pi *n end-pi;                                                                          
         // Vars pròpies                                                                            
         dcl-s bOk ind;                                                                             
         dcl-s iAux like(s5line);                                                                   
         dcl-s cloge like(s5loge) inz;                                                              
         dcl-s cmaga like(m0maga) inz;                                                              
         dcl-s iSer like(s5line) inz;                                                               
         dcl-s iOut like(s5line) inz;                                                               
         dcl-s iIn  like(s5line) inz;                                                               
           //clear Tart;                                                                            
           // Lectura codepe                                                                        
E7139      Txurr_Save(GetMsg(kmsg0027) :*on :Simon_tx);   // 'Load Items'                           
           setll (@pcias:@pdlga:@pnpco:@ptped:@pdatp:@pnopl) codepe;                                
           bOk =*on;                                                                                
           dow not %eof(codepe);                                                                    
             reade(n) (@pcias:@pdlga:@pnpco:@ptped:@pdatp:@pnopl) codepe;                           
             if %eof(codepe);                                                                       
               leave;                                                                               
             endif;                                                                                 
             // Contador registres llegits                                                          
             iIn += 1;                                                                              
                                                                                                    
             // En aquest punt tindrem operatives variades depenent del gPROC                       
             //  gPROC = kPROCSimulacio        carreguem tot, validem tot                           
             //  gPROC = kPROCConfirmacio      carreguem tot, validem tot                           
             //  gPROC = kPROCForcedLin              SOLS carreguem la lin específica i la valid    
             //  gPROC = kPROCForcedHeader      carreguem tot, validem tot                          
             //  gPROC = kPROCAddLin           carreguem tot i, la lin especifica, la validem       
             //                            En aquest cas també gestionem la carrega de magatzems    
             //                          ja que les logístiques disponibles per la nova línia se    
             //                        les emprades en les línies existents de la comanda.          
             //  En TOTS els casos ignorem els articles de servei                                   
                                                                                                    
             // Procés ForcedLin: sols carreguem la lin demanada.                                   
             if gPROC = kPROCForcedLin and S5line <> @pline;                                        
               //ignorem línia                                                                      
               iOut +=1;                                                                            
               iter;                                                                                
             endif;                                                                                 
                                                                                                    
             //Dades addicionals                                                                    
             chain (s5arti:s5vari:s5mode) msarti;                                                   
                                                                                                    
             //Validacions específiques                                                             
             // Article de servei                                                                   
             pectab  = 'TIPG';                                                                      
             peclta = m5tipg;                                                                       
             chain (s5cias:pectab:peclta) pmtabd;                                                   
             if %found(pmtabd) and %trim(pebl61)=k1 ;                                               
               //article de servei: l'ignorem                                                       
               iSer += 1;                                                                           
               iter;                                                                                
             endif;                                                                                 
                                                                                                    
             // Línies tancades o amb quantitats servides:                                          
             //    Sols es poden tenir en compte per processos AddLin o ForceLin                    
             if s5stul = k5  or s5capp> 0;                                                          
               if gPROC = kPROCSimulacio or                                                         
                  gPROC = kPROCConfirmacio or                                                       
                  gPROC = kPROCForcedHeader;                                                        
                  //ignorem línia                                                                   
                   iOut +=1;                                                                        
                   iter;                                                                            
               endif;                                                                               
             endif;                                                                                 
                                                                                                    
             // Separem operatives en funció del tipus de procés                                    
             select;                                                                                
             when gPROC = kPROCSimulacio or                                                         
                  gPROC = kPROCConfirmacio or                                                       
                  gPROC = kPROCForcedHeader;                                                        
               iLarti += 1;                                                                         
               //clear Tart(iLarti) ;                                                               
               GuardaArticle(Tart(iLarti));                                                         
               GuardaArtS5(Tart(iLarti));    //Guardem dades específiques de línia comanda          
               exsr CercaExcept;                                                                    
             when gPROC = kPROCForcedLin;                                                           
               iLarti += 1;                                                                         
               GuardaArticle(Tart(iLarti));                                                         
               GuardaArtS5(Tart(iLarti));   //Guardem dades específiques de línia comanda           
               if s5line = @pline;                                                                  
                 exsr CercaExcept;  // Excepcions sempre                                            
               endif;                                                                               
             when gPROC = kPROCAddLin;                                                              
               if  s5line <> @pline; //Guardem logístiques de les línies                            
                 exsr SaveLogLin;   // existents menys l'afegida                                    
               endif;                                                                               
               iLarti += 1;                                                                         
               GuardaArticle(Tart(iLarti));                                                         
               GuardaArtS5(Tart(iLarti));   //Guardem dades específiques de línia comanda           
               if s5line = @pline;                                                                  
                 exsr CercaExcept;                                                                  
               endif;                                                                               
             endsl;                                                                                 
           enddo;                                                                                   
                                                                                                    
E7139      //Txurr_Save('LoadArti':*on:Simon_tx);                                                   
E7139      //Txurr_Save('In    ' + %editc(iIn:'X'):*off:Simon_tx);                                  
E7139      //Txurr_Save('Out   ' + %editc(iOut:'X'):*off:Simon_tx);                                 
E7139      //Txurr_Save('Serv: ' + %editc(iSer:'X'):*off:Simon_tx);                                 
E7139      //Txurr_Save('iLart ' + %editc(iLarti:'X'):*off:Simon_tx);                               
E7139                                                                                               
E7139      Txurr_Save(' '+%subst(GetMsg(kmsg0033):1:12) + %editc(iIn:'X')                           
E7139           :*off:Simon_tx);    //  Leidos                                                      
E7139      Txurr_Save(' '+%subst(GetMsg(kmsg0034):1:12) + %editc(iOut:'X')                          
E7139           :*off:Simon_tx);   //  Descartados                                                  
E7139      Txurr_Save(' '+%subst(GetMsg(kmsg0035):1:12) + %editc(iSer:'X')                          
E7139           :*off:Simon_tx);   //  Servicio                                                     
E7139      Txurr_Save(' '+%subst(GetMsg(kmsg0036):1:12) + %editc(iLarti:'X')                        
E7139           :*off:Simon_tx); //  Cargados                                                       
E7139      Txurr_Save(' '+%subst(GetMsg(kmsg0028):1:12) + %editc(iExcpt :'X')                       
E7139           :*off:Simon_tx);//  Excepcion                                                       
E7139      Txurr_Save(' '+%subst(GetMsg(kmsg0037):1:12) + %editc(iLPEND:'X')                        
E7139           :*off:Simon_tx);  //  Pendientes                                                    
E7139                                                                                               
           return;                                                                                  
         //.....................................................................................    
         begsr SaveLogLin;                                                                          
           // Si la línia és ED podem tenir una logística virtual                                   
           cmaga = *blanks;                                                                         
           if s5tpe4= k2;                                                                           
             cmaga = s5loge;                                                                        
E7249        //cloge = Call1411(cmaga:k1);                                                          
E7249        cloge = Call1411(cmaga:k1:s0dlga);                                                     
             if cloge <> *blanks; //1411 retorna, en aquest cas, el magatzem                        
               chain (@pcias:cloge) msalma;  //cerquem la logística                                 
               if %found(msalma);                                                                   
                 cloge = m0loge;                                                                    
               endif;                                                                               
             endif;                                                                                 
           endif;                                                                                   
           if cloge = *blanks;                                                                      
             cloge = s5loge;                                                                        
           endif;                                                                                   
           if %lookup(cloge:Tlog)  = 0; //not found                                                 
             iLlog += 1;                                                                            
             Tlog(iLlog) = cloge;                                                                   
             TNcoe(iLlog) = atoi(%subst(s5ampl:1:2));                                               
           endif;                                                                                   
         endsr;                                                                                     
         //.....................................................................................    
                                                                                                    
         begsr CercaExcept;                                                                         
             // 2022/07/21.- Primer afegit                                                          
             // S'ha d'accedir al proveïdor de la fitxa de l'article per veure si tenim un nou      
             //  paràmetre:                                                                         
             //          - logística siempre ED                                                     
             // En cas d'estar informat ho tractem com una excepció                                 
             chain (@pcias:Tart(iLarti).zPrvr) puprov;                                              
             if %found(puprov) and c0baja<>k1;                                                      
               Tart(iLarti).zLogVirtual = %subst(c0amp2:70:3);                                      
               if Tart(iLarti).zLogVirtual <> *blanks;                                              
                 Tart(iLarti).zLogFinal = Tart(iLarti).zLogVirtual;                                 
                 Tart(iLarti).zExcpt = *on;                                                         
                 iExcpt += 1     ;  // acumulem línies assignades per Except arti/prov              
               endif;                                                                               
             endif;                                                                                 
                                                                                                    
             // Restriccions d'article, de proveïdor                                                
             // Aquests assignen directament la logística de sortida                                
             if Tart(iLarti).zLogFinal = *blanks; //si no ho tenim assignat                         
               t4arvt = s5arti + s5vari + s5mode;                                                   
               t4prio = 1;                                                                          
               //Nivell article + dlga                                                              
               if GetExcept(@pcias:kC :@pdlga:*blanks:t4arvt:                                       
                   *blanks:t4prio:Tart(iLarti)) = *off;                                             
                                                                                                    
                 //Nivell article + *                                                               
                 if GetExcept(@pcias:kC :'*':*blanks:t4arvt:                                        
                     *blanks:t4prio:Tart(iLarti)) = *off;                                           
                                                                                                    
                   // Nivell prov + dlga                                                            
                   if GetExcept(@pcias:kB:@pdlga:m5prvr:*blanks:*blanks:                            
                       t4prio:Tart(iLarti)) = *off;                                                 
                                                                                                    
                     // Nivell prov + *                                                             
FGI25          //    GetExcept(@pcias:kB:'*':m5prvr:*blanks:*blanks:                                
FGI25          //      t4prio:Tart(iLarti));                                                        
FGI25                if GetExcept(@pcias:kB:'*':m5prvr:*blanks:*blanks:                             
FGI25                    t4prio:Tart(iLarti)) = *off;                                               
FGI25 // Nova excepció                                                                              
FGI25                  if GetExceptMTOS(@pcias:@pdlga:Tart(iLarti))=*off;                           
FGI25   //               GetExceptMTOS(@pcias:'*':Tart(iLarti));                                    
FGI25                  endif; //nivel MTOS + dlga                                                   
FGI25                endif; //nivel Prov + *                                                        
                   endif; //nivell prov + dlga                                                      
                 endif; //nivell article + *                                                        
               endif; //nivell article + dlga                                                       
             endif;  //si no ho tenim assignat                                                      
             // Si NO hem assignat excepció                                                         
             if Tart(iLarti).zLogFinal = *blanks;                                                   
               iLPEND += 1;                                                                         
               Tpend(iLPEND) = iLarti; //Guardo els elements pendents d'assignar                    
             endif;                                                                                 
         endsr;                                                                                     
                                                                                                    
         end-proc;                                                                                  
                                                                                                    
FGI25 //----------------------------------------------------------------------------------------    
FGI25 //GetExceptMTOS: Cerca d'excepcions MTO/MTS i validació en maga origen                       
FGI25    dcl-proc GetExceptMTOS;                                                                    
FGI25    dcl-pi *n ind;               //valor de retorn                                             
FGI25      pcias like(@pcias) value;                                                                
FGI25      pdlga like(@pdlga) value;                                                                
FGI25      pdsArt likeds(dsArt) ;                                                                   
FGI25    end-pi;                                                                                    
FGI25    dcl-s  wPrvr like(M0PRVR) inz;                                                             
FGI25    dcl-s  wArvm like(C3ARVM) inz;                                                             
FGI25    dcl-s  wOltFamT like(T4FAMT) inz(*blanks);                                                 
FGI25    dcl-s itemp like(s5line) inz;                                                              
FGI25                                                                                               
FGI25    // Si NO tenim el parm Maga Check MTOS no podem mirar res                                  
FGI25        if gMTOS = *blanks;                                                                    
FGI25          return *off;                                                                         
FGI25        endif;                                                                                 
20907        //                                                                                     
20907        if pDsArt.zNoed = k1 ; // Article NO accepta ED                                        
20907          chain (pcias:gMTOS) msalma;                                                          
20907          if not %found(msalma) or (%found(msalma) and m0tal1=k8);                             
20907            return *off; //No es pot assignar                                                  
20907          endif;                                                                               
20907        endif;                                                                                 
FGI25                                                                                               
FGI25    // Traducció maga AS -> maga M3                                                            
FGI25        mqwhlo = Call1411(gMTOS:K2:*blanks);                                                   
FGI25                                                                                               
FGI25    // Bucle per tots els registres d'aquesta excepció... sols en podem tenir 2                
FGI25        setll (pcias:kM:pdlga:*blanks:*blanks:*blanks) edpar2;                                 
FGI25        reade (pcias:kM:pdlga) edpar2;                                                         
FGI25        dow not %eof(edpar2);                                                                  
FGI25          if t4maga<>*blanks and t4famt<>wOltFamT;                                             
FGI25            wOltFamT = t4famt;                                                                 
FGI25            //cercar Prvr del msalma                                                           
FGI25         // chain (pcias:t4maga) msalma;                                                       
FGI25            chain (pcias:gMTOS) msalma;                                                        
FGI25            if %found(msalma);                                                                 
FGI25              // cercar codi d'article del Proveïdor                                           
FGI25              if m0prvr <> *blanks;                                                            
FGI25                wPrvr = m0prvr;                                                                
FGI25              else;                                                                            
FGI25                wPrvr = m5prvr;                                                                
FGI25              endif;                                                                           
FGI25              wArvm=pDsArt.zArti+pDsArt.zVari+pDsArt.zMode;                                    
FGI25              chain (@pcias:wPrvr:wArvm) puprp0;                                               
FGI25              if %found(puprp0) and c3arvp<>*blanks;                                           
FGI25                mqitno=c3arvp;                                                                 
FGI25              else;                                                                            
FGI25                mqitno= wArvm;                                                                 
FGI25              endif;                                                                           
FGI25          //  mqwhlo = Call1411(t4maga:K2:*blanks);                                            
FGI25              chain (gCONO:mqwhlo:mqitno) zaqbal00;                                            
FGI25              if %found(zaqbal00) and t4famt=mqmtso;                                           
FGI25                //OK, tenim excepció. Hem de validar-ho contra el MITBAL                       
FGI25                chain (gCONO:mqwhlo:mqitno) mitbal00;                                          
FGI25                if %found(mitbal00) and mbpuit=3;                                              
FGI25                  chain (pcias:t4maga) msalma;                                                 
20907                  if pDsArt.zNoed = k1 ; // Article NO accepta ED                              
20907                    if not %found(msalma) or                                                   
20907                              (%found(msalma) and m0tal1=k8);                                  
20907                      return *off; //No es pot assignar                                        
20907                    endif;                                                                     
20907                  endif;                                                                       
FGI25                  //Guardem aquest magatzem per calcular el Ncoe                               
FGI25                  itemp=  %lookup(m0logs:TAuxExc);                                             
FGI25                  if itemp = 0; // no el teniem                                                
FGI25                    iAuxExc += 1;                                                              
FGI25                    TAuxExc(iAuxExc) = m0logs;                                                 
FGI25                    itemp = iAuxExc;                                                           
FGI25                  endif;                                                                       
FGI25                                                                                               
FGI25                  pDsArt.znMag = kMaxMag + itemp; // Assigno un valor per utilitzar-lo desp    
FGI25                  pDsArt.zLogFinal = m0logs;                                                   
FGI25                  pDsArt.zLogVirtual = Call1411(t4maga:*blanks:s0dlga);                        
FGI25                  pDsArt.zExcpt = *on;                                                         
FGI25                  if (m0tal1 = k8 or m0tal1 = k7);                                             
FGI25                    pDsArt.zTpe4 = k2;                                                         
FGI25                  else;                                                                        
FGI25                    pDsArt.zTpe4 = *blanks;                                                    
FGI25                  endif;                                                                       
FGI25                  iExcpt += 1     ;  //                                                        
FGI25                  Txurr_Save(' ' + %subst(Getmsg(kmsg0028):1:10)+' O/S:' +                     
FGI25                  %trim(wArvm)+  ' -> '+  %trim(Getmsg(kmsg0029)) +': '+                       
FGI25                     m0logs                                                                    
FGI25                  :*off:Simon_tx);                                                             
FGI25                  return *on;                                                                  
FGI25                endif; // mitbal00                                                             
FGI25              endif; // zaqbal00                                                               
FGI25            endif; // msalma                                                                   
FGI25          endif; //t4maga *blanks                                                              
FGI25          reade (pcias:kM:@pdlga) edpar2;                                                      
FGI25        enddo;                                                                                 
FGI25        // si arribem aquí vol dir que no tenim aquesta excepció                               
FGI25        return *off;                                                                           
FGI25                                                                                               
FGI25    end-proc;                                                                                  
FGI25                                                                                               
FGI25 //----------------------------------------------------------------------------------------    
      //----------------------------------------------------------------------------------------    
      //GetExcept: Recuperem excepcions article/proveïdor (segons parms rebuts)                    
         dcl-proc GetExcept;                                                                        
         dcl-pi *n ind;               //valor de retorn                                             
           pcias like(@pcias) value;                                                                
           ptreg like(t4treg) value;                                                                
           pdlga like(@pdlga) value;                                                                
           pprvr like(t4prvr) value;                                                                
           parvt like(t4arvt) value;                                                                
           pfamt like(t4famt) value;                                                                
           pprio like(t4prio) value;                                                                
           pdsArt likeds(dsArt) ;                                                                   
         end-pi;                                                                                    
         dcl-s itemp like(s5line) inz;                                                              
                                                                                                    
           //Mateix codi per article i proveïdor, depenent dels parms                               
             chain (pcias:ptreg:pdlga:pprvr:parvt:pfamt:pprio) edpar2;                              
             if %found(edpar2);                    // Si existeix excepció sempre tindrem un        
               chain (@pcias:t4maga) msalma;       // codi de magatzem NO virtual                   
               if %found(msalma);                                                                   
                 //Guardem aquest magatzem per calcular el Ncoe                                     
                 itemp=  %lookup(m0logs:TAuxExc);                                                   
                 if itemp = 0; // no el teniem                                                      
                   iAuxExc += 1;                                                                    
                   TAuxExc(iAuxExc) = m0logs;                                                       
                   itemp = iAuxExc;                                                                 
                 endif;                                                                             
                 pDsArt.znMag = kMaxMag + itemp; // Assigno un valor per utilitzar-lo més endeva    
                 pDsArt.zLogFinal = m0logs;                                                         
E7249            //pDsArt.zLogVirtual = Call1411(t4maga:*blanks);                                   
E7249            pDsArt.zLogVirtual = Call1411(t4maga:*blanks:s0dlga);                              
                 pDsArt.zExcpt = *on;                                                               
                 if (m0tal1 = k8 or m0tal1 = k7);                                                   
                   pDsArt.zTpe4 = k2;                                                               
                 else;                                                                              
                   pDsArt.zTpe4 = *blanks;                                                          
                 endif;                                                                             
                 iExcpt += 1     ;  // acumulem línies assignades per Except arti/prov              
E7139          //Txurr_Save('GetExcpt' :*on:Simon_tx);                                              
E7139          //Txurr_Save('Dlga:'+pdlga+' Prv:'+pprvr+' Art:'+ %trim(parvt) +                     
E7139          //           ' ->'+%char(iExcpt)  :*off:Simon_tx);                                   
E7269            if parvt<>*blanks;                                                                 
E7139            Txurr_Save(' ' + %subst(Getmsg(kmsg0028):1:10) + ' Art:' +                         
E7139              %trim(parvt)+  ' -> '+  %trim(Getmsg(kmsg0029)) +': '+ m0logs                    
E7139              :*off:Simon_tx);                                                                 
E7269            else;                                                                              
E7269            Txurr_Save(' ' + %subst(Getmsg(kmsg0028):1:10) + ' Prv:' +                         
E7269              %trim(pprvr)+  ' -> '+  %trim(Getmsg(kmsg0029)) +': '+ m0logs                    
E7269              :*off:Simon_tx);                                                                 
E7269            endif;                                                                             
                 return *on;                                                                        
               endif;                                                                               
             endif;                                                                                 
             return *off;                                                                           
                                                                                                    
         end-proc;                                                                                  
                                                                                                    
      //----------------------------------------------------------------------------------------    
      //GuardaArtS5: guardem dades específiques de línia de comanda                                
         dcl-proc GuardaArtS5;                                                                      
         dcl-pi *n;                                                                                 
           pDsArt likeds(dsArt);// row de Tart                                                      
         end-pi;                                                                                    
                                                                                                    
             pDsArt.zLine = s5line;          //    linea tractada                                   
             pDsArt.zloge     = s5loge;      // logística actual                                    
             pDsArt.zFrep     = s5frep;      // data prevista                                       
             pDsArt.zNcoe     = atoi(%subst(s5ampl:1:2));     // número coenvio                     
             pDsArt.zTdi1     = s5tdi1 ;     // adreça d'entrega... a nivell línia??                
             pDsArt.zImpLin   = cs_importe();// Import calculat de la línia                         
             pDsArt.zCant     = s5cant;      // qty                                                 
             pDsArt.zUnim     = s5unim;      // unitat                                              
             pDsArt.zUni2     = m5unim;                                                             
             pDsArt.zCan2     = pDsArt.zCant;                                                       
             // Separem operatives en funció del tipus de procés                                    
             select;                                                                                
             when gPROC = kPROCSimulacio or                                                         
                  gPROC = kPROCConfirmacio or                                                       
                  gPROC = kPROCForcedHeader;                                                        
             //pDsArt.zProb = ChkObsoleto();                                                        
                pDsArt.zTcoj =                                                                      
                      ChkConjunto(m5cias:m5arti:m5vari:m5mode:m5prvr); // Conjunt                   
               if s5unim <> m5unim;                                                                 
                 pDsArt.zCan2 =                                                                     
                          ChgUnitats(pDsArt.zCant:pDsArt.zUnim:pDsArt.zUni2:                        
                            pDsArt.zArti:pDsArt.zVari:pDsArt.zMode);                                
               endif;                                                                               
             when gPROC = kPROCAddLin;                                                              
               if  s5line = @pline;                                                                 
               //pDsArt.zProb = ChkObsoleto();                                                      
                 pDsArt.zTcoj =                                                                     
                      ChkConjunto(m5cias:m5arti:m5vari:m5mode:m5prvr); // Conjunt                   
                 if s5unim <> m5unim;                                                               
                   pDsArt.zCan2 =                                                                   
                          ChgUnitats(pDsArt.zCant:pDsArt.zUnim:pDsArt.zUni2:                        
                            pDsArt.zArti:pDsArt.zVari:pDsArt.zMode);                                
                                                                                                    
                 endif;                                                                             
               else;                                                                                
                 pDsArt.zLogFinal = s5loge ;     // logística final assignada                       
               endif;                                                                               
             when gPROC = kPROCForcedLin ;                                                          
               if s5line<> @pline; // no és la línia que han afegit                                 
                 pDsArt.zLogFinal = s5loge ;     // logística final assignada                       
               else;                                                                                
               //pDsArt.zProb = ChkObsoleto();                                                      
                 pDsArt.zTcoj =                                                                     
                        ChkConjunto(m5cias:m5arti:m5vari:m5mode:m5prvr); // Conjunt                 
                 if s5unim <> m5unim;                                                               
                   pDsArt.zCan2 =                                                                   
                          ChgUnitats(pDsArt.zCant:pDsArt.zUnim:pDsArt.zUni2:                        
                            pDsArt.zArti:pDsArt.zVari:pDsArt.zMode);                                
                 endif;                                                                             
               endif;                                                                               
             endsl;                                                                                 
             if  pDsArt.zProb <> *blanks;                                                           
               bTenimObso = *on;                                                                    
             endif;                                                                                 
                                                                                                    
             exsr CS_PESOSVOL;                                                                      
                                                                                                    
             return;                                                                                
                                                                                                    
                                                                                                    
C3758C     CS_PESOSVOL   BEGSR                                                                      
C3758                                                                                               
C3758C                   CALL      'MM2686'                                                         
C3758C                   PARM                    @PCIAS                                             
C3758C                   PARM      S5ARTI        @PEARTI                                            
C3758C                   PARM      S5VARI        @PEVARI                                            
C3758C                   PARM      S5MODE        @PEMODE                                            
C3758C                   PARM      S5TCOJ        @PETCOJ                                            
C3758C                   PARM      S5CANT        @PECAST                                            
C3758C                   PARM      S5UNIM        @PEUNST                                            
C3758C                   PARM      0             @PEPBRE                                            
C3758C                   PARM      zZUPES        @PEUPES                                            
C3758C                   PARM      0             @PEVOLB                                            
C3758C                   PARM      ZZUVOL        @PEUVOL                                            
C3758C                   PARM      ZZUMED        @PEUMED                                            
C3758C                   PARM      0             @PENBUL                                            
C3758C                   PARM      *BLANK        @PETPAL                                            
C3758C                   PARM      *BLANK        @PETCT1                                            
C3758C                   PARM      *BLANK        @PEVTC1                                            
C3758C                   PARM      *BLANK        @PEERR                                             
C3758                                                                                               
C3758C                   IF        @PEERR=*blanks                                                   
           Tart(iLarti).zPesLin = @PEPBRE;                                                          
           Tart(iLarti).zVolLin = @PEVOLB;                                                          
C3758C                   ELSE                                                                       
           Tart(iLarti).zPesLin = *zero  ;                                                          
           Tart(iLarti).zVolLin = *zero  ;                                                          
C3758C                   ENDIF                                                                      
C3758C                   ENDSR                                                                      
                                                                                                    
                                                                                                    
         end-proc;                                                                                  
                                                                                                    
      //----------------------------------------------------------------------------------------    
      //GuardaArticle: guardem les dades necessaries en Tart                                       
      // Cridem aquest codi amb una lectura del MSARTI feta                                         
      // El contador de posició de la taula corresponent (Tart o Tcom) es gestiona fora             
         dcl-proc GuardaArticle;                                                                    
         dcl-pi *n;                                                                                 
           pDsArt likeds(dsArt);// row de Tart                                                      
         end-pi;                                                                                    
                                                                                                    
           //iLarti += iLarti;                                                                      
             clear pDsArt;                                                                          
             pDsArt.zArti = m5arti;          // -                                                   
             pDsArt.zVari = m5vari;          // +  Arti, Vari, Mode                                 
             pDsArt.zMode = m5mode;          // -                                                   
             pDsArt.zPrvr = m5prvr ;         // proveïdor de l'article                              
             pDsArt.zSiol = m5siol ;         // article propi                                       
             pDsArt.zNoED = %subst(m5ampl:63:1);                                                    
             pDsArt.zLogFinal = *blanks;     // logística final assignada                           
             pDsArt.zForzado  = *off;        // línia forçada                                       
             pDsArt.zExcpt    = *off;        // logística x excepció                                
             pDsArt.zProb     = *blanks;     // art obsolet                                         
             pDsArt.zProb     = ChkObsoleto();                                                      
             pDsArt.zCost     = GetCost();                                                          
                                                                                                    
         end-proc;                                                                                  
                                                                                                    
      //----------------------------------------------------------------------------------------    
      // GetCost: Passem el valor de cost per articles obsolets???                                 
         dcl-proc GetCost;                                                                          
         dcl-pi *n like(m5cosu);                                                                    
         end-pi;                                                                                    
         dcl-s xRetorn like(m5cosu);                                                                
                                                                                                    
           select;                                                                                  
           when m5tcos = k0;                                                                        
             xRetorn = m5cosu;                                                                      
           when m5tcos = k1;                                                                        
             xRetorn = m5cosp;                                                                      
           when m5tcos = k2;                                                                        
             xRetorn = m5cosm;                                                                      
           other;                                                                                   
             xRetorn = m5cosu;                                                                      
           endsl;                                                                                   
           return xRetorn;                                                                          
         end-proc;                                                                                  
                                                                                                    
      //----------------------------------------------------------------------------------------    
      // ChkObsoleto : validem si és obsoleto                                                      
         dcl-proc ChkObsoleto;                                                                      
         dcl-pi *n char(2);                                                                         
         end-pi;                                                                                    
         dcl-s xRetorn char(2) inz(*blanks);                                                        
                                                                                                    
           if gChkObso ;  // Obsolets                                                               
             select;                                                                                
             when %subst(m5ampl:49:2) = kOB;                                                        
               xRetorn = kOB;                                                                       
             when %subst(m5ampl:49:2) = kOC;                                                        
               xRetorn = kOC;                                                                       
             endsl;                                                                                 
           endif;                                                                                   
           return xRetorn;                                                                          
         end-proc;                                                                                  
                                                                                                    
                                                                                                    
      //----------------------------------------------------------------------------------------    
      // ChgUnitats : canvi unitats                                                                
         dcl-proc ChgUnitats;                                                                       
         dcl-pi *n like(s5cant);  // Retorn: qty convertida                                         
           p_cant like(s5cant) const;  // qty                                                       
           p_unim like(s5unim) const;  // uni origen                                                
           p_uni2 like(s5unim) const;  // uni destí                                                 
           p_arti like(s5arti) const;  // arti                                                      
           p_vari like(s5vari) const;  //     vari                                                  
           p_mode like(s5mode) const;  //         mode                                              
         end-pi;                                                                                    
                                                                                                    
         dcl-s xRetorn like(s5cant) inz;                                                            
                                                                                                    
           chain (@pcias:p_arti:p_vari:p_mode:p_unim) pmunal;                                       
           if not %found;                                                                           
             chain (@pcias:p_arti:*blanks:*blanks:p_unim) pmunal;                                   
           endif;                                                                                   
           if %found;                                                                               
             if p6tcof<> k1;                                                                        
               xRetorn = p_cant * p6cofa;                                                           
             else;                                                                                  
               if p6cofa <> 0;                                                                      
                 xRetorn = p_cant / p6cofa;                                                         
               endif;                                                                               
             endif;                                                                                 
             //Ajuste y decimales                                                                   
             xzauxi = xRetorn;                                                                      
             xzdeci= 0 ;    //zxdes0;                                                               
             xzajud= 0 ;    //zxaju0;                                                               
             /copy *libl/qsrdsrc,srd001                                                             
             xRetorn = xzauxi;                                                                      
           else;                                                                                    
             xRetorn = p_cant;                                                                      
           endif;                                                                                   
           return xRetorn;                                                                          
         end-proc;                                                                                  
                                                                                                    
      //--Codi eliminat ------------------------------------------------------------------------    
      // ChkArtB : valida articles B                                                               
      // dcl-proc ChkArtB;                                                                          
      // dcl-pi *n ind;                                                                             
      //   xcias like(s5cias);                                                                      
      //   xarti like(s5arti);                                                                      
      //   xvari like(s5vari);                                                                      
      //   xmode like(s5mode);                                                                      
      //   xloge like(s0loge);                                                                      
      // end-pi;                                                                                    
      // // Vars pròpies                                                                            
      // dcl-s iA like(s5line);                                                                     
      // dcl-s xRetorn ind inz(*off);                                                               
      //                                                                                            
      //   if  %subst(t3ampl:12:1) = k1  ;                                                          
      //     //El codi de magatzem de la logística de capçalera el tenim en gHDRmaga                
      //     //Cerquem categoria de rotació                                                         
      //     chain (xcias:xarti:xvari:xmode:gHDRmaga) msstok;                                       
      //     if %found(msstok) and m1crot=kB ;                                                      
      //       //Busco stock en el almacén de la logística                                          
      //       chain (xcias:xarti:xvari:xmode:gHDRmaga:kA) mssto01;                                 
      //       if %found(mssto01);                                                                  
      //         xRetorn = *on;                                                                     
      //       endif;                                                                               
      //     endif;                                                                                 
      //   endif;                                                                                   
      //                                                                                            
      //   return xRetorn;                                                                          
      //                                                                                            
      // end-proc;                                                                                  
      //                                                                                            
      //----------------------------------------------------------------------------------------    
      //ChkConjunto : retorna si és conjunt o no                                                   
         dcl-proc ChkConjunto;                                                                      
         dcl-pi *n like(NDTCOJ);                                                                    
           xcias like(s5cias);                                                                      
           xarti like(s5arti);                                                                      
           xvari like(s5vari);                                                                      
           xmode like(s5mode);                                                                      
           xprvr like(m5prvr);                                                                      
         end-pi;                                                                                    
         // Vars pròpies                                                                            
         dcl-s iA like(s5line);                                                                     
         dcl-s x3arvm like(c3arvm);                                                                 
         dcl-s xRetorn like(NDTCOJ) inz;                                                            
                                                                                                    
           open mscojc;                                                                             
           //open puprcj;  //19/08/2022.- OL2-186                                                   
           //Miramos si es Conjunto de Venta                                                        
           chain (xcias:xarti:xvari:xmode:k4 ) mscojc;                                              
           if %found(mscojc) and ndbaja<k1 ;                                                        
             //19/08/2022.- OL2-186: eliminem tot aquest blok                                       
             ////miramos si es Conjunto de Compra;                                                  
             //chain (xcias:xarti:xvari:xmode:k1 ) mscojc;                                          
             //if %found(mscojc) and ndbaja<k1 ;                                                    
             //  //Si es Conjunto de Ventas y de Compra  validem contra PUPRCJ                      
             //  x3arvm = xarti + xvari + xmode;                                                    
             //  chain (xcias:x3arvm:k1:xprvr) puprcj;                                              
             //  if %found(puprcj);                                                                 
             //    xRetorn = k4;                                                                    
             //  else;                                                                              
             //    xRetorn = *blanks;                                                               
             //  endif;                                                                             
             //else;                                                                                
             //  //Si es Conjunto de Ventas y No de Compra Si lo tratamos                           
             //  xRetorn = k4 ;                                                                     
             //endif;                                                                               
             //19/08/2022.- OL2-186: Add                                                            
             xRetorn = k4 ;                                                                         
             //19/08/2022.- OL2-186: END                                                            
           else;                                                                                    
             //Si No es Conjunto de Venta , Pues no es Conjunto y punto                             
             xRetorn = *blanks;                                                                     
           endif;                                                                                   
           close mscojc;                                                                            
           //close puprcj; //19/08/2022.- OL2-186                                                   
                                                                                                    
           return xRetorn;                                                                          
                                                                                                    
         end-proc;                                                                                  
                                                                                                    
      //----------------------------------------------------------------------------------------    
      //qJobType: tipus de job, interact o batch                                                   
         dcl-proc qJobType;                                                                         
         dcl-pi *n char(1) end-pi;                                                                  
         dcl-pr QUSRJOBI extpgm ;                                                                   
          *n char(32766) options(*varsize) ;                                                        
          *n int(10:0) const ;                                                                      
          *n char(8) const ;                                                                        
          *n char(26) const ;                                                                       
          *n char(16) const ;                                                                       
         end-pr;                                                                                    
         dcl-ds Returned len(86) ;                                                                  
          JobType char(1) pos(61) ;                                                                 
         end-ds;                                                                                    
                                                                                                    
         QUSRJOBI(Returned:%size(Returned):'JOBI0100':'*':'') ;                                     
         return JobType ;                                                                           
                                                                                                    
         end-proc;                                                                                  
                                                                                                    
      //----------------------------------------------------------------------------------------    
      //ValidaTot : Validacions referents a Maga-Arti                                              
         dcl-proc ValidaTot;                                                                        
         dcl-pi *n end-pi;                                                                          
         dcl-s iA like(s5line);                                                                     
         dcl-s iM like(s5line);                                                                     
                                                                                                    
         //dbg                                                                                      
E7139   // Txurr_Save('ValidaTot':*on:Simon_tx);                                                    
E7139   // Txurr_Save('Start:' + %char(%timestamp):*off:Simon_tx);                                  
E7139     Txurr_Save(GetMsg(kmsg0038):*on:Simon_tx);                                                
                                                                                                    
                                                                                                    
          open pmcaor01;                                                                            
          open pmcaor08;                                                                            
          open pmdeor05;                                                                            
FGI25   //E7249     open mitbal00;                                                                  
E7249     open utcom0  ;                                                                            
          // Realitzem les validacions de cada 'pis' del cub                                        
          // Bucle Articles (línies de comanda)                                                     
          //  Bucle Magatzems                                                                       
          //    Per cada Article/Magatzem es realitzem totes les validacions                        
          // Si l'article és un conjunt va per un altre banda, similar, i es passen les dades       
          //  sumaritzades (AND) dels componets a l'article pare                                    
          for iA = 1 to iLarti; // per tots els articles carregats                                  
            if Tart(iA).zTcoj = k4;                                                                 
              ComputeConjunt(iA); //Calcula opcions per cada component                              
                                  //i agrupa al row pare                                            
            else;                                                                                   
            for iM = 1 to iLmag; // per tots els magatzems carregats                                
                                                                                                    
             if Tart(iA).zTcoj<> k4;   // No kit                                                    
              // 1er.- Existencia de l'article                                                      
              CArt(iA).CMag(iM).CVal(kExist) =                                                      
                ValExist(Tart(iA):iM:CArt(iA).CMag(iM).CVal(kExist):                                
                                   CArt(iA).CMag(iM).CVal(kM1PROP));                                
              // 2on.- Disponible                                                                   
              CArt(iA).CMag(iM).CVal(kDispo) =                                                      
                ValDisp(Tart(iA):iM:CArt(iA).CMag(iM).CVal(kDispo));                                
              // 3er.- Data horitzó                                                                 
              CArt(iA).CMag(iM).CVal(kFrep) =                                                       
                ValFhor(Tart(iA):iM:CArt(iA).CMag(iM).CVal(kFrep) );                                
              // 4rt.- Pesos Volumns Unitats                                                        
              CArt(iA).CMag(iM).CVal(kPesVol) =                                                     
                ValPesVol(Tart(iA):iM:CArt(iA).CMag(iM).CVal(kPesVol));                             
              // 5é .- Proveïdor                                                                    
              CArt(iA).CMag(iM).CVal(kProv) =                                                       
                ValProv(Tart(iA):iM:CArt(iA).CMag(iM).CVal(kProv));                                 
              // Si el prov no passa ja no farem la crida al ED51                                   
              if CArt(iA).CMag(iM).CVal(kProv) = 0;                                                 
                 CArt(iA).CMag(iM).CVal(kED51) = CArt(iA).CMag(iM).CVal(kProv);                     
              endif;                                                                                
              // 6é .- Número línies assignades                                                     
              CArt(iA).CMag(iM).CVal(kNLin) =                                                       
                ValNlin(Tart(iA):iM:CArt(iA).CMag(iM).CVal(kNLin):                                  
                                    CArt(iA).CMag(iM).CVal(kDispo));                                
             endif;                                                                                 
              // 7é .- Possible FD (ED0051) // per tots els articles, kits inclosos                 
              CArt(iA).CMag(iM).CVal(kED51) =                                                       
                ValED51(Tart(iA):iM:CArt(iA).CMag(iM).CVal(kED51):                                  
                                   CArt(iA).CMag(iM).CVal(kM1PROP):                                 
                                   CArt(iA).CMag(iM).CVal(kxInci));                                 
              // 8é .- Acumula Validacions per Art/Mag: si aquesta combinacio Art/Mag supera tot    
              //                       les validacions.                                             
               ValidaGrpArtMag(iA:iM);                                                              
                                                                                                    
              // Sols per ME (magatzems especials: ArtiB/Obso)                                      
E7139         //       if gChkArtiB or bTenimObso;                                                  
E7139         if gChkArtiB or bTenimObso or gChkSS; //Phase3 add gChkSS                             
                // 9é .- Valida si NO conta PE pel ME                                               
                CArt(iA).CMag(iM).CVal(kNoPE) =                                                     
E7728          // ValidaNoPE(Tart(iA):iM:CArt(iA).CMag(iM).CVal(kFinal));                           
E7728     // Per ArtiB,Obso,SS sols validem contra Disponible                                       
E7728             ValidaNoPE(Tart(iA):iM:CArt(iA).CMag(iM).CVal(kDispo));                           
                //10é .- Valida Final ME                                                            
                CArt(iA).CMag(iM).CVal(kFinalME) =                                                  
                  ValidaFinalME(CArt(iA).CMag(iM).CVal(kFinal):                                     
                                CArt(iA).CMag(iM).CVal(kNoPE));                                     
              else;                                                                                 
                CArt(iA).CMag(iM).CVal(kNoPE) = 0;                                                  
                CArt(iA).CMag(iM).CVal(kFinalME) = 0;                                               
              endif;                                                                                
                                                                                                    
             endfor; // bucle Magatzems                                                             
            endif; // Conjunts                                                                      
          endfor; // Bucle articles                                                                 
                                                                                                    
          close pmcaor01;                                                                           
          close pmcaor08;                                                                           
          close pmdeor05;                                                                           
FGI25   //E7249     close mitbal00;                                                                 
E7249     close utcom0  ;                                                                           
          // En aquest punt ja tenim tot el cub informant excepte la fila iLarti + 1                
          // Aquí sumaritzem, a nivell magatzem, quantes línies compleixen les condicions i, en     
          // pis kFinal, quantes línies compleixen TOTES les condicions                             
          // Pels ME (magatzems especials) tenim 2 línies addicionals                               
          ValidaFinal();                                                                            
         //dbg                                                                                      
E7139   // Txurr_Save('End  :' + %char(%timestamp):*off:Simon_tx);                                  
E7139   // Txurr_Save('>' + %char(ilmag) + ' X ' + %char(iLarti+1) + ' X ' +                        
E7139   //        %char(kFinalME) + ' = ':*off:Simon_tx);                                           
E7139   // Txurr_Save('>' + %char(iLmag * (iLarti+1) * kFinalME)+                                   
E7139   //                   ' Validacions':*off:Simon_tx);                                         
                                                                                                    
         end-proc;                                                                                  
                                                                                                    
                                                                                                    
      //----------------------------------------------------------------------------------------    
      //ChkValorsActuals                                                                           
      //   Aquest és un pas repetitiu en totes les validacions i permet centralitzar accions        
      //  pels processos AddLin i ForcedLin                                                         
         dcl-proc ChkValorsActuals;                                                                 
         dcl-pi *n like(s5line);                                                                    
          pDsArt likeds(dsArt);                                                                     
          pM like(s5line);                                                                          
          pActual like(s5line);                                                                     
         end-pi;                                                                                    
         dcl-s xRetorn like(s5line) inz(*zero);                                                     
                                                                                                    
          select;                                                                                   
          when ( gPROC = kPROCForcedLin ) or ( gPROC = kPROCAddLin ); // Per AddLin / ForcedLin     
            if pDsArt.zLine <> @pline;                     //No és Lin afectada                     
             if Tmag(pM).zLoge = pDsArt.zLogFinal  or         //i té la log d'aquest maga           
              (Tmag(pM).zLogVirtual = pDsArt.zLogVirtual and Tmag(pM).ztal1=k8);                    
               return 1;                                                                            
             else;                                                                                  
               return 0;                                                                            
             endif;                                                                                 
            endif;   // si és la línea afectada realitza les validacions corresponents              
          when pDsArt.zLogFinal <> *blanks;  // Si ja el tenim assignat (per except) forcem a 0     
            return 0;                                                                               
          endsl;                                                                                    
          return pActual;                                                                           
                                                                                                    
         end-proc;                                                                                  
                                                                                                    
                                                                                                    
      //----------------------------------------------------------------------------------------    
      //ValExist: Valida existencia                                                                
      //                                                                                            
         dcl-proc ValExist;                                                                         
         dcl-pi *n like(s5line);                                                                    
          pDsArt likeds(dsArt);                                                                     
          //iA like(s5line);                                                                        
          pM like(s5line);                                                                          
          pActual like(s5line);                                                                     
          piPROP like(s5line); //Valor de l'element del pis kM1PROP                                 
         end-pi;                                                                                    
         dcl-s xRetorn like(s5line) inz(*zero);                                                     
         dcl-s xAuxPrvr like(m0prvr) inz;                                                           
                                                                                                    
          // Comprovacions independents del tipus de validació;                                     
          xRetorn = ChkValorsActuals(pDsArt:pM:pActual);                                            
          if xRetorn <> 999; // Ja hem decidit o ja teniem valor                                    
            return xRetorn;                                                                         
          endif;                                                                                    
                                                                                                    
          chain (@pcias:Tmag(pM).zMaga:pDsArt.zArti                                                 
                  :pDsArt.zVari:pDsArt.zMode)msstok;                                                
                                                                                                    
          select;                                                                                   
          when Tmag(pM).ztal1 = k8;      // Sols per magatzems tal1=8.                              
            select;                                                                                 
            when pDsArt.zNoed = k1; // article NO accepta ED                                        
              xRetorn = 0;                                                                          
            when %found(msstok);                                                                    
              piPROP = atoi(M1PROP); //Propietat article en aquest maga                             
              xRetorn = 1;                                                                          
            other;                                                                                  
              xRetorn = 0;                                                                          
            endsl;                                                                                  
E7249       if xRetorn = 1;                                                                         
E7249       // Accedim al MITBAL per verificar l'estat d'aquest article a M3.                       
E7249       // Ja tenim el CONO en gCONO i WHLO en Tmag(x).zWHLO. Sols ens falta ITNO.              
E7249         if Tmag(pM).zPrvr <> *blanks;                                                         
E7249           xAuxPrvr= Tmag(pM).zPrvr;                                                           
E7249         else;                                                                                 
E7249           xAuxPrvr= pDsArt.zPrvr;                                                             
E7249         endif;                                                                                
E7249         xRetorn = GetStsM3(Tmag(pM).zWHLO:xAuxPrvr:                                           
E7249                    pDsArt.zArti+pDsArt.zVari+pDsArt.zMode:xRetorn);                           
E7249         if xRetorn = 0;                                                                       
E7249           Txurr_Save(cRRd+'M3 status!'+cNGr+'Art:'+ pDsArt.zArti +                            
E7249            ' Whse:'+Tmag(pM).zMaga:*off:Simon_tx);                                            
E7249         endif;                                                                                
E7249       endif;                                                                                  
          other;                                                                                    
            xRetorn = 1;                                                                            
          endsl;                                                                                    
          return xRetorn;                                                                           
         end-proc;                                                                                  
                                                                                                    
                                                                                                    
      //----------------------------------------------------------------------------------------    
      //ValDisp: Valida disponible                                                                 
         dcl-proc ValDisp;                                                                          
         dcl-pr pMM1412 extpgm('MM1412');                                                           
          *n like(s5cias);                                                                          
          *n like(s5arti);                                                                          
          *n like(s5vari);                                                                          
          *n like(s5mode);                                                                          
          *n like(@Stok);                                                                           
          *n like(m0baja);                                                                          
          *n like(m0maga);                                                                          
         end-pr;                                                                                    
         dcl-pi *n like(s5line);   // Retorn: 0 o 1                                                 
          pDsArt likeds(dsArt);   // input: ds Article                                              
          piM like(s5line);        // input: posició Taula Magatzems                                
          piActual like(s5line);   // input: valor actual d'aquesta validació                       
         end-pi;                                                                                    
         dcl-s xRetorn like(s5line);                                                                
         dcl-s xDispo like(m1sact) inz(*zero);                                                      
E7139    // Passem la var a global         dcl-s p_Stock like(@Stok) inz;                           
         dcl-s p_Serv like(m0baja) inz;                                                             
E7219     p_Stock=*zero;                                                                            
          // Comprovacions independents del tipus de validació;                                     
          xRetorn = ChkValorsActuals(pDsArt:piM:piActual);                                          
          if xRetorn <> 999; // Ja hem decidit o ja teniem valor                                    
            return xRetorn;                                                                         
          endif;                                                                                    
          //chain (@pcias:Tmag(piM).zMaga:pDsArt.zArti:pDsArt.zVari//Hem fet la lectura en ValEx    
          //      :pDsArt.zMode)msstok;                                                             
          if not %found(msstok);                                                                    
            m1crot = *blanks;                                                                       
          endif;                                                                                    
                                                                                                    
          select;                                                                                   
          // Si tenim Omit ctl stock (els ME sempre ho tenen desactivat)                            
            when Tmag(piM).zOctS;                                                                   
              return 1;                                                                             
E7728     // Si  CtlSobreStock                                                                      
E7728       when gChkSS    and Tmag(piM).zMagEsp;                                                   
E7728         xRetorn = xRetorn; // Check Sobre Stock i Maga Esp: continuem validacions             
          // Validacions per si és un ME (magatzem especial per ArtiB/Obso)                         
            when gChkObso  and Tmag(piM).zMagEsp and pDsArt.zProb <> *blanks; //Valida Obso         
              xRetorn = xRetorn; //Chkobso, MagaObso i article OBSO.. continuem validacions         
            when gChkArtiB and Tmag(piM).zMagEsp; //Valida ArtiB                                    
              if m1crot <> kB;   //Validem la rotació                                               
                return  0;     //ChkArtiB, MagaObso i article NO B                                  
              endif;                                                                                
            when gChkObso  and Tmag(piM).zMagEsp and pDsArt.zProb =  *blanks; //Valida Obso         
              return  0 ; // ChkObso, MagaObso i article NO obso, No ArtiB(hauriem entrat en les    
                           // condicions anteriors.                                                 
          endsl;                                                                                    
          // En aquest punt hem de realitzar els cálculs per validar que                            
          //    Tenim stk per satisfer la línia                                                     
          //    Si està parametritzat, no superem l'estoc mínim (msstok.m1smin)                     
                                                                                                    
          // Càlculs diferents per tipus de magatzem                                                
          select;                                                                                   
          when      Tmag(piM).zTAL1=k8;                                                             
            pMM1412(@pcias:pDsArt.zArti:pDsArt.zVari:                                               
                 pDsArt.zMode:p_Stock:p_Serv:Tmag(piM).zMaga);                                      
          when      Tmag(piM).zTAL1=k7;                                                             
            g1cias = @pcias;                                                                        
            g1maga = Tmag(piM).zMaga;                                                               
            g1arti = pDsArt.zArti ;                                                                 
            g1vari = pDsArt.zVari ;                                                                 
            g1mode = pDsArt.zMode ;                                                                 
            g1cali = kA;                                                                            
                                                                                                    
            chain (g1cias:g1maga:g1arti:g1vari:g1mode:g1cali) gxsto0;                               
                                                                                                    
            //  G1CIAS+G1MAGA gr G1ARTI gr G1VARI gr G1MODE gr  G1CALI gr                           
            //  G1CIAO z3.0 G1MAGO gr G1ARTO grG1VARO gr G1MODO gr G1CALO gr                        
            //                                                                                      
            //                                                                                      
            if %found(gxsto0);                                                                      
              p_Stock = g1sact;                                                                     
            else;                                                                                   
              return 0;    //tal1=7 i no trobem registre                                            
            endif;                                                                                  
          other;                                                                                    
          //m1cias=@pcias;                                                                          
          chain (@pcias:pDsArt.zArti:pDsArt.zVari:pDsArt.zMode:                                     
                  Tmag(piM).zMaga:kA)mssto01;                                                       
            if %found(mssto01) and m1sact> 0 ;                                                      
                                                                                                    
     C                   EVAL      ZXSTDD = 0                                                       
     C                   EVAL      ZXSTKA = 0                                                       
     C                   EVAL      ZXCANS0 = 0                                                      
     C                   EVAL      ZXCANE0 = 0                                                      
     C                   EVAL      ZXDEPO0 = 0                                                      
      * Solo tratamos si el almacén tiene stock                                                     
     C                   EVAL      ZXSTKA=M1SACT                                                    
     C                   EVAL      ZXCANT=1                                                         
      * Busqueda cantidades de stock pdte servir,fabricar,deposito...                               
     C                   EXSR      CS_CANSTOK                                                       
      * Stock disponible                                                                            
     C                   EVAL      ZXSTDD=ZXSTKA-ZXCANS0-ZXCANE0                                    
     C                   IF        ZXDEPO0>0                                                        
     C                   EVAL      ZXSTDD=ZXSTDD-ZXDEPO0                                            
     C                   ENDIF                                                                      
      *                                                                                             
                         p_Stock = zxstdd;                                                          
     C                   ENDIF                                                                      
     C                   ENDSL                                                                      
      *                                                                                             
                                                                                                    
          // Independentment del tal1 del magatzem                                                  
          // p_Stock -> disponible calculat                                                         
          //                                                                                        
          select;                                                                                   
          when p_Stock < pDsArt.zCan2;  //No tenim ni per servir la línia                           
            xRetorn = 0;                                                                            
E7323     when Tmag(piM).zMagEsp;      //Magatzem especial i tenim stock                            
E7323       xRetorn = 1;               //No validem %                                               
          when (p_Stock * Tmag(piM).zDisp/100)< pDsArt.zCan2 and                                    
                          Tmag(piM).zDisp>0;                                                        
            xRetorn = 0;                                                                            
          //when (p_Stock - pDsArt.zCan2) <(pDsArt.zCant * Tmag(piM).zPmin) and                     
          //                Tmag(piM).zPmin>0;                                                      
          //  xRetorn = 0;                                                                          
          when p_Stock - pDsArt.zCan2     < m1smin * Tmag(piM).zPmin / 100  and                     
               m1smin * Tmag(piM).zPmin / 100 <> 0 ;                                                
            xRetorn = 0;                                                                            
          other;                                                                                    
            xRetorn = 1;                                                                            
          endsl;                                                                                    
                                                                                                    
          return xRetorn;                                                                           
          //---------------------                                                                   
      **********************************************************************                        
      *  Busqueda cantidades de stock pdte servir,fabricar,deposito...                              
      **********************************************************************                        
     C     CS_CANSTOK    BEGSR                                                                      
                                                                                                    
     C                   EVAL      @PEDATD=*DATE                                                    
     C                   EVAL      @PEDATH=*DATE                                                    
     C                   MOVE      @PEDATD       ZXDATD                                             
     C                   MOVE      @PEDATH       ZXDATH                                             
     C                   SUBDUR    1000  :*D     ZXDATD                                             
     C                   ADDDUR    1000  :*D     ZXDATH                                             
     C                   MOVE      ZXDATD        @PEDATD                                            
     C                   MOVE      ZXDATH        @PEDATH                                            
                                                                                                    
      * Pendiente de servir                                                                         
           @perro = '1';                                                                            
           @pecant = *zero;                                                                         
           @pecan1=*zero;                                                                           
           pCO2770(@pcias:@pdlga:pDsArt.zArti:pDsArt.zVari:pDsArt.zMode:@petcoj:                    
              @pedatd:@pedath:@pecant:@pecan1:Tmag(piM).zLoge:@pomfde:@perro);                      
     C                   EVAL      ZXCANS0 = @PECANT * ZXCANT                                       
                                                                                                    
      * Pendiente de traspasos depositos                                                            
     C                   EVAL      @PETISE=' '                                                      
                                                                                                    
           @perro = *blanks;                                                                        
           @pecant= 0;                                                                              
           @pecan1 = 0;                                                                             
           pMM2604(@pcias:zzdlga :@pearti:@pevari:@pemode:@petcoj:@pedatd:                          
                   @pedath:@pecant:@pecan1:m1maga:@petise:@perro);                                  
                                                                                                    
     C                   EVAL      ZXDEPO0 = @PECANT * ZXCANT                                       
                                                                                                    
      * Esto solo para empresas que utilizan nuestra produccion                                     
     C                   EVAL      @PECAN1=0                                                        
     C                   EVAL      @PECAN2=0                                                        
b01  C                   IF        ZZTCIA='1' OR ZZTCIA='2'                                         
     C                   EVAL      @PEDATD=*DATE                                                    
     C                   EVAL      @PEDATH=*DATE                                                    
     C                   MOVE      @PEDATD       ZXDATD                                             
     C                   MOVE      @PEDATH       ZXDATH                                             
     C                   SUBDUR    1000  :*D     ZXDATD                                             
     C                   ADDDUR    1000  :*D     ZXDATH                                             
     C                   MOVE      ZXDATD        @PEDATD                                            
     C                   MOVE      ZXDATH        @PEDATH                                            
      * Solo realizaré la búsqued en artículos susceptibles de ser utilizados en                    
      * es decir, que sean estructuras o componentes.                                               
           chain (@pcias:pDsArt.zArti:pDsArt.zVari:pDsArt.zMode) pmcaor01;                          
     C**** KMSARTI00     CHAIN     PMCAOR01                           81                            
b02  C                   IF        not %found(pmcaor01)                                             
           chain (@pcias:pDsArt.zArti:pDsArt.zVari:pDsArt.zMode) pmcaor08;                          
     C**** KMSARTI00     CHAIN     PMCAOR08                           81                            
e02  C                   ENDIF                                                                      
                                                                                                    
      * Búsqueda de las necesidades a tener en cuenta en OF's                                       
     C                   EVAL      @PECAN1=0                                                        
     C                   EVAL      @PECAN2=0                                                        
           chain (@pcias:pDsArt.zArti:pDsArt.zVari:pDsArt.zMode) pmdeor05;                          
     C**** KMSARTI00     CHAIN     PMDEOR05                           81                            
b02  C                   IF        %found(pmdeor05)                                                 
      * Si MÑSNCC>='1', entonces (DOLL) se desea que se presente el                                 
      * material asignado                                                                           
     C                   EVAL      @PERRO=*BLANKS                                                   
                                                                                                    
     C                   CALL      'MM2602'                                                         
     C                   PARM                    @pCIAS                                             
     C                   PARM                    @PEARTI                                            
     C                   PARM                    @PEVARI                                            
     C                   PARM                    @PEMODE                                            
     C                   PARM                    @PEDATD                                            
     C                   PARM                    @PEDATH                                            
     C                   PARM      0             @PECAN1                                            
     C                   PARM      0             @PECAN2                                            
     C                   PARM                    M1MAGA                                             
     C                   PARM                    M5MAGD                                             
     C                   PARM                    @PERRO                                             
e02  C                   ENDIF                                                                      
e01  C                   ENDIF                                                                      
     C                   EVAL      ZXCANE0 = @PECAN2 * ZXCANT                                       
                                                                                                    
     C                   ENDSR                                                                      
          //---------------------                                                                   
         end-proc;                                                                                  
                                                                                                    
                                                                                                    
      //----------------------------------------------------------------------------------------    
      //ValFhor: Data horitzó                                                                      
         dcl-proc ValFhor;                                                                          
         dcl-pi *n like(s5line);                                                                    
          pDsArt likeds(dsArt);                                                                     
          piM like(s5line);                                                                         
          piActual like(s5line);                                                                    
         end-pi;                                                                                    
         dcl-s xRetorn like(s5line);                                                                
                                                                                                    
          // Comprovacions independents del tipus de validació;                                     
          xRetorn = ChkValorsActuals(pDsArt:piM:piActual);                                          
          if xRetorn <> 999; // Ja hem decidit o ja teniem valor                                    
            return xRetorn;                                                                         
          endif;                                                                                    
                                                                                                    
          // Depenem del tal1 del magatzem                                                          
          select;                                                                                   
          when TMag(piM).zTal1 = k8;  // Magatzem Operador Logístic                                 
            xRetorn = 1 ;                                                                           
          when Tmag(piM).zMaga = gDFTmaga; // Magatzem per defecte                                  
            xRetorn = 1 ;                                                                           
          other;                                                                                    
            if TMag(piM).zFhor < pDsArt.zFrep;                                                      
              xRetorn = 0  ;                                                                        
            else;                                                                                   
              xRetorn = 1  ;                                                                        
            endif;                                                                                  
          endsl;                                                                                    
          return xRetorn;                                                                           
         end-proc;                                                                                  
                                                                                                    
                                                                                                    
      //----------------------------------------------------------------------------------------    
      //ValPesVol: Validem Pesos Volumns Unitats                                                   
         dcl-proc ValPesVol;                                                                        
         dcl-pi *n like(s5line);                                                                    
          pDsArt likeds(dsArt);                                                                     
          piM like(s5line);                                                                         
          piActual like(s5line);                                                                    
         end-pi;                                                                                    
         dcl-s xRetorn like(s5line) inz(*zero);                                                     
                                                                                                    
          // Comprovacions independents del tipus de validació;                                     
          xRetorn = ChkValorsActuals(pDsArt:piM:piActual);                                          
          if xRetorn <> 999; // Ja hem decidit o ja teniem valor                                    
            return xRetorn;                                                                         
          endif;                                                                                    
                                                                                                    
          xRetorn = 1; // Per defecte                                                               
                                                                                                    
          // Pes                                                                                    
          if Tmag(piM).zOpes > pDsArt.zPesLin and Tmag(piM).zOpes > *zero;                          
              xRetorn = 0;                                                                          
          endif;                                                                                    
                                                                                                    
          // Unitats                                                                                
          if Tmag(piM).zOuni > pDsArt.zCan2 and Tmag(piM).zOuni > *zero;                            
            xRetorn = 0;                                                                            
          endif;                                                                                    
                                                                                                    
          //No tenim res per volum??                                                                
                                                                                                    
          return xRetorn;                                                                           
         end-proc;                                                                                  
                                                                                                    
      //----------------------------------------------------------------------------------------    
      //ValProv : Valida proveïdor                                                                 
         dcl-proc ValProv;                                                                          
         dcl-pi *n like(s5line);                                                                    
          pDsArt likeds(dsArt);                                                                     
          piM like(s5line);                                                                         
          piActual like(s5line);                                                                    
         end-pi;                                                                                    
         dcl-s cPrvr   like(C0prvr) inz;                                                            
         dcl-s iCias   like(c3cias) inz;                                                            
         dcl-s xRetorn like(s5line) inz(*zero);                                                     
         dcl-s iCnt like(s5line) inz;                                                               
                                                                                                    
          // Comprovacions independents del tipus de validació;                                     
          xRetorn = ChkValorsActuals(pDsArt:piM:piActual);                                          
          if xRetorn <> 999; // Ja hem decidit o ja teniem valor                                    
            return xRetorn;                                                                         
          endif;                                                                                    
                                                                                                    
          if Tmag(piM).zPrvr <> *blanks and                                                         
            (Tmag(piM).ztal1 = k8 or Tmag(piM).ztal1=k7);                                           
            cPrvr = Tmag(piM).zPrvr;                                                                
          else;                                                                                     
            cPrvr = pDsArt.zPrvr;                                                                   
          endif;                                                                                    
          iCias = @pcias;                                                                           
          chain (iCias:cPrvr) puprov ;                                                              
          if %found(puprov) ;                                                                       
E7223       //if  %subst(c0amp2:1:1)= k1;                                                           
E7223       if  %subst(c0amp2:1:1)= k1 or %subst(c0amp2:1:1)= k2;                                   
              xRetorn = 1;                                                                          
            else;                                                                                   
              return 0; //no accepta ED, no val la pena mirar res més                               
            endif;                                                                                  
             //  (%subst(c0amp2:1:1)=*blanks or %subst(c0amp2:1:1)=k0);                             
            //if pDsArt.zNoED <> k2;  Ja hem mirat si l'article accepta ED en ValExist              
            //  xRetorn = 0;                                                                        
            //else;                                                                                 
            //  xRetorn = 1;                                                                        
            //endif;                                                                                
          else;                                                                                     
            //Comprobar si el Proveïdor és extern                                                   
            chain (iCias:cPrvr) gxeqpr;                                                             
            if %found(gxeqpr) and q1pgrp=k1;                                                        
              xRetorn = 1;                                                                          
            else;                                                                                   
              xRetorn = 0;                                                                          
            endif;                                                                                  
          endif;                                                                                    
                                                                                                    
          return xRetorn;                                                                           
         end-proc;                                                                                  
                                                                                                    
      //----------------------------------------------------------------------------------------    
      //MostraResultat: Montem el resúm de la info a mostrar                                       
         dcl-proc MostraResultat;                                                                   
         dcl-pi *n ind;               //valor de retorn                                             
         end-pi;                                                                                    
         dcl-s xRetorn ind inz(*off);                                                               
E7139    //dcl-s ctsiED char(50);     les passem a global                                           
E7139    //dcl-s ctnoED char(50);     les passem a global                                           
         dcl-s ixX like(s5line);                                                                    
         dcl-s iyY like(s5line);                                                                    
         dcl-s ixI like(s5line);                                                                    
         dcl-s sAux char(1);                                                                        
                                                                                                    
             clear @ptitulo ;                                                                       
             clear txurru;                                                                          
             clear tjob;                                                                            
             //Montem txurru per passar al MSGBOX                                                   
             // 1er. Titol                                                                          
             @ptitulo = cRWh + %trim(GetMsg(kmsg0000)) + CNGr;                                      
                                                                                                    
             // 2on. Guardem textes 'Accepta FD' i 'No Accepta FD' ja que es poden emprar           
             //      varies vegades.                                                                
E7139        //ctSiED    = GetMsg(kmsg0001);                                                        
E7139        //ctNoED    = GetMsg(kmsg0002);                                                        
                                                                                                    
             select;                                                                                
             when gERROR = kErrorTransFP  ; //Error validacions x deft                              
               exsr MontaHeader;                                                                    
               Txurr_Save(GetMsg(kmsg0018)                  :*off:txurru);                          
                                                                                                    
             when gERROR = kErrorClient  ; //Error client no ed i NO simulació                      
               exsr MontaHeader;                                                                    
               Txurr_Save(GetMsg(kmsg0011):*off:txurru);                                            
                                                                                                    
             when gERROR = kErrorPedCompl  ; //Error Pedido Completo NO es pot assignar. queda l    
               exsr MontaHeader;                                                                    
               Txurr_Save(GetMsg(kmsg0020):*off:txurru);                                            
               Txurr_Save(GetMsg(kmsg0021):*off:txurru);                                            
                                                                                                    
             when gERROR = kErrorNotPossible;//Error No s'ha pogut assignar una/totes les línies    
               exsr MontaHeader;                                                                    
               exsr MontaErrorNotPossible;                                                          
               //Txurr_Save('kErrorNotPossible: not be assigned':*off:txurru);                      
               //Txurr_Save(cURd + '.Muesga..............' + cNGr  :*off:txurru);                   
                                                                                                    
             when gPROC = kPROCForcedLin;   //                                                      
               exsr MontaForced;                                                                    
             when gERROR = kNOError  ; //Tot correcte, procés normal                                
               exsr MontaHeader;                                                                    
               exsr MontaNOError;                                                                   
                                                                                                    
             endsl; // <- gERROR                                                                    
                                                                                                    
             //Mostrem finestra                                                                     
             @plongitud = %len(txurru);                                                             
             select;                                                                                
             when gPROC = kPROCSimulacio;                                                           
               @pfuncion = k0;        //  k2;  // F10 confirmar, F12 cancelar                       
             when gERROR <> kNOError ;                                                              
               @pfuncion = k0;                                                                      
             when gPROC = kPROCForcedLin;                                                           
               @pfuncion = k0;        //  k2;  // F10 confirmar, F12 cancelar                       
             when gPROC = kPROCForcedHeader;                                                        
               @pfuncion = k2;        //  k2;  // F10 confirmar, F12 cancelar                       
             when gPROC = kPROCAddLin;                                                              
               @pfuncion = k0;        //  k2;  // F10 confirmar, F12 cancelar                       
             other;                                                                                 
               @pfuncion = k0;                                                                      
             endsl;                                                                                 
                                                                                                    
             if gERROR <> kNOError                                                                  
               or gPROC = kPROCForcedLin                                                            
               or gPROC = kPROCForcedHeader                                                         
               or gPROC = kPROCAddLin;                                                              
E7225         if gJobType = kI; // and gJobType<> kI;  //mod    per no executar-ho                  
               pMSGBOX(@pTitulo:%addr(txurru)+2:@pLongitud:@pFuncion:                               
                     @pRetorno:*on);                                                                
E7225         endif;                                                                                
             endif;                                                                                 
                                                                                                    
             select;                                                                                
             when gPROC = kPROCSimulacio;                                                           
               xRetorn = *on;                                                                       
             when gERROR= kErrorPedCompl  ; //tenim error 3, hem d'actualitzar la capçalera per     
               xRetorn = *on;                                                                       
             when gERROR = kErrorNotPossible;//Error No s'ha pogut assignar una/totes les línies    
               xRetorn = *on;                                                                       
             when gERROR <> kNOError ; // qualsevol altre error no actualitzem                      
               xRetorn = *off;                                                                      
             when gPROC = kPROCConfirmacio;                                                         
               xRetorn = *on;                                                                       
             when gPROC = kPROCForcedLin;                                                           
               xRetorn = *on;                                                                       
             when gPROC = kPROCForcedHeader and @pRetorno <> k2; //NO han acceptat                  
               DesmarcaHeader();                                                                    
               xRetorn = *off;                                                                      
             //  xRetorn = *on;                                                                     
             when gPROC = kPROCAddLin;                                                              
               xRetorn = *on;                                                                       
             when @pfuncion = k2 and @pRetorno = k2; // Si hem demanat confirmació i han accepta    
               xRetorn = *on;                                                                       
             other;                                                                                 
               xRetorn = *off;                                                                      
             endsl;                                                                                 
E7377        if gPROC = kPROCConfirmacio and xRetorn = *off;                                        
E7377          SaveHst(); //Generem registre en fitxer històric DOOMHT                              
E7377        endif;                                                                                 
                                                                                                    
             return xRetorn;                                                                        
                                                                                                    
             //.................................................................................    
             begsr MontaErrorNotPossible;                                                           
                                                                                                    
               Txurr_Save(GetMsg(kmsg0017)           :*off:txurru);                                 
               Txurr_Save(*blanks                    :*off:txurru);                                 
                                                                                                    
               for ixX = 1 to iLArti;  //Busquem tots els articles assignats a Default              
                 iyY += 1;                                                                          
                                                                                                    
               //if Tart(ixX).znMag = gDFTpos;  // logística x defecte                              
               //                                                                                   
               //  for iyY = (iLmagME + 1) to iLmag; //Busquem els magatzems OL                     
               //                                                                                   
               //    if Tmag(iyY).zTal1 = k8;                                                       
               //      // Revisem quins valors tenim a 0                                            
               //      if cArt(ixX).cMag(iyY).cVar(kExist) = *zero;                                 
               //                                                                                   
               //                                                                                   
               //    endif;                                                                         
               //  endfor;                                                                          
               //endif;                                                                             
                                                                                                    
               endfor;                                                                              
               Txurr_Save(%trim(GetMsg(kmsg0009)) +' '+gDFTloge+':'+                                
                      %char(iyY) :*off:txurru);                                                     
             endsr;                                                                                 
             //.................................................................................    
             begsr MontaForced ;                                                                    
               Txurr_Save(GetMsg(kmsg0009)+ ':'      :*off:txurru);                                 
               if gPROC = kProcForcedLin;                                                           
                 Txurr_Save(' -> ' + tart(1).zLogFinal :*on:txurru);                                
               else;                                                                                
                 exsr MontaLogAssign;                                                               
               endif;                                                                               
               Txurr_Save(GetMsg(kmsg0010)           :*off:txurru);                                 
             endsr;                                                                                 
             //.................................................................................    
             begsr MontaLogAssign;                                                                  
               // Recorrem Magatzems Assignats i montem la info:                                    
               //                                                                                   
               for ixX = 1 to iLAmag;                                                               
                 clear tjob;                                                                        
                 if (Tmag(TAmag(ixX)).ztal1=k8 or Tmag(TAmag(ixX)).ztal1=k7);                       
                 //tjob = cRGr+ Tmag(TAmag(ixX)).zMaga + ' ' +                                      
                 //            %char(Tmag(TAmag(ixX)).zNlin) + cNGr;                                
                   tjob = cRGr+ Tmag(TAmag(ixX)).zMaga + cNGr;                                      
                 else;                                                                              
                 //tjob = ' ' +Tmag(TAmag(ixX)).zMaga + ' ' +                                       
                 //                 %char(Tmag(TAmag(ixX)).zNlin);                                  
                   tjob = ' ' +Tmag(TAmag(ixX)).zMaga + ' ' ;                                       
                 endif;                                                                             
               //Txurr_Save(tjob  :*off:txurru);                                                    
                 Txurr_Save(%char(Tmag(TAmag(ixX)).zNlin) + ' ' +                                   
                      %trim(GetMsg(kmsg0003)) + ' ' + %trim(tjob)                                   
                                  :*off:txurru);                                                    
               endfor;                                                                              
             endsr;                                                                                 
             //.................................................................................    
             begsr MontaNOError;                                                                    
               exsr MontaLogAssign;                                                                 
                                                                                                    
               // 5é.  Recorrem Arti cercant Excepcions i montem la info:                           
               //     número de línies -> assignades per Excepció                                   
               for ixX = 1 to iLarti;                                                               
                 if Tart(ixX).zExcpt;                                                               
                   ixI += 1;                                                                        
                 endif;                                                                             
               endfor;                                                                              
               if ixI > *zero;                                                                      
                 Txurr_Save(%char(ixI) +' '+ %trim(GetMsg(kmsg0019))   :                            
                            *off:txurru);                                                           
               endif;                                                                               
               // linea en blank                                                                    
               Txurr_Save(*blanks                                :*off:txurru);                     
                                                                                                    
               // 6é.  Literal de conformitat:                                                      
               //      Està d'accord amb el resultat? Premi F-10                                    
               //      En cas contrari premi F-12 i la comanda NO serà modificada                   
               Txurr_Save(GetMsg(kmsg0004)                       :*off:txurru);                     
               Txurr_Save(GetMsg(kmsg0005)                       :*off:txurru);                     
             endsr;                                                                                 
             //.................................................................................    
             begsr MontaHeader;                                                                     
               //     Client    : accepta o no                                                      
               if gEDClient;                                                                        
                 tjob = cNWh + %trim(ctSiED) + cNGr;                                                
               else;                                                                                
                 tjob = cRRd + %trim(ctNoED) + cNGr;                                                
               endif;                                                                               
               Txurr_Save(%subst(GetMsg(kmsg0014):1:8) + ' ' + s0cust + ' ' +                       
                  %subst(s0des1:1:30-(%len(%trim(tjob))))+ %trim(tjob):*off:                        
                           txurru);                                                                 
               clear tjob;                                                                          
               //     Fpag      : accepta o no                                                      
               if gEDFPag;                                                                          
                 tjob = cNWh + %trim(ctSiED) + cNGr;                                                
               else;                                                                                
                 tjob = cRRd + %trim(ctNoED) + cNGr;                                                
               endif;                                                                               
               Txurr_Save(%subst(GetMsg(kmsg0016):1:10)+'    '+s0fpag+'    '+                       
                  %subst(cFormaPago:1:30-(%len(%trim(tjob))))+ %trim(tjob):*off:                    
                           txurru);                                                                 
               clear tjob;                                                                          
               //     Transport : accepta o no                                                      
               if gEDTrans;                                                                         
                 tjob = cNWh + %trim(ctSiED) + cNGr;                                                
               else;                                                                                
                 tjob = cRRd + %trim(ctNoED) + cNGr;                                                
               endif;                                                                               
               Txurr_Save(%subst(GetMsg(kmsg0015):1:13)+' '+s0ttta+'   '+                           
                  %subst(n1des1:1:30-(%len(%trim(tjob))))+ %trim(tjob):*off:                        
                           txurru);                                                                 
               clear tjob;                                                                          
                                                                                                    
E7377 // Si s'han produit errors en LoadDefault NO tenim informació per l'históric                  
E7377          if %len(Simon_tx) < 50;                                                              
E7377            Simon_tx = txurru;                                                                 
E7377          endif;                                                                               
               // Add 1 lin en blank                                                                
               Txurr_Save(*blanks:*off:txurru);                                                     
             endsr;                                                                                 
                                                                                                    
         end-proc;                                                                                  
                                                                                                    
      //----------------------------------------------------------------------------------------    
      //UpdateSO: Actualitza la comanda                                                            
      //  Passem la logística assignada i calculem el valor per s5ncoe                              
      //  O, en cas de PedidoCompleto i no poder assignar, no toquem les línies i sols bloquejem    
      //   la capçalera                                                                             
      //                                                                                            
         dcl-proc UpdateSO;                                                                         
         dcl-pi *n end-pi;                                                                          
         dcl-s xRetorn ind inz(*off);                                                               
         dcl-s iA like(s5line);                                                                     
                                                                                                    
         // 24/11/2022.- Parlat amb Toni: no lck header i deixar les línies amb resultat del càl    
         // Error de pedido completo gERROR = k3                                                    
         //if gERROR= kErrorPedCompl ;                                                              
         //  chain (@pcias:@pdlga:@pnpco:@ptped:@pdatp:@pnopl) cocape;                              
         //  s0phld = k1;  //Pedido retenido                                                        
         //  s0rhld = k1;  //RETENER RESERVAS AUT                                                   
         //  update rcocape;                                                                        
         //  return; //sortim i no toquem res més                                                   
         //endif;                                                                                   
         // Per si de cas netejem el fitxer Do0052w                                                 
         exsr Clear0052w;                                                                           
E7139    chain (@Pcias:@Pdlga) pmempr;                                                              
                                                                                                    
         For iA = 1 to iLarti;                                                                      
                                                                                                    
           select;                                                                                  
           when ( gPROC = kPROCSimulacio ) or (gPROC = kPROCConfirmacio) ; //simulació o confirm    
             Tart(iA).zLogFinal = GetVirtual(iA);                                                   
             Tart(iA).zNNcoe = GetCoenvio(iA);                                                      
             UpdateCodepe(iA);                                                                      
           when ( gPROC = kPROCForcedLin ) ;                  //forced lin:Sols mod 1 lin           
             if Tart(iA).zLine = @pline;                                                            
               Tart(iA).zLogFinal = GetVirtual(iA);                                                 
               Tart(iA).zNNcoe = Tart(iA).zNcoe; // Deixem el valor que tenia                       
               UpdateCodepe(iA);                                                                    
             endif;                                                                                 
           when ( gPROC = kPROCForcedHeader )  ;               //forced Head                        
             Tart(iA).zLogFinal = GetVirtual(iA);                                                   
             Tart(iA).zNNcoe = GetCoenvio(iA);                                                      
             UpdateCodepe(iA);                                                                      
           when ( gPROC = kPROCAddLin );                      //Addlin: Sols mod 1 lin              
             if Tart(iA).zLine = @pline;                                                            
               Tart(iA).zLogFinal = GetVirtual(iA);                                                 
               Tart(iA).zNNcoe = Tart(iA).zNcoe; // Deixem el valor que tenia                       
               UpdateCodepe(iA);                                                                    
             endif;                                                                                 
           endsl;                                                                                   
         endfor;                                                                                    
         //Mirem si actualitzem capçalera                                                           
         if s0tpe4 <> k2 and gTPE4 or gS0COEN <> %subst(s0ampl:1:1);                                
           chain (@pcias:@pdlga:@pnpco:@ptped:@pdatp:@pnopl) cocape;                                
           if gS0COEN <> %subst(s0ampl:1:1);                                                        
             %subst(s0ampl:1:1) = gS0COEN;                                                          
           endif;                                                                                   
           if s0tpe4 <> k2;                                                                         
             s0tpe4 = k2;                                                                           
           endif;                                                                                   
           update rcocape;                                                                          
         endif;                                                                                     
                                                                                                    
         return;                                                                                    
         //.....................................................................................    
         begsr Clear0052w;                                                                          
                                                                                                    
           exec sql                                                                                 
             delete from do0052w where d2cias>0;                                                    
                                                                                                    
         endsr;                                                                                     
         //.....................................................................................    
         end-proc;                                                                                  
                                                                                                    
                                                                                                    
      //----------------------------------------------------------------------------------------    
      //UpdateCodepe                                                                               
      //                                                                                            
      // Passem les dades al fitxer (sols una vegada)                                               
         dcl-proc UpdateCodepe;                                                                     
         dcl-pi *n ;                                                                                
           iA like(s5line);       //parm: posició on estem de Tart                                  
         end-pi;                                                                                    
                                                                                                    
         dcl-s xRetorn like(s5loge);                                                                
         dcl-s xA like(s5line);                                                                     
         dcl-s iLine like(s5line) inz;                                                              
         dcl-s xInci char(3) inz;                                                                   
                                                                                                    
         // Lectura amb lck del codepe                                                              
         chain                                                                                      
           (@pcias:@pdlga:@pnpco:@ptped:@pdatp:@pnopl:Tart(iA).zLine) codepe;                       
         // Movem els camps LOGE, NCOE, TPE4                                                        
         if Tart(iA).zLogFinal <> s5loge;                                                           
           s5loge = Tart(iA).zLogFinal ;                                                            
         endif;                                                                                     
         if Tart(iA).ztpe4 <> s5tpe4;                                                               
           s5tpe4 = Tart(iA).ztpe4;                                                                 
         endif;                                                                                     
         s5ncoe = %subst(%editc(Tart(iA).zNNcoe:'X'):2:2);                                          
E7377    if gs0coen=k3;                                                                             
E7377      s5ncoi='00';                                                                             
E7377      s5ncof='00';                                                                             
E7377    endif;                                                                                     
                                                                                                    
         // Update                                                                                  
         update rcodepe;                                                                            
                                                                                                    
         // Si la logística assignada NO es d'un magatzem m0tal1=8 hem de desmarcar el              
         // corresponent registre en ED0050W per evitar que, algun pgm simpatic com ED0060,         
         // ens ho torni a canviar.                                                                 
         iLine = Tart(iA).zLine;                                                                    
         if Tart(iA).ztpe4 <> k2;                                                                   
           exec sql                                                                                 
             update ed0050w set t2forz='0', t2entd='0'                                              
               where t2line = :iLine ;   // :Tart(iA).zLine;                                        
         else;                                                                                      
           if Tart(iA).znMag > *zero and Tart(iA).znMag < (iLmag + 1);                              
             //xInci = %char(CArt(iA).CMag(Tart(iA).znMag).CVal(kxInci));                           
             xInci = %editc(CArt(iA).CMag(Tart(iA).znMag).CVal(kxInci):'X');                        
           else;                                                                                    
             xInci = *blanks;                                                                       
           endif;                                                                                   
           exec sql                                                                                 
             update ed0050w set t2forz='0', t2entd='1', t2inci=:xInci                               
               where t2line = :iLine ;   // :Tart(iA).zLine;                                        
         endif;                                                                                     
                                                                                                    
         // Gravem el registre en DO0052W per tal que ED1000W mostri la informació correcte         
         clear RDO0052W;                                                                            
         select;                                                                                    
         when Tart(iA).zExcpt = *on;                                   //Excepció Article/Proveï    
           d2treg = kz;                                                                             
           d2va23 = 1;                                                                              
         when Tart(iA).zProb = kob and Tmag(Tart(iA).znMag).zMagEsp;   //Obsolets OB                
           d2treg = kz;                                                                             
           d2va05 = 1;                                                                              
         when Tart(iA).zProb = koc and Tmag(Tart(iA).znMag).zMagEsp;   //Obsolets OC                
           d2treg = kz;                                                                             
           d2va21 = 1;                                                                              
         when Tmag(Tart(iA).znMag).zMagEsp;                            //Articles B                 
           d2treg = kz;                                                                             
           d2va14 = 1;                                                                              
         when Tart(iA).znMag = iLmagME + 1; //Primera opció de magatzems                            
           d2treg = k0;                                                                             
           d2va23 = 1;                                                                              
         when Tart(iA).znMag = gDFTpos; // Magatzem per defecte                                     
           d2treg = k0;                                                                             
           d2va23 = 2;                                                                              
         when Tart(iA).znMag > iLmagME + 1; //Següent opció de magatzems                            
           d2treg = k0;                                                                             
           d2va23 = 3;                                                                              
         other;                                                                                     
           d2treg = kz;                                                                             
           d2va23 = 1;                                                                              
         endsl;                                                                                     
         // Movem la info de la clau                                                                
         d2cias = @pcias;                                                                           
         d2dlga = @pdlga;                                                                           
         d2npco = @pnpco;                                                                           
         d2tped = @ptped;                                                                           
         d2datp = @pdatp;                                                                           
         d2nopl = @pnopl;                                                                           
         d2line = Tart(iA).zLine;                                                                   
                                                                                                    
         write RDO0052W;                                                                            
                                                                                                    
         end-proc;                                                                                  
                                                                                                    
                                                                                                    
      //----------------------------------------------------------------------------------------    
      //GetVirtual                                                                                 
      //                                                                                            
      // Decidim si apliquem virtual o ho deixem tal qual                                           
         dcl-proc GetVirtual;                                                                       
         dcl-pi *n like(s5loge);  //Valor de retorn: logística                                      
           zA like(s5line);       //parm: posició on estem de Tart                                  
         end-pi;                                                                                    
                                                                                                    
         dcl-s xRetorn like(s5loge);                                                                
         dcl-s iM like(s5line);                                                                     
                                                                                                    
         xRetorn = Tart(zA).zLogFinal;         //Retornem el mateix valor per defecte               
                                                                                                    
         //if Tart(zA).zSiol <> k2 and Tart(zA).zTpe4 = k2;                                         
         select;                                                                                    
         when Tart(zA).zExcpt = *on; //assignat x excepció                                          
           if Tart(zA).zLogVirtual <> *blanks;     //Si tenim informat log virtual                  
             xRetorn = Tart(zA).zLogVirtual;       //El retornem                                    
           endif;                                                                                   
         when %trim(Tart(zA).zTpe4)= k2 and                                                         
           (cArt(zA).cMag(Tart(zA).znMag).cVal(kM1PROP) <> 1 and                                    
            cArt(zA).cMag(Tart(zA).znMag).cVal(kM1PROP) <> 2);                                      
           if Tart(zA).zLogVirtual <> *blanks;     //Si tenim informat log virtual                  
             xRetorn = Tart(zA).zLogVirtual;       //El retornem                                    
           endif;                                                                                   
         endsl;                                                                                     
                                                                                                    
         return xRetorn;                                                                            
                                                                                                    
         end-proc;                                                                                  
                                                                                                    
      //----------------------------------------------------------------------------------------    
      //Call1411                                                                                   
      //                                                                                            
      // Cerquem la logística virtual , sempre serà un tal1=8                                       
      // Cridem aquest codi sempre que el magatzem sigui tal1=8 durant la càrrega de magatzems      
      // Encara que NO sabem si aquest Mag serà emprat li cerquem el virtual. Si aquest Mag és      
      // emprat ja tindrem el valor i ens estalviem fer la crida a cada línia de comanda.           
      //                                                                                            
         dcl-proc Call1411;                                                                         
         dcl-pi *n like(s5loge);                                                                    
           zMag like (m0maga);                                                                      
           ztipo char(1) const;                                                                     
E7249      zDLGA like(s0dlga) const;                                                                
         end-pi;                                                                                    
                                                                                                    
         dcl-s cresp  like(@peresp);                                                                
         dcl-s xRetorn like(s5loge);                                                                
         dcl-s iM like(s5line);                                                                     
                                                                                                    
E7249    //pMM1411(s0cias:zMag:ztipo:s0dlga:cresp);                                                 
E7249    pMM1411(s0cias:zMag:ztipo:zDLGA:cresp);                                                    
         if cresp <> *blanks;                                                                       
           xRetorn = cresp;                                                                         
         endif;                                                                                     
         return xRetorn;                                                                            
                                                                                                    
         end-proc;                                                                                  
                                                                                                    
                                                                                                    
      //----------------------------------------------------------------------------------------    
      //GetCoenvio                                                                                 
      //                                                                                            
         dcl-proc GetCoenvio;                                                                       
         dcl-pi *n like(s5line);                                                                    
           //zCoe like(s5line);  // valor coenvio                                                   
           iA   like(s5line); //element de Tart                                                     
         end-pi;                                                                                    
                                                                                                    
         dcl-s xRetorn like(s5line);                                                                
                                                                                                    
                                                                                                    
         select;                                                                                    
         when gS0COEN = k0; // Coenvio 0: totes les línies amb el mateix valor = 00                 
           xRetorn = *zero;                                                                         
         when gS0COEN = k1; // Coenvio 1: totes les línies amb el mateix valor = 01                 
           xRetorn = 1;                                                                             
         when gS0COEN = k2; // Coenvio 2: línies agrupades per lógística                            
           //xRetorn = 1;    //   zCoe;                                                             
           xRetorn = SaveAmag(Tart(iA).znMag);                                                      
           //MUESGATION                                                                             
         when gS0COEN = k3; // Coenvio 3: totes les línies amb el mateix valor = 00                 
           xRetorn = *zero;                                                                         
         endsl;                                                                                     
                                                                                                    
         if Tart(iA).zSiol <> k2 and Tart(iA).zTpe4 = k2;                                           
           if %subst(P7AMP2:10:1) = k1;                                                             
             xRetorn = CS_EXCEPM3(iA:xRetorn);                                                      
           endif;                                                                                   
         endif;                                                                                     
                                                                                                    
         return xRetorn;                                                                            
                                                                                                    
         end-proc;                                                                                  
                                                                                                    
                                                                                                    
      //----------------------------------------------------------------------------------------    
      //CS_EXCEPM3: cerca excepció M3                                                              
         dcl-proc CS_EXCEPM3;                                                                       
         dcl-pi *n like(s5line);                                                                    
          iA like(s5line);  //posició de Tart                                                       
          iActual like(s5line);  //valor actual                                                     
         end-pi;                                                                                    
         dcl-s xRetorn like(s5line) inz;                                                            
                                                                                                    
         xRetorn = iActual;                                                                         
                                                                                                    
         if Tart(iA).zExcpt;   // assignat per excepció                                             
           return xRetorn;                                                                          
         endif;                                                                                     
                                                                                                    
         if Tmag(Tart(iA).znMag).zPrvr <> *blanks;                                                  
           C3prvr = Tmag(Tart(iA).znMag).zPrvr ;                                                    
         else;                                                                                      
           C3prvr = Tart(iA).zPrvr ;                                                                
         endif;                                                                                     
         C3arvm = Tart(iA).zArti + Tart(iA).zVari + Tart(iA).zMode;                                 
         chain (@pcias:C3prvr:C3arvm) puprp0;                                                       
         if %found(puprp0);                                                                         
           @PEdprvr = C3prvr;                                                                       
           if C3ARVP<>*BLANKS;                                                                      
             @PEdARVP = C3ARVP;                                                                     
           else;                                                                                    
             @PEdARVP = C3arvm;                                                                     
           endif;                                                                                   
         else;                                                                                      
           @PEdARVP = C3arvm;                                                                       
IT228      @PEdPRVR = Tart(iA).zPrvr ;                                                              
         endif;                                                                                     
         if Tmag(Tart(iA).znMag).zLogVirtual <> *blanks;                                            
           @PEdAlm1= Tmag(Tart(iA).znMag).zLogVirtual ;                                             
         else;                                                                                      
           @PEdAlm1= Tmag(Tart(iA).znMag).zLoge ;                                                   
         endif;                                                                                     
IT228 *                                                                                    Z        
IT228C                   CALL      'ED2530'                                                Z        
IT228C                   PARM                    @pCIAS                                    Z        
IT228C                   PARM                    @pedprvr                                  Z        
IT228C                   PARM                    @PEdARVP                                  Z        
IT228C                   PARM                    @PEdALM1                                  Z        
IT228C                   PARM                    @PEdALM2                                  Z        
IT228C                   PARM                    @PEINFO                                   Z        
IT228 *                                                                                    Z        
IT228C                   IF        @PEINFO='A' OR @PEINFO='P'                   1          Z        
            xRetorn = 0;                                                                            
IT228 *                                                                         I          Z        
IT228C                   ENDIF                                                  1          Z        
IT228 *                                                                                             
                                                                                                    
            return xRetorn;                                                                         
                                                                                                    
                                                                                                    
         end-proc;                                                                                  
                                                                                                    
                                                                                                    
      //----------------------------------------------------------------------------------------    
      //GetMsg: Agafem el texte                                                                    
         dcl-proc GetMsg;                                                                           
         dcl-pi *n like(@ptitulo);                                                                  
          xmsgID like(p_msgID) value;                                                               
         end-pi;                                                                                    
         // Variables pel RTVMSGTXT                                                                 
         dcl-s   p_library char(10) inz('*LIBL     ');                                              
         dcl-s   p_msgf char(10)    inz('ASGMSG    ');                                              
         dcl-s   p_msgID char(10) ;                                                                 
         dcl-s   p_msgdata char(500) inz;                                                           
         dcl-s   p_msgTEXT like(string_t);                                                          
         dcl-s   string_t varchar(2048) template;                                                   
                                                                                                    
         dcl-s xRetorn like(@ptitulo) inz;                                                          
         //RtvMsgTxt: Recupera texte de missage file                                               
         dcl-pr pRtvMsgTxt     extpgm('RTVMSGTXT');                                                 
           *n like(p_library);                                                                      
           *n like(p_msgF);                                                                         
           *n like(p_msgID);                                                                        
           *n like(p_msgData);                                                                      
           *n like(string_t);                                                                       
         end-pr;                                                                                    
                                                                                                    
             p_msgID = xmsgID;                                                                      
             pRtvMsgTxt(p_library:p_msgf:p_msgID:p_msgdata:p_msgTEXT);                              
             xRetorn  = %trim(p_msgTEXT);                                                           
                                                                                                    
             return xRetorn;                                                                        
                                                                                                    
         end-proc;                                                                                  
                                                                                                    
                                                                                                    
      //----------------------------------------------------------------------------------------    
      //ValNlin: número de línies                                                                  
         dcl-proc ValNlin;                                                                          
         dcl-pi *n like(s5line);                                                                    
          pDsArt likeds(dsArt);        // Fitxa article                                             
          piM like(s5line);            // Número (posició) del magatzem                             
          piActual like(s5line);       // Valor actual d'aquesta validació                          
          piDispo  like(s5line);       // Valor validació disponible                                
         end-pi;                                                                                    
         dcl-s xRetorn like(s5line) inz(*zero);                                                     
                                                                                                    
          // Comprovacions independents del tipus de validació;                                     
          xRetorn = ChkValorsActuals(pDsArt:piM:piActual);                                          
          if xRetorn <> 999; // Ja hem decidit o ja teniem valor                                    
            return xRetorn;                                                                         
          endif;                                                                                    
                                                                                                    
          // Sols per magatzems locals, tal1 < 8                                                    
          select;                                                                                   
          when Tmag(piM).zOctL; //Omit ctl línies activat                                           
            xRetorn = 1;                                                                            
          when TMag(piM).ztal1 < k7 and piDispo = 1; // maga Locals i que tinguin estoc             
            if TMag(piM).zMLiz < TMag(piM).zMlin; // lin.Max < lin actuals + les calculades         
              TMag(piM).zMliz += 1;                                                                 
              xRetorn = 1;                                                                          
            else;                                                                                   
              xRetorn = 0;                                                                          
            endif;                                                                                  
          when TMag(piM).ztal1 < k7 and piDispo<> 1; // maga Locals i que NO tinguin estoc          
            xRetorn = 0;                                                                            
          other;                                                                                    
            xRetorn = 1;                                                                            
          endsl;                                                                                    
          return xRetorn;                                                                           
         end-proc;                                                                                  
                                                                                                    
      //----------------------------------------------------------------------------------------    
      //ValED51: Pot ser ED? sols per m0tal1 = 8                                                   
         dcl-proc ValED51;                                                                          
         dcl-pi *n like(s5line);                                                                    
          pDsArt likeds(dsArt);                                                                     
          piM like(s5line);                                                                         
          piActual like(s5line);                                                                    
          piM1prop like(s5line);                                                                    
          pixInci  like(s5line);                                                                    
         end-pi;                                                                                    
         dcl-pr pED0051 extpgm('ED0051');                                                           
            *n like(s0cias) const;                                                                  
            *n like(s0dlga) const;                                                                  
            *n like(s0npco) const;                                                                  
            *n like(s0tped) const;                                                                  
            *n like(s0datp) const;                                                                  
            *n like(s0nopl) const;                                                                  
            *n like(s5line) const;                                                                  
            *n like(xdarv1) const;                                                                  
            *n like(xdcom2) const;                                                                  
            *n like(s0cust) const;                                                                  
            *n like(s5tdi1) const;                                                                  
            *n char(3) const;                                                                       
            *n like(xlogi) const;                                                                   
            *n like(xorig) const;                                                                   
            *n like(xInte) const;                                                                   
            *n like(xPerro);                                                                        
            *n like(xInci);                                                                         
            *n like(xLoge);                                                                         
         end-pr;                                                                                    
         dcl-s xdarv1 like(@fdarv1) inz;                                                            
         dcl-s xdcom2 like(@fdarv1) inz;                                                            
         dcl-s xLogi  like(@plogi) inz;                                                             
         dcl-s xOrig like(@porig) inz;                                                              
         dcl-s xInte like(@pinte) inz(1);                                                           
         dcl-s xPerro like(@perro) inz;                                                             
         dcl-s xInci  like(@pinci) inz;                                                             
         dcl-s xLoge  like(s0loge) inz;                                                             
         dcl-s xLine  like(s5line) inz;                                                             
         dcl-s xRetorn like(s5line) inz(*zero);                                                     
                                                                                                    
          // Comprovacions independents del tipus de validació;                                     
          xRetorn = ChkValorsActuals(pDsArt:piM:piActual);                                          
          if xRetorn <> 999; // Ja hem decidit o ja teniem valor                                    
            return xRetorn;                                                                         
          endif;                                                                                    
                                                                                                    
          // Sols per magatzems logístics, tal1 = 7 o 8                                             
          select;                                                                                   
          when TMag(piM).ztal1 = k7 or TMag(piM).ztal1 = k8;                                        
            // Cridem al ED0051 per validar-ho                                                      
            // Si tenim proveïdor del magatzem l'utilitzem. En cas contrari el de l'article         
            if Tmag(piM).zPrvr <> *blanks;                                                          
              if piM1prop = 1 or piM1prop = 2;                                                      
                xLoge = Tmag(piM).zLoge;                                                            
              else;                                                                                 
                xLoge = Tmag(piM).zLogVirtual;                                                      
              endif;                                                                                
            else;                                                                                   
              xLoge = *blanks;                                                                      
            endif;                                                                                  
            if pDsArt.zNoed = k1; //muesga, article NO accepta ED                                   
              xRetorn = 0;                                                                          
            else;                                                                                   
              pED0051(@pcias:@pdlga:@pnpco:@ptped:@pdatp:@pnopl:                                    
                    pDsArt.zLine:xdarv1:xdcom2:s0cust:pDsArt.zTdi1:                                 
                     '403':xLogi:xOrig:xInte:xPerro:xInci:xLoge);                                   
              if xInci = k003 or xInci = k005 or xInci = k019 or xInci=k060;                        
                xRetorn = 0;                                                                        
              else;                                                                                 
                xRetorn = 1;                                                                        
              endif;                                                                                
              pixInci = atoi(xInci);                                                                
          //  if xPerro <> *blanks;                                                                 
          //    if pDsArt.zLine <> 0;                                                               
          //      xLine = pDsArt.zLine;                                                             
          //      exec sql                                                                          
          //        update ed0050w set t2inci=:xInci                                                
          //        where t2line = :xLine;                                                          
          //    endif;                                                                              
          //  endif;                                                                                
            endif;                                                                                  
          other;                                                                                    
            xRetorn = 1;                                                                            
          endsl;                                                                                    
          return xRetorn;                                                                           
         end-proc;                                                                                  
                                                                                                    
      //----------------------------------------------------------------------------------------    
      //ValidaNoPE: Valida si NO conta punt entrega. Sols ME (magatzems especials: ArtiB/Obso)     
         dcl-proc ValidaNoPE;                                                                       
         dcl-pi *n like(s5line);                                                                    
          pDsArt likeds(dsArt);                                                                     
          iM like(s5line);                                                                          
          xAnterior like(s5line); //Valor del row kFinal                                            
         end-pi;                                                                                    
         dcl-s xRetorn like(s5line) inz(*zero);                                                     
                                                                                                    
          // Si les validacions anterior són 0 posem 0                                              
          if xAnterior = 0;                                                                         
            return 0;                                                                               
          endif;                                                                                    
          // Si ja el tenim assignat (per except) forcem a 0                                        
          if pDsArt.zLogFinal <> *blanks;                                                           
            return 0;                                                                               
          endif;                                                                                    
                                                                                                    
E7139     xRetorn = 0; //Phase3 add                                                                 
          // Sols per ME (magatzems especial)                                                       
          select;                                                                                   
          when pDsArt.zProb = kOB;                                                                  
            if Tmag(iM).zaoeOB = k1;    // No conta punt                                            
              if (pDsArt.zCost * pDsArt.zCan2) > Tmag(iM).zairOB ;  //Control cost                  
                xRetorn = 1;                                                                        
              endif;                                                                                
            else;                                                                                   
              xRetorn = 0;                                                                          
            endif;                                                                                  
          when pDsArt.zProb = kOC;                                                                  
            if Tmag(iM).zaoeOC = k1;  //No conta punt                                               
              if (pDsArt.zCost * pDsArt.zCan2) > Tmag(iM).zairOC ;  //Control cost                  
                xRetorn = 1;                                                                        
              endif;                                                                                
            else;                                                                                   
              xRetorn = 0;                                                                          
            endif;                                                                                  
          other;                                                                                    
            if Tmag(iM).zaoeAB = k1;                                                                
              if (pDsArt.zCost * pDsArt.zCan2) > Tmag(iM).zairAB ;  //Control cost                  
                xRetorn = 1;                                                                        
              endif;                                                                                
E7139         //  else;                                                                             
E7139         //   xRetorn = 0;                                                                     
            endif;                                                                                  
E7139       if Tmag(iM).zaoeSS = k1;                                                                
E7139                                                                                               
E7139         //chain (cia:maga:arti:vari:mode) msstok; //Hem fet la lectura en ValExist            
E7139         if %found(msstok);                                                                    
E7139         // Nota: p_Stock es calcula en ValDisp i és variable global                           
E7139           if (Tmag(iM).zpsMax * m1smax) > (p_Stock - pDsArt.zCan2)                            
E7139              or m1smax = 0;                                                                   
E7139            xRetorn = 0;                                                                       
E7139           else;                                                                               
E7139             if (pDsArt.zCost * pDsArt.zCan2) > Tmag(iM).zairSS ; // SS                        
E7139               xRetorn = 1;                                                                    
E7139             endif;  //zairSS                                                                  
E7139           endif;  // m1smax                                                                   
E7139         endif;  // %found                                                                     
E7139       endif;  // zaoeSS                                                                       
          endsl;                                                                                    
                                                                                                    
          return xRetorn;                                                                           
         end-proc;                                                                                  
                                                                                                    
      //----------------------------------------------------------------------------------------    
      //ValidaFinalME: Validació final per magatzems especials                                     
         dcl-proc ValidaFinalME;                                                                    
         dcl-pi *n like(s5line);                                                                    
          xValid like(s5line);                                                                      
          xAnterior like(s5line);                                                                   
         end-pi;                                                                                    
         dcl-s xRetorn like(s5line) inz(*zero);                                                     
                                                                                                    
          select;                                                                                   
          when xValid =  1 and xAnterior = 1;                                                       
            xRetorn = 1;                                                                            
          when xValid <> 1 and xAnterior = 1;                                                       
            xRetorn = 0;                                                                            
          when xValid =  1 and xAnterior <> 1;                                                      
            xRetorn = 0;                                                                            
          when xValid <> 1 and xAnterior <> 1;                                                      
            xRetorn = 0;                                                                            
          endsl;                                                                                    
          // Sip, ho sé: innecessari. M'agrada deixar-ho clar i lligat.                             
                                                                                                    
          return xRetorn;                                                                           
         end-proc;                                                                                  
      //----------------------------------------------------------------------------------------    
      //ValidaGrpArtMag: Acumula Validacions per Arti/Maga                                         
         dcl-proc ValidaGrpArtMag;                                                                  
         dcl-pi *n;                                                                                 
          piA like(s5line);  //posició Tart                                                         
          piM like(s5line);  //posició Tmag                                                         
         end-pi;                                                                                    
         dcl-s iI like(s5line) inz;                                                                 
         //dcl-s xA like(s5line) inz;                                                               
         //dcl-s xM like(s5line) inz;                                                               
         dcl-s iacumula like(s5line) inz;                                                           
                                                                                                    
          // Si ja tenim valor NO importa, el MODIFIQUEM sempre.                                    
          // Per TOTS els magatzems, logístics o no, per ArtiB/Obso                                 
          // Acumulem validacions parcials                                                          
          // Parcial 1 : Existencia, Disponibilitat, ED51 i Nlin                                    
          if cArt(piA).cMag(piM).cVal(kExist) = 1   and                                             
             cArt(piA).cMag(piM).cVal(kED51)  = 1   and                                             
             cArt(piA).cMag(piM).cVal(kDispo) = 1   and                                             
             cArt(piA).cMag(piM).cVal(knlin) = 1;                                                   
            Cart(piA).CMag(piM).CVal(kFinalP1) = 1;                                                 
          else;                                                                                     
            Cart(piA).CMag(piM).CVal(kFinalP1) = 0;                                                 
          endif;                                                                                    
          // Parcial 2 : Existencia, ED51 i Nlin                                                    
          if cArt(piA).cMag(piM).cVal(kExist) = 1   and                                             
             cArt(piA).cMag(piM).cVal(kED51)  = 1   and                                             
             cArt(piA).cMag(piM).cVal(knlin) = 1;                                                   
            Cart(piA).CMag(piM).CVal(kFinalP2) = 1;                                                 
          else;                                                                                     
            Cart(piA).CMag(piM).CVal(kFinalP2) = 0;                                                 
          endif;                                                                                    
                                                                                                    
          // kFinal ha d'esser sempre el darrer pis de les validacions                              
          for iI = 1 to kFinal-1;                                                                   
            iacumula +=  Cart(piA).CMag(piM).CVal(iI) ;                                             
          endfor;                                                                                   
                                                                                                    
          if iacumula = (kFinal-1); // Totes les validacions tenen 1                                
            Cart(piA).CMag(piM).CVal(kFinal) = 1;                                                   
          else;                                                                                     
            Cart(piA).CMag(piM).CVal(kFinal) = 0;                                                   
          endif;                                                                                    
                                                                                                    
         end-proc;                                                                                  
                                                                                                    
      //----------------------------------------------------------------------------------------    
      //ValidaFinal: Acumula Validacions a nivell Maga                                             
         dcl-proc ValidaFinal;                                                                      
         dcl-pi *n end-pi;                                                                          
         dcl-s iM like(s5line) inz; // Posició Mag                                                  
         dcl-s iV like(s5line) inz; // Posició Pis (Valida)                                         
         dcl-s iA like(s5line) inz; // Posició Pis (Valida)                                         
         dcl-s iacumula like(s5line) inz;                                                           
                                                                                                    
          // Si ja tenim valor NO importa, el MODIFIQUEM sempre.                                    
                                                                                                    
          // Per TOTS els magatzems, logístics o no, per ArtiB/Obso                                 
          // kFinalME ha d'esser sempre el darrer pis de les validacions                            
          //  Després venen els pisos d'acumulats que omplim aquí                                   
          for iM = 1 to iLmag;                                                                      
            for iV = 1 to kFinalME;                                                                 
              iacumula = *zero;                                                                     
              for iA = 1 to iLarti;                                                                 
                iacumula +=  Cart(iA).CMag(iM).CVal(iV) ;                                           
              endfor;                                                                               
              // Assignem el valor en la darrera fila: iLarti + 1                                   
              Cart(iLarti + 1).CMag(iM).Cval(iV) = iacumula;                                        
            endfor;                                                                                 
          endfor;                                                                                   
                                                                                                    
          // Tindrem, el la posició iLarti + 1, el sumatori de línies que compleixen la condició    
          // I en el pis kFinal, el darrer de condicions/validacions, el sumatori de les línies     
          //  que compleixen TOTES les condicions.                                                  
          // I en el pis kFinalME els que compleixen TOTES les condicions i no conta Punt expedi    
          //  pels magatzems especials (ME): ArtiB/Obso                                             
          // I en el pis kFinalP1 i kFinalP2 els que copleixen les condicions parcials de cada c    
                                                                                                    
         end-proc;                                                                                  
                                                                                                    
      //----------------------------------------------------------------------------------------    
      //ComputeConjunt: Càlcul de cada component del conjunt                                       
      // Crearem un cub sols pels components del conjunt.                                           
      // Els magatzems són els mateixos que ja hem carregat. Sols queda carregar els                
      //  articles en una taula nova.                                                               
      // I realitzar TOTES les validacions (que són les mateixes) i després passar els resultats    
      //  al cub principal                                                                          
      //                                                                                            
         dcl-proc ComputeConjunt;                                                                   
         dcl-pi *n;                                                                                 
          piA like(s5line); // Article Conjunt: element de Tart.                                    
         end-pi;                                                                                    
E7139 //       dcl-c kMaxCom const(20); // màxim components : passem a var global                   
         dcl-s iC like(s5line) inz;                                                                 
         dcl-s iM like(s5line) inz;                                                                 
         dcl-s iV like(s5line) inz;                                                                 
         dcl-s iLCom like(s5line) inz(*zero);                                                       
         dcl-s iacumula like(s5line) inz;                                                           
         dcl-s iProp   like(s5line) inz;                                                            
         dcl-s bkPROC  like(s5line) inz; // Var per guardar el PROC real                            
olfgi    dcl-s oExcpt like(s5line) inz(*zero); // per guardar el Total de Lin x Except              
olfgi    dcl-s wExcpt  like(s5line) inz(*zero);                                                     
olfgi    dcl-s wLogFinal like(s5loge) inz(*blanks);                                                 
olfgi    dcl-s wLogVirtual like(s5loge) inz(*blanks);                                               
       //Dimensió Components                                                                       
       //  Dimensió Magatzems                                                                      
       //    Dimensió Validacions                                                                  
       dcl-ds xCom qualified dim(kMaxCom); // Aquest cub és molt més petit                          
         dcl-ds xMag dim(kMaxMag); //                                                               
           xVal like(s5line) inz(999) dim(kMaxVal);                                                 
         end-ds;                                                                                    
       end-ds;                                                                                      
       //   xCom(x).xMag(y).xVal(z)  = ....                                                        
olfgi  // Guardem el número de línies assignades x excepció ja que el procés de components pot      
olfgi  // modificar aquest valor i perdem la realitat                                               
olfgi    oExcpt = iExcpt;                                                                           
                                                                                                    
       // 1er: carregar components en TCom                                                          
         iLCom = LoadCom(piA);                                                                      
olfgi  // Retornem el valor de línies assignades x excepció                                         
olfgi    iExcpt = oExcpt;                                                                           
                                                                                                    
       // 2on: realitzar les validacions                                                            
       // Per tal que les validacions siguin correctes i ja que són les mateixes que s'utilitzem    
       // pels articles, les enganyem modificant el valor de gPROC                                  
       // ja que per AddLin o ForcedLin no funciona per components                                  
                                                                                                    
          bkPROC = gPROC; // guardem valor actual                                                   
          gPROC =  kPROCsimulacio;  //modifiquem el valor. Confirmació també serviria               
                                                                                                    
          // Realitzem les validacions de cada 'pis' del cub                                        
          for iC = 1 to iLCom; // per tots els components carregats                                 
             for iM = 1 to iLmag; // per tots els magatzems carregats                               
                                                                                                    
              // 1er.- Existencia de l'article                                                      
              xCom(iC).xMag(iM).xVal(kExist) =                                                      
                ValExist(TCom(iC):iM:xCom(iC).xMag(iM).xVal(kExist):                                
                         xCom(iC).xMag(iM).xVal(kM1PROP));  //Element per guardar Propietat         
              // 2on.- Disponible                                                                   
              xCom(iC).xMag(iM).xVal(kDispo) =                                                      
                ValDisp(TCom(iC):iM:xCom(iC).xMag(iM).xVal(kDispo));                                
              // 3er.- Data horitzó                                                                 
              xCom(iC).xMag(iM).xVal(kFrep) =                                                       
                ValFhor(TCom(iC):iM:xCom(iC).xMag(iM).xVal(kFrep) );                                
              // 4rt.- Pesos, Volumns...                                                            
              xCom(iC).xMag(iM).xVal(kPesVol) =                                                     
                ValPesVol(TCom(iC):iM:xCom(iC).xMag(iM).xVal(kPesVol));                             
              // 5é .- Proveïdor                                                                    
              xCom(iC).xMag(iM).xVal(kProv) =                                                       
                ValProv(TCom(iC):iM:xCom(iC).xMag(iM).xVal(kProv));                                 
              // Si el prov no passa ja no farem la crida al ED51                                   
              if xCom(iC).xMag(iM).xVal(kProv) = 0;                                                 
                 xCom(iC).xMag(iM).xVal(kED51) = xCom(iC).xMag(iM).xVal(kProv);                     
              endif;                                                                                
              // 6é .- Número línies assignades                                                     
              xCom(iC).xMag(iM).xVal(kNLin) =                                                       
                ValNlin(TCom(iC):iM:xCom(iC).xMag(iM).xVal(kNLin):                                  
                                    xCom(iC).xMag(iM).xVal(kDispo));                                
              // 7é .- Possible FD (ED0051)                                                         
              xCom(iC).xMag(iM).xVal(kED51) =                                                       
              //ValED51(TCom(iC):iM:xCom(iC).xMag(iM).xVal(kED51):                                  
                ValED51(TArt(piA):iM:xCom(iC).xMag(iM).xVal(kED51):                                 
                         xCom(iC).xMag(iM).xVal(kM1PROP):      //Element per guardar Propietat      
                         xCom(iC).xMag(iM).xVal(kxInci));    //Element per guardar xInci del ED0    
              // 8é .- Acumula Validacions per Art/Mag: si aquesta combinacio Art/Mag supera tot    
              //                       les validacions.                                             
               exsr ValidaGrpArtMagCom;                                                             
              // Sols per ME (magatzems especials: ArtiB/Obso)                                      
            //if gChkArtiB or bTenimObsoCom; //Tenim component obsolet                              
                // 9é .- Valida si NO conta PE pel ME                                               
                xCom(iC).xMag(iM).xVal(kNoPE) =                                                     
                  ValidaNoPE(TCom(iC):iM:xCom(iC).xMag(iM).xVal(kFinal));                           
                //10é .- Valida Final ME                                                            
                xCom(iC).xMag(iM).xVal(kFinalME) =                                                  
                  ValidaFinalME(xCom(iC).xMag(iM).xVal(kFinal):                                     
                                xCom(iC).xMag(iM).xVal(kNoPE) );                                    
            //endif;                                                                                
                                                                                                    
             endfor; // bucle Magatzems                                                             
          endfor; // Bucle articles                                                                 
                                                                                                    
          gPROC = bkPROC; // restaurem el valor de Procés                                           
                                                                                                    
       // 3er: passar valors a cub principal                                                        
          exsr MouConjunt;                                                                          
                                                                                                    
          return;                                                                                   
                                                                                                    
                                                                                                    
          // sbr propies                                                                            
                                                                                                    
          // Passem la info final al cub principal                                                  
          // Per tal que un article conjunt sigui valid (1) tots els seus components han de ser     
          //  valids pel mateix magatzem/validació                                                  
                                                                                                    
          begsr MouConjunt;                                                                         
                                                                                                    
            for iM = 1 to iLmag;                                                                    
              for iV = 1 to kFinalME;                                                               
                iacumula = *zero;                                                                   
                for iC = 1 to iLCom;                                                                
                  iacumula += xCom(iC).xMag(iM).xVal(iV);                                           
                endfor;                                                                             
                if iacumula = iLCom; //Si tots els components per aquest maga han passat aquesta    
                                    // validació tindrem el mateix valor que el número de compon    
                                   // Per tant l'article conjunt passa aquesta validació per aqu    
                                  // magatzem.                                                      
                  CArt(piA).CMag(iM).CVal(iV) = 1;                                                  
                else;                                                                               
                  CArt(piA).CMag(iM).CVal(iV) = 0;                                                  
                endif;                                                                              
              endfor;                                                                               
              // per m1prop                                                                         
              if Tmag(iM).ztal1 = k8 or Tmag(iM).ztal1 = k7;                                        
                iProp = 2;                                                                          
                for iC = 1 to iLCom;                                                                
                  if xCom(iC).xMag(iM).xVal(kM1PROP) <> 1 and                                       
                     xCom(iC).xMag(iM).xVal(kM1PROP) <> 2;                                          
                     iProp = *zero;                                                                 
                  endif;                                                                            
                endfor;                                                                             
                CArt(piA).CMag(iM).CVal(kM1PROP) = iProp;                                           
              endif;                                                                                
            endfor;                                                                                 
olfgi       // Darrera volta: si tots els componets s'han assignat per excepció                     
olfgi       for iC = 1 to iLCom;                                                                    
olfgi         if TCom(iC).zExcpt ;                                                                  
olfgi           if wLogFinal = *blanks or wLogFinal=Tcom(iC).zLogFinal;                             
olfgi             wExcpt +=1;                                                                       
olfgi             wLogFinal = TCom(iC).zLogFinal;                                                   
olfgi             wLogVirtual= TCom(iC).zLogVirtual;                                                
olfgi           endif;                                                                              
olfgi         endif;                                                                                
olfgi       endfor;                                                                                 
olfgi       // Si tots els components s'han assignat a la mateixa logística x excepció el kit       
olfgi       //   l'hem d'assignar a aquesta logística                                               
olfgi       if wExcpt = iLCom; //total línies assignades x excepció = total components              
olfgi         Tart(piA).zExcpt=*on;                                                                 
olfgi         Tart(piA).zLogFinal= wLogFinal;                                                       
olfgi         Tart(piA).zLogVirtual=wLogVirtual;                                                    
olfgi         iExcpt +=1;                                                                           
olfgi       endif;                                                                                  
            //Per xInci                                                                             
            //iInci = *zeros;                                                                       
            //for iM = 1 to iLmag;                                                                  
            //  if Tmag(iM).ztal1=k8 or Tmag(iM).ztal1=k7;                                          
            //    for iC = 1 to iLCom;                                                              
            //      if xCom(iC).xMag(iM).xVal(kxInci) <> 999 and                                    
            //         xCom(iC).xMag(iM).xVal(kxInci) <> *zero;                                     
            //        iInci = xCom(iC).xMag(iM).xVal(kxInci);                                       
            //      endif;                                                                          
            //    endfor;                                                                           
            //    CArt(piA).CMag(iM).CVal(kxInci) = iInci;                                          
            //    iInci = *zeros;                                                                   
            //  endif;                                                                              
            //endfor;                                                                               
          endsr;                                                                                    
                                                                                                    
          // 'Acumulem' validacions                                                                 
          begsr ValidaGrpArtMagCom;                                                                 
            // Per TOTS els magatzems, logístics o no, per ArtiB/Obso                               
            // kFinal ha d'esser sempre el darrer pis de les validacions                            
            // Acumulem validacions parcials                                                        
            // Parcial 1 : Existencia, Disponibilitat, ED51 i Nlin                                  
            if xCom(iC).xMag(iM).xVal(kExist) = 1   and                                             
               xCom(iC).xMag(iM).xVal(kED51)  = 1   and                                             
               xCom(iC).xMag(iM).xVal(kDispo) = 1   and                                             
               xCom(iC).xMag(iM).xVal(knlin) = 1;                                                   
              xCom(iC).xMag(iM).xVal(kFinalP1) = 1;                                                 
            else;                                                                                   
              xCom(iC).xMag(iM).xVal(kFinalP1) = 0;                                                 
            endif;                                                                                  
            // Parcial 2 : Existencia, ED51 i Nlin                                                  
            if xCom(iC).xMag(iM).xVal(kExist) = 1   and                                             
               xCom(iC).xMag(iM).xVal(kED51)  = 1   and                                             
               xCom(iC).xMag(iM).xVal(knlin) = 1;                                                   
              xCom(iC).xMag(iM).xVal(kFinalP2) = 1;                                                 
            else;                                                                                   
              xCom(iC).xMag(iM).xVal(kFinalP2) = 0;                                                 
            endif;                                                                                  
            //Obsolets i Conjunt no lliguen, com l'aigua i l'oli                                    
            xCom(iC).xMag(iM).xVal(kFinalME) = 0;                                                   
            xCom(iC).xMag(iM).xVal(kNoPE) = 0;                                                      
            // Acumulem per final                                                                   
            iacumula = *zero;                                                                       
            for iV = 1 to kFinal-1;                                                                 
              iacumula +=  xCom(iC).xMag(iM).xVal(iV) ;                                             
            endfor;                                                                                 
                                                                                                    
            if iacumula = (kFinal-1); // Totes les validacions tenen 1                              
              xCom(iC).xMag(iM).xVal(kFinal) = 1;                                                   
            else;                                                                                   
              xCom(iC).xMag(iM).xVal(kFinal) = 0;                                                   
            endif;                                                                                  
                                                                                                    
          endsr;                                                                                    
                                                                                                    
                                                                                                    
         end-proc;                                                                                  
                                                                                                    
      //----------------------------------------------------------------------------------------    
      //LoadCom: carrega taula components                                                          
      //                                                                                            
         dcl-proc LoadCom;                                                                          
         dcl-pi *n like(s5line);  // Retorn número de components carregats                          
          piA like(s5line); // Article Conjunt: element de Tart.                                    
         end-pi;                                                                                    
         dcl-s iI like(s5line) inz(*zero);                                                          
         // Vars pròpies                                                                            
         dcl-s bOk ind;                                                                             
                                                                                                    
           open mscojd;                                                                             
           // Lectura MSCOJD                                                                        
           setll (@pcias:Tart(piA).zArti:                                                           
                 Tart(piA).zVari:Tart(piA).zMode:k4) mscojd;                                        
           reade (@pcias:Tart(piA).zArti:                                                           
                 Tart(piA).zVari:Tart(piA).zMode:k4) mscojd;                                        
           bOk =*on;                                                                                
           dow not %eof(mscojd);                                                                    
             if ndbaja <> k1;                                                                       
                                                                                                    
               //Dades addicionals                                                                  
               chain (ndcomp:ndvar2:ndmod2) msarti;                                                 
                                                                                                    
               // En aquest punt sempre carreguem dades                                             
               iI += 1;                                                                             
               GuardaArticle(TCom(iI));                                                             
               TCom(iI).zCant = Tart(piA).zCant * ndcant;                                           
               TCom(iI).zCan2 = Tart(piA).zCan2 * ndcant;                                           
             //TCom(iI).zProb = ChkObsoleto();                                                      
               exsr CercaExcept;                                                                    
             //if TCom(iI).zProb <> *blanks;                                                        
             //  bTenimObsoCom = *on;                                                               
             //endif;                                                                               
             endif;                                                                                 
             reade (@pcias:Tart(piA).zArti:                                                         
                 Tart(piA).zVari:Tart(piA).zMode:k4) mscojd;                                        
           enddo;                                                                                   
           close mscojd;                                                                            
           return iI;                                                                               
                                                                                                    
         begsr CercaExcept;                                                                         
             // Restriccions d'article, de proveïdor                                                
             if TCom(iI).zLogFinal = *blanks; //si no ho tenim assignat                             
               t4arvt = Tcom(iI).zArti + TCom(iI).zVari + TCom(iI).zMode ;                          
               t4prio = 1;                                                                          
               //Nivell article                                                                     
               if GetExcept(@pcias:kC :@pdlga:*blanks:t4arvt:*blanks:t4prio:                        
                 TCom(iI))= *off;                                                                   
                 // Nivell prov                                                                     
                 GetExcept(@pcias:kB:@pdlga:m5prvr:*blanks:*blanks:t4prio:                          
                   TCom(iI));                                                                       
               endif;                                                                               
             endif;                                                                                 
         endsr;                                                                                     
                                                                                                    
         end-proc;                                                                                  
                                                                                                    
      //----------------------------------------------------------------------------------------    
      //ProcessaME: processa magatzems especials                                                   
      // Donem sortida a totes les línies de ME que NO carreguin punt expedició                     
      // No ens preocupem de controlar PE, donem sortida a TOT el que es pugui                      
         dcl-proc ProcessaME;                                                                       
         dcl-pi *n end-pi;                                                                          
         dcl-s iM like(s5line) inz;                                                                 
                                                                                                    
E7139    // Txurr_Save('ProcessaME':*on:Simon_tx);                                                  
E7139    // Txurr_Save('->iLPEND:'+ %char(iLPEND):*off:Simon_tx);                                   
E7139    Txurr_Save(GetMsg(kmsg0040):*on:Simon_tx); // 'Special Warehouses Process'                 
                                                                                                    
         iM = FindMax(iLarti+1:kFinalME:1:iLmagME); // Cerquem ME                                   
         dow iM <> 0;                                                                               
          if ValidaMaga(iM:kFinalME); // Validem imports per magatzem (sumatori línies)             
E7139       //Txurr_Save('->Assign:'+ %char(iM):*off:Simon_tx);                                     
E7139       Txurr_Save(cRWh+'>'+cNGr+                                                               
E7139           %editc(CArt(iLarti+1).CMag(iM).CVal(kFinalME):'X') +                                
E7139           %trim(GetMsg(kmsg0042))+ ' '+                                                       
E7139           %trim(GetMsg(kmsg0029))+ ': ' + Tmag(iM).zMaga :*off:Simon_tx);                     
            AssignaMag(iM:kFinalME);        // Assignem les línies al magatzem                      
          else;                                                                                     
            RessetMag(iM:kFinalME); // Inicialitzem el pis d'aquest maga per no utilitzar-l'ho      
          endif;                                                                                    
          iM = FindMax(iLarti+1:kFinalME:1:iLmagME); // Cerquem següent ME                          
         enddo;                                                                                     
                                                                                                    
E7139    //Txurr_Save('<-iLPEND:'+ %char(iLPEND):*off:Simon_tx);                                    
E7139    Txurr_Save(%trim(GetMsg(kmsg0037))+':'+ %char(iLPEND):*off:Simon_tx);                      
                                                                                                    
         end-proc;                                                                                  
                                                                                                    
      //----------------------------------------------------------------------------------------    
      //Processa: processa magatzems                                                               
      // Donem sortida a totes les línies per un PE                                                 
      // Sortirem del bucle quan:                                                                   
      //       - Hem assignat línies a un PE                                                        
      //       - NO hem pogut assignar res de res                                                   
      // Si NO hem pogut assignar ens cridem a nosaltres mateixos reduïnt criteris                  
      // Si SI hem pogut assignar sortim                                                            
      //                                                                                            
      // Els criteris de validació els tenim en la taula TLevel. Aquesta taula sols té el valor     
      //  del pis que agafem com referent de validació.                                             
      // Per exemple, tenim en TLevel els valors 08, 09 i 10 que corresponent a kFinal,kFinalP1     
      // (Nota:sols tenim 3 nivells de validació, per tant mai ens cridarem amb un valor superio    
      //                                                                                            
      // En el bucle principal valida si queden PE utilitzables i, en cas afirmatiu, ens tornarà    
      //  cridar.                                                                                   
      //                                                                                            
         dcl-proc Processa;                                                                         
         dcl-pi *n ;                                                                                
          piLevel like(s5line) value; //Nivell de validació                                         
         end-pi;                                                                                    
         dcl-s iM like(s5line) inz;                                                                 
         dcl-s bOk ind inz(*off);                                                                   
                                                                                                    
E7139    //Txurr_Save('Processa':*on:Simon_tx);                                                     
E7139    //Txurr_Save('->iLPEND:'+ %char(iLPEND)+'-> Level:'+%char(piLevel):*off:                   
E7139    //         Simon_tx);                                                                      
E7139                                                                                               
E7139    Txurr_Save(%trim(GetMsg(kmsg0041))+' L->'+%editc(piLevel:'X')                              
E7139     :*on:Simon_tx); // 'Main Process'                                                         
E7139                                                                                               
         iM = FindMax(iLarti+1:TLevel(piLevel):iLmagME + 1:iLmag); // Cerquem Magatzem              
         dow iM <> 0;                                                                               
           // s0coen <> 1 O (s0coen=1 Y podem subministrar TOTES les línies)                        
           if gS0COEN <>k1 OR (gS0COEN=k1 AND                                                       
              CArt(iLarti+1).CMag(iM).CVal(TLevel(piLevel)) = iLPEND);                              
             if ValidaMaga(iM:TLevel(piLevel)); // Validem imports per magatzem (sumatori línies    
E7139          //Txurr_Save('->Assign:'+ %char(iM):*off:Simon_tx);                                  
E7139          Txurr_Save(cRWh+'>'+cNGr+                                                            
E7139           %editc(CArt(iLarti+1).CMag(iM).CVal(TLevel(piLevel)):'X') +                         
E7139           %trim(GetMsg(kmsg0042))+ ' '+                                                       
E7139           %trim(GetMsg(kmsg0029))+ ': ' + Tmag(iM).zMaga :*off:Simon_tx);                     
               AssignaMag(iM:TLevel(piLevel));  // Assignem les línies al magatzem                  
               bOk = *on;                                                                           
               leave;                                                                               
             else;                                                                                  
               RessetMag(iM:TLevel(piLevel));//Inicialitzem el pis d'aquest maga                    
             endif;                                                                                 
           else; // coen=1 Y no podem subnimistrar TOTES les línies                                 
             RessetMag(iM:TLevel(piLevel));//Inicialitzem el pis d'aquest maga                      
           endif;                                                                                   
          iM = FindMax(iLarti+1:TLevel(piLevel):iLmagME+1:iLmag); // Cerquem següent                
         enddo;                                                                                     
         if bOk = *off;                                                                             
           if piLevel < %elem(TLevel);//No hem assignat i queden criteris menys restrit             
             piLevel +=1; // Incrementem el valor per passar al seguent criteri                     
             Processa(piLevel); // Crida recursiva                                                  
           else;                                                                                    
             // Hem realitzat TOTS els nivells de validació i NO hem pogut assignar res             
             // Ho passem a residual que ho passarà al magatzem per defecte                         
E7139        //Txurr_Save('->ToResidual' :*off:Simon_tx);                                           
             AssignaMagResidual();                                                                  
           endif;                                                                                   
         endif;                                                                                     
                                                                                                    
E7139    //Txurr_Save('<-iLPEND:'+ %char(iLPEND)+'-> Level:'+%char(piLevel):*off:                   
E7139    //        Simon_tx);                                                                       
         end-proc;                                                                                  
                                                                                                    
      //----------------------------------------------------------------------------------------    
      //AssignaMagResidual: '...repartiendo las migajas...'                                        
      //                                                                                            
         dcl-proc AssignaMagResidual;                                                               
         dcl-pi *n end-pi;                                                                          
         dcl-s iM   like(s5line) inz;                                                               
         dcl-s iA   like(s5line) inz;                                                               
         dcl-s iBkpnd like(s5line) inz;                                                             
         dcl-s xRetorn like(s5line) inz;                                                            
         dcl-s bDft ind inz(*off);                                                                  
         dcl-s iDft like(s5line) inz;                                                               
         dcl-s iNcoe like(s5line) inz;                                                              
                                                                                                    
        //Bucle per articles pendents                                                               
        // Cercar existencia en totes les logístiques , per prioritat de logística                  
        //   Si NO es possible ho passem a default de la dlga.                                      
        // En aquest punt podem tenir o NO PE disponible.                                           
        // Per tant podem tenim un problema si hem passat línies a DFLT i no teniem PE disponibl    
        //                                                                                          
                                                                                                    
E7139      //Txurr_Save('AssignaMagResidual':*on:Simon_tx);                                         
E7139      //Txurr_Save('->iLPEND:'+ %char(iLPEND):*off:Simon_tx);                                  
E7139      Txurr_Save(GetMsg(kmsg0043):*on :Simon_tx);                                              
           iBkPND = ilPEND;                                                                         
           For iA = 1 to iLPEND;                                                                    
E7317        //iM = GetNext(0);                                                                     
E7317        iM = GetNext(iLmagME);                                                                 
             //For iM = (iLmagME + 1) to iLmag;                                                     
             dow iM>0;                                                                              
              //Validem: Existencia solament. Ja ho hem intentat amb més condicions.                
              if CArt(Tpend(iA)).CMag(iM).CVal(KExist) = 1;                                         
                 //Guardo logística si no l'em emprat abans                                         
                 iNcoe = SaveAmag(iM);                                                              
               //Adjudicat!!                                                                        
                 Adjudicat(Tpend(iA):iM);                                                           
               //Tart(Tpend(iA)).zNNcoe = iNcoe;                                                    
               //iNcoe = Tart(Tpend(iA)).zNNcoe;                                                    
                 iBkPND -= 1;                                                                       
                 leave;                                                                             
              endif;                                                                                
             //endfor;                                                                              
              iM = GetNext(iM);                                                                     
             enddo;                                                                                 
                                                                                                    
             // Si NO l'hem pogut assignar el passem a default                                      
             if Tart(Tpend(iA)).zLogFinal = *blanks;      // No s'ha pogut assignar                 
               bDft = *on;                                                                          
               iDft += 1;                                                                           
               Tart(Tpend(iA)).zLogFinal = gDFTloge;                                                
               Tart(Tpend(iA)).zLogVirtual = gDFTLogV    ;                                          
             //Tart(Tpend(iA)).zNNcoe = gDFTpos ; //                                                
               Tart(Tpend(iA)).znMag = gDFTpos;                                                     
               Tmag(gDFTpos).zNlin += 1;                                                            
               iBkPND -= 1;                                                                         
               select;                                                                              
               when gPROC = kPROCSimulacio or gPROC = kPROCConfirmacio ; //procés Normal            
               when gPROC = kPROCForcedLin or gPROC = kPROCAddLin      ;    //procés Forçat  or     
                 gERROR = kErrorNotPossible ;                              // addlin                
               when gPROC = kPROCForcedHeader ;               // Forçat capçalera                   
            //   Tart(Tpend(iA)).zLogFinal = Tart(Tpend(iA)).zLoge;  //deixem la logística que t    
                 gERROR = kErrorNotPossible ;                              // addlin                
               endsl;                                                                               
             endif;                                                                                 
           endfor;                                                                                  
                                                                                                    
           // En aquest punt ho hem de tenir tot assignat                                           
           // iBkPND ha d'estar a 0                                                                 
           ilPEND = iBkPND;                                                                         
                                                                                                    
           // Si hem arribat aquí amb 'Pedido Completo' hem de bloquejar header i NO tocar          
           // les línies                                                                            
           if bDft and %subst(s0ampl:63:1) = k1;                                                    
             gERROR = kErrorPedCompl  ;                                                             
           endif;                                                                                   
                                                                                                    
           // Si ens ha saltat un error no fem res mes                                              
           if gERROR <> kNoError and gERROR<> kErrorPedCompl;                                       
             return;                                                                                
           endif;                                                                                   
                                                                                                    
           // Podem tenir el 'problema' de que el magatzem x defecte ens hagi incrementat els PE    
           //                                                                                       
           select;                                                                                  
           when bDft and gDFTused;                                                                  
             // cap problema: hem passat a dft i ja el teniem utilitzat                             
      //     RepassaNcoe(gDFTpos);                                                                  
           when bDft and not(gDFTused) and (gMaxPE = iPE);                                          
             // Problemo: hem emprat el magatzem x dft i no el teniem. Hem incrementat un PE        
             // Hem d'agafar tot el que estigues assignat al darrer maga emprat i passar-ho a df    
             ReassignaMag(TAmag(iLAmag):gDFTpos); // PosMag a desassignar - PosMag a assignar       
      //     RepassaNcoe(gDFTpos);                                                                  
           when not(bDft) and gDFTused;                                                             
             // cap problema: no hem passat a dft tot i que ja el teniem utilitzat                  
           when not(bDft) and not(gDFTused);                                                        
             // cap problema: no hem passat a dft i no el teniem.                                   
           endsl;                                                                                   
                                                                                                    
           return;                                                                                  
                                                                                                    
         end-proc;                                                                                  
                                                                                                    
      //----------------------------------------------------------------------------------------    
      //RepassaNcoe: repassem Ncoe per deixar-ho uniforme                                          
      //                                                                                            
      // dcl-proc RepassaNcoe; ///(gDFTpos                                                          
      // dcl-pi *n;                                                                                 
      //  piM like(s5line) value;  //pos maga origen                                                
      //  //piNcoe like(s5line) value;  //nCoe assignat                                             
      // end-pi;                                                                                    
      // dcl-s iNcoe like(s5line) inz;                                                              
      // dcl-s iA   like(s5line) inz;                                                               
      //                                                                                            
      //   Txurr_Save('RepassaNcoe':*on:Simon_tx);                                                  
      //   //1er.- Cercar valor en TAmag                                                            
      //   iNcoe = SaveAmag(piM);                                                                   
      //   //Cercar TOTS els articles que estiguin assignats en aquest magatzem i canviar-li        
      //   For iA = 1 to iLarti;                                                                    
      //     if Tart(iA).znMag = piM ;                                                              
      //       Tart(iA).zNNcoe = iNcoe;                                                             
      //     endif;                                                                                 
      //   endfor;                                                                                  
      //                                                                                            
      //   return;                                                                                  
      //                                                                                            
      // end-proc;                                                                                  
      //                                                                                            
                                                                                                    
      //----------------------------------------------------------------------------------------    
      //ReassignaMag: Passem les assignacions d'un magatzem a un altre                             
      //   El número de coenvio ho gestiona RepassaNcoe                                             
         dcl-proc ReassignaMag;                                                                     
         dcl-pi *n;                                                                                 
          piO like(s5line)     ;  //pos maga origen                                                 
          piD like(s5line) value;  //pos maga destí                                                 
         end-pi;                                                                                    
         dcl-s iA   like(s5line) inz;                                                               
         dcl-s iaux like(s5line) inz;                                                               
                                                                                                    
E7139    //Txurr_Save('ReassignaMag':*on:Simon_tx);                                                 
E7139    //Txurr_Save('Ori:'+ %char(piO) + ' Des:' + %char(piD):*off:                               
E7139    //          Simon_tx);                                                                     
E7139      Txurr_Save(GetMsg(kmsg0044):*on : Simon_tx);                                             
E7139      Txurr_Save(' From:'+ Tmag(piO).zMaga + ' To:' + Tmag(piD).zMaga :                        
E7139          *off:Simon_tx);                                                                      
           //Cercar TOTS els articles que estiguin assignats en aquest magatzem i canviar-li        
           For iA = 1 to iLarti;                                                                    
             if Tart(iA).znMag = piO ;                                                              
               Adjudicat(iA:piD);                                                                   
               Tmag(piD).znLin += 1;                                                                
             endif;                                                                                 
           endfor;                                                                                  
                                                                                                    
           Tmag(piO).znLin = 0; // Inicialitzem linies assignades a maga ori                        
           //piO = piD;           // modifiquem TAmag amb el valor de del maga destí                
           // Hem d'eliminar la posició origen                                                      
           for iaux = pio to ilamag;                                                                
             Tamag(iaux) = Tamag(iaux+1);                                                           
           endfor;                                                                                  
           Tamag(ilamag) = *zero;                                                                   
           ilamag -= 1;                                                                             
                                                                                                    
           return;                                                                                  
                                                                                                    
         end-proc;                                                                                  
                                                                                                    
      //----------------------------------------------------------------------------------------    
      //GetNext: recupera el següent valor en TAmag                                                
      //                                                                                            
         dcl-proc GetNext;                                                                          
         dcl-pi *n like(s5line);                                                                    
          piA like(s5line) value;  //valor de comparació                                            
         end-pi;                                                                                    
         dcl-s ix   like(s5line) inz;                                                               
         dcl-s xRetorn like(s5line) inz(999);                                                       
         dcl-s iAux like(s5line) inz;                                                               
                                                                                                    
           For ix = 1 to iLAmag;                                                                    
             if TAmag(ix) > piA and TAmag(ix) < xRetorn;                                            
               xRetorn = TAmag(ix);                                                                 
               iAux = ix;                                                                           
             endif;                                                                                 
           endfor;                                                                                  
           if xRetorn = 999;                                                                        
             xRetorn = *zero;                                                                       
           endif;                                                                                   
                                                                                                    
           return xRetorn;                                                                          
                                                                                                    
         end-proc;                                                                                  
                                                                                                    
                                                                                                    
      //----------------------------------------------------------------------------------------    
      //FindMax: Cerca el valor més alt en el row/pis donats                                       
      //                                                                                            
         dcl-proc FindMax;                                                                          
         dcl-pi *n like(s5line);                                                                    
          piA like(s5line) value;  //col article                                                    
          piV like(s5line) value;    // pis validació                                               
          piStr  like(s5line) value;   // fila inicial warehouse                                    
          piEnd  like(s5line) value;     // fila final           warehouse                          
         end-pi;                                                                                    
         dcl-s iM   like(s5line) inz;                                                               
         dcl-s iSave like(s5line) inz;                                                              
         dcl-s xRetorn like(s5line) inz;                                                            
                                                                                                    
         for iM = piStr to piEnd;                                                                   
          if CArt(piA).CMag(iM).CVal(piV) > iSave;                                                  
            iSave = CArt(piA).CMag(iM).CVal(piV);                                                   
            xRetorn = iM;                                                                           
          endif;                                                                                    
         endfor;                                                                                    
         return xRetorn;                                                                            
                                                                                                    
         end-proc;                                                                                  
                                                                                                    
      //----------------------------------------------------------------------------------------    
      //ValidaMaga: validem sumatori imports d'articles per maga (i també número de línies)        
      //            i tot el que sigui validacions agrupades de les línies sobre un maga           
      //                                                                                            
      // Rebem les coordenades Maga - Validació                                                     
      // En Maga - Validació - iLarti + 1 tindrém el TOTAL d'elements valids                        
      //                                                                                            
      // Si el magatzem ja s'ha utilitzat, ja li hem assignat línies, NO hem de fer les validaci    
      //  ja les hem passat abans                                                                   
      //                                                                                            
         dcl-proc ValidaMaga;                                                                       
         dcl-pi *n ind;                                                                             
          piM like(s5line) value;                                                                   
          piV like(s5line) value; //pis Validació. Sempre serà kFinal o kFinalME                    
         end-pi;                                                                                    
         dcl-s iA   like(s5line) inz;                                                               
         dcl-s iCnt like(s5line) inz;                                                               
         dcl-s iSave like(s5line) inz;                                                              
         dcl-s iImportTotal like(t5impo) inz;                                                       
         dcl-s xRetorn ind inz(*off);                                                               
                                                                                                    
E7139    //Txurr_Save('ValidaMaga':*oN:Simon_tx);                                                   
                                                                                                    
         // Mirem si ja hem assignat aquest maga                                                    
         if %lookup(piM:TAmag) > 0;  // Ja l'hem utilitzat, no necessitem validar-l'ho              
E7139      //Txurr_Save('-ValidaMaga:'+%char(piM)+'->PreviouslyUsed':                               
E7139      //        *off:Simon_tx);                                                                
           return *on;                                                                              
         endif;                                                                                     
                                                                                                    
         // Si NO tenim PEnED disponible i NO és un maga tal1=8                                     
         if (Tmag(piM).zTal1<>k8 and Tmag(piM).zTal1<>k7) and iPEnED=gMaxPEnED;                     
           return *off;                                                                             
         endif;                                                                                     
                                                                                                    
         if not Tmag(piM).zOctI ; //Omit control import mínim                                       
           //1er.- Sumaritzar imports de les línies vàlides per aquest magatzem                     
           for iA = 1 to iLarti;                                                                    
             if iCnt = CArt(iLarti + 1).CMag(piM).CVal(piV); //Ja els hem trobat tots,              
               leave;     // Sortim del bucle                                                       
             endif;                                                                                 
             if CArt(iA).CMag(piM).CVal(piV) = 1;                                                   
               iCnt += 1;                                                                           
               iImportTotal += Tart(iA).zImpLin;                                                    
             endif;                                                                                 
           endfor;                                                                                  
                                                                                                    
           if iImportTotal < Tmag(piM).zImpo     //Import comanda inferior a mínim                  
             and Tmag(piM).zImpo > 0;            // i tenim un valor mínim superior a 0             
E7139        //Txurr_Save('*ImpMinim* Suma:' + %char(iImportTotal) + ',Parm:'+                      
E7139        //  %char(Tmag(piM).zImpo) + ',Maga:'+%char(piM):*off:Simon_tx);                       
E7139        Txurr_Save(CRRd+'* '+ %trim(GetMsg(kmsg0045))+CRWh+                                    
E7139        Tmag(piM).zMaga +CNGr+%editc(Tmag(piM).zImpo:'X')+                                     
E7139        CRWh+%editc(iCnt:'X')+CNGr+%trim(GetMsg(kmsg0042))+                                    
E7139        %editc(iImportTotal:'X'):*off:Simon_tx);                                               
             return *off;                                                                           
           endif;                                                                                   
         endif; //Omit control import mínim                                                         
                                                                                                    
         // En aquest punt hem passat el control d'import                                           
         // Càlcul % línies sobre el total de la comanda                                            
         //    iLarti = 100%                                                                        
         //    iCnt o CArt(iLarti + 1).CMag(zM).CVal(zV) _=> x , línies que es poden assignar       
         // i ON tenim el % a superar???                         a aquest maga (iM)                 
         // Utilitzarem el valor t5capa, guardat en Tmag(iM).zCapa                                  
                                                                                                    
         if not Tmag(piM).zOctC; //NO Omit ctl capacitat                                            
           if (CArt(iLarti + 1).CMag(piM).CVal(piV) >                                               
                  Tmag(piM).zMLin * Tmag(piM).zCapa /100)  and                                      
                  Tmag(piM).zMLin>0 and Tmag(piM).zCapa >0;                                         
E7139        //Txurr_Save('*Capacit.* Lins:' +                                                      
E7139        //   %char(CArt(iLarti + 1).CMag(piM).CVal(piV)) + ',Parm:'+                           
E7139        //  %char(Tmag(piM).zCapa) + ',Maga:'+%char(piM):*off:Simon_tx);                       
E7139        Txurr_Save(CRRd+'* '+ %trim(GetMsg(kmsg0046))+CRWh+                                    
E7139        Tmag(piM).zMaga +CNGr+%editc(Tmag(piM).zMLin:'X')+' '+                                 
E7139        %editc(Tmag(piM).zCapa:'X')+'  '+                                                      
E7139        CRWh+%editc(CArt(iLarti + 1).CMag(piM).CVal(piV) :'X')+                                
E7139               CNGr+%trim(GetMsg(kmsg0042)):*off:Simon_tx);                                    
             return *off;                                                                           
           endif;                                                                                   
         endif;    // Omit ctl capacitat                                                            
                                                                                                    
         // Altres validacions....                                                                  
         //    Total línies que compleixen validació per aquest magatzem                            
         //           CArt(iLarti + 1).CMag(piM).CVal(piV)                                          
         //    Total línies que s'han carregat    iLarti                                            
         //    Total línies assignades via Excepció  iExcpt                                         
         //    % mínim per assignar la comanda a un magatzem   zAmasi                               
                                                                                                    
E7374        // if  CArt(iLarti + 1).CMag(piM).CVal(piV) * 100 / (iLarti - iExcpt) <                
E7374        //          Tmag(piM).zAmasi;                                                          
E7139        //Txurr_Save('*Amasi  .* Lins:' +                                                      
E7139        //   %char(CArt(iLarti + 1).CMag(piM).CVal(piV)) + ',Parm:'+                           
E7139        //  %char(Tmag(piM).zAmasi) + ',Maga:'+%char(piM):*off:Simon_tx);                      
HDC74        //E7374      if  CArt(iLarti + 1).CMag(piM).CVal(piV) * 100 /                          
HDC74    if  (iLarti - iExcpt - iArtB  >*zero) and                                                  
HDC74        CArt(iLarti + 1).CMag(piM).CVal(piV) * 100 /                                           
E7374          (iLarti - iExcpt - iArtB ) < Tmag(piM).zAmasi;                                       
E7139        Txurr_Save(CRRd+'* '+ %trim(GetMsg(kmsg0047))+CRWh+                                    
E7139        Tmag(piM).zMaga +CNGr+%editc(Tmag(piM).zAmasi:'X')+' '+                                
E7139        CRWh+%editc(CArt(iLarti + 1).CMag(piM).CVal(piV) :'X')+                                
E7139               CNGr+%trim(GetMsg(kmsg0042)):*off:Simon_tx);                                    
             return *off;                                                                           
         endif;                                                                                     
                                                                                                    
         return *on;                                                                                
                                                                                                    
         end-proc;                                                                                  
                                                                                                    
      //----------------------------------------------------------------------------------------    
      //AssignaMag: Assignem les línies al magatzem                                                
      //                                                                                            
      // Rebem les coordenades Maga - Validació                                                     
      // En Maga - Validació - iLarti + 1 tindrém el TOTAL d'elements valids                        
      //                                                                                            
         dcl-proc AssignaMag;                                                                       
         dcl-pi *n ;                                                                                
          piM like(s5line) value;                                                                   
          piV like(s5line) value;                                                                   
         end-pi;                                                                                    
         dcl-s iArt like(s5line) inz;                                                               
         dcl-s iCnt like(s5line) inz;                                                               
         dcl-s iM   like(s5line) inz;                                                               
         dcl-s iP   like(s5line) inz;                                                               
         dcl-s iV2  like(s5line) inz;                                                               
         dcl-s iValor like(s5line) inz;                                                             
         dcl-s bContaPE ind inz(*off);  // Indicador per incrementar, o no, els PE                  
         dcl-s bMagUpd  ind inz(*off);  // Indicador d'actualització en mag                         
         dcl-s iNcoe like(s5line);                                                                  
E7269    dcl-s iValorANTiLAmag like(s5line); // Valor anterior de iLAmag                            
                                                                                                    
         //Hem de validar si aquesta assignació conta com PE                                        
         // En el pis kNoPE indiquem, per ME (magatzems especials per ArtiB i Obso) si aquest       
         // no conta com punt d'expedició. I en cas afirmatiu posem un 1. I en cas negatiu posem    
         //     Es a dir: el valor 1 NO incrementa PE.                                              
         //               el valor 0 SI incrementa PE.                                              
         // I pels arti-maga que no siguin PE, obsolets, ArtiB...?                                  
         //               el valor per defecte, 999, SI incrementen PE.                             
         // Usea, sols es lliura d'incrementar PE si tenim 1                                        
         //                                                                                         
                                                                                                    
         // Guardem valor actual per comparacions                                                   
         // Nota: aquest valor serà del pis kFinal, el més provable. I el valor d'aquest pis        
         //  es va modificant a mida que assignem items al magatzems.                               
         iValor = Cart(iLarti+1).CMag(piM).CVal(piV);                                               
                                                                                                    
         //Guardem Magatzem assignat, si no l'hem utilitzat abans                                   
         //Ens retorna la posició en TAmag on tenim aquest magatzem. Utilitzem aquest valor per     
E7269    iValorANTiLAmag = iLAmag; // Guardem el valor actual per determinar si aquest maga         
E7269                             // l'hem utilitzat abans o no.                                    
         iNcoe = SaveAmag(piM);                                                                     
         //iLAmag += 1;         //Comptador magatzems assignats                                     
         //TAmag(iLAmag) = piM;  //Magatzems utilitzats                                             
                                                                                                    
         //Si és el magatzem per defecte activem l'indicador                                        
         if piM = gDFTpos;                                                                          
           gDFTused = *on;                                                                          
         endif;                                                                                     
                                                                                                    
         //Si maga tal1<>8 incrementem contador                                                     
         if (Tmag(piM).zTal1 <> k7 and Tmag(piM).zTal1 <> k8);                                      
           iPEnED +=1;                                                                              
         endif;                                                                                     
                                                                                                    
         // Bucle per tots els articles disponibles en aquest magatzem                              
         For iArt = 1 to iLarti;                                                                    
           if CArt(iArt).CMag(piM).CVal(piV) = 1;                                                   
             iCnt += 1;                           //contador línies processades                     
             iLPEND -= 1;                         //contador línies pendents                        
             //Adjudicat!!                                                                          
             Adjudicat(iArt:piM);                                                                   
             if CArt(iArt).CMag(piM).CVal(kNoPE) <> 1;  //Si hem d'incrementar PE                   
               bContaPE = *on;                         //Si hem d'incrementar PE                    
             endif;                                    //Si hem d'incrementar PE                    
             // Guardem per NNcoe                                                                   
             Tart(iArt).zNNcoe = iNcoe;                                                             
             // Aquest article ja està assignat. Ara toca desmarcar-l'ho dels altres magatzems      
             For iM = 1 to iLmag;                                                                   
               DesmarcaArtMag(iArt:iM:kFinalME:bMagUpd);                                            
               //Validacions Parcials: desmarquem en totes les validacions.                         
               For iV2 = 1 to %elem(TLevel);                                                        
                 DesmarcaArtMag(iArt:iM:TLevel(iV2):bMagUpd);                                       
               endfor;                                                                              
               //Corregim núm lin maga, si cal                                                      
               if bMagUpd and Tmag(iM).zMliZ > *zero;                                               
                  Tmag(iM).zMliZ -= 1;                                                              
               endif;                                                                               
               bMagUpd = *off;                                                                      
             endfor;                                                                                
           else;                                                                                    
             //Actualitzo taula pendents, si s'escau                                                
             if Tart(iArt).zLogFinal = *blanks;                                                     
               iP += 1;                                                                             
               Tpend(iP) = iArt ;                                                                   
             endif;                                                                                 
           endif;                                                                                   
                                                                                                    
         endfor;                                                                                    
         // En aquest punt ilPEND = iP                                                              
         ilPEND = iP;                                                                               
         iRonda += 1; // Comptador de rondes                                                        
         Tmag(piM).zAssigRonda = iRonda;                                                            
E7269    //if bContaPE;                                                                             
E7269    // Incrementem el comptador de Punts Expedició emprats si aquest magatzem ens increment    
E7269    //  punt (bContaPE) i si NO l'hem utilitzat abans                                          
E7269    if bContaPE and (iValorANTiLAmag < iLAmag);                                                
           iPE += 1;    // Comptador de Punts Expedició emprats                                     
         endif;                                                                                     
                                                                                                    
         end-proc;                                                                                  
                                                                                                    
      //----------------------------------------------------------------------------------------    
      //SaveAmag:   Guardem la posició del magatzem assignat, si NO l'hem empleat abans            
      //                                                                                            
         dcl-proc SaveAmag;                                                                         
         dcl-pi *n like(s5line);                                                                    
          piM like(s5line) value;  // Element de Tmag                                               
         end-pi;                                                                                    
         dcl-s xRetorn like(s5line);                                                                
         // Cerquem el valor en TAmag                                                               
         xRetorn = %lookup(piM:TAmag) ;                                                             
         if xRetorn = 0 ;  // Not found                                                             
           iLAmag += 1;  // incrementem contador de darrera posició                                 
           TAmag(iLAmag) = piM;  // guardem posició magatzem assignat                               
           xRetorn = iLAmag;                                                                        
         endif;                                                                                     
         return xRetorn;                                                                            
         end-proc;                                                                                  
                                                                                                    
      //----------------------------------------------------------------------------------------    
      //DesmarcaArtMag                                                                             
      //                                                                                            
         dcl-proc DesmarcaArtMag;                                                                   
         dcl-pi *n ;                                                                                
          piA like(s5line) value;  // Element de Tart                                               
          piM like(s5line) value;  // Element de Tmag                                               
          piV like(s5line) value;  // pis de validació                                              
          pbUpd ind;                                                                                
         end-pi;                                                                                    
                                                                                                    
         dcl-s bUpd ind inz(*off);                                                                  
                                                                                                    
           if CArt(piA).CMag(piM).CVal(piV) = 1;                                                    
             //Validacions Finals per ME                                                            
             CArt(piA).CMag(piM).CVal(piV) = 0;                                                     
             CArt(iLarti + 1).CMag(piM).CVal(piV) -= 1;                                             
             bUpd = *on;                                                                            
           endif;                                                                                   
           pbUpd = pbUpd  or bUpd;                                                                  
         return;                                                                                    
                                                                                                    
         end-proc;                                                                                  
                                                                                                    
      //----------------------------------------------------------------------------------------    
      //Adjudicat: Movem camps assignació Article / Magatzem                                       
      //                                                                                            
      //  Els comptadors d'articles pendents (iLPEND), magatzems emprats (iLAmag), taules           
      //   de pendents (Tpend) o maga assignats (TAmag) es mantenen fora                            
      //  Aquí sols movem info entre Tmag i Tarti                                                   
      //                                                                                            
         dcl-proc Adjudicat;                                                                        
         dcl-pi *n ;                                                                                
          piA like(s5line) value;  // Element de Tart                                               
          piM like(s5line) value;  // Element de Tmag                                               
         end-pi;                                                                                    
                                                                                                    
             Tart(piA).zLogFinal = Tmag(piM).zLoge;        //guardem logística en línia Adjudica    
             Tart(piA).zLogVirtual = Tmag(piM).zLogVirtual;  //guardem logística virtualAdjudica    
             Tart(piA).znMag = piM ; //Posició del magatzem assignat                    Adjudica    
             if Tmag(piM).ztal1= k8 or Tmag(piM).ztal1= k7;//                            Adjudic    
               Tart(piA).zTpe4 = k2;                    // informem s5tpe4 = 2         Adjudicat    
               gTPE4 = *on;                             // Sip, tenim TPE4=2            Adjudica    
             else;                                     //                               Adjudica    
               Tart(piA).zTpe4 = *blanks;              // tpe4 a blanks                Adjudicat    
             endif;                                  //                               Adjudicat     
             Tmag(piM).zNlin += 1  ; // Línies assignades a aquest magatzem           Adjudicat     
                                                                                                    
         end-proc;                                                                                  
                                                                                                    
      //----------------------------------------------------------------------------------------    
      //RessetMag: Resetejem aquest Magatzem per tal que no ens torni a sortir                     
      //                                                                                            
      // Això ho fem per magatzems que no superen les validacions finals (ValidaMaga)               
      //                                                                                            
         dcl-proc RessetMag;                                                                        
         dcl-pi *n ;                                                                                
          piM like(s5line) value;  //Parm Integer Magatzem                                          
          piV like(s5line) value;  //Parm Integer Validacions                                       
         end-pi;                                                                                    
         dcl-s iA   like(s5line) inz;                                                               
         dcl-s iCnt like(s5line) inz;                                                               
                                                                                                    
        for iA = 1 to iLarti;                                                                       
          if iCnt = CArt(iLarti + 1).CMag(piM).CVal(piV);   // Ja hem processat totes les línies    
            leave;                                                                                  
          endif;                                                                                    
          if CArt(iA).CMag(piM).CVal(piV) = 1    ;                                                  
            iCnt  += 1;                                                                             
            CArt(iA).CMag(piM).CVal(piV) = 0 ;      // inicializem valor per arti/maga/Validació    
          endif;                                                                                    
        endfor;                                                                                     
        CArt(iLArti + 1).CMag(piM).CVal(piV) = 0;   // inicialitzem acumulat d'aquesta validació    
        return        ;                                                                             
                                                                                                    
         end-proc;                                                                                  
                                                                                                    
                                                                                                    
      //----------------------------------------------------------------------------------------    
      //Txurr_Save:                                                                                
      //                                                                                            
         dcl-proc Txurr_Save;                                                                       
         dcl-pi *n;                                                                                 
           pTxt char(50) value;                                                                     
           pBol ind value;                                                                          
E7139      ptxurru like(DODATA);  //varchar(5000);                                                  
         end-pi;                                                                                    
                                                                                                    
         if pBol;                                                                                   
           pTxt = cRWh + %trim(pTxt) +cNGr ;                                                        
         endif;                                                                                     
E7139    //if %len(ptxurru) < 5000;                                                                 
E7139    if %len(ptxurru) < %len(ptxurru: *MAX);                                                    
           ptxurru = ptxurru + pTxt;                                                                
         endif;                                                                                     
                                                                                                    
         end-proc;                                                                                  
                                                                                                    
                                                                                                    
      //----------------------------------------------------------------------------------------    
      //Simon_show:                                                                                
      //                                                                                            
         dcl-proc Simon_show;                                                                       
         dcl-pi *n end-pi;                                                                          
                                                                                                    
        if bSimon;          //Simon                                                                 
                                                                                                    
         @pTitulo = kSS;                                                                            
         @pFuncion = k0;                                                                            
         @pLongitud = %len(Simon_tx);                                                               
         pMSGBOX(@pTitulo:%addr(Simon_tx)+2:@pLongitud:@pFuncion:@pRetorno:*on);                    
                                                                                                    
        endif;                                                                                      
                                                                                                    
         end-proc;                                                                                  
                                                                                                    
                                                                                                    
      //----------------------------------------------------------------------------------------    
      //cs_importe: càlcul import línia                                                            
      // Calculo Importe línea pedido                                                               
      //                                                                                            
         dcl-proc CS_IMPORTE;                                                                       
         dcl-pi *n like(zxbimp) end-pi;                                                             
                                                                                                    
                                                                                                    
     C                   EVAL      ZXMONE2 = S5MONE                                                 
      * Tipo de IVA                                                                                 
     C                   EVAL      PECIAS=S5CIAS                                                    
     C                   EVAL      PECTAB='TIV2'                                                    
     C                   EVAL      PECLTA=*BLANKS                                                   
     C                   EVAL      PECLTA=S0TIV3                                                    
           chain (@pcias:pectab:peclta) pmtabd;                                                     
     C**** KPMTABD       CHAIN     PMTABD                                                           
     C                   IF        %FOUND(PMTABD)                                                   
     C                   EVAL      ZXTIVC=PEBL61                                                    
     C                   EVAL      ZXPABI=%subst(pebl65:1:1)                                        
     C                   ELSE                                                                       
     C                   EVAL      ZXPABI=*BLANKS                                                   
     C                   ENDIF                                                                      
                                                                                                    
     C                   EVAL      XZAUXI=*ZEROS                                                    
     C                   EVAL      XZAUXI1=*ZEROS                                                   
     C                   EVAL      MBCIAS=S5CIAS                                                    
     C                   EVAL      MBMONE=ZXMONE2                                                   
     * Ecotaxe                                                                                     
     C                   EVAL      XZTAXE=0                                                         
     C                   IF        S5ECOP<>*BLANKS                                                  
     C                   CALL      'MN0398'                                                         
     C                   PARM                    @PCIAS                                             
     C                   PARM      S5ECOP        @PEECOP                                            
     C                   PARM      S5DATP        @PEFLCD                                            
     C                   PARM      0             @PETAXE                                            
     C                   EVAL      XZTAXE=@PETAXE                                                   
     C                   ENDIF                                                                      
      * Buscamos en Ajuste decimal                                                                  
                                                                                                    
     C**** KMSDIV0       CHAIN     MSDIV0                                                           
           chain (@pcias:mbmone) msdiv0;                                                            
     C                   IF        %FOUND(MSDIV0)                                                   
     C                   EVAL      XZDECI=MBDECI                                                    
     C                   EVAL      XZAJUD=MBAJUD                                                    
     C                   ENDIF                                                                      
      * Buscamos en PMUNAL UNIDADES ALTERNATIVAS                                                    
     C                   EVAL      XZCOFU=1                                                         
     C                   IF        S5UNIM<>S5UNDP                                                   
     C                   EVAL      XZCIAS=@PCIAS                                                    
     C                   EVAL      XZARTI=S5ARTI                                                    
     C                   EVAL      XZVARI=S5VARI                                                    
     C                   EVAL      XZMODE=S5MODE                                                    
     C                   EVAL      ZXCA10=S5CANT                                                    
     C                   EVAL      ZXCA11=S5CANT                                                    
     C                   EVAL      ZXUN10=S5UNIM                                                    
     C                   EVAL      ZXUN11=S5UNDP                                                    
     C* CAMBIO de unidades                                                                          
     C/COPY *LIBL/QSRDSRC,SRD021                                                                    
     C                   ENDIF                                                                      
      * Buscamos en CAMBIO MONEDA CABECERA DEL PEDIDO                                               
     C                   IF        ZXMONE2<>S5MONE                                                  
     C                   CALL      'MM2555'                                                         
     C                   PARM      S5CIAS        @PCIAS                                             
     C                   PARM      S5MONE        @PMON1                                             
     C                   PARM      ZXMONE2       @PMON2                                             
     C                   PARM      S5DATP        @PDATA                                             
     C                   PARM      S5NOPL        @PHORA                                             
     C                   PARM      0             @PCMCOCO                                           
     C                   PARM      0             @PCMCCCO                                           
     C                   PARM      *BLANKS       @PEERR                                             
     C                   EVAL      ZXCOCAMB=@PCMCCCO                                                
     C                   ELSE                                                                       
     C                   EVAL      ZXCOCAMB=1                                                       
     C                   ENDIF                                                                      
                                                                                                    
      * Buscamos en % de IVA                                                                        
     C                   EVAL      MVCIAS=S5CIAS                                                    
     C                   EVAL      MVTIVA=S5TIVA                                                    
     C                   EVAL      MVPABI=ZXPABI                                                    
     C                   EVAL      MVFLCD=@PDATP                                                    
           setgt (@pcias:mvtiva:mvpabi) msivas;                                                     
           readpe (@pcias:mvtiva:mvpabi:mvflcd) msivas;                                             
     C**** KMSIVAS       SETGT     MSIVAS                                                           
     C**** KMSIVAS0      READPE    MSIVAS                                 83                        
     C                   SELECT                                                                     
     C                   WHEN      ZXTIVC=' '                                                       
     C                   EVAL      MVPIV2=*ZEROS                                                    
     C                   WHEN      ZXTIVC='0'                                                       
     C                   EVAL      MVPIV1=*ZEROS                                                    
     C                   EVAL      MVPIV2=*ZEROS                                                    
     C                   ENDSL                                                                      
      * Calculamos el precio de nueva linea o modificada                                            
     C                   EVAL      XZCANT=S5CANT                                                    
     C                   EVAL      XZPREC=S5PREC                                                    
     C                   EVAL      XZCADP=S5CADP                                                    
     C                   EVAL      XZDTO1=S5DTO1                                                    
     C                   EVAL      XZDTO2=S5DTO2                                                    
     C                   EVAL      XZDTO3=S5DTO3                                                    
     C                   EVAL      XZDTO4=S5DTO4                                                    
b01  C                   IF        XZDTO4=*ZEROS                                                    
     C                   EVAL      XZDTO4=@PDTOE                                                    
e01  C                   ENDIF                                                                      
ECOP C/COPY *LIBL/QSRDSRC,SRD022ECO                                                                 
ECOP C* AJUSTE Y DECIMALES                                                                          
ECOP C/COPY *LIBL/QSRDSRC,SRD001                                                                    
ECOP C                   Z-ADD     XZAUXI        ZXBIMPECO                                          
05052* Evitar error división por 0                                                                 
05052C                   IF        XZCADP = 0                                                       
05052C                   EVAL      XZCADP = 1                                                       
05052C                   ENDIF                                                                      
05052C                   IF        XZCADP = 0                                                       
05052C                   EVAL      XZCADP = 1                                                       
05052C                   ENDIF                                                                      
     C/COPY *LIBL/QSRDSRC,SRD022                                                                    
                                                                                                    
     C* AJUSTE Y DECIMALES                                                                          
     C/COPY *LIBL/QSRDSRC,SRD001                                                                    
     C                   Z-ADD     XZAUXI        ZXBIMP                                             
ECOP C                   ADD       ZXBIMPECO     ZXBIMP                                             
      * Calculamos el IVA                                                                           
     C                   EVAL      XZAUXI=ZXBIMP*MVPIV1                                             
     C     XZAUXI        DIV(H)    100           XZAUXI                                             
     C* AJUSTE Y DECIMALES                                                                          
     C/COPY *LIBL/QSRDSRC,SRD001                                                                    
     C                   Z-ADD     XZAUXI        ZXIIV1                                             
      * Calculamos el Recargo de equivalencia                                                       
     C                   EVAL      XZAUXI=ZXBIMP*MVPIV2                                             
     C     XZAUXI        DIV(H)    100           XZAUXI                                             
     C* AJUSTE Y DECIMALES                                                                          
     C/COPY *LIBL/QSRDSRC,SRD001                                                                    
     C                   Z-ADD     XZAUXI        ZXIIV2                                             
                                                                                                    
      * Omitimos BASE o IVA segun tipo de IVA                                                       
                                                                                                    
b01  C                   IF        MVOMTB>='1'                                                      
     C                   EVAL      ZXBIMP=ZXBIMP-ZXBIMP                                             
e01  C                   ENDIF                                                                      
b01  C                   IF        MVOMTI>='1'                                                      
     C                   EVAL      ZXIIV1=ZXIIV1-ZXIIV1                                             
     C                   EVAL      ZXIIV2=ZXIIV2-ZXIIV2                                             
e01  C                   ENDIF                                                                      
       return zxbimp;                                                                               
                                                                                                    
         end-proc;                                                                                  
      //----------------------------------------------------------------------------------------    
      //DesmarcaHeader                                                                             
      // treiem FD de la capçalera                                                                  
      //                                                                                            
         dcl-proc DesmarcaHeader;                                                                   
         dcl-pi *n  end-pi;                                                                         
                                                                                                    
           exec sql                                                                                 
             update cocape set s0tpe4=' '                                                           
             where s0cias = :@pcias and s0dlga = :@pdlga and s0npco = :@pnpco                       
               and s0tped = :@ptped and s0datp = :@pdatp and s0nopl = :@pnopl;                      
                                                                                                    
         end-proc;                                                                                  
E7139 //----------------------------------------------------------------------------------------    
E7139 //SaveHst: Guardem dades en Històric càlcul Doom                                             
E7139 //                                                                                            
E7139    dcl-proc SaveHst;                                                                          
E7139    dcl-pi *n  end-pi;                                                                         
E7139                                                                                               
E7139      select;                                                                                  
E7139      when  gProc = kPROCsimulacio    ;                                                        
E7139        return;  // no fem res                                                                 
E7139      when  Simon_tx=''               ;                                                        
E7139        return;  // no fem res                                                                 
E7139      endsl;                                                                                   
E7139                                                                                               
E7139      Open doomht;                                                                             
E7139      clear rdoomht;                                                                           
E7139      docias= @pcias;        //-+                                                              
E7139      dodlga= @pdlga;        // |                                                              
E7139      donpco= @pnpco;        // +--- Clau comanda                                              
E7139      dotped= @ptped;        // |                                                              
E7139      dodatp= @pdatp;        // |                                                              
E7139      donopl= @pnopl;        //-+                                                              
E7139      dousua= Pgm.sdsUser;       //----- Usuari que realitza el procés                         
E7139      doproc= %char(gPROC);        //----- Tipus de procés                                     
E7139      dotmsp= %timestamp;    //----- Timestamp                                                 
E7139      %nullind(dodata) = *off;                                                                 
E7139      dodata = Simon_tx;  //----- Dades del càlcul                                             
E7139      write rdoomht;                                                                           
E7139      close doomht;                                                                            
E7139      return;                                                                                  
E7139                                                                                               
E7139    end-proc;                                                                                  
E7249 //----------------------------------------------------------------------------------------    
E7249 //GetCono: Recupera el cono perdido en la AP7                                                
E7249 //                                                                                            
E7249    dcl-proc GetCono;                                                                          
E7249    dcl-pi *n like(MBCONO);                                                                    
E7249    end-pi;                                                                                    
E7249    dcl-s xReturn like(MBCONO) inz;                                                            
E7249      open svuser;                                                                             
E7249      chain (Pgm.sdsUser) svuser;                                                              
E7249      if %found(svuser) and %subst(k4amp4:1:3)<>*blanks;                                       
E7249        xReturn=atoi(%subst(k4amp4:1:3));                                                      
E7249      else;                                                                                    
E7249        xReturn=100;                                                                           
E7249      endif;                                                                                   
E7249      close svuser;                                                                            
E7249      return xReturn;                                                                          
E7249                                                                                               
E7249    end-proc;                                                                                  
E7249 //----------------------------------------------------------------------------------------    
E7249 //GetStsM3:Recupera status de l'article / maga en M3                                         
E7249 //                                                                                            
E7249    dcl-proc GetStsM3;                                                                         
E7249    dcl-pi *n like(s5line);                                                                    
E7249      pWHLO like(MBWHLO) const;                                                                
E7249      pPRVR like(M0PRVR) const;                                                                
E7249      pARVM like(C3ARVM) const;                                                                
E7249      pRetorn like(s5line) const;                                                              
E7249    end-pi;                                                                                    
E7249    dcl-s xRetorn like(s5line) inz;                                                            
E7249      // 1er.- Verificar que aquest proveïdor el tenim en M3                                   
E7249      // Cerquem la Cia d'aquest proveïdor en UTCOM                                            
E7249      chain (s0cias:'5':pPrvr:*blanks) utcom0;                                                 
E7249      if %found(utcom0) and u0baja <> k0;                                                      
E7253        if %trim(U0CIA1)='018'; // TXAPU per IBERSPA: no s'ha de validar                       
E7253          return pRetorn;      // ja que està en Legacy                                        
E7253        endif;                                                                                 
E7249        //Mirem que l'empresa estigui en M3                                                    
E7249        chain (U0CIA1) pmlibl;                                                                 
E7249        if %found(pmlibl) and %subst(ppbl10:9:1)=kV ;                                          
E7249          xRetorn=xRetorn;                                                                     
E7249        else;                                                                                  
E7249          return pRetorn; //No està en M3 o no tenim reg en pmlibl                             
E7249        endif;                                                                                 
E7246      else;                                                                                    
E7249       return  pRetorn; // no tenim UTCOM per aquest proveïdor                                 
E7249      endif;                                                                                   
E7249      // En aquest punt el proveïdor està en M3                                                
E7249      // 2on.-Cerquem el ITNO d'aquest proveïdor                                               
E7249      chain (s0cias:pPrvr:pArvm) puprp0;                                                       
E7249      if %found(puprp0) and c3arvp <> *blanks;                                                 
E7249        mbitno= c3arvp;                                                                        
E7249      else;                                                                                    
E7249        mbitno= pArvm;                                                                         
E7249      endif;                                                                                   
E7249      //3er.- Finalment accedim al mitbal per validar                                          
E7249      chain (gCONO:pWHLO:mbitno) mitbal00;                                                     
E7249      if %found(mitbal00) and mbstat>=k20 and mbstat<k80;                                      
E7249        xRetorn=1;                                                                             
E7249      else;                                                                                    
E7249        xRetorn=0;                                                                             
E7249      endif;                                                                                   
E7249                                                                                               
E7249      return xRetorn;                                                                          
E7249                                                                                               
E7249    end-proc;                                                                                  
