      * TITOL: ED0015  © FLUIDRA SERVICES                          *                                
      * DATA CREACIO:  02/02/2010                                  *                                
      * FUNCIO DEL PROGRAMA: ED: Sincronización Ventas-Compras     *                                
      **************************************************************                                
FQ604 * Modificación: FQ604                                        *                                
FQ604 *        Autor: Josep Aragonès                               *                                
FQ604 * Fecha Inicio: 07/05/2010                                   *                                
FQ604 *  Descripción: Fluidra direct. Gestión Observaciones.       *                                
FQ604 *                               Método entrega.              *                                
FQ604 **************************************************************                                
In190 *      Modificació: In190                                    *                                
In190 *            Autor: Josep Aragonès                           *                                
In190 * Data modificació: 14/09/2010                               *                                
In190 *       Descripció: No enviar registros si linea cerrada     *                                
In190 **************************************************************                                
In178 *      Modificació: In178                                    *                                
In178 *            Autor: Josep Aragonès                           *                                
In178 * Data modificació: 17/09/2010                               *                                
In178 *       Descripció: Cuando se crea conjunto compra C5TCOJ=' '*                                
In178 **************************************************************                                
In196 *      Modificació: In196                                    *                                
In196 *            Autor: Josep Aragonès                           *                                
In196 * Data modificació: 22/09/2010                               *                                
In196 *       Descripció: Eliminar traçabilitat quan es baixa      *                                
In196 **************************************************************                                
In199 * Modificación: In199                                        *                                
In199 *        Autor: Josep Aragonès                               *                                
In199 * Fecha Inicio: 22/10/2010                                   *                                
In199 *  Descripción: Evento cambio logistica                      *                                
In199 **************************************************************                                
In195 * Modificación: FQ722                                        *                                
In195 *        Autor: Vicky Garcés                                 *                                
In195 * Fecha Inicio: 22/10/2010                                   *                                
In195 *  Descripción: No encriptar/deserncriptar los campos        *                                
In195 *  S2PEGE,S2TELE,S2TFAX,S2TLEX,S2TEL2 DE CODEPE              *                                
In195 **************************************************************                                
In206 *      Modificació: In206                                    *                                
In206 *            Autor: Josep Aragonès                           *                                
In206 * Data modificació: 11/11/2010                               *                                
In206 *       Descripció: Error en evento 013                      *                                
In206 **************************************************************                                
FQ709 * DATA DE MODIFICACIÓ: 01/12/2010  MARCA: FQ709              *                                
FQ709 * AUTOR: Teresa Boada                                        *                                
FQ709 * DOCUMENTACIÓ: Omplir rotació a línies de comandes de compra*                                
FQ709 **************************************************************                                
In209 * Modificación: In209                                        *                                
In209 *        Autor: Josep Aragonès                               *                                
In209 * Fecha Inicio: 20/01/2011                                   *                                
In209 *  Descripción: Evitar bloqueo CODEPE al eliminar linea      *                                
In209 **************************************************************                                
In209 * Modificación: 15041                                        *                                
In209 *        Autor: JMARTINEZP                                   *                                
In209 * Fecha Inicio: 15/04/2011                                   *                                
In209 *  Descripción: Control pedidos compra duplicados            *                                
In209 *               Control generación pedidos de compra         *                                
In209 **************************************************************                                
In209 * Modificación: 14061  y 27061                               *                                
In209 *        Autor: TL                                           *                                
In209 * Fecha Inicio: 14/06/2011                                   *                                
In209 *  Descripción: FECHA SOLICITUD NO PUEDE SER INFERIOR A      *                                
In209 *               LANZAMIENTO                                  *                                
In209 **************************************************************                                
      * Modificación: 09091                                        *                                
      *        Autor: JMARTINEZP                                   *                                
      * Fecha Inicio: 09/09/2011                                   *                                
      *  Descripción: Error al modificar la cantidad a (-) "007"   *                                
      **************************************************************                                
ECOP  *  OS 27/06/2011 Traitement Ecotaxe: pas d'{cotaxe si {tranger                               
     *                                                                                            
     *========================================================================================    
      * Modificación: 17101                                        *                                
      *        Autor: JMARTINEZP                                   *                                
      * Fecha Inicio: 17/10/2011                                   *                                
      *  Descripción: corregir incidencia detactada creación de lin*                                
      **************************************************************                                
      * Modificación: 14121                                        *                                
      *        Autor: JMARTINEZP                                   *                                
      * Fecha Inicio: 14/12/2011                                   *                                
      *  Descripción: corregir incidencia fechas                   *                                
      **************************************************************                                
15612 *      Modificació: 15612                                    *                                
15612 *            Autor: Josep Aragonès                           *                                
15612 * Data modificació: 15/06/2012                               *                                
15612 *       Descripció: EL evento 022 falta precio compra despues*                                
15612 *         de crear pedido compra para que llegue el mail     *                                
15612 **************************************************************                                
28612 *      Modificació: 28612                                    *                                
28612 *            Autor: Josep Aragonès                           *                                
28612 * Data modificació: 28/06/2012                               *                                
28612 *       Descripció: La modi de Qty restem servida només Alta *                                
28612 **************************************************************                                
      *      Modificació: IN240                                    *                                
      *            Autor: JMARTINEZP                               *                                
      * Data modificació: 03/07/2012                               *                                
      *       Descripció: INCIDENCIA ENVIO PROCESO PU2540          *                                
      **************************************************************                                
FDX01 *      Modificació: FDX01                                                                     
FDX01 *            Autor: Carlos del Valle                                                          
FDX01 * Data modificació: 03/01/2013                                                                
FDX01 *       Descripció: Fluidra Direct: Correcciones y mejoras                                    
FDX01 **************************************************************                                
07053 *      Modificació: 07053                                                                     
07053 *            Autor: VICKY GARCES                                                              
07053 * Data modificació: 07/05/2013                                                                
07053 *       Descripció: Arreglo eliminacion observaciones                                         
07053 **************************************************************                                
      * DATA DE MODIFICACIÓ: 17/05/2013  MARCA: CR964              *                                
      * AUTOR: JMARTINEZP                                          *                                
      * DOCUMENTACIÓ: MODIFICACIONES CUBOS / ESTADÍSTICAS          *                                
      **************************************************************                                
CR530 * DATA DE MODIFICACIÓ: 03/12/2013  MARCA: CR530              *                                
CR530 * AUTOR: JLMARTIN                                            *                                
CR530 * DOCUMENTACIÓ: ALTA PEDIDOS CONFIRMADOS MISMAS COMPROBACION *                                
CR530 **************************************************************                                
22716 * DATA DE MODIFICACIÓ: 04/03/2014  MARCA: 22716              *                                
22716 * AUTOR: JLMARTIN                                            *                                
22716 * DOCUMENTACIÓ: CAMBIAR COMPROBACIÓN DE PEDIDOS CONFIRMADOS  *                                
22716 **************************************************************                                
C1341 * DATA DE MODIFICACIÓ: 09/04/2014  MARCA: C1341              *                                
C1341 * AUTOR: Josep Aragonès   DE01091                            *                                
C1341 * DOCUMENTACIÓ: Pedidos configurador Cannibal                *                                
C1341 *  Si el pedido tiene la marca Tipo LINER DLGA=INTER         *                                
C1341 **************************************************************                                
C1579 * Modificación: CR1579                                       *                                
C1579 *        Autor: Javier Arbide                                *                                
C1579 * Fecha Inicio: 01/04/2014                                   *                                
C1579 *  Descripción: Envío automático pedidos recambios a Poolweb *                                
C1579 **************************************************************                                
C     * DATA DE MODIFICACIÓ: 06/05/2014  MARCA: Q0322              *                                
C     * AUTOR: JMARTINEZP       DE01223                            *                                
C     * DOCUMENTACIÓ: INCIDENCIA DIRECCIONES FD                    *                                
C     **************************************************************                                
H2506 * Modificación: H2506                                        *                                
H2506 *        Autor: V.Garces                                                                      
H2506 * Fecha Inicio: 09/06/2014                                   *                                
H2506 *  Descripción: No permitir opcion 36 reabrir pedidos si no  *                                
H2506 *               procede                                      *                                
H2506 **************************************************************                                
C1983 * Modificación: CR1983       Marca:C1983                     *                                
C1983 *        Autor: JLMARTIN                                     *                                
C1983 * Fecha Inicio: 30/06/2014                                   *                                
C1983 *  Descripción: Control modificaciones pedidos PoolWeb       *                                
C1983 **************************************************************                                
C1078 * DATA DE MODIFICACIÓ: 19/01/2012  MARCA: C1078              *                                
C1078 * AUTOR: JMARTINEZP                                          *                                
C1078 * DOCUMENTACIÓ: DOM                                          *                                
C1078 **************************************************************                                
C2638 * Modificación: CR2638       Marca:C2638                     *                                
C2638 *        Autor: Javier Arbide                                *                                
C2638 * Fecha Inicio: 14/04/2015                                   *                                
C2638 *  Descripción: Problema en la sincronización del cambio de  *                                
C2638 *               dirección en los pedidos de compras          *                                
C2638 **************************************************************                                
C2556 * DATA DE MODIFICACIÓ: 03/03/2015  MARCA: C2556              *                                
C2556 * AUTOR: Josep Aragonès   DE02298                            *                                
C2556 * DOCUMENTACIÓ: Pasar campo EDME de ventas a compras y a TRxx*                                
C2556 **************************************************************                                
C2559 * DATA DE MODIFICACIÓ: 18/03/2015  MARCA: C2559      CR2559  *                                
C2559 * AUTOR: Javier Arbide                                       *                                
C2559 * DOCUMENTACIÓ: Anulación artículos tipo B en pedidos        *                                
C2559 *               Incluir cierre autómatico líneas (EDAU=051)  *                                
C2559 **************************************************************                                
C2676 * Modificación: CR2676       Marca:C2676                     *                                
C2676 *        Autor: JRGONZALEZ                                   *                                
C2676 * Fecha Inicio: 28/04/2015                                   *                                
C2676 *  Descripción: AL REABRIR UNA LINEA SE HA DE ENVIAR LA      *                                
C2676 *               DIRECCION                                    *                                
C2676 **************************************************************                                
C2770 * Modificación: CR2770       Marca:C2770                     *                                
C2770 *        Autor: Manuel Alonso                                *                                
C2770 * Fecha Inicio: 19/06/2015                                   *                                
C2770 *  Descripción: Solucionar error de altas duplicadas en      *                                
C2770 *               WH0035                                       *                                
C2770 **************************************************************                                
M345B * Modificación: M345B        Marca:M345B                     *                                
M345B *        Autor: JONATHAN MARTINEZ                            *                                
M345B * Fecha Inicio: 11/11/2016                                   *                                
M345B *  Descripción: EN EL CASO DE SER UN CAMBIO DE COENVIO       *                                
M345B *               ENVIAREMOS UN TR0036 CON OPCION = 9          *                                
M345B **************************************************************                                
PD838 * Modificación: PD838        Marca:PD838                     *                                
PD838 *        Autor: JONATHAN MARTINEZ                            *                                
PD838 * Fecha Inicio: 12/12/2016                                   *                                
PD838 *  Descripción: EN EL CASO DE CAMBIAR DIRECCIÓN TB ENVIAMOS  *                                
PD838 *               EL CAMBIO DE LA '1'                          *                                
PD838 **************************************************************                                
PD838 * Modificación: PJ933        Marca:PJ933                     *                                
PD838 *        Autor: JONATHAN MARTINEZ                            *                                
PD838 * Fecha Inicio: 05/04/2017                                   *                                
PD838 *  Descripción: ANOTACIONES EN EDTRLP                        *                                
PD838 *                                                            *                                
PD838 **************************************************************                                
C4137* Data de Modificació: 26/09/2017  Marca: C4137              *                                
C4137* Autor: Cecilio Ruiz                                        *                                
C4137* Documentació: 171 - SIBO DC - ORDERS                       *                                
C4137**************************************************************                                
C0518* Data de Modificació: 05/01/2018  Marca: C0518              *                                
C0518* Autor: TONI LÓPEZ                                          *                                
C0518* Documentació: ERROR EN CANTIDAD PARA PRECIO                *                                
C0518**************************************************************                                
C4406* Data de Modificació: 03/05/2018  Marca: C4406              *                                
C4406* Autor: Jordi Montesinos                                    *                                
C4406* Documentació: Fluidra Direct con UNISTRAL Recambios        *                                
C4406**************************************************************                                
C5442* Data de Modificació: 11/03/2020  Marca: C5442              *                                
C5442* Autor: Julian                                              *                                
C5442* Documentació:Si pedido en P en comerc. crear nueva compra  *                                
C5442**************************************************************                                
I0164* DATA DE MODIFICACIÓ: 01/09/2020  MARCA: I0164  (ITOM164)   *                                
I0164* AUTOR: Javier Arbide                                       *                                
I0164* DOCUMENTACIÓ: Creación automática de Kit en Distribuidor   *                                
I0164**************************************************************                                
I0161* Modificación: ITOM161            Marca: I0161              *                                
I0161*        Autor: JULIAN                                       *                                
I0161* Fecha Inicio: 28/09/2020                                   *                                
I0161*  Descripción: ENVIAR OBSERVACION TIPO 2                    *                                
I0161**************************************************************                                
I0200* DATA DE MODIFICACIÓ: 26/01/2021  MARCA: I0200  (ITOM200)                                    
I0200* AUTOR: Javier Arbide                                                                        
I0200* DOCUMENTACIÓ: Marcar pedidos de cliente de exportación                                      
I0200******************************************************************                            
F-2OL * DATA DE MODIFICACIÓ: 25/11/2021  MARCA: F-2OL              *                                
F-2OL * AUTOR: David Grau                                          *                                
F-2OL * DOCUMENTACIÓ: 2OL- Obrir a més d'un OL                     *                                
F-2OL **************************************************************                                
CQ718* Fecha Inicio: 10/12/2021            MARCA: CQ718 (CRQ-718) *                                
CQ718*       Autor : Manuel Alonso                                *                                
CQ718* Descripción : Controlar consolidación de nuevos pedidos FD *                                
CQ718**************************************************************                                
GP581* DATA DE MODIFICACIÓ: 29/03/2022                                                             
GP581* AUTOR: Lluís Albert Grau                                                                    
GP581* DOCUMENTACIÓ: Alteración cierre lineas AS400                                                
GP581*               Modificar PV para desvincular compra                                          
GP581*               Cerrar línea pedido de compra en lugar de borrar y Quitar TPE4='2'            
GP581*               Borrar EDTRLP (Ya se hace actualmente)                                        
GP581*               Quitar vinculación con la venta                                               
GP581*               Enviar cierre a M3                                                            
GP581* MARCA: GP581 (PGP-581)                                                                      
GP581******************************************************************                            
46222* Modificación: FSD146222            Marca: 46222                                             
46222*        Autor: Lluís Albert Grau                                                             
46222* Fecha Inicio: 01/08/2022                                                                    
46222*  Descripción: Error precio de compra pedidos s/c FD                                         
46222*               de Salesforce                                                                 
46222**************************************************************                                
OL187 // DATA DE MODIFICACIÓ: 19/09/2022  MARCA: OL187    OL2-187                                   
OL187 // AUTOR: Multiples Autors                                                                    
OL187 // DOCUMENTACIÓ: Correccions varies per Kits                                                  
OL187 //////////////////////////////////////////////////////////////////////////////////////////    
E7153 // DATA DE MODIFICACIÓ: 19/09/2022  MARCA: E7153                                              
E7153 // AUTOR: MMontana                                                                            
E7153 // DOCUMENTACIÓ: Correcció crida MM1411                                                       
E7153 //////////////////////////////////////////////////////////////////////////////////////////    
OL187H DFTACTGRP(*NO)                                                                               
     H DATEDIT(*YMD/)                                                                               
     H OPTION(*NODEBUGIO:*SRCSTMT)                                                                  
      *                                                                                             
     FCOCAPE    UF   E           K DISK                                                             
     FCODEPE    UF   E           K DISK                                                             
     FCODIPE    IF   E           K DISK                                                             
     FCOOBPE    IF   E           K DISK                                                             
      *                                                                                             
     FPUCAPE    UF A E           K DISK                                                             
     FPUDEPE    UF A E           K DISK                                                             
     FPUOBPE    UF A E           K DISK                                                             
     FPUDIPE    UF A E           K DISK                                                             
      *                                                                                             
     FMSOBAR    IF   E           K DISK                                                             
     FMSPAIS    IF   E           K DISK                                                             
     FMSARTI00  IF   E           K DISK                                                             
     FMSCOJC    IF   E           K DISK                                                             
     FMSCOJD    IF   E           K DISK                                                             
     FPMUNAL    IF   E           K DISK                                                             
     FPUPROV    IF   E           K DISK                                                             
     FPUDTO0    IF   E           K DISK                                                             
     FPUPRP0    IF   E           K DISK                                                             
     FPUDIVI    IF   E           K DISK                                                             
     FMSALMA    IF   E           K DISK                                                             
     FMSALMA05  IF   E           K DISK    RENAME(RMSALMA:RMSALMA05)                                
     FMSLOGI    IF   E           K DISK                                                             
     FPMEMPR    IF   E           K DISK                                                             
     FPMJOBC    IF   E           K DISK                                                             
     FPMSETP    IF   E           K DISK                                                             
     FPMTAB2    IF   E           K DISK                                                             
     FUTCOM0    IF   E           K DISK                                                             
     FUTDEST    IF   E           K DISK                                                             
     FPMTABD    IF   E           K DISK                                                             
     FPMLIBL    IF   E           K DISK                                                             
I0164FPUPRCJ    IF   E           K DISK    PREFIX(P_)                                               
      *                                                                                             
     FEDTRLP00  IF   E           K DISK    RENAME(EDTRLP:REDTRLP00)                                 
     FED0050W   IF   E           K DISK                                                             
      *                                                                                             
     FTR0035    O  A E           K DISK                                                             
     FTR0036    O  A E           K DISK                                                             
     FTR0037    O  A E           K DISK                                                             
     FTR0038    O  A E           K DISK                                                             
21050FPUBCAP    O    E           K DISK                                                             
21050FPUBDEP    O    E           K DISK                                                             
M345B                                                                                               
M345BFAQPEDI10  IF   E           K DISK                                                             
C4137*                                                                                             
C4137ftr0435    o    e             disk                                                             
C4137fpucedi    if   e           k disk                                                             
C4137feiexce    if   e           k disk                                                             
C4406f*C4137 edparm    if   e           k disk                                                      
F-2OLFMSSTOK    IF   E           K DISK                                                             
C4137*                                                                                             
      *                                                                                             
      *                                                                                             
     D                SDS                                                                           
     D  SDSPGM                 1     10                                                             
     D  SDSJOB               244    253                                                             
     D  SDSSTS           *STATUS                                                                    
     D  SDSUSR               254    263                                                             
     D  SDSJNBR              264    269                                                             
      *                                                                                             
     D  @PCIAS         S                   LIKE(S5CIAS)                                             
     D  @PDLGA         S                   LIKE(S5DLGA)                                             
     D  @PNPCO         S                   LIKE(S5NPCO)                                             
     D  @PTPED         S                   LIKE(S5TPED)                                             
     D  @PDATP         S                   LIKE(S5DATP)                                             
     D  @PNOPL         S                   LIKE(S5NOPL)                                             
     D  @PLINE         S                   LIKE(S5LINE)                                             
     D  @PEDAU         S              3                                                             
     D  @PJOBT         S                   LIKE(JOTRAT)                                             
     D  @PFIN          S              1  0                                                          
      * 2OL                                                                                         
F-2OLD  @PALMA         S                   LIKE(m1maga)                                             
F-2OLD  @PTIPO         S              1                                                             
F-2OLD  @PRESP         S                   like(m1maga)                                             
      *                                                                                             
     D  @PECIAS        S                   LIKE(S5CIAS)                                             
     D  @PEDLGA        S                   LIKE(S5DLGA)                                             
     D  @PENPCO        S                   LIKE(S5NPCO)                                             
     D  @PETPED        S                   LIKE(S5TPED)                                             
     D  @PEDATP        S                   LIKE(S5DATP)                                             
     D  @PENOPL        S                   LIKE(S5NOPL)                                             
     D  @PELINE        S                   LIKE(S5LINE)                                             
     D  @PEERR         S              1                                                             
     D  @PEFINA        S              1                 INZ                                         
     D  @PEPROC        S              1                 INZ                                         
     D  @PEARVM        S             25                                                             
     D  @PECADP        S                   LIKE(C5CADP)                                             
     D  @PECANT        S                   LIKE(C5CANT)                                             
     D  @PECLTR        S                   LIKE(C5CLTR)                                             
     D  @PEDTO1        S                   LIKE(C5DTO1)                                             
     D  @PEDTO2        S                   LIKE(C5DTO2)                                             
     D  @PEDTO3        S                   LIKE(C5DTO3)                                             
     D  @PEDTO4        S                   LIKE(C5DTO4)                                             
     D  @PEFPED        S                   LIKE(C0FPED)                                             
     D  @PEMONB        S                   LIKE(C0MONE)                                             
     D  @PEMONE        S                   LIKE(C0MONE)                                             
     D  @PEMONP        S                   LIKE(C0MONE)                                             
     D  @PEPREC        S                   LIKE(C5PREC)                                             
     D  @PEPRMO        S                   LIKE(C5PRMO)                                             
     D  @PEPRVR        S                   LIKE(C5PRVR)                                             
     D  @PECUST        S                   LIKE(C0CUST)                                             
     D  @PETCOJ        S                   LIKE(C5TCOJ)                                             
     D  @PETCST        S                   LIKE(C5TCST)                                             
     D  @PETPPR        S              1                                                             
     D  @PEUNDP        S                   LIKE(C5UNDP)                                             
     D  @PEUNIM        S                   LIKE(C5UNIM)                                             
     D  @PEZXCO        S             12  7                                                          
     D  ZXDES1         S                   LIKE(M5DES1)                                             
     D  ZXCANT         S                   LIKE(C5CANT)                                             
     D  ZXUNIM         S                   LIKE(C5UNIM)                                             
     D    @PETDVA      S              1                                                             
     D    @PACT0       S              1                                                             
     D    @PACT1       S              1                                                             
     D    @PACT2       S              1                                                             
     D    @PEPRG2      S             10                                                             
      *                                                                                             
     D  @FDCIAS        S                   LIKE(T0CIAS)                                             
     D  @FDDLGA        S              5                                                             
     D  @FDNPCO        S             10                                                             
     D  @FDTPED        S              2                                                             
     D  @FDDATP        S                   LIKE(T0DATP)                                             
     D  @FDNOPL        S                   LIKE(T0NOPL)                                             
     D  @FDLINE        S              3p 0                                                          
     D  @FDCIA2        S                   LIKE(T0CIA2)                                             
     D  @FDDLG2        S              5                                                             
     D  @FDNPC2        S             10                                                             
     D  @FDTPE2        S              2                                                             
     D  @FDDAT2        S                   LIKE(T0DAT2)                                             
     D  @FDNOP2        S                   LIKE(T0NOP2)                                             
     D  @FDLIN2        S                   LIKE(T0LIN2)                                             
     D  @FDLOGI        S              1  0                                                          
     D  @FDORIG        S              1  0                                                          
     D  @FDEDAU        S              3                                                             
     D  @FDERAV        S              3                                                             
     D  @FDTEXT        S             50                                                             
     D  @FDDATO        S            300                                                             
     D  @FDWAUD        S              1  0                                                          
     D  @FDCANT        S                   LIKE(T0CANT)                                             
      *                                                                                             
     D  @PECADENA      S            120                                                             
     D  @PEACCION      S              1                                                             
     D  @PEERROR       S              1                                                             
C1579D  @PEERRO        S              1                                                             
C1579D  @PCIAS1        S              3                                                             
C1579D  @PDATP1        S              8                                                             
C1579D  @PNOPL1        S              6                                                             
      *                                                                                             
     D  ZXNOCONF       S              1  0 INZ                                                      
     D  ZXDCOJ         S              1  0 INZ                                                      
     D  ZXSENDCAB      S              1  0                                                          
H2506D  ZXSEND019      S              1  0                                                          
C4137*                                                                                             
C4137d  zxexcepcion    s              1  0                                                          
C4137d  zxnograbar     s              1                                                             
C4137*                                                                                             
      *                                                                                             
     D  S0AMPL         DS                                                                           
     D    S0COEN               1      1                                                             
     D    S0RSPP               2      2                                                             
FQ604D    S0EDME              65     65                                                             
FQ604D**  S0RESTO              3    100                                                             
C1341 *                                                                                             
C1341D  S0AMP1         DS                                                                           
C1341D    S0DECA              36     36                                                             
      *                                                                                             
     D  S5AMPL         DS                                                                           
     D    S5NCOE               1      2                                                             
     D    S5FOEP               3     10                                                             
     D    S5FORE              11     18                                                             
     D    S5NCOI              19     20                                                             
     D    S5NCOF              21     22                                                             
     D    S5RESTO             23    100                                                             
      *                                                                                             
     D  C0AMPL         DS                                                                           
     D    C0COEN               1      1                                                             
C1341D    C0DECA              30     30                                                             
     D    C0TOLI              48     50                                                             
FQ604D    C0EDME              51     51                                                             
FQ604D**  C0RESTO              5    100                                                             
      *                                                                                             
     D  C5AMPL         DS                                                                           
     D    C5NCOE               1      2                                                             
     D    C5FOEP               3     10                                                             
     D    C5FORE              11     18                                                             
     D    C5NCOI              19     20                                                             
     D    C5NCOF              21     22                                                             
     D    C5ECOP              24     24                                                             
FQ709D    C5CROT              26     26                                                             
FQ709D    C5CROP              27     27                                                             
FQ709D    C5CROTA             28     29                                                             
FQ709D    C5CROTB             30     31                                                             
FQ709D    C5CROTC             32     33                                                             
FQ709D*   C5RESTO             25    100                                                             
     D*   C5RESTO             23    100                                                             
                                                                                                    
FQ709D  @QCIAS         S                   LIKE(C5CIAS)                                             
FQ709D  @QDLGA         S                   LIKE(C5DLGA)                                             
FQ709D  @QLOGE         S                   LIKE(C5LOGE)                                             
FQ709D  @QARTI         S                   LIKE(C5ARTI)                                             
FQ709D  @QVARI         S                   LIKE(C5VARI)                                             
FQ709D  @QMODE         S                   LIKE(C5MODE)                                             
FQ709D  @QTCOJ         S              1A                                                            
FQ709D  @QCROT         S              2A                                                            
FQ709D  @QCROTA        S              2A                                                            
FQ709D  @QCROTB        S              2A                                                            
FQ709D  @QCROTC        S              2A                                                            
FDX01 *                                                                                             
FDX01 * Variable para saber la situación de los componentes                                         
FDX01 * de un conjunto de venta y su situación para                                                 
FDX01 * la distribución                                                                             
FDX01 *                                                                                             
FDX01D  @PSICO         S              1                                                             
FDX01 *                                                                                             
     D DSLDA         E DS                  EXTNAME(PURLDADS)                                        
      *                                                                                             
     D                 DS                                                                           
     D  JOTRAT                 1     18                                                             
     D   ZXJNBR                1      6                                                             
     D   ZXDATA                7     12                                                             
     D   ZXHORA               13     18  0                                                          
      *                                                                                             
     D  PU2540       E DS                  EXTNAME(PU2540DS)                                        
     D  PU0120       E DS                  EXTNAME(PU0120DS)                                        
      *                                                                                             
     D                 DS                                                                           
     D  ZXARVMX                1     25                                                             
     D    ZXARTIX              1     15                                                             
     D    ZXVARIX             16     18                                                             
     D    ZXMODEX             19     21                                                             
      *                                                                                             
     D  ZYARTI         S                   LIKE(NDARTI)                                             
     D  ZYVARI         S                   LIKE(NDVARI)                                             
     D  ZYMODE         S                   LIKE(NDMODE)                                             
     D  ZYTCOJ         S                   LIKE(NDTCOJ)                                             
     D  ZXARTIBS       S                   LIKE(NDARTI)                                             
     D  ZXVARIBS       S                   LIKE(NDVARI)                                             
     D  ZXMODEBS       S                   LIKE(NDMODE)                                             
     D  ZXUNIMBS       S                   LIKE(NDUNIM)                                             
      *                                                                                             
     D                 DS                                                                           
     D  ZXARVM                 1     25                                                             
     D    ZXARTI               1     15                                                             
     D    ZXVARI              16     18                                                             
     D    ZXMODE              19     21                                                             
      *                                                                                             
     D  ZXTCOJ         S                   LIKE(NDTCOJ)                                             
     D    ZXERRO       S              1                                                             
     D  ZXAUXI2        S             29  9                                                          
     D  ZXCANCON       S             29  9                                                          
     D  ZXAUXI3        S             29  9                                                          
     D  ZXAUXIBS       S             29  9                                                          
     D  ZXLEA1         S              5  0                                                          
     D  ZXFREP1        S                   LIKE(C0FREP) INZ                                         
     D  ZXFREP2        S                   LIKE(C0FREP) INZ                                         
     D  ZXFREPI        S               D   DATFMT(*ISO)                                             
     D  ZXUTCOMU       S              1  0                                                          
     D  ZXOPC0         S                   LIKE(C5OPC0)                                             
     D  ZXEVR0         S                   LIKE(C5EVR0)                                             
     D  ZXEVOL         S                   LIKE(C5EVOL)                                             
     D  ZXEVPR         S                   LIKE(C5EVPR)                                             
     D  ZXTIME         S                   LIKE(C0HORA)                                             
     D  ZXCHKS         S              3  0                                                          
18060D  ZXTLIN         S                   LIKE(T0LINE)                                             
C1579D  ZXPRVR         S                   LIKE(M5PRVR)                                             
C1579D  ZXPWEB         S              1                                                             
C1983D  ZXPWP0         S              1                                                             
I0164D  KitAsigPrv     S               n                                                            
I0200D  ZXEXPORT       S              1                                                             
      *                                                                                             
      *Ecotaxe                                                                                     
      *                                                                                             
     D  M5AMPL         DS                                                                           
     D    M5ECOP               8      8                                                             
20070D    M5NOED              63     63                                                             
      *                                                                                             
     D  ZXARTPOR       S                   LIKE(S5ARTI)                                             
      *                                                                                             
     D  PPBL10         DS                                                                           
     D  PPBL08                 1      8                                                             
     D  PPMVXV                 9      9                                                             
     D  PPMVXE                10     10                                                             
      *                                                                                             
     D  C0AMP2         DS                                                                           
     D  C0PEVT                 1      1                                                             
     D  C0SUNO                 2     11                                                             
     D  C0PEST                12     21                                                             
     D  C0PGRP                22     22                                                             
     D  C0HDLG                23     25                                                             
     D  C0TDID                27     28                                                             
     D  C0APETX               29     33                                                             
     D  C0XXXX                34     34                                                             
     D  C0BRPG                35     36                                                             
     D  C0SERS                37     38                                                             
     D  C0RESTOxx             39     99                                                             
CQ718D  C0CNFD                68     68                                                             
      *                                                                                             
     D Z1COMA          DS          2000                                                             
     DSDE              S              1A   DIM(10)                                                  
     D  C              S              1A   DIM(1) CTDATA PERRCD(1)                                  
     DSPROV            S             10A   DIM(999)                                                 
C2638D*31030*SPRO2            S             10A   DIM(999)                                          
C2638 * Incluiremos el pedido al proveedor (C0PRVR+C0NPCO)                                          
C2638D SPRO2           S             20A   DIM(999)                                                 
C2638D ZXPR2_PED       S             20                                                             
     DBP               S              3  0                                                          
31030DBP2              S              3  0                                                          
     D  ZXTRAT         S              1  0                                                          
09060D ZXDELPUCAPE     S              1                                                             
15041D ZXEXISCOM       S              1                                                             
15612D ZXPRIVEZ        S              1                                                             
In199 *                                                                                             
In199D  DSTEXT         DS                                                                           
In199D  ZXLOGANT               1      3                                                             
In199D  ZXFLECH                5      6                                                             
In199D  ZXLOGPOS               8     10                                                             
In199D  ZXLOGE         S                   LIKE(C5LOGE)                                             
09091D  ZXCANT_SAV     S                   LIKE(C5CANT)                                             
CR964                                                                                               
CR964D  @QLOFD         S              2A                                                            
CR530D  ZXPEDCON       S              1  0                                                          
Q0322DSPR_PED          S             20A   DIM(999)                                                 
Q0322DZXPR_PED         S             20A                                                            
C1078D                                                                                              
C1078D  ZXPRVR_DOM     S             10                                                             
M345B                                                                                               
M345B * Parámetros para GX0150 (Entorno Movex)                                                      
M345BD  @PECONO        S              3P 0                                                          
M345BD  @PEDIVI        S              3                                                             
M345BD  @PEUSER        S             10                                                             
M345BD  @PEVAL         S            250                                                             
M345BD  ZXVAL          DS                                                                           
M345BD    MXCONO               1      3                                                             
M345BD    MXDIVI               4      6                                                             
M345BD    MXIDIO               7      8                                                             
M345BD    MXMONE               9     11                                                             
M345BD    MXRESTO             12    250                                                             
PD889D  ZXCONFIRMADO   S              1                                                             
PD933D  ZXPECABE       S              1                                                             
OL187   DCL-S GPROP IND INZ;                                                                        
C4137*                                                                                             
C4137d                 ds                                                                           
C4137d c0aml1                  1    100                                                             
C4137d   c0edic                1      1                                                             
C4137d   c0fedi                2      9                                                             
C4137d   c0uedi               10     19                                                             
C4137*                                                                                             
C4137d  t3ampl         ds                                                                           
C4137d     t3opl1              1      3                                                             
C4137d     t3opl2              4      6                                                             
C4137d     t3rese              7      7                                                             
C4137d     t3rtre              8      8                                                             
C4137d     t3lvir              9     11                                                             
C4137d     t3vfyb             12     12                                                             
C4137d     t3fdsc             15     15                                                             
C4137d     t3pppp             34     34                                                             
C4137d     t3alpr             35     35                                                             
C4137*                                                                                             
      **********************************************************************                        
      * Rutina principal                                                                            
      **********************************************************************                        
      *                                                                                             
     C                   EVAL      S5CIAS=@PCIAS                                                    
     C                   EVAL      S5DLGA=@PDLGA                                                    
     C                   EVAL      S5NPCO=@PNPCO                                                    
     C                   EVAL      S5TPED=@PTPED                                                    
     C                   EVAL      S5DATP=@PDATP                                                    
     C                   EVAL      S5NOPL=@PNOPL                                                    
     C                   EVAL      S5LINE=@PLINE                                                    
     C                   EVAL      S0CIAS=@PCIAS                                                    
     C                   EVAL      S0DLGA=@PDLGA                                                    
     C                   EVAL      S0NPCO=@PNPCO                                                    
     C                   EVAL      S0TPED=@PTPED                                                    
     C                   EVAL      S0DATP=@PDATP                                                    
     C                   EVAL      S0NOPL=@PNOPL                                                    
03060C                   TIME                    ZXHORA                                             
      *                                                                                             
     C                   IF        @PFIN<>1                                                         
PD889C                   EVAL      ZXCONFIRMADO=' '                                                 
PD889C     KCOCAPE       CHAIN(N)  COCAPE                                                           
PD889C*C5442             IF        %FOUND AND S0STCO>='20'                                          
C5442C                   IF        %FOUND AND S0STCO>='2P'                                          
PD933C                   IF        ZXPECABE='1'                                                     
PD933C                   EVAL      ZXPEDCON=0                                                       
PD933C                   ELSE                                                                       
PD933C                   EVAL      ZXPEDCON=1                                                       
PD933C                   ENDIF                                                                      
PD889C                   EVAL      ZXCONFIRMADO='1'                                                 
PD889C                   ENDIF                                                                      
      *                                                                                             
      * Si nos llega 1 línea                                                                        
      *                                                                                             
     C                   IF        @PLINE<>0                                                        
     C     KCODEPE       CHAIN(N)  CODEPE                                                           
     C                   IF        %FOUND(CODEPE)                                                   
     C                             AND S5TLIN<'1'                                                   
     C                             AND S5ARTI<>ZXARTPOR                                             
     C                   EXSR      CS_MAIN                                                          
15040 * Si nos llega 1 alta de linea de un pedido ya confirmado y                                   
15040 * hemos grabado cabecera porque es un nuevo proveedor envio                                   
15040 * TR0035                                                                                      
15040C                   IF        ZXMASL=1 And ZXNEWC=1                                            
11050C                   EVAL      ZXOPC0='1'                                                       
15040C                   EXSR      CS_SNDALTCAB                                                     
15040C                   ENDIF                                                                      
11050 *                                                                                             
11050 * Si nos llega 1 alta de linea de un pedido ya confirmado y                                   
11050 * aunque ya se grabó cabecera, se vuelve a enviar para actualizar                             
11050 * CHKSUM                                                                                      
11050C                   IF        ZXMASL=1 AND ZXNEWC=0                                            
11050C                   EVAL      ZXOPC0='2'                                                       
11050C                   EXSR      CS_SNDALTCAB                                                     
11050C                   ENDIF                                                                      
11050 *                                                                                             
     C                   ENDIF                                                                      
      *                                                                                             
      * Si nos llega sin línea hacemos todo el pedido                                               
      *                                                                                             
     C                   ELSE                                                                       
     C     KCODEPE       SETLL     CODEPE                                                           
     C     KCODEPE0      READE(N)  CODEPE                                                           
     C                   DOW       NOT %EOF(CODEPE)                                                 
     C                   IF        S5TLIN<'1'                                                       
     C                             AND S5ARTI<>ZXARTPOR                                             
     C                   EVAL      @PLINE=S5LINE                                                    
     C                   EXSR      CS_MAIN                                                          
     C                   ENDIF                                                                      
     C     KCODEPE0      READE(N)  CODEPE                                                           
     C                   ENDDO                                                                      
      *                                                                                             
     C                   ENDIF                                                                      
      *                                                                                             
      * Comprobar trazabilidad de la cabecera de Ventas                                             
      *                                                                                             
     C                   EXSR      CS_DELTRACAB                                                     
      *                                                                                             
      * Enviar las cabeceras de compra de todos los pedidos ED                                      
      * cuando ya tenga todas las líneas (@PFIN=1)                                                  
      *                                                                                             
     C                   ELSE                                                                       
In199C                   IF        @PEDAU<>'011'                                                    
11050C                   EVAL      ZXOPC0='1'                                                       
     C                   EXSR      CS_SNDALTCAB                                                     
In199C                   ENDIF                                                                      
     C                   ENDIF                                                                      
      *                                                                                             
     C                   SETON                                        LR                            
      **********************************************************************                        
      * Subrutina inicial                                                  *                        
      **********************************************************************                        
     C     *INZSR        BEGSR                                                                      
      *                                                                                             
      * Claves                                                                                      
      *                                                                                             
     C     KPMJOBC       KLIST                                                                      
     C                   KFLD                    @PJOBT                                             
     C                   KFLD                    JOLINE                                             
      *                                                                                             
     C     KPMSETP       KLIST                                                                      
     C                   KFLD                    PICIAS                                             
     C                   KFLD                    PIPROG                                             
     C                   KFLD                    PIUSU1                                             
      *                                                                                             
     C     KCOCAPE       KLIST                                                                      
     C                   KFLD                    S0CIAS                                             
     C                   KFLD                    S0DLGA                                             
     C                   KFLD                    S0NPCO                                             
     C                   KFLD                    S0TPED                                             
     C                   KFLD                    S0DATP                                             
     C                   KFLD                    S0NOPL                                             
      *                                                                                             
     C     KCODIPE       KLIST                                                                      
     C                   KFLD                    S2CIAS                                             
     C                   KFLD                    S2DLGA                                             
     C                   KFLD                    S2NPCO                                             
     C                   KFLD                    S2TPED                                             
     C                   KFLD                    S2DATP                                             
     C                   KFLD                    S2NOPL                                             
     C                   KFLD                    S2CDIR                                             
      *                                                                                             
     C     KCODEPE0      KLIST                                                                      
     C                   KFLD                    S5CIAS                                             
     C                   KFLD                    S5DLGA                                             
     C                   KFLD                    S5NPCO                                             
     C                   KFLD                    S5TPED                                             
     C                   KFLD                    S5DATP                                             
     C                   KFLD                    S5NOPL                                             
      *                                                                                             
     C     KCODEPE       KLIST                                                                      
     C                   KFLD                    S5CIAS                                             
     C                   KFLD                    S5DLGA                                             
     C                   KFLD                    S5NPCO                                             
     C                   KFLD                    S5TPED                                             
     C                   KFLD                    S5DATP                                             
     C                   KFLD                    S5NOPL                                             
     C                   KFLD                    S5LINE                                             
      *                                                                                             
     C     KPUPROV       KLIST                                                                      
     C                   KFLD                    C0CIAS                                             
     C                   KFLD                    C0PRVR                                             
      *                                                                                             
     C     KPUCAPE       KLIST                                                                      
     C                   KFLD                    C0CIAS                                             
     C                   KFLD                    C0DLGA                                             
     C                   KFLD                    C0NPCO                                             
     C                   KFLD                    C0TPED                                             
     C                   KFLD                    C0DATP                                             
     C                   KFLD                    C0NOPL                                             
      *                                                                                             
     C     KPUDEPE       KLIST                                                                      
     C                   KFLD                    C5CIAS                                             
     C                   KFLD                    C5DLGA                                             
     C                   KFLD                    C5NPCO                                             
     C                   KFLD                    C5TPED                                             
     C                   KFLD                    C5DATP                                             
     C                   KFLD                    C5NOPL                                             
     C                   KFLD                    C5LINE                                             
      *                                                                                             
     C     KPUDEPEX      KLIST                                                                      
     C                   KFLD                    C5CIAS                                             
     C                   KFLD                    C5DLGA                                             
     C                   KFLD                    C5NPCO                                             
     C                   KFLD                    C5TPED                                             
     C                   KFLD                    C5DATP                                             
     C                   KFLD                    C5NOPL                                             
      *                                                                                             
     C     KPUOBPE       KLIST                                                                      
     C                   KFLD                    C0CIAS                                             
     C                   KFLD                    C0DLGA                                             
     C                   KFLD                    C0NPCO                                             
     C                   KFLD                    C0TPED                                             
     C                   KFLD                    C0DATP                                             
     C                   KFLD                    C0NOPL                                             
     C                   KFLD                    C0LINP                                             
     C                   KFLD                    C0IDIO                                             
     C                   KFLD                    C0LINE                                             
FQ604 *                                                                                             
FQ604C     KPUOBPE0      KLIST                                                                      
FQ604C                   KFLD                    C0CIAS                                             
FQ604C                   KFLD                    C0DLGA                                             
FQ604C                   KFLD                    C0NPCO                                             
FQ604C                   KFLD                    C0TPED                                             
FQ604C                   KFLD                    C0DATP                                             
FQ604C                   KFLD                    C0NOPL                                             
      *                                                                                             
07053C     KPUOBPE1      KLIST                                                                      
07053C                   KFLD                    C0CIAS                                             
07053C                   KFLD                    C0DLGA                                             
07053C                   KFLD                    C0NPCO                                             
07053C                   KFLD                    C0TPED                                             
07053C                   KFLD                    C0DATP                                             
07053C                   KFLD                    C0NOPL                                             
07053C                   KFLD                    C0LINP                                             
      *                                                                                             
     C     KCOOBPE       KLIST                                                                      
     C                   KFLD                    S0CIAS                                             
     C                   KFLD                    S0DLGA                                             
     C                   KFLD                    S0NPCO                                             
     C                   KFLD                    S0TPED                                             
     C                   KFLD                    S0DATP                                             
     C                   KFLD                    S0NOPL                                             
     C                   KFLD                    S0LINP                                             
      *                                                                                             
     C     KPUDIPE       KLIST                                                                      
     C                   KFLD                    C2CIAS                                             
     C                   KFLD                    C2DLGA                                             
     C                   KFLD                    C2NPCO                                             
     C                   KFLD                    C2TPED                                             
     C                   KFLD                    C2DATP                                             
     C                   KFLD                    C2NOPL                                             
     C                   KFLD                    C2CDIR                                             
      *                                                                                             
     C     KPUPRP0       KLIST                                                                      
     C                   KFLD                    C3CIAS                                             
     C                   KFLD                    C3PRVR                                             
     C                   KFLD                    C3ARVM                                             
     C                   KFLD                    C3TCOJ                                             
      *                                                                                             
     C     KMSOBAR       KLIST                                                                      
     C                   KFLD                    M5CIAS                                             
     C                   KFLD                    M5ARTI                                             
     C                   KFLD                    M5VARI                                             
     C                   KFLD                    M5MODE                                             
      *                                                                                             
     C     KMSARTI00     KLIST                                                                      
     C                   KFLD                    M5CIAS                                             
     C                   KFLD                    M5ARTI                                             
     C                   KFLD                    M5VARI                                             
     C                   KFLD                    M5MODE                                             
      *                                                                                             
     C     KMSCOJD       KLIST                                                                      
     C                   KFLD                    NDCIAS                                             
     C                   KFLD                    NDARTI                                             
     C                   KFLD                    NDVARI                                             
     C                   KFLD                    NDMODE                                             
     C                   KFLD                    NDTCOJ                                             
     C                   KFLD                    NDCOMP                                             
     C                   KFLD                    NDVAR2                                             
     C                   KFLD                    NDMOD2                                             
     C                   KFLD                    NDTCO2                                             
      *                                                                                             
     C     KMSCOJC       KLIST                                                                      
     C                   KFLD                    NDCIAS                                             
     C                   KFLD                    NDARTI                                             
     C                   KFLD                    NDVARI                                             
     C                   KFLD                    NDMODE                                             
     C                   KFLD                    NDTCOJ                                             
      *                                                                                             
     C     KPMUNAL       KLIST                                                                      
     C                   KFLD                    P6CIAS                                             
     C                   KFLD                    P6ARTI                                             
     C                   KFLD                    P6VARI                                             
     C                   KFLD                    P6MODE                                             
     C                   KFLD                    P6UNIM                                             
      *                                                                                             
     C     KPUDIVI       KLIST                                                                      
     C                   KFLD                    CDCIAS                                             
     C                   KFLD                    CDPRVR                                             
     C                   KFLD                    CDMONE                                             
     C                   KFLD                    CDFDES                                             
      *                                                                                             
     C     KPUDIVI0      KLIST                                                                      
     C                   KFLD                    CDCIAS                                             
     C                   KFLD                    CDPRVR                                             
     C                   KFLD                    CDMONE                                             
      *                                                                                             
     C     KPUDTO0       KLIST                                                                      
     C                   KFLD                    CPCIAS                                             
     C                   KFLD                    CPPRVR                                             
     C                   KFLD                    CPTPTA                                             
     C                   KFLD                    CPTPLI                                             
     C                   KFLD                    CPFDES                                             
     C                   KFLD                    CPHORA                                             
      *                                                                                             
     C     KPUDTO00      KLIST                                                                      
     C                   KFLD                    CPCIAS                                             
     C                   KFLD                    CPPRVR                                             
     C                   KFLD                    CPTPTA                                             
     C                   KFLD                    CPTPLI                                             
      *                                                                                             
     C     KMSALMA       KLIST                                                                      
     C                   KFLD                    M0CIAS                                             
     C                   KFLD                    M0MAGA                                             
      *                                                                                             
     C     KMSALMA05     KLIST                                                                      
     C                   KFLD                    M0CIAS                                             
     C                   KFLD                    M0LOGE                                             
      *                                                                                             
     C     KMSLOGI       KLIST                                                                      
     C                   KFLD                    MICIAS                                             
     C                   KFLD                    MIDLGA                                             
     C                   KFLD                    MILGCA                                             
      *                                                                                             
     C     KEDTRLP00     KLIST                                                                      
     C                   KFLD                    T0CIAS                                             
     C                   KFLD                    T0DLGA                                             
     C                   KFLD                    T0NPCO                                             
     C                   KFLD                    T0TPED                                             
     C                   KFLD                    T0DATP                                             
     C                   KFLD                    T0NOPL                                             
     C                   KFLD                    T0LINE                                             
      *                                                                                             
     C     KEDTRLP00X    KLIST                                                                      
     C                   KFLD                    T0CIAS                                             
     C                   KFLD                    T0DLGA                                             
     C                   KFLD                    T0NPCO                                             
     C                   KFLD                    T0TPED                                             
     C                   KFLD                    T0DATP                                             
     C                   KFLD                    T0NOPL                                             
      *                                                                                             
     C     KED0050W      KLIST                                                                      
     C                   KFLD                    T2CIAS                                             
     C                   KFLD                    T2DLGA                                             
     C                   KFLD                    T2NPCO                                             
     C                   KFLD                    T2TPED                                             
     C                   KFLD                    T2DATP                                             
     C                   KFLD                    T2NOPL                                             
     C                   KFLD                    T2LINE                                             
      *                                                                                             
     C     KPMTABD       KLIST                                                                      
     C                   KFLD                    PECIAS                                             
     C                   KFLD                    PECTAB                                             
     C                   KFLD                    PECLTA                                             
      *                                                                                             
     C     KPMTAB2       KLIST                                                                      
     C                   KFLD                    PECTAB                                             
     C                   KFLD                    PECLTA                                             
      *                                                                                             
     C     KUTCOM0       KLIST                                                                      
     C                   KFLD                    U0CIAS                                             
     C                   KFLD                    U0TENV                                             
     C                   KFLD                    U0CLP0                                             
     C                   KFLD                    U0CLP2                                             
      *                                                                                             
     C     KPMEMPR       KLIST                                                                      
     C                   KFLD                    P7CIAS                                             
     C                   KFLD                    P7DLGA                                             
      *                                                                                             
     C     KMSPAIS       KLIST                                                                      
     C                   KFLD                    S0CIAS                                             
     C                   KFLD                    S0PAIS                                             
M345B                                                                                               
M345BC     KAQPEDI10     KLIST                                                                      
M345BC                   KFLD                    Z1CIAS                                             
M345BC                   KFLD                    Z1CONO                                             
M345B                                                                                               
C4137*                                                                                             
C4137c     keiexce       klist                                                                      
C4137c                   kfld                    z0file                                             
C4137c                   kfld                    z0cias                                             
C4137c                   kfld                    z0pais                                             
C4137c                   kfld                    z0grp2                                             
C4137c                   kfld                    z0cust                                             
C4137c                   kfld                    z0camp                                             
C4137*                                                                                             
C4137c     kpucedi       klist                                                                      
C4137c                   kfld                    c9cias                                             
C4137c                   kfld                    c9prvr                                             
C4137*                                                                                             
C4406c*C4137     kedparm       klist                                                                
C4406c*C4137                   kfld                    t3cias                                       
C4406c*C4137                   kfld                    t3dlga                                       
C4137*                                                                                             
I0164 *                                                                                             
I0164C     KPUPRCJ       KLIST                                                                      
I0164C                   KFLD                    P_C3CIAS                                           
I0164C                   KFLD                    P_C3ARVM                                           
I0164C                   KFLD                    P_C3TCOJ                                           
I0164C                   KFLD                    P_C3PRVR                                           
I0164 *                                                                                             
I0164C     KPUPRCJa      KLIST                                                                      
I0164C                   KFLD                    P_C3CIAS                                           
I0164C                   KFLD                    P_C3ARVM                                           
I0164C                   KFLD                    P_C3TCOJ                                           
      *                                                                                             
F-2OL *                                                                                             
F-2OLc     KMSSTOK       KLIST                                                                      
F-2OLC                   KFLD                    M5CIAS                                             
F-2OLc                   KFLD                    M1MAGA                                             
F-2OLC                   KFLD                    M1ARTI                                             
F-2OLC                   KFLD                    M1VARI                                             
F-2OLC                   KFLD                    M1MODE                                             
                                                                                                   
      * Entrada de parámetros                                                                       
      *                                                                                             
     C     *ENTRY        PLIST                                                                      
     C                   PARM                    @PCIAS                                             
     C                   PARM                    @PDLGA                                             
     C                   PARM                    @PNPCO                                             
     C                   PARM                    @PTPED                                             
     C                   PARM                    @PDATP                                             
     C                   PARM                    @PNOPL                                             
     C                   PARM                    @PLINE                                             
     C                   PARM                    @PEDAU                                             
     C                   PARM                    @PJOBT                                             
     C                   PARM                    @PFIN                                              
PD933C                   PARM                    @PCABE            1                                
PD933C                   IF        %PARMS>10                                                        
PD933C                   EVAL      ZXPECABE=     @PCABE                                             
PD933C                   ENDIF                                                                      
      *                                                                                             
      * @PFIN: 0 = No es la última línea del pedido de ventas                                       
      *        1 = Es la última línea del pedido de ventas                                          
      *        8 = Es una nueva línea en un ped.vta. ya confirmado ant.CO0181                       
      *                                                                                             
22716C** Comprobar si venimos de nuevo pedido o Adicción lineas                                     
22716C                   EVAL      ZXPEDCON=0                                                       
22716C                   IF        @PFIN=8                                                          
22716C                   EVAL      ZXPEDCON=1                                                       
22716C                   ENDIF                                                                      
     C                   Z-ADD     0             ZXMASL            1 0                              
     C                   IF        @PFIN=8                                                          
     C                   EVAL      @PFIN=0                                                          
     C                   EVAL      ZXMASL=1                                                         
     C                   ENDIF                                                                      
      *                                                                                             
      * ANTES DE NADA RECUPERO EL TIPO DE TRABAJO (INTERACTIVO O BATCH)                             
      * SI EL TRABAJO ES BATCH TRANSFORMO TODO LO MANUAL EN AUTOMATICO                              
      * '0' SIGNIFICA BATCH                                                                         
      * '1' SIGNIFICA INTERACTIVO                                                                   
      *                                                                                             
     C                   CALL      'RTVTIJ'                                                         
     C                   PARM      *BLANKS       @PTIPJ            1                                
      *                                                                                             
     C                   IF        @PTIPJ<='0'                                                      
     C                   CALL      'PRDGJ4CL'                                                       
     C                   ENDIF                                                                      
      *                                                                                             
      * Recuperación de la LDA (Interactiva o BATCH)                                                
      *                                                                                             
     C     *DTAARA       DEFINE    PURLDA        DSLDA                                              
     C                   IF        @PTIPJ>'0'                                                       
     C                   IN        DSLDA                                                            
     C                   ELSE                                                                       
     C     *LOCK         IN        DSLDA                                                            
     C                   ENDIF                                                                      
      *                                                                                             
     C                   IF        @PTIPJ<='0'                                                      
     C                   EVAL      JOLINE=86                                                        
     C     KPMJOBC       CHAIN     PMJOBC                                                           
     C                   IF        %FOUND(PMJOBC)                                                   
     C     JODATO        CAT       DSLDA:0       DSLDA                                              
     C                   ENDIF                                                                      
     C                   OUT       DSLDA                                                            
     C                   ENDIF                                                                      
      *                                                                                             
      * Parámetros del Setup de entrada de pedidos de compra                                        
      *                                                                                             
     C                   EVAL      PICIAS=ZZCIAS                                                    
     C                   EVAL      PIPROG='PU0120   '                                               
     C                   EVAL      PIUSU1=ZZUSUA                                                    
     C     KPMSETP       CHAIN     PMSETP                                                           
     C                   CLEAR                   PU0120                                             
     C     PIDATR        CAT       PU0120:0      PU0120                                             
      *                                                                                             
      * Busqueda Cias OL                                                                            
      *                                                                                             
     C                   EVAL      PECIAS=ZZCIAS                                                    
     C                   EVAL      PECTAB='INOL'                                                    
     C                   EVAL      PECLTA='DESTSGA   '                                              
     C     KPMTAB2       CHAIN     PMTAB2                                                           
     C                   IF        %FOUND(PMTAB2)                                                   
     C                   EVAL      U1DEST=PEDESC                                                    
     C     U1DEST        CHAIN     UTDEST                                                           
     C                   IF        %FOUND(UTDEST) AND U1DSGA='1'                                    
     C                   EVAL      U0DEST=U1DEST                                                    
     C                   EVAL      U0TENV='9'                                                       
     C                   EVAL      U0CLP0=*BLANKS                                                   
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
      *                                                                                             
      * Variable de envío General activada                                                          
      * Variable de envío a TRACE desactivada                                                       
      * Variable de envío a PRODUCTIVA activada                                                     
      *                                                                                             
     C                   EVAL      ZXEVR0=*BLANKS                                                   
     C                   EVAL      ZXEVOL='1'                                                       
     C                   EVAL      ZXEVPR='1'                                                       
      *                                                                                             
     C                   EVAL      @PECIAS=@PCIAS                                                   
     C                   EVAL      @FDEDAU=@PEDAU                                                   
      *                                                                                             
      * Guardo si tiene artículo de portes tipo APE                                                 
      *                                                                                             
     C                   EVAL      ZXARTPOR=*BLANKS                                                 
     C                   EVAL      PECIAS=@PCIAS                                                    
     C                   EVAL      PECTAB='PORT'                                                    
     C                   EVAL      PECLTA='ARTICULO'                                                
     C     KPMTABD       CHAIN     PMTABD                                                           
     C                   IF        %FOUND(PMTABD)                                                   
     C                   EVAL      ZXARTPOR=PEDESC                                                  
     C                   ENDIF                                                                      
      *                                                                                             
     C                   CLEAR                   SPROV                                              
31030C                   CLEAR                   SPRO2                                              
     C                   CLEAR                   BP                                                 
Q0322C                   CLEAR                   SPR_PED                                            
Q0322C                   CLEAR                   ZXPR_PED                                           
      *                                                                                             
M345B                                                                                               
M345BC                   MOVE      @PCIAS        @PEDIVI                                            
M345BC                   CALL      'GX0150'                                                         
M345BC                   PARM                    @PEDIVI                                            
M345BC                   PARM      SDSUSR        @PEUSER                                            
M345BC                   PARM      *BLANKS       @PEVAL                                             
M345BC                   EVAL      ZXVAL=@PEVAL                                                     
M345BC                   MOVEL     MXCONO        Z1CONO                                             
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Estructura de Programa                                                                      
      **********************************************************************                        
     C     CS_MAIN       BEGSR                                                                      
C1579 *                                                                                             
C1579 * Si el pedido es de procedencia Poolweb, el proveedor será el                                
C1579 * especificado para Poolweb en la tabla PWEB, no el del artículo                              
C1579 *                                                                                             
C1579C                   EXSR      CS_POOLWEB                                                       
      *                                                                                             
     C                   EVAL      ZXTRAT=0                                                         
      *                                                                                             
      * El tratamiento siempre es para 1 línea de ventas                                            
      *                                                                                             
     C                   EVAL      ZXARTI=S5ARTI                                                    
     C                   EVAL      ZXVARI=S5VARI                                                    
     C                   EVAL      ZXMODE=S5MODE                                                    
     C                   EVAL      ZXUNIM=S5UNIM                                                    
      *                                                                                             
      * Datos necesarios del artículo base                                                          
      *                                                                                             
      * No hacemos pedido si no existe o está de baja                                               
      *                    o no tiene proveedor asignado                                            
      *                    o el proveedor no permite ED (Se mira después)                           
      *                    o es un artículo de Fabricación Propia                                   
      *                    o es un artículo Propio que tengo en TRACE                               
FDX01 *                                                                                             
FDX01 * Recoger la situación de los componentes                                                     
FDX01 * de un conjunto de venta y su situación para                                                 
FDX01 * la distribución                                                                             
FDX01 *                                                                                             
FDX01C                   CALL      'CO2733'                                                         
FDX01C                   PARM                    @PCIAS                                             
FDX01C                   PARM                    ZXARTI                                             
FDX01C                   PARM                    ZXVARI                                             
FDX01C                   PARM                    ZXMODE                                             
FDX01C                   PARM      *BLANKS       @PSICO                                             
FDX01 *                                                                                             
F-2OLC*OL187             exsr      SRrecu                                                           
OL187                    zxprvr = srrecu(s5arti:s5vari:s5mode);                                     
F-2OLc*                                                                                             
     C                   EVAL      M5CIAS=S5CIAS                                                    
     C                   EVAL      M5ARTI=S5ARTI                                                    
     C                   EVAL      M5VARI=S5VARI                                                    
     C                   EVAL      M5MODE=S5MODE                                                    
     C     KMSARTI00     CHAIN     MSARTI00                                                         
C1078                                                                                               
C1078C                   IF        %FOUND                                                           
F-2OLc                   if        ZXPRVR = *blanks                                                 
OL187c                   movel     m5prvr        zxprvr                                             
C1078C                   EVAL      ZXPRVR_DOM=ZXPRVR                                                
C1078C                   ENDIF                                                                      
F-2OLC                   ENDIF                                                                      
F-2OLC*                                                                                             
C1078C                   EVAL      M0CIAS=M5CIAS                                                    
C1078C                   EVAL      M0LOGE=S5LOGE                                                    
C1078C     KMSALMA05     CHAIN     MSALMA05                                                         
C1078C                   IF        %FOUND AND M0TAL1='7'                                            
C1078C                   EVAL      ZXPRVR_DOM=M0PRVR                                                
C1078C                   ENDIF                                                                      
C1078                                                                                               
C4137*                                                                                             
C4406c*C4137             if        %found(msarti00) and %found(msalma05)                            
C4406c*C4137             exsr      cs_provstok                                                      
C4406c*C4137             endif                                                                      
C4137*                                                                                             
     C                   IF        %FOUND(MSARTI00) AND M5BAJA<>'1'                                 
C1579C***                          AND M5PRVR<>*BLANKS                                              
C1579C                             AND ZXPRVR<>*BLANKS                                              
     C                             AND M5FABR<'1'                                                   
FDX01C***                          AND M5SIOL<>'2'                                                  
FDX01 *                                                                                             
OL187 *FDX01C                   IF        M5SIOL<>'2' AND (@PSICO=*BLANKS OR                        
OL187 *FDX01C                             @PSICO='2' OR @PSICO='3' OR @PSICO='4')                   
OL187 *FDX01C                             OR M5SIOL='2' AND (@PSICO='2' OR @PSICO='3')              
OL187             if not GPROP and                                                                  
OL187              (@PSICO=*BLANKS or @PSICO='2' or @PSICO='3' or @PSICO='4')                       
OL187              OR GPROP and (@PSICO='2' or @PSICO='3');                                         
     C                                                                                              
      *Marco se trata el evento                                                                     
     C                   EVAL      ZXTRAT=1                                                         
      *                                                                                             
      * Normal o desglosar línea si es un conjunto                                                  
      *                                                                                             
     C                   IF        S5TCOJ=' '                                                       
19050C***                EVAL      ZXCANT=S5CANT-S5CANS-S5CANR                                      
28612C                   IF        @PEDAU='001' OR @PEDAU='002'                                     
28612C                             OR @PEDAU='010'                                                  
19050C                   IF        S5CANC<>0                                                        
19050C                   EVAL      ZXCANT=S5CANC-S5CANS-S5CANR                                      
19050C                   ELSE                                                                       
19050C                   EVAL      ZXCANT=S5CANT-S5CANS-S5CANR                                      
19050C                   ENDIF                                                                      
28612C                   ELSE                                                                       
28612C                   IF        S5CANC<>0                                                        
28612C                   EVAL      ZXCANT=S5CANC-S5CANR                                             
28612C                   ELSE                                                                       
28612C                   EVAL      ZXCANT=S5CANT-S5CANR                                             
28612C                   ENDIF                                                                      
28612C                   ENDIF                                                                      
     C                   EVAL      ZXDCOJ=0                                                         
     C                   EXSR      CS_PRODET                                                        
      *                                                                                             
      * EN CASO DE CONJUNTO, MIRAMOS QUE NO SEA CONJUNTO DE COMPRAS A LA VEZ                        
      * QUE DE VENTAS, DE SER ASí, ACTUA COMO SI NO FUESE CONJUNTO.                                 
      *                                                                                             
     C                   ELSE                                                                       
I0164 *                                                                                             
I0164 * Miramos que el conjunto está asignado al proveedor para poder comprarse como Kit;           
I0164 * sino, deberán de comprarse por los componentes de venta (no existira como Kit)              
I0164 *                                                                                             
I0164C                   EVAL      KitAsigPrv=*on                                                   
I0164 *     Primero miramos si existe alguna asignación para el Kit                                 
I0164C                   EVAL      P_C3CIAS=S5CIAS                                                  
I0164C                   EVAL      P_C3ARVM=S5ARTI                                                  
I0164C                   EVAL      P_C3TCOJ='1'                                                     
I0164C     KPUPRCJa      CHAIN     PUPRCJ                                                           
I0164 *                                                                                             
I0164 *     Si existe, miramos si existe para nuestro proveedor                                     
I0164C                   IF        %FOUND(PUPRCJ)                                                   
I0164C                   EVAL      P_C3PRVR=ZXPRVR                                                  
I0164C     KPUPRCJ       CHAIN     PUPRCJ                                                           
I0164C                   IF        not %FOUND(PUPRCJ)                                               
I0164C                   EVAL      KitAsigPrv=*off                                                  
I0164C                   ENDIF                                                                      
I0164C                   ENDIF                                                                      
I0164 *                                                                                             
     C                   EVAL      NDCIAS=S5CIAS                                                    
     C                   EVAL      NDARTI=S5ARTI                                                    
     C                   EVAL      NDMODE=S5MODE                                                    
     C                   EVAL      NDVARI=S5VARI                                                    
     C                   EVAL      NDTCOJ='1'                                                       
     C     KMSCOJC       CHAIN     MSCOJC                                                           
     C                   IF        %FOUND(MSCOJC) AND NDBAJA<>'1'                                   
I0164C                             AND KitAsigPrv=*on                                               
19050C***                EVAL      ZXCANT=S5CANT-S5CANS-S5CANR                                      
28612C                   IF        @PEDAU='001' OR @PEDAU='002'                                     
28612C                             OR @PEDAU='010'                                                  
19050C                   IF        S5CANC<>0                                                        
19050C                   EVAL      ZXCANT=S5CANC-S5CANS-S5CANR                                      
19050C                   ELSE                                                                       
19050C                   EVAL      ZXCANT=S5CANT-S5CANS-S5CANR                                      
19050C                   ENDIF                                                                      
28612C                   ELSE                                                                       
28612C                   IF        S5CANC<>0                                                        
28612C                   EVAL      ZXCANT=S5CANC-S5CANR                                             
28612C                   ELSE                                                                       
28612C                   EVAL      ZXCANT=S5CANT-S5CANR                                             
28612C                   ENDIF                                                                      
28612C                   ENDIF                                                                      
     C                   EVAL      ZXDCOJ=0                                                         
In178C                   EVAL      ZXTCOJ='1'                                                       
     C                   EXSR      CS_PRODET                                                        
     C                   ELSE                                                                       
     C                   EXSR      CS_PROCOJ                                                        
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
      *                                                                                             
     C                   ENDIF                                                                      
FDX01 *                                                                                             
FDX01C                   ENDIF                                                                      
      *                                                                                             
25050 *Para artículos propios si viene evento de borrar aunque no                                   
25050 *hay pedido de compras si debemos borrar EDTRLP.                                              
      *Si el evento es 005=Baja siempre se debe procesar si no ha entrado                           
      *en el IF anterior.                                                                           
25050C***                IF        %FOUND(MSARTI00)                                                 
25050C***                          AND M5SIOL='2' and @PEDAU='005'                                  
25050C                   IF        ZXTRAT=0 and (@PEDAU='005' or @PEDAU='009')                      
25050C                   EVAL      @FDEDAU=@PEDAU                                                   
25050C                   EXSR      CS_TRAZAVTA                                                      
25050C                   ENDIF                                                                      
25050C                                                                                              
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Proceso del detalle de un conjunto                                                          
      **********************************************************************                        
     C     CS_PROCOJ     BEGSR                                                                      
      *                                                                                             
      * DEBEMOS MIRAR LA CANTIDAD NECESARIA PARA EL CONJUNTO                                        
      * EN UNIDAD BASICA Y CONSERVAMOS EN ZXAUXI2                                                   
      *                                                                                             
     C                   EVAL      ZXAUXI2=S5CANT-S5CANS-S5CANR                                     
     C                   IF        ZXAUXI2>0                                                        
      *                                                                                             
     C                   IF        S5UNIM<>M5UNIM                                                   
     C                   EVAL      ZXAUXIBS=S5CANT                                                  
     C                   EVAL      ZXARTIBS=S5ARTI                                                  
     C                   EVAL      ZXUNIMBS=S5UNIM                                                  
     C                   EXSR      CS_CNVUBS                                                        
     C                   EVAL      ZXAUXI2=ZXAUXIBS                                                 
     C                   ENDIF                                                                      
     C                   EVAL      ZXCANCON=ZXAUXI2                                                 
      *                                                                                             
      * Lectura del detalle                                                                         
      *                                                                                             
     C                   EVAL      NDCIAS=S5CIAS                                                    
     C                   EVAL      NDARTI=S5ARTI                                                    
     C                   EVAL      NDMODE=S5MODE                                                    
     C                   EVAL      NDVARI=S5VARI                                                    
     C                   EVAL      NDTCOJ=S5TCOJ                                                    
     C     KMSCOJC       CHAIN     MSCOJC                                                           
     C                   IF        %FOUND(MSCOJC) AND NDBAJA<>'1'                                   
      *                                                                                             
     C                   EVAL      NDCANT=0                                                         
     C                   EVAL      NDUNIM=*BLANKS                                                   
     C     KMSCOJC       SETLL     MSCOJD                                                           
     C     KMSCOJC       READE     MSCOJD                                                           
     C                   DOW       NOT %EOF(MSCOJD)                                                 
      *                                                                                             
     C                   IF        NDBAJA<>'1'                                                      
      *                                                                                             
      * No hacemos pedido si no existe o está de baja                                               
      *                    o no tiene proveedor asignado                                            
      *                    o es un artículo de Fabricación Propia                                   
      *                    o es un artículo Propio que tengo en TRACE                               
      *                                                                                             
     C                   EVAL      M5CIAS=NDCIAS                                                    
     C                   EVAL      M5ARTI=NDCOMP                                                    
     C                   EVAL      M5VARI=NDVAR2                                                    
     C                   EVAL      M5MODE=NDMOD2                                                    
OL187      zxprvr_dom=srrecu(ndcomp:ndvar2:ndmod2);                                                 
     C     KMSARTI00     CHAIN     MSARTI00                                                         
C1078C*OL187             IF        %FOUND                                                           
OL187C                   IF        %FOUND and zxprvr_dom=*blanks                                    
C1078C                   EVAL      ZXPRVR_DOM=M5PRVR                                                
C1078C                   ENDIF                                                                      
C1078C                   EVAL      M0CIAS=M5CIAS                                                    
C1078C                   EVAL      M0LOGE=S5LOGE                                                    
C1078C     KMSALMA05     CHAIN     MSALMA05                                                         
C1078C                   IF        %FOUND AND M0TAL1='7'                                            
C1078C                   EVAL      ZXPRVR_DOM=M0PRVR                                                
C1078C                   ENDIF                                                                      
      *                                                                                             
C4406C*C4137             IF        %FOUND(MSARTI00) AND %FOUND(MSALMA05)                            
C4406C*C4137             EXSR      CS_PROVSTOK                                                      
C4406C*C4137             ENDIF                                                                      
      *                                                                                             
     C                   IF        %FOUND(MSARTI00) AND M5BAJA<>'1'                                 
C1579C***                          AND M5PRVR<>*BLANKS                                              
19514C***** C1579                  AND ZXPRVR<>*BLANKS                                              
C1078C*                            AND M5PRVR<>*BLANKS                                              
C1078C                             AND ZXPRVR_DOM<>*BLANKS                                          
     C                             AND M5FABR<'1'                                                   
OL187C                             AND not GPROP                                                    
OL187C*                            AND M5SIOL<>'2'                                                  
      *                                                                                             
C1078C*                  EVAL      ZXPRVR=M5PRVR                                                    
C1078C                   EVAL      ZXPRVR=ZXPRVR_DOM                                                
     C                   EVAL      ZXARTI=M5ARTI                                                    
     C                   EVAL      ZXVARI=M5VARI                                                    
     C                   EVAL      ZXMODE=M5MODE                                                    
     C                   EVAL      ZXTCOJ=*BLANKS                                                   
      *                                                                                             
     C                   EVAL      ZXARTIX=M5ARTI                                                   
     C                   EVAL      ZXVARIX=M5VARI                                                   
     C                   EVAL      ZXMODEX=M5MODE                                                   
     C                   EVAL      ZXARVM=ZXARVMX                                                   
      *                                                                                             
      * MIRAMOS SI ES CONJUNTO DE COMPRAS                                                           
      * GUARDAMOS CLAVE                                                                             
      *                                                                                             
     C                   EVAL      ZYARTI=NDARTI                                                    
     C                   EVAL      ZYMODE=NDMODE                                                    
     C                   EVAL      ZYVARI=NDVARI                                                    
     C                   EVAL      ZYTCOJ=NDTCOJ                                                    
      *                                                                                             
     C                   EVAL      NDARTI=M5ARTI                                                    
     C                   EVAL      NDMODE=M5MODE                                                    
     C                   EVAL      NDVARI=M5VARI                                                    
     C                   EVAL      NDTCOJ='1'                                                       
     C     KMSCOJC       CHAIN     MSCOJC                                                           
     C                   IF        %FOUND(MSCOJC)                                                   
     C                   EVAL      ZXTCOJ=NDTCOJ                                                    
     C                   ENDIF                                                                      
      *                                                                                             
      * RECUPERAMOS CLAVE                                                                           
      *                                                                                             
     C                   EVAL      NDARTI=ZYARTI                                                    
     C                   EVAL      NDMODE=ZYMODE                                                    
     C                   EVAL      NDVARI=ZYVARI                                                    
     C                   EVAL      NDTCOJ=ZYTCOJ                                                    
      *                                                                                             
     C                   Z-ADD     NDCANT        ZXCANT                                             
     C                   MULT      ZXCANCON      ZXCANT                                             
     C                   EVAL      ZXUNIM=NDUNIM                                                    
      *                                                                                             
     C                   EVAL      ZXDCOJ=1                                                         
     C                   EXSR      CS_PRODET                                                        
      *                                                                                             
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
      *                                                                                             
     C     KMSCOJC       READE     MSCOJD                                                           
     C                   ENDDO                                                                      
      *                                                                                             
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
      *                                                                                             
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Proceso de una linea de compra                                                              
      **********************************************************************                        
     C     CS_PRODET     BEGSR                                                                      
      *                                                                                             
      * Seleccionamos la acción a realizar según código                                             
      * de auditoría que nos llega                                                                  
      *                                                                                             
     C                   SELECT                                                                     
      *                                                                                             
     C                   WHEN      @PEDAU='001' OR @PEDAU='002'                                     
     C                             OR @PEDAU='010'                                                  
      *                                                                                             
      * Miramos si el proveedor permite ED para hacer altas                                         
      * en teoría ya se debe haber validado anteriormente                                           
      *                                                                                             
     C                   EVAL      C0CIAS=M5CIAS                                                    
C1078C                   EVAL      M0CIAS=M5CIAS                                                    
C1078C                   EVAL      M0LOGE=S5LOGE                                                    
C1078C     KMSALMA05     CHAIN     MSALMA05                                                         
C1078C                   IF        %FOUND AND M0TAL1='7'                                            
C1078C                   EVAL      ZXPRVR=M0PRVR                                                    
C1078C                   ENDIF                                                                      
C1579C***                EVAL      C0PRVR=M5PRVR                                                    
C1579C                   EVAL      C0PRVR=ZXPRVR                                                    
     C     KPUPROV       CHAIN     PUPROV                                                           
20070C                   IF        (%FOUND(PUPROV) AND C0PEVT>='1'                                  
20070C                             AND C0BAJA<'1')                                                  
20070C                             Or (%FOUND(PUPROV) AND C0PEVT<'1'                                
20070C                             AND C0BAJA<'1' AND M5NOED='2')                                   
21060C**                 IF        ZXDCOJ=1 And (@PEDAU='001' Or                                    
21060C**                           @PEDAU='002' OR @PEDAU='010')                                    
26050C***                EXSR      CS_ALTA                                                          
09060C                   If        ZXCANT>0                                                         
07060C                   EXSR      CS_ALTA                                                          
09060C                   Endif                                                                      
21060C**                 ELSE                                                                       
21060C**                 EXSR      CS_MODI                                                          
21060C**                 ENDIF                                                                      
     C                   ENDIF                                                                      
      *                                                                                             
     C                   WHEN      @PEDAU='005' OR @PEDAU='009'                                     
     C                             OR @PEDAU='018'                                                  
C2559C                             OR @PEDAU='051'                                                  
     C                   EXSR      CS_BAJA                                                          
      *                                                                                             
     C                   WHEN      @PEDAU='006' OR @PEDAU='007'                                     
     C                             OR @PEDAU='008' OR @PEDAU='012'                                  
     C                             OR @PEDAU='013' OR @PEDAU='014'                                  
     C                             OR @PEDAU='015' OR @PEDAU='019'                                  
FQ604C                             OR @PEDAU='026'                                                  
19050C                             OR @PEDAU='027'                                                  
In199C                             OR @PEDAU='011'                                                  
     C                   EXSR      CS_MODI                                                          
      *                                                                                             
     C                   ENDSL                                                                      
      *                                                                                             
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Alta de 1 línea de pedido                                                                   
      **********************************************************************                        
     C     CS_ALTA       BEGSR                                                                      
15041 * Comprueba si existe un pedido proveedor para la linea de                                    
15041 * artículo                                                                                    
15041C                                                                                              
15041C                   EXSR      CS_EXISCOMP                                                      
15041C                   IF        ZXEXISCOM='1'                                                    
15041C                   LEAVESR                                                                    
15041C                   ENDIF                                                                      
      *                                                                                             
      * Comprueba si la línea tiene incidencia, porque si es así                                    
      * creará siempre un pedido nuevo                                                              
      *                                                                                             
15612C                   EVAL      ZXPRIVEZ='1'                                                     
     C                   EXSR      CS_INCICOMP                                                      
      *                                                                                             
      * Comprueba si tenemos cabecera de pedido, sino, se crea                                      
      *                                                                                             
     C                   EXSR      CS_CHECKCAB                                                      
      *                                                                                             
     C                   EVAL      C5CIAS=C0CIAS                                                    
     C                   EVAL      C5DLGA=C0DLGA                                                    
     C                   EVAL      C5DATP=C0DATP                                                    
     C                   EVAL      C5NOPL=C0NOPL                                                    
     C                   EVAL      C5NPCO=C0NPCO                                                    
     C                   EVAL      C5TPED=C0TPED                                                    
      *                                                                                             
      * Buscamos número de línea                                                                    
      *                                                                                             
     C                   CALL      'PU2527'                                                         
     C                   PARM                    @PECIAS                                            
     C                   PARM      C5DLGA        @PEDLGA                                            
     C                   PARM      C5NPCO        @PENPCO                                            
     C                   PARM      C5TPED        @PETPED                                            
     C                   PARM      C5DATP        @PEDATP                                            
     C                   PARM      C5NOPL        @PENOPL                                            
     C                   PARM      0             @PELINE                                            
     C                   PARM      *BLANKS       @PEERR                                             
     C                   EVAL      C5LINE=@PELINE                                                   
      *                                                                                             
     C                   EVAL      C5ARTI=ZXARTI                                                    
     C                   EVAL      C5VARI=ZXVARI                                                    
     C                   EVAL      C5MODE=ZXMODE                                                    
     C                   EVAL      C5CANT=ZXCANT                                                    
     C                   EVAL      C5DES1=M5DES1                                                    
     C                   EVAL      C5UNIM=ZXUNIM                                                    
     C                   EVAL      C5TCOJ=ZXTCOJ                                                    
     C                   EVAL      C5MONE=C0MONE                                                    
     C                   EVAL      C5MONC=C0MONE                                                    
27061C*                  EVAL      C5FREP=C0FREP                                                    
27061C*                  EVAL      C5FRRR=C0FRRR                                                    
      *                                                                                             
      * Como el pedido es de ED TPE4=2 entonces la fecha prevista de                                
      * entrega de los pedidos de compra ha de ser igual a fecha prevista de                        
      * entrega de los pedidos de venta                                                             
      *                                                                                             
     C                   EVAL      C5FREP=S5FREP                                                    
     C                   IF        C5FREP=0                                                         
     C                   EVAL      C5FREP=C0FREP                                                    
     C                   ENDIF                                                                      
27061C                   IF        C5FREP<ZZDATS                                                    
27061C                   EVAL      C5FREP=ZZDATS                                                    
27061C                   ENDIF                                                                      
     C                   EVAL      C5FRRR=C5FREP                                                    
     C                   EVAL      C5TIVA=M5TIVA                                                    
     C                   EVAL      C5CCCA=M5CCCA                                                    
     C                   EVAL      C5PPRG=C0PPRG                                                    
     C***                EVAL      C5LOGE=C0LOGE                                                    
     C                   EVAL      C5LOGE=S5LOGE                                                    
     C                   IF        M5OLGE>='1' AND ZZDLGA=*BLANKS                                   
C1078C                             AND M0TAL1<>'7'                                                  
     C                   EVAL      C5LOGE=M5LOGE                                                    
     C                   ENDIF                                                                      
     C                   EVAL      C5TPTA=M5TPTA                                                    
     C                   EVAL      C5CLTR=C0CLTR                                                    
     C                   EVAL      C5STUL='0'                                                       
     C                   EVAL      C5FUEN=C0FUEN                                                    
     C                   EVAL      C5PUEN=C0PUEN                                                    
     C                   EVAL      C5ALBA=*BLANKS                                                   
     C                   EVAL      C5INTR=C0INTR                                                    
     C                   EVAL      C5TCST=M5TCS1                                                    
     C                   EVAL      C5ARAL=M5ARAL                                                    
     C                   EVAL      C5ARVP=*BLANKS                                                   
     C                   EVAL      C5FRRE=C0FRRE                                                    
     C                   EVAL      C5CALI=C0CALI                                                    
     C                   EVAL      C5TEMB=M5TEMB                                                    
     C                   EVAL      C5CLAB=M5CLAB                                                    
      * PUNTUACIONES *BLANKS                                                                        
     C                   EVAL      C5PUN1=*BLANKS                                                   
     C                   EVAL      C5PUN2=*BLANKS                                                   
     C                   EVAL      C5PUN3=*BLANKS                                                   
     C                   EVAL      C5PUN4=*BLANKS                                                   
     C                   EVAL      C5PUN5=*BLANKS                                                   
     C                   EVAL      C5MIMP=C0MIMP                                                    
     C                   EVAL      C5FIMP=C0FIMP                                                    
     C                   EVAL      C5PCST=C0PCST                                                    
     C                   EVAL      C5FCST=C0FCST                                                    
     C                   EVAL      C5DAT1=C0DAT1                                                    
     C                   EVAL      C5DAT8=C0DAT8                                                    
     C                   EVAL      C5PANT=C0PANT                                                    
     C                   EVAL      C5USUA=C0USUA                                                    
     C                   EVAL      C5HORA=C0HORA                                                    
     C                   EVAL      C5PRVR=C0PRVR                                                    
     C                   EVAL      C5CUST=S5CUST                                                    
     C                   EVAL      C5CMGI=S5CMGI                                                    
     C                   EVAL      C5NPVE=S5NPCO                                                    
     C                   EVAL      C5TPVE=S5TPED                                                    
     C                   EVAL      C5DAVE=S5DATP                                                    
     C                   EVAL      C5NOVE=S5NOPL                                                    
     C                   EVAL      C5LIVE=S5LINE                                                    
     C                   EVAL      C5ARV2=S5ARVP                                                    
     C                   EVAL      C5NCOE=S5NCOE                                                    
     C                   EVAL      C5FOEP=S5FOEP                                                    
     C                   EVAL      C5FORE=S5FORE                                                    
     C                   EVAL      C5NCOI=S5NCOI                                                    
     C                   EVAL      C5NCOF=S5NCOF                                                    
      *                                                                                             
     C                   EVAL      C5DLVE=S5DLGA                                                    
     C                   MOVEL     S5CIAS        C5CIVE                                             
      * Si los valores de cabecera estan activados, mandan los de cabecera                          
     C                   EVAL      C5PHLD=S5PHLD                                                    
     C                   IF        C0PHLD>='1'                                                      
     C                   EVAL      C5PHLD=C0PHLD                                                    
     C                   ENDIF                                                                      
     C                   EVAL      C5TPE4=S5TPE4                                                    
     C                   EVAL      C5EDET=S5EDET                                                    
     C                   IF        C0TPE4>='1'                                                      
     C                   EVAL      C5TPE4=C0TPE4                                                    
     C                   ENDIF                                                                      
     C                   IF        C0EDET>='1'                                                      
     C                   EVAL      C5EDET=C0EDET                                                    
     C                   ENDIF                                                                      
     C                   EVAL      C5MURG=S5MURG                                                    
     C                   IF        C0MURG>='1'                                                      
     C                   EVAL      C5MURG=C0MURG                                                    
     C                   ENDIF                                                                      
      *                                                                                             
     C                   EVAL      C3CIAS=C5CIAS                                                    
     C                   EVAL      C3PRVR=C5PRVR                                                    
     C                   EVAL      C3TCOJ=C5TCOJ                                                    
     C                   EVAL      C3ARVM=ZXARVM                                                    
     C     *NOKEY        CLEAR     *ALL          RPUPRP0                                            
     C     KPUPRP0       CHAIN     PUPRP0                                                           
     C                   IF        %FOUND(PUPRP0)                                                   
     C                   EVAL      C5DES1=C3DES1                                                    
     C                   EVAL      C5ARAL=C3ARAL                                                    
     C                   EVAL      C5TCST=C3TCST                                                    
     C                   EVAL      C5CCCA=C3CCCA                                                    
     C                   EVAL      C5CALI=C3CALI                                                    
     C                   EVAL      C5DEAP=C3DEAP                                                    
     C                   EVAL      C5ARVP=C3ARVP                                                    
     C                   EVAL      C5CLAB=C3CLAB                                                    
     C                   EVAL      C5ARAL=C3ARAL                                                    
     C                   EVAL      C5DES1=C3DES1                                                    
     C                   EVAL      C5TCST=C3TCST                                                    
     C                   EVAL      C5PUN1=C3PUN1                                                    
     C                   EVAL      C5PUN2=C3PUN2                                                    
     C                   EVAL      C5PUN3=C3PUN3                                                    
     C                   EVAL      C5PUN4=C3PUN4                                                    
     C                   EVAL      C5PUN5=C3PUN5                                                    
     C                   EVAL      C5MPU1=C3MPU1                                                    
     C                   EVAL      C5MPU2=C3MPU2                                                    
     C                   EVAL      C5MPU3=C3MPU3                                                    
     C                   EVAL      C5MPU4=C3MPU4                                                    
     C                   EVAL      C5MPU5=C3MPU5                                                    
     C                   EVAL      C5TIVA=C3TIVA                                                    
     C                   IF        C5TCST=*BLANKS                                                   
     C                   EVAL      C5TCST=M5TCS1                                                    
     C                   ENDIF                                                                      
     C                   IF        C5DES1=*blanks                                                   
     C                   EVAL      C5DES1=M5DES1                                                    
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
      * RECUPERACION DEL PRECIO                                                                     
     C                   IF        C0CAMB<>*ZEROS                                                   
     C     C0CMPR        DIV       C0CAMB        @PEZXCO                                            
     C                   ELSE                                                                       
     C                   EVAL      @PEZXCO=*ZEROS                                                   
     C                   ENDIF                                                                      
      *                                                                                             
      * PROBAMOS PRIMERO DE IR AL PU2601                                                            
      * QUE SON PRECIOS ESPECIALES DE COMPRA SEGUN CLIENTE                                          
     C                   EVAL      C5TPRE=' '                                                       
     C                   IF        ZZCPP1='1'                                                       
     C                   CALL      'PU2601'                                                         
     C                   PARM                    @PECIAS                                            
     C                   PARM      C0CUST        @PECUST                                            
     C                   PARM      C0PRVR        @PEPRVR                                            
     C                   PARM      ZXARVM        @PEARVM                                            
     C                   PARM      C5TCOJ        @PETCOJ                                            
     C                   PARM      C0FPED        @PEFPED                                            
     C                   PARM      C5CANT        @PECANT                                            
     C                   PARM      C5UNIM        @PEUNIM                                            
     C                   PARM      C0MONE        @PEMONP                                            
     C                   PARM      *BLANKS       @PEMONB                                            
     C                   PARM                    @PEZXCO                                            
     C                   PARM      C0CLTR        @PECLTR                                            
     C                   PARM      0             @PEPREC                                            
     C                   PARM      0             @PEDTO1                                            
     C                   PARM      0             @PEDTO2                                            
     C                   PARM      0             @PEDTO3                                            
     C                   PARM      0             @PEDTO4                                            
     C                   PARM      *BLANKS       @PEMONE                                            
     C                   PARM      0             @PECADP                                            
     C                   PARM      *BLANKS       @PEUNDP                                            
     C                   PARM      *BLANKS       @PETPPR                                            
     C                   PARM                    @PEERR                                             
      *                                                                                             
     C                   IF        @PEERR<'1' AND @PETPPR<>'5'                                      
      * YA NOS HA RECUPERADO EL PRECIO                                                              
     C                   EVAL      C5TPRE='1'                                                       
     C                   GOTO      BPU2600                                                          
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
      *                                                                                             
      * EN CASO DE NO RECUPERAR PRECIO, DEBE PASAR POR EL PGM NORMAL                                
      *                                                                                             
     C                   CALL      'PU2600'                                                         
     C                   PARM                    @PECIAS                                            
     C                   PARM      C0PRVR        @PEPRVR                                            
     C                   PARM      ZXARVM        @PEARVM                                            
     C                   PARM      C5TCOJ        @PETCOJ                                            
     C                   PARM      C0FPED        @PEFPED                                            
     C                   PARM      C5CANT        @PECANT                                            
     C                   PARM      C5UNIM        @PEUNIM                                            
     C                   PARM      C0MONE        @PEMONP                                            
     C*                  PARM      C0MONB        @PEMONB                                            
     C                   PARM      *BLANKS       @PEMONB                                            
     C                   PARM                    @PEZXCO                                            
     C                   PARM      C0CLTR        @PECLTR                                            
     C                   PARM      0             @PEPREC                                            
     C                   PARM      0             @PEDTO1                                            
     C                   PARM      0             @PEDTO2                                            
     C                   PARM      0             @PEDTO3                                            
     C                   PARM      0             @PEDTO4                                            
     C                   PARM      *BLANKS       @PEMONE                                            
     C                   PARM      0             @PECADP                                            
     C                   PARM      *BLANKS       @PEUNDP                                            
     C                   PARM      C5TCST        @PETCST                                            
     C                   PARM      *BLANKS       @PETPPR                                            
     C                   PARM      *BLANKS       @PEPRMO                                            
     C                   PARM      'F'           @PEERR                                             
      *                                                                                             
     C     BPU2600       TAG                                                                        
      *                                                                                             
     C                   EVAL      C5UNDP=@PEUNDP                                                   
     C                   EVAL      C5CADP=@PECADP                                                   
     C                   EVAL      C5PREC=@PEPREC                                                   
     C                   EVAL      C5DTO1=@PEDTO1                                                   
     C                   EVAL      C5DTO2=@PEDTO2                                                   
     C                   EVAL      C5DTO3=@PEDTO3                                                   
     C                   EVAL      C5DTO4=@PEDTO4                                                   
     C                   EVAL      C5PRMO=@PEPRMO                                                   
      *                                                                                             
      * 1º INCIDENCIA: EL PRECIO NO SE HA PODIDO RECUPERAR                                          
      * PARA ED FUERZO A 0,01 DE MOMENTO (POR CONSENSO QUIPO DESARROLLO)                            
      *                                                                                             
     C** ANULADO         IF        C5PREC=0                                                         
     C**                 EVAL      C5PREC=0,01                                                      
     C**                 ENDIF                                                                      
      *                                                                                             
      * Grabamos el detalle                                                                         
      *                                                                                             
C0518C                   IF        C5PREC=0                                                         
     C                   EVAL      C5UNDP=M5UNIM                                                    
     C                   EVAL      C5CADP=1                                                         
C0518C                   ENDIF                                                                      
     C                   EVAL      C5EVPR='1'                                                       
ECOP C                   EVAL      C5ECOP=*BLANKS                                                   
ECOP C                   IF        C0PAIS=ZZPAIS                                                    
ECOP C                   EVAL      C5ECOP=M5ECOP                                                    
ECOP C                   ENDIF                                                                      
ECOP C*                  EVAL      C5ECOP=M5ECOP                                                    
     C                   EVAL      C5EVOL=ZXEVOL                                                    
     C                   EVAL      C5EVPR=ZXEVPR                                                    
FQ709C                   EXSR      CS_BUSROTNEWC                                                    
     C                   WRITE     RPUDEPE                                                          
      *                                                                                             
     C                   SELECT                                                                     
     C                   WHEN      @PEDAU='001' OR @PEDAU='002'                                     
     C                   EVAL      @FDEDAU='100'                                                    
     C                   WHEN      @PEDAU='010'                                                     
     C                   EVAL      @FDEDAU='110'                                                    
     C                   ENDSL                                                                      
     C                   EXSR      CS_TRAZACOM                                                      
      *                                                                                             
     C                   EXSR      CS_OBSERV                                                        
      *                                                                                             
15612C                   EVAL      ZXPRIVEZ='0'                                                     
15612C                   EXSR      CS_INCICOMP                                                      
15612                                                                                               
      * Actualización datos en CODEPE y COCAPE                                                      
      * Si es conjunto se guardará como trazabilidad                                                
      * la última línea de compras generada por lo                                                  
      * que será incorrecta y deberemos ir al fichero de                                            
      * trazabilidad ED para tratarla correctamente                                                 
      *                                                                                             
     C     KCODEPE       CHAIN     CODEPE                                                           
     C                   IF        %FOUND(CODEPE)                                                   
     C                   MOVEL     C5CIAS        S5CI01                                             
     C                   EVAL      S5PR01=C5PRVR                                                    
     C                   EVAL      S5DL01=C5DLGA                                                    
     C                   EVAL      S5TP01=C5TPED                                                    
     C                   EVAL      S5NP01=C5NPCO                                                    
     C                   EVAL      S5DA01=C5DATP                                                    
     C                   EVAL      S5NO01=C5NOPL                                                    
     C                   EVAL      S5LI01=C5LINE                                                    
     C                   UPDATE    RCODEPE                                                          
      *                                                                                             
      * Si se creo la cabecera de compras asociamos cabecera de ventas                              
      * sólo para la 1ª vez que se crea                                                             
      *                                                                                             
     C                   IF        ZXSENDCAB=1                                                      
     C                   EVAL      S0CIAS=S5CIAS                                                    
     C                   EVAL      S0DLGA=S5DLGA                                                    
     C                   EVAL      S0NPCO=S5NPCO                                                    
     C                   EVAL      S0TPED=S5TPED                                                    
     C                   EVAL      S0DATP=S5DATP                                                    
     C                   EVAL      S0NOPL=S5NOPL                                                    
     C     KCOCAPE       CHAIN     COCAPE                                                           
     C                   IF        %FOUND(COCAPE)                                                   
     C                   EVAL      S0CI01=S5CI01                                                    
     C                   EVAL      S0PR01=S5PR01                                                    
     C                   EVAL      S0DL01=S5DL01                                                    
     C                   EVAL      S0TP01=S5TP01                                                    
     C                   EVAL      S0NP01=S5NP01                                                    
     C                   EVAL      S0DA01=S5DA01                                                    
     C                   EVAL      S0NO01=S5NO01                                                    
     C                   UPDATE    RCOCAPE                                                          
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
      *                                                                                             
      * Recalcular el PUCAIM (Importe del Pedido)                                                   
      *                                                                                             
     C                   EXSR      CS_PUCAIM                                                        
      *                                                                                             
     C                   ENDIF                                                                      
      *                                                                                             
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Baja de 1 línea de pedido                                                                   
      **********************************************************************                        
     C     CS_BAJA       BEGSR                                                                      
      *                                                                                             
      * Eliminamos la/las línea del pedido de compras y Traza                                       
      * usando el fichero de trazabilidad ED                                                        
      *                                                                                             
     C                   EVAL      T0CIAS=@PCIAS                                                    
     C                   EVAL      T0DLGA=@PDLGA                                                    
     C                   EVAL      T0NPCO=@PNPCO                                                    
     C                   EVAL      T0TPED=@PTPED                                                    
     C                   EVAL      T0DATP=@PDATP                                                    
     C                   EVAL      T0NOPL=@PNOPL                                                    
     C                   EVAL      T0LINE=@PLINE                                                    
     C     KEDTRLP00     SETLL     EDTRLP00                                                         
     C     KEDTRLP00     READE     EDTRLP00                                                         
     C                   DOW       NOT %EOF(EDTRLP00)                                               
      *                                                                                             
      * Si no es conjunto procesar normalmente, pero si es un                                       
      * detalle de conjunto sólo procesar su línea                                                  
      *                                                                                             
     C                   IF        ZXDCOJ=0                                                         
     C                             OR ZXDCOJ=1 AND T0ARV1=ZXARVM                                    
      *                                                                                             
     C                   EVAL      C5CIAS=T0CIA1                                                    
     C                   EVAL      C5DLGA=T0DLG1                                                    
     C                   EVAL      C5NPCO=T0NPC1                                                    
     C                   EVAL      C5TPED=T0TPE1                                                    
     C                   EVAL      C5DATP=T0DAT1                                                    
     C                   EVAL      C5NOPL=T0NOP1                                                    
     C                   EVAL      C5LINE=T0LIN1                                                    
     C     KPUDEPE       CHAIN     PUDEPE                                                           
     C                   IF        %FOUND(PUDEPE)                                                   
In190C                   IF        C5STUL<'5'                                                       
      *                                                                                             
09060 *Si tienen cantidad servida no se puede borrar el pudepe o                                    
14060 *Si es el evento cerrar línea                                                                 
14060C                   IF        @PEDAU='018'                                                     
C2559C                             OR @PEDAU='051'                                                  
GP581C                             OR @PEDAU='005'                                                  
GP581C                             OR @PEDAU='009'                                                  
14060C                             OR T0CANS<>0 OR C5CANS<>0                                        
     C                   EVAL      C5STUL='5'                                                       
GP581C                   IF        @PEDAU='005' OR @PEDAU='009'                                     
GP581C                   EVAL      C5NPVE=*BLANKS                                                   
GP581C                   EVAL      C5CUST=*BLANKS                                                   
GP581C                   EVAL      C5TPVE=*BLANKS                                                   
GP581C                   EVAL      C5DAVE=0                                                         
GP581C                   EVAL      C5NOVE=0                                                         
GP581C                   EVAL      C5LIVE=0                                                         
GP581C                   EVAL      C5CANR=0                                                         
GP581C                   ENDIF                                                                      
     C                   UPDATE    RPUDEPE                                                          
     C                   ELSE                                                                       
     C                   DELETE    RPUDEPE                                                          
21050C                   IF        ZZCBPE='1' OR ZZCBPE='3'                                         
21050C                   WRITE     RPUBDEP                              80                          
21050C                   ENDIF                                                                      
07053C                   EVAL      C0CIAS=C5CIAS                                                    
07053C                   EVAL      C0DLGA=C5DLGA                                                    
07053C                   EVAL      C0NPCO=C5NPCO                                                    
07053C                   EVAL      C0TPED=C5TPED                                                    
07053C                   EVAL      C0DATP=C5DATP                                                    
07053C                   EVAL      C0NOPL=C5NOPL                                                    
07053C                   EVAL      C0LINP=C5LINE                                                    
07053C                   EXSR      CS_OBSDEL                                                        
                                                                                                    
     C                   ENDIF                                                                      
      *                                                                                             
     C                   EVAL      C0CIAS=C5CIAS                                                    
     C                   EVAL      C0DLGA=C5DLGA                                                    
     C                   EVAL      C0NPCO=C5NPCO                                                    
     C                   EVAL      C0TPED=C5TPED                                                    
     C                   EVAL      C0DATP=C5DATP                                                    
     C                   EVAL      C0NOPL=C5NOPL                                                    
     C     KPUCAPE       CHAIN(N)  PUCAPE                                                           
     C                   IF        %FOUND(PUCAPE)                                                   
      *                                                                                             
      * Datos de envío                                                                              
      *                                                                                             
     C                   EXSR      CS_SEND                                                          
      *                                                                                             
      * Quito trazabilidad en pedido de ventas                                                      
      *                                                                                             
     C     KCODEPE       CHAIN(N)  CODEPE                                                           
     C                   IF        %FOUND(CODEPE)                                                   
      *                                                                                             
     C                   SELECT                                                                     
     C                   WHEN      @PEDAU='005'                                                     
     C                   EVAL      @FDEDAU='005'                                                    
     C                   EXSR      CS_TRAZAVTA                                                      
     C                   EVAL      @FDEDAU='105'                                                    
     C                   WHEN      @PEDAU='009'                                                     
     C                   EVAL      @FDEDAU='009'                                                    
     C                   EXSR      CS_TRAZAVTA                                                      
     C                   EVAL      @FDEDAU='109'                                                    
     C                   WHEN      @PEDAU='018'                                                     
     C                   EVAL      @FDEDAU='018'                                                    
     C                   EXSR      CS_TRAZAVTA                                                      
     C                   EVAL      @FDEDAU='118'                                                    
C2559C                   WHEN      @PEDAU='051'                                                     
C2559C                   EVAL      @FDEDAU='051'                                                    
C2559C                   EXSR      CS_TRAZAVTA                                                      
C2559C                   EVAL      @FDEDAU='151'                                                    
     C                   ENDSL                                                                      
     C                   EXSR      CS_TRAZACOM                                                      
      *                                                                                             
In209C***                IF        @FDEDAU='105' Or @FDEDAU='109'                                   
In209C                   IF        @FDEDAU='109'                                                    
In196C     KCODEPE       CHAIN     CODEPE                                                           
In196C                   EVAL      S5CI01=*BLANKS                                                   
In196C                   EVAL      S5PR01=*BLANKS                                                   
In196C                   EVAL      S5DL01=*BLANKS                                                   
In196C                   EVAL      S5TP01=*BLANKS                                                   
In196C                   EVAL      S5NP01=*BLANKS                                                   
In196C                   EVAL      S5DA01=0                                                         
In196C                   EVAL      S5NO01=0                                                         
In196C                   EVAL      S5LI01=0                                                         
In196C                   UPDATE    RCODEPE                                                          
In196C                   ENDIF                                                                      
     C                   ENDIF                                                                      
      *                                                                                             
      * Si no hay más líneas, eliminamos también la cabecera                                        
      * o si tiene otras pero están cerradas, cerramos la cabecera                                  
      *                                                                                             
     C                   Z-ADD     0             ZXTOCE            1 0                              
     C                   Z-ADD     0             ZXLIAB            1 0                              
     C                   EVAL      C5LINE=0                                                         
     C     KPUDEPE       SETLL     PUDEPE                                                           
     C     KPUDEPEX      READE(N)  PUDEPE                                                           
     C                   DOW       NOT %EOF(PUDEPE)                                                 
     C                   IF        C5STUL<'5'                                                       
     C                   EVAL      ZXTOCE=0                                                         
21060C*                  EVAL      ZXLIAB=ZXLIAB+1                                                  
21060C                   EVAL      ZXLIAB=1                                                         
     C                   LEAVE                                                                      
     C                   ELSE                                                                       
     C                   EVAL      ZXTOCE=1                                                         
21060C*                  EVAL      ZXLIAB=ZXLIAB+1                                                  
21060C                   EVAL      ZXLIAB=1                                                         
     C                   ENDIF                                                                      
     C     KPUDEPEX      READE(N)  PUDEPE                                                           
     C                   ENDDO                                                                      
11050 *                                                                                             
11050 *  Activaremos el campo de CHEKSUM                                                            
11050 *                                                                                             
11050C                   EXSR      CS_CHKSUM                                                        
11050 *                                                                                             
     C                   IF        ZXTOCE=1 OR ZXLIAB=0                                             
11050 *                                                                                             
     C                   EVAL      C0CIAS=C5CIAS                                                    
     C                   EVAL      C0DLGA=C5DLGA                                                    
     C                   EVAL      C0NPCO=C5NPCO                                                    
     C                   EVAL      C0TPED=C5TPED                                                    
     C                   EVAL      C0DATP=C5DATP                                                    
     C                   EVAL      C0NOPL=C5NOPL                                                    
     C     KPUCAPE       CHAIN     PUCAPE                                                           
09060C                   EVAL      ZXDELPUCAPE='0'                                                  
     C                   IF        %FOUND(PUCAPE)                                                   
     C                   IF        ZXLIAB=0                                                         
     C                   IF        @PEDAU='018'                                                     
C2559C                             OR @PEDAU='051'                                                  
     C                   EVAL      C0STCO='90'                                                      
     C                   UPDATE    RPUCAPE                                                          
     C                   ELSE                                                                       
     C                   DELETE    RPUCAPE                                                          
09060C                   EVAL      ZXDELPUCAPE='1'                                                  
21050C                   IF        ZZCBPE='1' OR ZZCBPE='3'                                         
21050C                   WRITE     RPUBCAP                              80                          
21050C                   ENDIF                                                                      
     C                   ENDIF                                                                      
09060 *Solo si borra el PUCAPE se enviará TR0035                                                    
09060C                   If        ZXDELPUCAPE='1'                                                  
CQ718C                   If        C0CNFD <> '1'                                                    
     C                   EVAL      ZXOPC0='4'                                                       
     C                   EXSR      CS_SENDCAB                                                       
     C                   EXSR      CS_SENDOBS                                                       
     C                   EXSR      CS_SENDDIR                                                       
CQ718C                   Endif                                                                      
09060C                   Endif                                                                      
     C                   ELSE                                                                       
     C                   EVAL      C0STCO='90'                                                      
     C                   UPDATE    RPUCAPE                                                          
09060 *Solo si borra el PUCAPE se enviará TR0035                                                    
09060C***                EVAL      ZXOPC0='4'                                                       
09060C***                EXSR      CS_SENDCAB                                                       
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
      *                                                                                             
11050C                   ELSE                                                                       
11050C                   EVAL      ZXOPC0='2'                                                       
11050C                   EXSR      CS_SENDCAB                                                       
     C                   ENDIF                                                                      
      *                                                                                             
      * Si no encuentra PUDEPE, podría ser artículo propio                                          
      * entonces grabo auditoría pero no envío los datos                                            
      *                                                                                             
In190C                   ENDIF                                                                      
     C                   ELSE                                                                       
     C     KCODEPE       CHAIN(N)  CODEPE                                                           
     C                   IF        %FOUND(CODEPE)                                                   
     C                   SELECT                                                                     
     C                   WHEN      @PEDAU='005'                                                     
     C                   EVAL      @FDEDAU='005'                                                    
     C                   EXSR      CS_TRAZAVTA                                                      
     C                   WHEN      @PEDAU='009'                                                     
     C                   EVAL      @FDEDAU='009'                                                    
     C                   EXSR      CS_TRAZAVTA                                                      
     C                   WHEN      @PEDAU='018'                                                     
     C                   EVAL      @FDEDAU='018'                                                    
     C                   EXSR      CS_TRAZAVTA                                                      
C2559C                   WHEN      @PEDAU='051'                                                     
C2559C                   EVAL      @FDEDAU='051'                                                    
C2559C                   EXSR      CS_TRAZAVTA                                                      
     C                   ENDSL                                                                      
     C                   ENDIF                                                                      
      *                                                                                             
     C                   ENDIF                                                                      
      *                                                                                             
     C                   ENDIF                                                                      
      *                                                                                             
     C     KEDTRLP00     READE     EDTRLP00                                                         
     C                   ENDDO                                                                      
      *                                                                                             
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Modificación de 1 línea de pedido                                                           
      **********************************************************************                        
     C     CS_MODI       BEGSR                                                                      
      *                                                                                             
      * Actualizamos la/las línea del pedido de compras                                             
      * usando el fichero de trazabilidad ED                                                        
      *                                                                                             
     C                   EVAL      T0CIAS=@PCIAS                                                    
     C                   EVAL      T0DLGA=@PDLGA                                                    
     C                   EVAL      T0NPCO=@PNPCO                                                    
     C                   EVAL      T0TPED=@PTPED                                                    
     C                   EVAL      T0DATP=@PDATP                                                    
     C                   EVAL      T0NOPL=@PNOPL                                                    
     C                   EVAL      T0LINE=@PLINE                                                    
     C     KEDTRLP00     SETLL     EDTRLP00                                                         
     C     KEDTRLP00     READE     EDTRLP00                                                         
     C                   DOW       NOT %EOF(EDTRLP00)                                               
      *                                                                                             
      * Si no es conjunto procesar normalmente, pero si es un                                       
      * detalle de conjunto sólo procesar su línea                                                  
      *                                                                                             
     C                   IF        ZXDCOJ=0                                                         
     C                             OR (ZXDCOJ=1 AND T0ARV1=ZXARVM)                                  
      *                                                                                             
     C                   EVAL      C5CIAS=T0CIA1                                                    
     C                   EVAL      C5DLGA=T0DLG1                                                    
     C                   EVAL      C5NPCO=T0NPC1                                                    
     C                   EVAL      C5TPED=T0TPE1                                                    
     C                   EVAL      C5DATP=T0DAT1                                                    
     C                   EVAL      C5NOPL=T0NOP1                                                    
     C                   EVAL      C5LINE=T0LIN1                                                    
     C     KPUDEPE       CHAIN     PUDEPE                                                           
     C                   IF        %FOUND(PUDEPE)                                                   
     C                   EVAL      C0CIAS=C5CIAS                                                    
     C                   EVAL      C0DLGA=C5DLGA                                                    
     C                   EVAL      C0NPCO=C5NPCO                                                    
     C                   EVAL      C0TPED=C5TPED                                                    
     C                   EVAL      C0DATP=C5DATP                                                    
     C                   EVAL      C0NOPL=C5NOPL                                                    
     C     KPUCAPE       CHAIN(N)  PUCAPE                                                           
     C                   IF        %FOUND(PUCAPE)                                                   
      *                                                                                             
     C                   SELECT                                                                     
      *                                                                                             
      * Cial: Mod cant (+) pedido vtas                                                              
     C                   WHEN      @FDEDAU='006'                                                    
     C                   IF        C5TCOJ=*BLANKS                                                   
     C                   EVAL      C5CANT=ZXCANT                                                    
     C                   ELSE                                                                       
     C                   EVAL      C5CANT=ZXCANT*T0CFC1                                             
     C                   ENDIF                                                                      
     C                   UPDATE    RPUDEPE                                                          
24812C                   IF        S5FREP>0                                                         
14121C                   EVAL      C5FRRR=S5FREP                                                    
24812C                   ENDIF                                                                      
     C                   EVAL      @FDEDAU='106'                                                    
     C                   EXSR      CS_TRAZACOM                                                      
     C                   EVAL      @FDEDAU='006'                                                    
      *                                                                                             
      * Cial: Mod cant (-) pedido vtas                                                              
     C                   WHEN      @FDEDAU='007'                                                    
09091C                   EVAL      ZXCANT_SAV=C5CANT                                                
In190C                   IF        C5STUL<'5'                                                       
     C                   IF        C5TCOJ=*BLANKS                                                   
     C                   EVAL      C5CANT=ZXCANT                                                    
     C                   ELSE                                                                       
     C                   EVAL      C5CANT=ZXCANT*T0CFC1                                             
     C                   ENDIF                                                                      
09091 *                                                                                             
09091 * si la cantidad calculada es 0 quiere decir que se ha servido                                
09091 * y reservado toda la cantidad del pedido, pero eso no quiere                                 
09091 * decir que debamos inicializar a 0 la cantidad del pedido de                                 
09091 * compras   ZXCANT=S5CANT-S5CANS-S5CANR=0                                                     
09091 *              implica que C5CANT=C5CANS+C5CANR                                               
09091 * en el caso de que la cantidad resultante siga siendo 0                                      
09091 * cerraremos la línea (aunque lo correcto sería eliminarla).                                  
09091 *                                                                                             
09091C                   IF        C5CANT=0                                                         
09091C                   EVAL      C5CANT=C5CANS+C5CANR                                             
09091C                   IF        C5CANT=0                                                         
09091C                   EVAL      C5CANT=ZXCANT_SAV                                                
09091C                   EVAL      C5STUL='5'                                                       
09091C                   ENDIF                                                                      
09091C                   ENDIF                                                                      
09091 *                                                                                             
     C                   UPDATE    RPUDEPE                                                          
24812C                   IF        S5FREP>0                                                         
14121C                   EVAL      C5FRRR=S5FREP                                                    
24812C                   ENDIF                                                                      
     C                   EVAL      @FDEDAU='107'                                                    
     C                   EXSR      CS_TRAZACOM                                                      
     C                   EVAL      @FDEDAU='007'                                                    
In190C                   ENDIF                                                                      
      *                                                                                             
      * Cial: Retener lín o tot ped vta                                                             
     C                   WHEN      @FDEDAU='008'                                                    
In190C                   IF        C5STUL<'5'                                                       
     C                   IF        S5PHLD>='1'                                                      
     C                   EVAL      C5PHLD='1'                                                       
     C                   ELSE                                                                       
     C                   EVAL      C5PHLD=*BLANKS                                                   
     C                   ENDIF                                                                      
     C                   UPDATE    RPUDEPE                                                          
24812C                   IF        S5FREP>0                                                         
14121C                   EVAL      C5FRRR=S5FREP                                                    
24812C                   ENDIF                                                                      
     C                   EVAL      @FDEDAU='108'                                                    
     C                   EXSR      CS_TRAZACOM                                                      
     C                   EVAL      @FDEDAU='008'                                                    
In190C                   ENDIF                                                                      
In199 *                                                                                             
In199 * Cial: Cambio logística pedido                                                               
In199C                   WHEN      @FDEDAU='011'                                                    
In199C                   IF        C5STUL<'5'                                                       
In199C                   EVAL      ZXLOGE=C5LOGE                                                    
In199C                   EVAL      C5LOGE=S5LOGE                                                    
In199C                   UPDATE    RPUDEPE                                                          
24812C                   IF        S5FREP>0                                                         
14121C                   EVAL      C5FRRR=S5FREP                                                    
24812C                   ENDIF                                                                      
In199C                   EVAL      @FDEDAU='111'                                                    
In199C                   EVAL      DSTEXT = *BLANKS                                                 
In199C                   EVAL      ZXLOGANT = ZXLOGE                                                
In199C                   EVAL      ZXFLECH  = '=>'                                                  
In199C                   EVAL      ZXLOGPOS = C5LOGE                                                
In199C                   MOVEL     DSTEXT        @FDTEXT                                            
In199C                   EXSR      CS_TRAZACOM                                                      
In199C                   EVAL      @FDTEXT = *BLANKS                                                
In199C                   EVAL      @FDEDAU='011'                                                    
In199C                   ENDIF                                                                      
19050 * Cial: DesRetener línea                                                                      
19050C                   WHEN      @FDEDAU='027'                                                    
In190C                   IF        C5STUL<'5'                                                       
19050C                   IF        S5PHLD<'1'                                                       
19050C                   EVAL      C5PHLD=*BLANKS                                                   
19050C                   ENDIF                                                                      
19050C                   UPDATE    RPUDEPE                                                          
24812C                   IF        S5FREP>0                                                         
14121C                   EVAL      C5FRRR=S5FREP                                                    
24812C                   ENDIF                                                                      
19050C                   EVAL      @FDEDAU='121'                                                    
19050C                   EXSR      CS_TRAZACOM                                                      
19050C                   EVAL      @FDEDAU='027'                                                    
In190C                   ENDIF                                                                      
      *                                                                                             
      * Cial: Cambio dirección entrega                                                              
     C                   WHEN      @FDEDAU='012'                                                    
In190C                   IF        C5STUL<'5'                                                       
     C                   EVAL      ZXOPC0='2'                                                       
     C                   EXSR      CS_PUDIPE1                                                       
     C                   UNLOCK    PUDEPE                                                           
     C                   EVAL      @FDEDAU='112'                                                    
     C                   EXSR      CS_TRAZACOM                                                      
     C                   EVAL      @FDEDAU='012'                                                    
31030 * EN CABECERA                                                                                 
31030C                   EVAL      S0CIAS=T0CIAS                                                    
31030C                   EVAL      S0DLGA=T0DLGA                                                    
31030C                   EVAL      S0NPCO=T0NPCO                                                    
31030C                   EVAL      S0TPED=T0TPED                                                    
31030C                   EVAL      S0DATP=T0DATP                                                    
31030C                   EVAL      S0NOPL=T0NOPL                                                    
31030C     KCOCAPE       CHAIN(N)  COCAPE                                                           
31030C                   IF        %FOUND(COCAPE)                                                   
31030C                   EVAL      C0CIAS=T0CIA1                                                    
31030C                   EVAL      C0DLGA=T0DLG1                                                    
31030C                   EVAL      C0NPCO=T0NPC1                                                    
31030C                   EVAL      C0TPED=T0TPE1                                                    
31030C                   EVAL      C0DATP=T0DAT1                                                    
31030C                   EVAL      C0NOPL=T0NOP1                                                    
31030C     KPUCAPE       CHAIN     PUCAPE                                                           
31030C                   IF        %FOUND(PUCAPE)                                                   
31030C                   EVAL      *IN55=*OFF                                                       
C2638C                   EVAL      ZXPR2_PED=*BLANKS                                                
C2638C                   EVAL      ZXPR2_PED=C0PRVR+C0NPCO                                          
C2638C*31030 C0PRVR        LOOKUP    SPRO2(1)                             55                        
C2638C     ZXPR2_PED     LOOKUP    SPRO2(1)                               55                        
31030C                   IF        *IN55=*OFF                                                       
31030C                   EVAL      BP2=BP2+1                                                        
C2638C*31030             EVAL      SPRO2(BP2)=C0PRVR                                                
C2638C                   EVAL      SPRO2(BP2)=C0PRVR+C0NPCO                                         
31030C                   EVAL      C0TDI1=S0TDI1                                                    
31030C                   EVAL      C0TDIF=S0TDI1                                                    
C2556C                   EVAL      C0EDME=S0EDME                                                    
C2556C                   EVAL      C0DECA=S0DECA                                                    
31030C                   UPDATE    RPUCAPE                                                          
11050 *                                                                                             
11050 *  Activaremos el campo de CHEKSUM                                                            
11050 *                                                                                             
11050C                   EXSR      CS_CHKSUM                                                        
11050 *                                                                                             
31030C                   EVAL      ZXOPC0='2'                                                       
31030C                   EXSR      CS_SENDCAB                                                       
31030C                   ENDIF                                                                      
31030C                   ENDIF                                                                      
31030C                   ENDIF                                                                      
In190C                   ENDIF                                                                      
      *                                                                                             
      * Cial: Cambio cond coenvío                                                                   
     C                   WHEN      @FDEDAU='013'                                                    
In190C                   IF        C5STUL<'5'                                                       
      * EN DETALLE                                                                                  
     C                   EVAL      C5NCOE=S5NCOE                                                    
     C                   EVAL      C5NCOI=S5NCOI                                                    
     C                   EVAL      C5NCOF=S5NCOF                                                    
     C                   UPDATE    RPUDEPE                                                          
24812C                   IF        S5FREP>0                                                         
14121C                   EVAL      C5FRRR=S5FREP                                                    
24812C                   ENDIF                                                                      
     C                   EVAL      @FDEDAU='113'                                                    
     C                   EXSR      CS_TRAZACOM                                                      
In206C**                 EVAL      @FDEDAU='113'                                                    
In206C                   EVAL      @FDEDAU='013'                                                    
      * EN CABECERA                                                                                 
     C                   EVAL      S0CIAS=T0CIAS                                                    
     C                   EVAL      S0DLGA=T0DLGA                                                    
     C                   EVAL      S0NPCO=T0NPCO                                                    
     C                   EVAL      S0TPED=T0TPED                                                    
     C                   EVAL      S0DATP=T0DATP                                                    
     C                   EVAL      S0NOPL=T0NOPL                                                    
     C     KCOCAPE       CHAIN(N)  COCAPE                                                           
     C                   IF        %FOUND(COCAPE)                                                   
     C                   EVAL      C0CIAS=T0CIA1                                                    
     C                   EVAL      C0DLGA=T0DLG1                                                    
     C                   EVAL      C0NPCO=T0NPC1                                                    
     C                   EVAL      C0TPED=T0TPE1                                                    
     C                   EVAL      C0DATP=T0DAT1                                                    
     C                   EVAL      C0NOPL=T0NOP1                                                    
     C     KPUCAPE       CHAIN     PUCAPE                                                           
     C                   IF        %FOUND(PUCAPE)                                                   
     C                   EVAL      C0COEN=S0COEN                                                    
C2556C                   EVAL      C0EDME=S0EDME                                                    
C2556C                   EVAL      C0DECA=S0DECA                                                    
     C                   UPDATE    RPUCAPE                                                          
11050 *                                                                                             
11050 *  Activaremos el campo de CHEKSUM                                                            
11050 *                                                                                             
11050C                   EXSR      CS_CHKSUM                                                        
11050 *                                                                                             
     C                   EVAL      ZXOPC0='2'                                                       
     C                   EXSR      CS_SENDCAB                                                       
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
In190C                   ENDIF                                                                      
      *                                                                                             
      * Cial: Camb fec solicit cliente                                                              
     C                   WHEN      @FDEDAU='014'                                                    
In190C                   IF        C5STUL<'5'                                                       
     C                   EVAL      C5FREP=S5FREP                                                    
     C                   UPDATE    RPUDEPE                                                          
24812C                   IF        S5FREP>0                                                         
14121C                   EVAL      C5FRRR=S5FREP                                                    
24812C                   ENDIF                                                                      
24812C**                 EVAL      C5FRRR=S5FREP                                                    
     C                   EVAL      @FDEDAU='114'                                                    
     C                   EXSR      CS_TRAZACOM                                                      
     C                   EVAL      @FDEDAU='014'                                                    
In190C                   ENDIF                                                                      
      *                                                                                             
      * BO: Bloq ped vtas riesgo exced                                                              
     C                   WHEN      @FDEDAU='015'                                                    
In190C                   IF        C5STUL<'5'                                                       
     C                   IF        T0RISK>=1                                                        
     C                   EVAL      C5PHLD='1'                                                       
     C                   ELSE                                                                       
     C                   EVAL      C5PHLD=*BLANKS                                                   
     C                   ENDIF                                                                      
     C                   UPDATE    RPUDEPE                                                          
24812C                   IF        S5FREP>0                                                         
14121C                   EVAL      C5FRRR=S5FREP                                                    
24812C                   ENDIF                                                                      
     C                   EVAL      @FDEDAU='115'                                                    
     C                   EXSR      CS_TRAZACOM                                                      
     C                   EVAL      @FDEDAU='015'                                                    
In190C                   ENDIF                                                                      
      *                                                                                             
      * Cial: 36 Reabrir ped vtas                                                                   
     C                   WHEN      @FDEDAU='019'                                                    
H2506C                   EVAL      ZXSEND019=0                                                      
     C                   IF        C5CANS=0                                                         
H2506C                   IF        C5STUL<>'0'                                                      
H2506C                   EVAL      ZXSEND019=1                                                      
     C                   EVAL      C5STUL='0'                                                       
H2506C                   ENDIF                                                                      
     C                   ELSE                                                                       
H2506C                   IF        C5CANS<>C5CANT                                                   
H2506C                   EVAL      ZXSEND019=1                                                      
     C                   EVAL      C5STUL='3'                                                       
H2506C                   ENDIF                                                                      
     C                   ENDIF                                                                      
     C                   UPDATE    RPUDEPE                                                          
24812C                   IF        S5FREP>0                                                         
14121C                   EVAL      C5FRRR=S5FREP                                                    
24812C                   ENDIF                                                                      
     C                   EVAL      @FDEDAU='119'                                                    
H2506C                   IF        ZXSEND019=1                                                      
     C                   EXSR      CS_TRAZACOM                                                      
H2506C                   ENDIF                                                                      
     C                   EVAL      @FDEDAU='019'                                                    
FQ604 *                                                                                             
FQ604 * Cial: Cambio observaciones                                                                  
FQ604C                   WHEN      @FDEDAU='026'                                                    
In190C                   IF        C5STUL<'5'                                                       
FQ604C                   EVAL      S0CIAS=T0CIAS                                                    
FQ604C                   EVAL      S0DLGA=T0DLGA                                                    
FQ604C                   EVAL      S0NPCO=T0NPCO                                                    
FQ604C                   EVAL      S0TPED=T0TPED                                                    
FQ604C                   EVAL      S0DATP=T0DATP                                                    
FQ604C                   EVAL      S0NOPL=T0NOPL                                                    
FQ604C     KCOCAPE       CHAIN(N)  COCAPE                                                           
FQ604C                   IF        %FOUND(COCAPE)                                                   
FQ604C                   EVAL      C0CIAS=T0CIA1                                                    
FQ604C                   EVAL      C0DLGA=T0DLG1                                                    
FQ604C                   EVAL      C0NPCO=T0NPC1                                                    
FQ604C                   EVAL      C0TPED=T0TPE1                                                    
FQ604C                   EVAL      C0DATP=T0DAT1                                                    
FQ604C                   EVAL      C0NOPL=T0NOP1                                                    
FQ604C     KPUCAPE       CHAIN     PUCAPE                                                           
FQ604C                   IF        %FOUND(PUCAPE)                                                   
FQ604C                   EVAL      *IN55=*OFF                                                       
C2638C                   EVAL      ZXPR2_PED=*BLANKS                                                
C2638C                   EVAL      ZXPR2_PED=C0PRVR+C0NPCO                                          
C2638C*FQ604 C0PRVR        LOOKUP    SPRO2(1)                             55                        
C2638C     ZXPR2_PED     LOOKUP    SPRO2(1)                               55                        
FQ604 *  Solo actuamos si no lo hemos hecho antes para el proveedor                                 
FQ604C                   IF        *IN55=*OFF                                                       
FQ604C                   EVAL      BP2=BP2+1                                                        
C2638C*FQ604             EVAL      SPRO2(BP2)=C0PRVR                                                
C2638C                   EVAL      SPRO2(BP2)=C0PRVR+C0NPCO                                         
FQ604C                   EVAL      C0EDME=S0EDME                                                    
C1341C                   EVAL      C0DECA=S0DECA                                                    
FQ604C                   UPDATE    RPUCAPE                                                          
FQ604                                                                                               
FQ604 *  Activaremos el campo de CHEKSUM                                                            
FQ604C                   EXSR      CS_CHKSUM                                                        
FQ604 *  Enviamos Cabecera                                                                          
FQ604C                   EVAL      ZXOPC0='2'                                                       
FQ604C                   EXSR      CS_SENDCAB                                                       
FQ604                                                                                               
FQ604 *  Sincronizamos Observaciones, eliminando y creando                                          
FQ604C                   EVAL      ZXOPC0='4'                                                       
FQ604C                   EXSR      CS_SENDOBS                                                       
07053C                   EVAL      C0LINP=0                                                         
FQ604C                   EXSR      CS_OBSDEL                                                        
FQ604C                   EXSR      CS_OBSCAB                                                        
FQ604C                   EVAL      ZXOPC0='1'                                                       
FQ604C                   EXSR      CS_SENDOBS                                                       
FQ604                                                                                               
FQ604C                   ENDIF                                                                      
FQ604C                   ENDIF                                                                      
FQ604C                   ENDIF                                                                      
In190C                   ENDIF                                                                      
      *                                                                                             
21060C**                 WHEN      @PEDAU='001' OR @PEDAU='002'                                     
21060C**                 UNLOCK    PUDEPE                                                           
21060C**                 EVAL      @FDEDAU='100'                                                    
21060C**                 EXSR      CS_TRAZACOM                                                      
21060C**                                                                                            
21060C**                 WHEN      @PEDAU='010'                                                     
21060C**                 UNLOCK    PUDEPE                                                           
21060C**                 EVAL      @FDEDAU='110'                                                    
21060C**                 EXSR      CS_TRAZACOM                                                      
     C                   ENDSL                                                                      
      *                                                                                             
     C                   ENDIF                                                                      
21060C**o existe PUDEPE (por lo tanto serán altas)                                                  
21060C**                 ELSE                                                                       
21060C**                 IF        @PEDAU='001' OR @PEDAU='002' OR                                  
21060C**                           @PEDAU='010'                                                     
21060C**                                                                                            
21060C**Miramos si el proveedor permite ED para hacer altas                                         
21060C**en teoría ya se debe haber validado anteriormente                                           
21060C**                                                                                            
21060C**                 EVAL      C0CIAS=M5CIAS                                                    
C1579C**21060            EVAL      C0PRVR=M5PRVR                                                    
C1579C**                 EVAL      C0PRVR=ZXPRVR                                                    
21060C**   KPUPROV       CHAIN     PUPROV                                                           
21060C**                 IF        %FOUND(PUPROV) AND C0PEVT>='1'                                   
21060C**                           AND C0BAJA<'1'                                                   
21060C**                           AND ZXCANT>0                                                     
21060C**                 EVAL      ZXTLIN=T0LINE                                                    
21060C**                 EXSR      CS_ALTA                                                          
21060C**                 EVAL      T0LINE=ZXTLIN                                                    
21060C**                 ENDIF                                                                      
21060C**                 ENDIF                                                                      
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
      *                                                                                             
     C     KEDTRLP00     READE     EDTRLP00                                                         
     C                   ENDDO                                                                      
      *                                                                                             
      * Si es opción de reabrir, recalculamos estado del pedido de compras                          
      *                                                                                             
     C                   IF        @FDEDAU='019'                                                    
     C                   UNLOCK    PUDEPE                                                           
14050 * Si la cabecera de compra tiene estatus '90' volveré                                         
14050 * a enviar primero la cabecera                                                                
14050C                   IF        C0STCO='90'                                                      
14050C                   EXSR      CS_CHKSUM                                                        
C2770C*14050             EVAL      ZXOPC0='1'                                                       
C2770C                   EVAL      ZXOPC0='2'                                                       
H2506C                   IF        ZXSEND019=1                                                      
14050C                   EXSR      CS_SENDCAB                                                       
C2676C                   EXSR      CS_PUDIPE1                                                       
H2506C                   ENDIF                                                                      
14050C                   ENDIF                                                                      
     C                   CALL      'PU2560'                                                         
     C                   PARM      C5CIAS        @PECIAS                                            
     C                   PARM      C5DLGA        @PEDLGA                                            
     C                   PARM      C5NPCO        @PENPCO                                            
     C                   PARM      C5TPED        @PETPED                                            
     C                   PARM      C5DATP        @PEDATP                                            
     C                   PARM      C5NOPL        @PENOPL                                            
H2506C*                  PARM      0             @PELINE                                            
H2506C                   PARM      @PLINE        @PELINE                                            
H2506C*                  PARM      'B'           @PEFINA                                            
H2506C                   PARM      '0'           @PEFINA                                            
     C                   PARM      '1'           @PEPROC                                            
     C                   PARM      *BLANKS       @PEERR                                             
     C                   ENDIF                                                                      
      *                                                                                             
     C                   ENDSR                                                                      
15041 **********************************************************************                        
15041 * Evitar duplicidades lineas de compras                                                       
15041 **********************************************************************                        
15041C     CS_EXISCOMP   BEGSR                                                                      
15041C                   EVAL      ZXEXISCOM='0'                                                    
15041C                   EVAL      T0CIAS=@PCIAS                                                    
15041C                   EVAL      T0DLGA=@PDLGA                                                    
15041C                   EVAL      T0NPCO=@PNPCO                                                    
15041C                   EVAL      T0TPED=@PTPED                                                    
15041C                   EVAL      T0DATP=@PDATP                                                    
15041C                   EVAL      T0NOPL=@PNOPL                                                    
15041C                   EVAL      T0LINE=@PLINE                                                    
15041C     KEDTRLP00     SETLL     EDTRLP00                                                         
15041C     KEDTRLP00     READE     EDTRLP00                                                         
15041C                   DOW       NOT %EOF(EDTRLP00)                                               
15041C                   IF        T0NPC1<>*BLANKS AND                                              
15041C                             %TRIM(ZXARTI+ZXVARI+ZXMODE)=T0ARV1                               
15041C                   EVAL      C5CIAS=T0CIA1                                                    
15041C                   EVAL      C5DLGA=T0DLG1                                                    
15041C                   EVAL      C5NPCO=T0NPC1                                                    
15041C                   EVAL      C5TPED=T0TPE1                                                    
15041C                   EVAL      C5DATP=T0DAT1                                                    
15041C                   EVAL      C5NOPL=T0NOP1                                                    
15041C                   EVAL      C5LINE=T0LIN1                                                    
15041C     KPUDEPE       CHAIN(N)  PUDEPE                                                           
15041C                   IF        %FOUND(PUDEPE)                                                   
15041C                   EVAL       ZXEXISCOM='1'                                                   
15041C                   ENDIF                                                                      
15041C                   LEAVE                                                                      
15041C                   ENDIF                                                                      
15041C     KEDTRLP00     READE     EDTRLP00                                                         
15041C                   ENDDO                                                                      
15041C                   ENDSR                                                                      
      **********************************************************************                        
      * Comprobar cabecera de pedido de compras                                                     
      **********************************************************************                        
     C     CS_CHECKCAB   BEGSR                                                                      
      *                                                                                             
15040C                   Z-ADD     0             ZXNEWC            1 0                              
     C                   EVAL      ZXSENDCAB=1                                                      
      *                                                                                             
      * Comprueba todas las líneas de este pedido de ventas para ver si                             
      * ya tenemos pedido de compras abierto para el mismo proveedor                                
      * Usando el fichero de trazabilidad ED                                                        
      *                                                                                             
CQ718C                   IF        ZXPECABE = ''                                                    
CQ718C                   EVAL      C0CIAS=@PCIAS                                                    
CQ718C                   EVAL      C0PRVR=ZXPRVR                                                    
CQ718C     KPUPROV       CHAIN     PUPROV                                                           
CQ718C                   IF        %FOUND  AND  C0BAJA <> '1'  AND  C0CNFD = '1'                    
CQ718C                   EVAL      ZXPEDCON = 0                                                     
CQ718C                   ENDIF                                                  %FOUND(PUPROV)..    
CQ718C                   ENDIF                                                  ZXPECABE = ''       
CQ718 *                                                                                             
     C                   EVAL      T0CIAS=@PCIAS                                                    
     C                   EVAL      T0DLGA=@PDLGA                                                    
     C                   EVAL      T0NPCO=@PNPCO                                                    
     C                   EVAL      T0TPED=@PTPED                                                    
     C                   EVAL      T0DATP=@PDATP                                                    
     C                   EVAL      T0NOPL=@PNOPL                                                    
     C                   EVAL      T0LINE=0                                                         
22716C*CR530* Comprobar si venimos de nuevo pedido o Adicción lineas                                
22716C*CR530             EVAL      ZXPEDCON=0                                                       
22716C*CR530             IF        @PEDAU='002' AND @PLINE<>0                                       
22716C*CR530             EVAL      ZXPEDCON=1                                                       
22716C*CR530             ENDIF                                                                      
CR530C**                                                                                            
     C     KEDTRLP00     SETLL     EDTRLP00                                                         
CR530C                   IF        ZXPEDCON=0                                                       
     C     KEDTRLP00X    READE     EDTRLP00                                                         
CR530C                   ELSE                                                                       
CR530C     KEDTRLP00     READE     EDTRLP00                                                         
CR530C                   ENDIF                                                                      
     C                   DOW       NOT %EOF(EDTRLP00)                                               
      *                                                                                             
     C                   EVAL      C0CIAS=T0CIA1                                                    
     C                   EVAL      C0DLGA=T0DLG1                                                    
     C                   EVAL      C0NPCO=T0NPC1                                                    
     C                   EVAL      C0TPED=T0TPE1                                                    
     C                   EVAL      C0DATP=T0DAT1                                                    
     C                   EVAL      C0NOPL=T0NOP1                                                    
     C     KPUCAPE       CHAIN(N)  PUCAPE                                                           
GP581C*                  IF        %FOUND(PUCAPE)                                                   
GP581C                   IF        (%FOUND(PUCAPE)                                                  
GP581C                             AND C0CNFD<>'1'                                                  
17101C                             AND C0STCO<'30'                                                  
17101C*                            AND C0STCO<'90'                                                  
C1579C***                          AND C0PRVR=M5PRVR                                                
GP581C* C1579                      AND C0PRVR=ZXPRVR                                                
GP581C                             AND C0PRVR=ZXPRVR)                                               
GP581C                             OR                                                               
GP581C                             (%FOUND(PUCAPE)                                                  
GP581C                             AND C0CNFD='1'                                                   
GP581C                             AND C0STCO<'90'                                                  
GP581C                             AND C0PRVR=ZXPRVR)                                               
15041C     KPUCAPE       CHAIN(N)  PUDEPE                                                           
15041C*                  IF        C5PREC<>0                                                        
C1983C*17101             IF        C5PREC<>0 AND %FOUND(PUDEPE)                                     
C1983C* Controlar creación de cabecera si es pedido PoolWeb                                         
C1983C                   IF        C5PREC<>0 AND %FOUND(PUDEPE) AND ZXPWEB='0'                      
C1983C                             OR %FOUND(PUDEPE) AND ZXPWEB='1'                                 
     C                   EVAL      ZXSENDCAB=0                                                      
17101C     *NOKEY        CLEAR                   RPUDEPE                                            
     C                   LEAVE                                                                      
     C                   ENDIF                                                                      
15041C                   ENDIF                                                                      
      *                                                                                             
CR530C                   IF        ZXPEDCON=0                                                       
     C     KEDTRLP00X    READE     EDTRLP00                                                         
CR530C                   ELSE                                                                       
CR530C     KEDTRLP00     READE     EDTRLP00                                                         
CR530C                   ENDIF                                                                      
     C                   ENDDO                                                                      
      *                                                                                             
      * Recuperamos la línea de ventas que estamos tratando                                         
      *                                                                                             
     C                   EVAL      S5LINE=@PLINE                                                    
     C     KCODEPE       CHAIN(N)  CODEPE                                                           
      *                                                                                             
      * Si no hemos encontrado cabecera correcta hay que crearla                                    
      * o hay incidencias, siempre pedido nuevo                                                     
      *                                                                                             
     C                   IF        ZXSENDCAB=1                                                      
     C                             OR ZXNOCONF=1                                                    
      *                                                                                             
      * Recuperar siguiente numeración                                                              
      *                                                                                             
     C                   CALL      'PU2519'                                                         
     C                   PARM                    @PCIAS                                             
     C                   PARM      @PDLGA        @PEDLGA                                            
     C                   PARM      *BLANKS       @PENPCO                                            
     C                   PARM      *BLANKS       @PETPED                                            
     C                   PARM      *ZEROS        @PEDATP                                            
     C                   PARM      *ZEROS        @PENOPL                                            
     C                   PARM      ' '           @PEERR                                             
      *                                                                                             
     C                   IF        @PEERR<'1'                                                       
      *                                                                                             
      * Preparar campos                                                                             
      *                                                                                             
     C                   EVAL      C0CIAS=@PCIAS                                                    
C1579C***                EVAL      C0PRVR=M5PRVR                                                    
C1579C                   EVAL      C0PRVR=ZXPRVR                                                    
     C                   EVAL      C0DLGA=@PEDLGA                                                   
     C                   EVAL      C0NPCO=@PENPCO                                                   
     C                   EVAL      C0TPED=@PETPED                                                   
      *                                                                                             
     C                   EVAL      C0DATP=*DATE                                                     
     C                   TIME                    C0NOPL                                             
      *                                                                                             
     C     KPUPROV       CHAIN     PUPROV                                                           
     C                   IF        %FOUND(PUPROV) AND C0BAJA<>'1'                                   
      *                                                                                             
     C                   EVAL      C0FLAN=*ZEROS                                                    
     C                   EVAL      C0TLAN=*BLANKS                                                   
     C                   EVAL      C0FPED=ZZDATS                                                    
46222C                   IF        C0FPED<*DATE                                                     
46222C                   EVAL      C0FPED=*DATE                                                     
46222C                   ENDIF                                                                      
     C                   EVAL      C0FRRE=0                                                         
     C                                                                                              
     C                   IF        C0ALED>='1' AND C0LEA1>0                                         
     C                   MOVE      ZZDATS        ZXFREPI                                            
     C                   EVAL      ZXLEA1=C0LEA1                                                    
      * Si quieren actuar con el 2º lead time de seguridad                                          
     C                   IF        C0ALED>='3'                                                      
     C                   EVAL      ZXLEA1=ZXLEA1+C0LEA2                                             
     C                   ENDIF                                                                      
     C     ZXFREPI       ADDDUR    ZXLEA1:*D     ZXFREPI                                            
     C                   MOVE      ZXFREPI       C0FREP                                             
     C                   ELSE                                                                       
     C                   EVAL      C0FREP=ZZDATS                                                    
     C                   ENDIF                                                                      
      *                                                                                             
     C                   EVAL      C0STCO='20'                                                      
      *                                                                                             
      * Si el pedido de venta está excedido de riesgo no confirmamos el pedido                      
      * o si tiene incidencias                                              do                      
      *                                                                                             
     C                   EVAL      S0CIAS=@PCIAS                                                    
     C                   EVAL      S0DLGA=@PDLGA                                                    
     C                   EVAL      S0NPCO=@PNPCO                                                    
     C                   EVAL      S0TPED=@PTPED                                                    
     C                   EVAL      S0DATP=@PDATP                                                    
     C                   EVAL      S0NOPL=@PNOPL                                                    
     C     KCOCAPE       CHAIN(N)  COCAPE                                                           
     C                   IF        %FOUND(COCAPE)                                                   
     C                             AND S0REXC>='1' AND S0RAUT<>'1'                                  
     C                   EVAL      C0STCO='10'                                                      
     C                   ENDIF                                                                      
      *                                                                                             
     C                   IF        ZXNOCONF=1                                                       
     C                   EVAL      C0STCO='10'                                                      
     C                   ENDIF                                                                      
      *                                                                                             
     C                   EVAL      C0FREP=S0FREP                                                    
14061C                   IF        S0FLAN>S0FREP                                                    
14061C                   EVAL      C0FREP=S0FLAN                                                    
14061C                   ENDIF                                                                      
20072C                   IF        C0FREP<ZZDATS                                                    
20072C                   EVAL      C0FREP=ZZDATS                                                    
20072C                   ENDIF                                                                      
     C                   EVAL      C0TRAB=ZZUSUA                                                    
     C                   EVAL      C0DAT1=ZZDATS                                                    
     C                   EVAL      C0DAT8=ZZDATS                                                    
     C                   EVAL      C0USUA=ZZUSUA                                                    
     C                   EVAL      C0PANT=SDSJOB                                                    
     C                   TIME                    C0HORA                                             
     C                   EVAL      C0FRRR=C0FREP                                                    
     C                   EVAL      C0CUST=S5CUST                                                    
     C                   EVAL      C0NPVE=S5NPCO                                                    
     C                   EVAL      C0TPVE=S5TPED                                                    
     C                   EVAL      C0DAVE=S5DATP                                                    
     C                   EVAL      C0NOVE=S5NOPL                                                    
      *                                                                                             
     C                   MOVEL     S5CIAS        C0CIVE                                             
     C                   EVAL      C0DLVE=S5DLGA                                                    
     C                   EVAL      C0PHLD=S0PHLD                                                    
     C                   EVAL      C0TPE4=S0TPE4                                                    
     C                   EVAL      C0EDET=S0EDET                                                    
     C                   EVAL      C0MURG=S0MURG                                                    
     C                   EVAL      C0REFE=S0REFE                                                    
     C                   EVAL      C0NREF=S0NREF                                                    
     C                   EVAL      C0COEN=S0COEN                                                    
      *                                                                                             
     C                   EVAL      CPCIAS=@PCIAS                                                    
     C                   EVAL      CPPRVR=C0PRVR                                                    
     C                   EVAL      CPTPTA=*BLANKS                                                   
     C                   EVAL      CPFDES=C0FPED                                                    
     C                   EVAL      CPTPLI=*BLANKS                                                   
     C                   TIME                    CPHORA                                             
     C     KPUDTO0       SETLL     PUDTO0                                                           
     C     KPUDTO00      READPE    PUDTO0                                 81                        
     C                   IF        %FOUND(PUDTO0) AND CPFDES<=C0FPED                                
     C                             AND CPFHAS>=C0FPED                                               
     C                   EVAL      C0DTO1=CPDTO1                                                    
     C                   EVAL      C0DTO2=CPDTO2                                                    
     C                   EVAL      C0DTO3=CPDTO3                                                    
     C                   EVAL      C0DTO4=CPDTO4                                                    
     C                   EVAL      C0DTPP=CPDTPP                                                    
     C                   ELSE                                                                       
     C                   EVAL      C0DTO1=0                                                         
     C                   EVAL      C0DTO2=0                                                         
     C                   EVAL      C0DTO3=0                                                         
     C                   EVAL      C0DTO4=0                                                         
     C                   EVAL      C0DTPP=0                                                         
     C                   EVAL      CPTPOR=C0TPOR                                                    
     C                   EVAL      CPTEMB=*BLANKS                                                   
     C                   EVAL      CPTTTA=*BLANKS                                                   
     C                   EVAL      CPTTTE=*BLANKS                                                   
     C                   EVAL      CPIPOR=0                                                         
     C                   EVAL      CPMONE=*BLANKS                                                   
     C                   ENDIF                                                                      
      *                                                                                             
     C                   EVAL      M0CIAS=@PCIAS                                                    
     C                   EVAL      M0LOGE=*BLANKS                                                   
     C                   EVAL      M0LOGE=S0LOGE                                                    
     C     KMSALMA05     CHAIN     MSALMA05                           81                            
      *                                                                                             
      * Si no encontramos el almacén, buscar el de entrada por defecto                              
      *                                                                                             
     C                   IF        *IN81                                                            
     C                   EVAL      P7CIAS=M0CIAS                                                    
     C                   EVAL      P7DLGA=M0DLGA                                                    
     C     KPMEMPR       CHAIN     PMEMPR                             81                            
     C                   EVAL      M0MAGA=P7MACO                                                    
     C     KMSALMA       CHAIN     MSALMA                             81                            
     C                   ENDIF                                                                      
      *                                                                                             
     C                   EVAL      C0LOGE=M0LOGE                                                    
     C                   IF        C0LOGE=*BLANKS                                                   
     C                   EVAL      C0LOGE=ZZLOGE                                                    
     C                   ENDIF                                                                      
     C                   EVAL      C0TPOR=CPTPOR                                                    
     C                   EVAL      C0TEMB=CPTEMB                                                    
     C                   EVAL      C0TTTA=CPTTTA                                                    
     C                   EVAL      C0TTTE=CPTTTE                                                    
     C                   EVAL      C0IPOR=CPIPOR                                                    
     C                   EVAL      C0MONP=CPMONE                                                    
      *                                                                                             
     C                   EVAL      C0MONB=C0MONE                                                    
     C                   EVAL      CDCIAS=@PCIAS                                                    
     C                   EVAL      CDPRVR=C0PRVR                                                    
     C                   EVAL      CDMONE=C0MONE                                                    
     C                   EVAL      CDFDES=ZZDATS                                                    
     C     KPUDIVI       SETLL     PUDIVI                                                           
     C     KPUDIVI0      READPE    PUDIVI                                                           
     C                   IF        %FOUND(PUDIVI) AND CDFDES<=C0FPED                                
     C                             AND CDFHAS>=C0FPED                                               
     C                   EVAL      C0CAMB=CDCAMB                                                    
     C                   EVAL      C0CMPR=CDCMPR                                                    
     C                   EVAL      C0MONB=CDMONB                                                    
     C                   ELSE                                                                       
     C                   EVAL      C0CAMB=0                                                         
     C                   EVAL      C0CMPR=0                                                         
     C                   ENDIF                                                                      
     C                   EVAL      C0TDI1=M0TDIR                                                    
17022C*                  IF        MPTDI1<>*BLANKS                                                  
17022C*                  EVAL      C0TDI1=MPTDI1                                                    
17022C*                  ENDIF                                                                      
     C                   EVAL      C0TDI2='01'                                                      
     C                   EVAL      C0TDIF=S0TDI1                                                    
      *                                                                                             
     C                   EVAL      C0CAUT='1'                                                       
     C                   EVAL      C0EVPR='1'                                                       
      *                                                                                             
      * Grabamos la cabecera                                                                        
      *                                                                                             
C4406C                   EVAL      C0EDIC=*BLANKS                                                   
C4406C                   EVAL      C0FEDI=*BLANKS                                                   
C4406C                   EVAL      C0UEDI=*BLANKS                                                   
C4406                                                                                               
     C                   EVAL      C0EVOL=ZXEVOL                                                    
     C                   EVAL      C0EVPR=ZXEVPR                                                    
     C                   EVAL      C0TOLI=*BLANKS                                                   
FQ604C                   EVAL      C0EDME=S0EDME                                                    
C1341C                   EVAL      C0DECA=S0DECA                                                    
C4137*                                                                                             
C4137c                   eval      c9cias = c0cias                                                  
C4137c                   eval      c9prvr = c0prvr                                                  
C4137c     kpucedi       chain     pucedi                                                           
C4137c                   if        %found(pucedi) and c9eped = '1' and                              
C4137c                             c0edic = *blanks and c0stco='20'                                 
C4137c                   eval      zxexcepcion = 1                                                  
C4137c                   exsr      cs_eiexce                                                        
C4137c                   endif                                                                      
C4137*                                                                                             
C4137*                                                                                             
     C                   WRITE     RPUCAPE                                                          
15040C                   Z-ADD     1             ZXNEWC                                             
FQ604 *                                                                                             
FQ604 * Creamos Observaciones de Cabecera si existen según COOBPE                                   
FQ604C                   EXSR      CS_OBSCAB                                                        
      *                                                                                             
      * Enviamos al final de todo para tener el contador de líneas OK                               
      *                                                                                             
      * Creamos la dirección según CODIPE al ser ED                                                 
      *                                                                                             
     C                   EVAL        @PACT0='1'                                                     
     C                   EVAL        @PACT1='1'                                                     
     C                   EVAL        @PACT2='1'                                                     
      *                                                                                             
     C                   CALL      'PU2520'                                                         
     C                   PARM                    @PCIAS                                             
     C                   PARM      C0DLGA        @PEDLGA                                            
     C                   PARM      C0NPCO        @PENPCO                                            
     C                   PARM      C0TPED        @PETPED                                            
     C                   PARM      C0DATP        @PEDATP                                            
     C                   PARM      C0NOPL        @PENOPL                                            
     C                   PARM                    @PACT0                                             
     C                   PARM                    @PACT1                                             
     C                   PARM                    @PACT2                                             
     C                   PARM      *BLANKS       @PETDVA                                            
     C                   PARM      *BLANKS       @PEERR                                             
      *                                                                                             
     C                   EVAL      ZXOPC0='1'                                                       
     C                   EXSR      CS_PUDIPE1                                                       
      *                                                                                             
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
      *                                                                                             
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Dirección de envío directa cliente                                                          
      **********************************************************************                        
     C     CS_PUDIPE1    BEGSR                                                                      
      *                                                                                             
      * Tenemos una variable para controlar que sólo se envie una vez                               
      *                                                                                             
     C                   EVAL      S2CIAS=S0CIAS                                                    
     C                   EVAL      S2DLGA=S0DLGA                                                    
     C                   EVAL      S2NPCO=S0NPCO                                                    
     C                   EVAL      S2TPED=S0TPED                                                    
     C                   EVAL      S2DATP=S0DATP                                                    
     C                   EVAL      S2NOPL=S0NOPL                                                    
     C                   EVAL      S2CDIR='1'                                                       
     C     KCODIPE       CHAIN     CODIPE                                                           
     C                   IF        %FOUND(CODIPE)                                                   
      *                                                                                             
     C                   EVAL      S0CIAS=S2CIAS                                                    
     C                   EVAL      S0PAIS=S2PAIS                                                    
     C     KMSPAIS       CHAIN     MSPAIS                                                           
     C                   IF        %FOUND(MSPAIS)                                                   
      *                                                                                             
     C                   EVAL      C2CIAS=C0CIAS                                                    
     C                   EVAL      C2DLGA=C0DLGA                                                    
     C                   EVAL      C2NPCO=C0NPCO                                                    
     C                   EVAL      C2TPED=C0TPED                                                    
     C                   EVAL      C2DATP=C0DATP                                                    
     C                   EVAL      C2NOPL=C0NOPL                                                    
     C                   EVAL      C2CDIR='1'                                                       
     C     KPUDIPE       CHAIN     PUDIPE                                                           
      *                                                                                             
     C                   EVAL      C2TDVA='1'                                                       
     C                   EVAL      C2RAOS=S2RAOS                                                    
     C                   EVAL      C2RAO2=S2RAO2                                                    
     C                   EVAL      C2DPTO=S2DPTO                                                    
     C                   EVAL      C2DIRE=S2DIRE                                                    
     C                   EVAL      C2DIR2=S2DIR2                                                    
     C                   EVAL      C2POBL=S2POBL                                                    
     C                   EVAL      C2POST=S2POST                                                    
     C                   EVAL      C2TELE=S2TELE                                                    
     C                   EVAL      C2TEL2=S2TEL2                                                    
     C                   EVAL      C2TLEX=S2TLEX                                                    
     C                   EVAL      C2TFAX=S2TFAX                                                    
     C                   EVAL      C2EMAI=S2EMAI                                                    
     C                   EVAL      C2PAIS=S2PAIS                                                    
     C                   EVAL      C2PEGE=S2PEGE                                                    
     C                   EVAL      C2OB50=S2OB50                                                    
     C                   EVAL      C2OB51=S2OB51                                                    
     C                   EVAL      C2TTTA=S2TTTA                                                    
     C                   EVAL      C2EMAI=S2EMAI                                                    
      *                                                                                             
     C                   IF        MEPCEE='1'                                                       
     C                   EVAL      C2NIFF=S0NIFC                                                    
     C                   IF        C2NIFF=*BLANKS                                                   
     C                   EVAL      C2NIFF=S0NIFI                                                    
     C                   ENDIF                                                                      
     C                   ELSE                                                                       
     C                   EVAL      C2NIFF=S0NIFI                                                    
     C                   IF        C2NIFF=*BLANKS                                                   
     C                   EVAL      C2NIFF=S0NIFC                                                    
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
      *                                                                                             
     C                   IF        %FOUND(PUDIPE)                                                   
     C                   UPDATE    RPUDIPE                                                          
     C                   EVAL      ZXOPC0='2'                                                       
     C                   IF        @PEDAU='001' OR @PEDAU='002'                                     
     C                             OR @PEDAU='010'                                                  
     C                   EVAL      ZXOPC0='1'                                                       
     C                   ENDIF                                                                      
     C                   ELSE                                                                       
     C                   EVAL      C2EVOL=ZXEVOL                                                    
     C                   EVAL      C2EVPR=ZXEVPR                                                    
     C                   WRITE     RPUDIPE                                                          
     C                   EVAL      ZXOPC0='1'                                                       
     C                   ENDIF                                                                      
      *                                                                                             
     C                   EXSR      CS_SENDDIR                                                       
      *                                                                                             
     C                   ENDIF                                                                      
      *                                                                                             
     C                   ENDSR                                                                      
      **************************************************************                                
      * Grabacion observaciones                                    *                                
      *------------------------------------------------------------*                                
     C     CS_OBSERV     BEGSR                                                                      
      *                                                                                             
      * Grabo las observaciones del pedido de ventas si hay                                         
      *                                                                                             
     C                   EVAL      S0CIAS=S5CIAS                                                    
     C                   EVAL      S0DLGA=S5DLGA                                                    
     C                   EVAL      S0NPCO=S5NPCO                                                    
     C                   EVAL      S0TPED=S5TPED                                                    
     C                   EVAL      S0DATP=S5DATP                                                    
     C                   EVAL      S0NOPL=S5NOPL                                                    
     C                   EVAL      S0LINP=S5LINE                                                    
     C                   Z-ADD     0             ZXLINE            3 0                              
     C     KCOOBPE       SETLL     COOBPE                                                           
     C     KCOOBPE       READE     COOBPE                                                           
     C                   DOW       NOT %EOF(COOBPE)                                                 
      *                                                                                             
     C                   IF        S0T1OB=' ' OR S0T1OB='0' OR S0T1OB='4'                           
I0161C                             OR S0T1OB='1'                                                    
      *                                                                                             
     C                   EVAL      ZXLINE=ZXLINE+1                                                  
     C                   EVAL      C0LINE=ZXLINE                                                    
     C                   EVAL      C0CIAS=C5CIAS                                                    
     C                   EVAL      C0LINP=C5LINE                                                    
      *                                                                                             
     C                   EVAL      C0T1OB=S0T1OB                                                    
     C                   EVAL      C0T2OB=S0T2OB                                                    
     C                   EVAL      C0T3OB=S0T3OB                                                    
     C                   EVAL      C0IDIO=S0IDIO                                                    
     C                   EVAL      C0LINE=S0LINE                                                    
     C                   EVAL      C0MSGE=S0MSGE                                                    
     C                   EVAL      C0IDIB=S0IDIB                                                    
     C                   EVAL      C0DAT8=*DATE                                                     
     C                   TIME                    C0HORA                                             
     C                   EVAL      C0USUA=ZZUSUA                                                    
     C                   EVAL      C0PANT=SDSJOB                                                    
     C                   EVAL      C0TLI1=S0TLI1                                                    
     C                   EVAL      C0TLI2=S0TLI2                                                    
     C                   EVAL      C0TLI3=S0TLI3                                                    
     C                   EVAL      C0OB50=S0OB50                                                    
     C                   EVAL      C0MRCA=S0MRCA                                                    
     C                   EVAL      C0DAT1=C0DAT8                                                    
     C                   EVAL      C0EVOL=ZXEVOL                                                    
     C                   EVAL      C0EVPR=ZXEVPR                                                    
     C                   MOVEL     S5CIAS        C0CI02                                             
     C                   EVAL      C0DL02=S5DLGA                                                    
     C                   EVAL      C0NP02=S5NPCO                                                    
     C                   EVAL      C0TP02=S5TPED                                                    
     C                   EVAL      C0DA02=S5DATP                                                    
     C                   EVAL      C0NO02=S5NOPL                                                    
     C                   WRITE     RPUOBPE                                                          
FQ604C***                EVAL      ZXOPC0='1'                                                       
FQ604C***                EXSR      CS_SENDOBS                                                       
      *                                                                                             
     C                   ENDIF                                                                      
      *                                                                                             
     C     KCOOBPE       READE     COOBPE                                                           
     C                   ENDDO                                                                      
      *                                                                                             
      * Ahora de artículo                                                                           
      *                                                                                             
     C     KMSOBAR       SETLL     MSOBAR                                                           
     C     KMSOBAR       READE     MSOBAR                                                           
     C                   DOW       NOT %EOF(MSOBAR)                                                 
      *                                                                                             
     C                   EVAL      C0CIAS=C5CIAS                                                    
     C                   EVAL      C0LINP=C5LINE                                                    
     C                   EVAL      C0LINE=M5LINE                                                    
     C     KPUOBPE       CHAIN     PUOBPE                                                           
     C                   IF        NOT %FOUND(PUOBPE) AND (M5T1OB=' ' OR                            
     C                             M5T1OB='0' OR M5T1OB='4')                                        
     C                   EVAL      C0T1OB=M5T1OB                                                    
     C                   EVAL      C0T2OB=M5T2OB                                                    
     C                   EVAL      C0T2OB=M5T3OB                                                    
     C                   EVAL      C0IDIB=M5IDIB                                                    
     C                   EVAL      C0OB50=M5OB50                                                    
     C                   EVAL      C0MSGE=M5MSGE                                                    
     C                   EVAL      C0DAT8=ZZDATS                                                    
     C                   IF        C0DAT8=0                                                         
     C                   EVAL      C0DAT8=*DATE                                                     
     C                   ENDIF                                                                      
     C                   TIME                    C0HORA                                             
     C                   EVAL      C0USUA=ZZUSUA                                                    
     C                   EVAL      C0PANT=SDSJOB                                                    
     C                   EVAL      C0IDIO=M5IDIO                                                    
     C                   EVAL      C0TLI1=M5TLI1                                                    
     C                   EVAL      C0TLI2=M5TLI2                                                    
     C                   EVAL      C0TLI3=M5TLI3                                                    
     C                   EVAL      C0MRCA=M5MRCA                                                    
     C                   EVAL      C0DAT1=C0DAT8                                                    
     C                   EVAL      C0EVOL=ZXEVOL                                                    
     C                   EVAL      C0EVPR=ZXEVPR                                                    
     C                   WRITE     RPUOBPE                                                          
FQ604C***                EVAL      ZXOPC0='1'                                                       
FQ604C***                EXSR      CS_SENDOBS                                                       
     C                   ENDIF                                                                      
      *                                                                                             
     C     KMSOBAR       READE     MSOBAR                                                           
     C                   ENDDO                                                                      
      *                                                                                             
     C                   ENDSR                                                                      
FQ604 **************************************************************                                
FQ604 * Grabacion observaciones cabecera                           *                                
FQ604 *------------------------------------------------------------*                                
FQ604C     CS_OBSCAB     BEGSR                                                                      
FQ604 *                                                                                             
FQ604C                   Z-ADD     0             ZXLINE            3 0                              
FQ604 * Método de Entrega                                                                           
FQ604C                   IF        S0EDME<>' ' And S0EDME<>'0'                                      
FQ604C                   EVAL      C0IDIO=S0IDIO                                                    
FQ604C                   EVAL      C0LINP=0                                                         
FQ604C                   EVAL      ZXLINE=ZXLINE+1                                                  
FQ604C                   EVAL      C0LINE=ZXLINE                                                    
FQ604C     KPUOBPE       CHAIN     PUOBPE                                                           
FQ604C                   IF        NOT %FOUND(PUOBPE)                                               
FQ604C                   EVAL      PECTAB ='EDME'                                                   
FQ604C                   EVAL      PECLTA = S0EDME                                                  
FQ604C     KPMTAB2       CHAIN     PMTAB2                                                           
FQ604C                   IF        %FOUND(PMTAB2)                                                   
FQ604C                   MOVEL(P)  PEDESC        C0OB50                                             
FQ604C                   EVAL      C0T1OB=*BLANKS                                                   
FQ604C                   EVAL      C0T2OB=*BLANKS                                                   
FQ604C                   EVAL      C0T3OB=*BLANKS                                                   
FQ604C                   EVAL      C0IDIB=S0IDIB                                                    
FQ604C                   EVAL      C0MSGE=*BLANKS                                                   
FQ604C                   EVAL      C0DAT8=ZZDATS                                                    
FQ604C                   IF        C0DAT8=0                                                         
FQ604C                   EVAL      C0DAT8=*DATE                                                     
FQ604C                   ENDIF                                                                      
FQ604C                   TIME                    C0HORA                                             
FQ604C                   EVAL      C0USUA=ZZUSUA                                                    
FQ604C                   EVAL      C0PANT=SDSJOB                                                    
FQ604C                   EVAL      C0IDIO=S0IDIO                                                    
FQ604C                   EVAL      C0LINP=0                                                         
FQ604C                   EVAL      C0TLI1=*BLANKS                                                   
FQ604C                   EVAL      C0TLI2='1'                                                       
FQ604C                   EVAL      C0TLI3=*BLANKS                                                   
FQ604C                   EVAL      C0MRCA=*BLANKS                                                   
FQ604C                   EVAL      C0DAT1=C0DAT8                                                    
FQ604C                   MOVEL     S0CIAS        C0CI02                                             
FQ604C                   EVAL      C0DL02=S0DLGA                                                    
FQ604C                   EVAL      C0NP02=S0NPCO                                                    
FQ604C                   EVAL      C0TP02=S0TPED                                                    
FQ604C                   EVAL      C0DA02=S0DATP                                                    
FQ604C                   EVAL      C0NO02=S0NOPL                                                    
FQ604C                   EVAL      C0EVOL=ZXEVOL                                                    
FQ604C                   EVAL      C0EVPR=ZXEVPR                                                    
FQ604C                   WRITE     RPUOBPE                                                          
FQ604C                   ENDIF                                                                      
FQ604C                   ENDIF                                                                      
FQ604C                   ENDIF                                                                      
FQ604 *                                                                                             
FQ604 *                                                                                             
FQ604 * Grabo las observaciones del pedido de ventas si hay                                         
FQ604 *                                                                                             
FQ604C                   EVAL      S0CIAS=S5CIAS                                                    
FQ604C                   EVAL      S0DLGA=S5DLGA                                                    
FQ604C                   EVAL      S0NPCO=S5NPCO                                                    
FQ604C                   EVAL      S0TPED=S5TPED                                                    
FQ604C                   EVAL      S0DATP=S5DATP                                                    
FQ604C                   EVAL      S0NOPL=S5NOPL                                                    
FQ604C                   EVAL      S0LINP=0                                                         
FQ604C     KCOOBPE       SETLL     COOBPE                                                           
FQ604C     KCOOBPE       READE     COOBPE                                                           
FQ604C                   DOW       NOT %EOF(COOBPE)                                                 
FQ604 *                                                                                             
FQ604C                   IF        S0TLI2='1' Or S0TLI2='3'                                         
I0161C                             Or S0TLI2='2'                                                    
FQ604 *                                                                                             
FQ604C                   EVAL      ZXLINE=ZXLINE+1                                                  
FQ604C                   EVAL      C0LINE=ZXLINE                                                    
FQ604C                   EVAL      C0LINP=0                                                         
FQ604 *                                                                                             
FQ604C                   EVAL      C0T1OB=S0T1OB                                                    
FQ604C                   EVAL      C0T2OB=S0T2OB                                                    
FQ604C                   EVAL      C0T3OB=S0T3OB                                                    
FQ604C                   EVAL      C0IDIO=S0IDIO                                                    
FQ604C                   EVAL      C0MSGE=S0MSGE                                                    
FQ604C                   EVAL      C0IDIB=S0IDIB                                                    
FQ604C                   EVAL      C0DAT8=*DATE                                                     
FQ604C                   TIME                    C0HORA                                             
FQ604C                   EVAL      C0USUA=ZZUSUA                                                    
FQ604C                   EVAL      C0PANT=SDSJOB                                                    
FQ604C                   EVAL      C0TLI1=S0TLI1                                                    
FQ604C                   EVAL      C0TLI2=S0TLI2                                                    
FQ604C                   EVAL      C0TLI3=S0TLI3                                                    
FQ604C                   EVAL      C0OB50=S0OB50                                                    
FQ604C                   EVAL      C0MRCA=S0MRCA                                                    
FQ604C                   EVAL      C0DAT1=C0DAT8                                                    
FQ604C                   EVAL      C0EVOL=ZXEVOL                                                    
FQ604C                   EVAL      C0EVPR=ZXEVPR                                                    
FQ604C                   MOVEL     S0CIAS        C0CI02                                             
FQ604C                   EVAL      C0DL02=S0DLGA                                                    
FQ604C                   EVAL      C0NP02=S0NPCO                                                    
FQ604C                   EVAL      C0TP02=S0TPED                                                    
FQ604C                   EVAL      C0DA02=S0DATP                                                    
FQ604C                   EVAL      C0NO02=S0NOPL                                                    
FQ604C                   WRITE     RPUOBPE                                                          
FQ604 *                                                                                             
FQ604C                   ENDIF                                                                      
FQ604 *                                                                                             
FQ604C     KCOOBPE       READE     COOBPE                                                           
FQ604C                   ENDDO                                                                      
FQ604C                   ENDSR                                                                      
FQ604 **************************************************************                                
FQ604 * Eliminación Observaciones                                  *                                
FQ604 *------------------------------------------------------------*                                
FQ604C     CS_OBSDEL     BEGSR                                                                      
FQ604 *                                                                                             
07053C                   IF        C0LINP=0                                                         
FQ604C     KPUOBPE0      SETLL     PUOBPE                                                           
FQ604C     KPUOBPE0      READE     PUOBPE                                                           
07053C                   ELSE                                                                       
07053C     KPUOBPE1      SETLL     PUOBPE                                                           
07053C     KPUOBPE1      READE     PUOBPE                                                           
07053C                   ENDIF                                                                      
FQ604C                   DOW       NOT %EOF(PUOBPE)                                                 
FQ604C*07053             IF        C0TLI2='1' Or C0TLI2='3'                                         
FQ604C                   DELETE    RPUOBPE                                                          
FQ604C*07053             ENDIF                                                                      
07053C                   IF        C0LINP=0                                                         
FQ604C     KPUOBPE0      READE     PUOBPE                                                           
07053C                   ELSE                                                                       
07053C     KPUOBPE1      READE     PUOBPE                                                           
07053C                   ENDIF                                                                      
FQ604C                   ENDDO                                                                      
FQ604                                                                                               
FQ604C                   ENDSR                                                                      
      **********************************************************************                        
      * Datos generales para envío                                                                  
      **********************************************************************                        
     C     CS_SEND       BEGSR                                                                      
      *                                                                                             
     C                   EVAL      C0CIAS=C0CIAS                                                    
     C                   EVAL      C0PRVR=C0PRVR                                                    
     C     KPUPROV       CHAIN     PUPROV                                                           
      *                                                                                             
     C     KPUCAPE       CHAIN(N)  PUCAPE                                                           
      *                                                                                             
     C                   IF        ZZALOL<'1'                                                       
     C                   EVAL      MICIAS=C0CIAS                                                    
     C                   EVAL      MIDLGA=C0DLGA                                                    
     C                   EVAL      MILGCA=C0LOGE                                                    
     C     KMSLOGI       CHAIN     MSLOGI                                                           
     C                   IF        MIALOL='1'                                                       
     C                   EVAL      ZXEVR0=' '                                                       
     C                   EVAL      U0TENV='1'                                                       
     C                   ELSE                                                                       
     C                   EVAL      U0TENV='5'                                                       
     C                   EVAL      ZXEVR0='5'                                                       
     C                   ENDIF                                                                      
     C                   IF        ZZEPP1>='1' OR ZZEPP8>='1'                                       
     C                   EVAL      U0CIAS=C0CIAS                                                    
     C                   EVAL      U0CLP0=C0PRVR                                                    
      * El registro no debe ser baja ni puede estar desactivado y                                   
      * debe permitir traspaso automatico de pedidos                                                
     C     KUTCOM0       CHAIN     UTCOM0                                                           
     C                   IF        (%FOUND(UTCOM0) AND U0BAJA<='0' AND                              
     C                             U0ACTI<='0')AND (U0EPP1>='1')                                    
     C                   EVAL      ZXUTCOMU=1                                                       
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
      *                                                                                             
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Envío de la cabecera del pedido                                                             
      **********************************************************************                        
     C     CS_SENDCAB    BEGSR                                                                      
      *                                                                                             
      * Datos para envío general                                                                    
      *                                                                                             
     C                   EXSR      CS_SEND                                                          
I0200 *                                                                                             
I0200 * Miramos si el pedido de cliente es de Export                                                
I0200 * (Utilizaremos el campo libre C0CCCA)                                                        
I0200C                   EXSR      CS_EXPORT                                                        
I0200C                   EVAL      C0CCCA=ZXEXPORT                                                  
I0200C                                                                                              
      *                                                                                             
     C                   IF        ZXUTCOMU=1 AND ZZALOL<'1'                                        
      *                                                                                             
     C                   EVAL      C0OPC0=ZXOPC0                                                    
     C                   EVAL      C0EVR0=ZXEVR0                                                    
     C                   EVAL      C0CPVE='0'                                                       
      *                                                                                             
     C                   EVAL      C0TENV=U0TENV                                                    
     C                   EVAL      C0DEST=U0DEST                                                    
     C                   EVAL      C0TDES=U0TDES                                                    
     C                   EVAL      C0CIDT=U0CIA1                                                    
     C                   EVAL      C0CLDT=U0CLP1                                                    
     C                   EVAL      C0USU0=SDSUSR                                                    
     C                   EVAL      C0PAN0=ZZPANT                                                    
     C                   EVAL      C0DAT0=ZZDATS                                                    
     C                   TIME                    ZXTIME                                             
     C                   MOVEL     ZXTIME        C0HOR0                                             
     C                   EVAL      C0PROG=SDSPGM                                                    
11050 ** Activaremos el campo de CHEKSUM                                                            
11050C**                 EXSR      CS_CHKSUM                                                        
11050C**                 EVAL      C0CHKS=ZXCHKS                                                    
      *                                                                                             
     C                   EVAL      *IN81=*ON                                                        
     C                   DOU       *IN80=*OFF                                                       
     C                   EVAL      C0HOR0=C0HOR0+1                                                  
     C                   IF        ZXNOCONF=0                                                       
31030C                             AND C0STCO>='2A'                                                 
11050C                   EVAL      C0CHKS=ZXCHKS                                                    
C4137*                                                                                             
C4137c                   eval      zxnograbar=*blanks                                               
C4137c                   eval      c9cias = c0cias                                                  
C4137c                   eval      c9prvr = c0prvr                                                  
C4137c     kpucedi       chain     pucedi                                                           
C4137c                   if        %found(pucedi) and c9eped = '1'                                  
C4137c                   eval      zxnograbar='N'                                                   
C4137c                   endif                                                                      
C4137*                                                                                             
C4137c                   if        zxnograbar=*blanks                                               
     C                   WRITE     RTR0035                              80                          
C4137c                   endif                                                                      
C4137c                   eval      zxnograbar=*blanks                                               
C4137*                                                                                             
C4137c                   clear                   c0edic                                             
C4137c                   clear                   c0fedi                                             
C4137c                   clear                   c0uedi                                             
C4137c                   clear                   zxexcepcion                                        
C4137*                                                                                             
     C                   ENDIF                                                                      
     C                   ENDDO                                                                      
      *                                                                                             
     C                   ENDIF                                                                      
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Envío de la línea del pedido                                                                
      **********************************************************************                        
     C     CS_SENDDET    BEGSR                                                                      
      *                                                                                             
      * Datos para envío general si no es baja porque ya lo he determinado                          
      *                                                                                             
     C                   IF        @PEDAU<>'005' AND @PEDAU<>'009'                                  
     C                             AND @PEDAU<>'018'                                                
C2559C                             AND @PEDAU<>'051'                                                
     C                   EXSR      CS_SEND                                                          
     C                   ENDIF                                                                      
      *                                                                                             
     C                   IF        ZXUTCOMU=1 AND ZZALOL<'1'                                        
      *                                                                                             
     C                   EVAL      C5OPC0=ZXOPC0                                                    
     C                   EVAL      C5EVR0=ZXEVR0                                                    
      *                                                                                             
     C                   EVAL      C5TENV=U0TENV                                                    
     C                   EVAL      C5DEST=U0DEST                                                    
     C                   EVAL      C5TDES=U0TDES                                                    
     C                   EVAL      C5CIDT=U0CIA1                                                    
     C                   EVAL      C5CLDT=U0CLP1                                                    
     C                   EVAL      C5CUSF=C0CUST                                                    
     C                   EVAL      C5USU0=SDSUSR                                                    
     C                   EVAL      C5PAN0=ZZPANT                                                    
     C                   EVAL      C5DAT0=ZZDATS                                                    
     C                   IF        C5OPC0='4' OR ZXMASL=1                                           
     C                   EVAL      C5ACHK='1'                                                       
     C                   ENDIF                                                                      
     C                   TIME                    ZXTIME                                             
     C                   MOVEL     ZXTIME        C5HOR0                                             
     C                   EVAL      C5PROG=SDSPGM                                                    
      *                                                                                             
     C                   EVAL      *IN81=*ON                                                        
     C                   DOU       *IN80=*OFF                                                       
     C                   EVAL      C5HOR0=C5HOR0+1                                                  
M345BC                   IF        ZXOPC0='9'                                                       
M345BC                   EVAL      C5HOR0=C5HOR0+68                                                 
M345BC                   ENDIF                                                                      
     C                   EVAL      C0CIAS=C5CIAS                                                    
     C                   EVAL      C0DLGA=C5DLGA                                                    
     C                   EVAL      C0NPCO=C5NPCO                                                    
     C                   EVAL      C0TPED=C5TPED                                                    
     C                   EVAL      C0DATP=C5DATP                                                    
     C                   EVAL      C0NOPL=C5NOPL                                                    
     C     KPUCAPE       CHAIN(N)  PUCAPE                                                           
     C                   IF        ZXNOCONF=0                                                       
31030C                             AND C0STCO>='2A'                                                 
C4137c                   eval      zxnograbar=*blanks                                               
C4137c                   eval      c9cias = c0cias                                                  
C4137c                   eval      c9prvr = c0prvr                                                  
C4137c     kpucedi       chain     pucedi                                                           
C4137c                   if        %found(pucedi) and c9eped = '1'                                  
C4137c                   eval      zxnograbar='N'                                                   
C4137c                   endif                                                                      
C4137*                                                                                             
C4137c                   if        zxnograbar=*blanks                                               
     C                   WRITE     RTR0036                              80                          
C4137c                   endif                                                                      
C4137c                   eval      zxnograbar=*blanks                                               
     C                   ENDIF                                                                      
     C                   ENDDO                                                                      
      *                                                                                             
     C                   ENDIF                                                                      
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Envío de las observaciones del pedido                                                       
      **********************************************************************                        
     C     CS_SENDOBS    BEGSR                                                                      
      *                                                                                             
      * Datos para envío general                                                                    
      *                                                                                             
FQ604C                   IF        ZXOPC0<>'2'                                                      
     C                   EXSR      CS_SEND                                                          
      *                                                                                             
     C                   IF        ZXUTCOMU=1 AND ZZALOL<'1'                                        
      *                                                                                             
     C                   EVAL      C0OPC0=ZXOPC0                                                    
     C                   EVAL      C0EVR0=ZXEVR0                                                    
      *                                                                                             
     C                   EVAL      C0DL02=@PDLGA                                                    
     C                   EVAL      C0NP02=@PNPCO                                                    
     C                   EVAL      C0TP02=@PTPED                                                    
     C                   EVAL      C0DA02=@PDATP                                                    
     C                   EVAL      C0NO02=@PNOPL                                                    
      *                                                                                             
     C                   EVAL      C0TENV=U0TENV                                                    
     C                   EVAL      C0DEST=U0DEST                                                    
     C                   EVAL      C0TDES=U0TDES                                                    
     C                   EVAL      C0CIDT=U0CIA1                                                    
     C                   EVAL      C0CLDT=U0CLP1                                                    
     C                   EVAL      C0USU0=SDSUSR                                                    
     C                   EVAL      C0PAN0=ZZPANT                                                    
     C                   EVAL      C0DAT0=ZZDATS                                                    
     C                   TIME                    ZXTIME                                             
     C                   MOVEL     ZXTIME        C0HOR0                                             
     C                   EVAL      C0PROG=SDSPGM                                                    
      *                                                                                             
     C                   EVAL      *IN81=*ON                                                        
     C                   DOU       *IN80=*OFF                                                       
     C                   EVAL      C0HOR0=C0HOR0+1                                                  
     C     KPUCAPE       CHAIN(N)  PUCAPE                                                           
     C                   IF        ZXNOCONF=0                                                       
     C                             AND C0STCO>='20'                                                 
18060C*    KPUOBPE0      CHAIN(N)  PUOBPE                                                           
18060C     KPUOBPE0      SETLL     PUOBPE                                                           
18060C     KPUOBPE0      READE     PUOBPE                                                           
FQ604C                   DOW       NOT %EOF(PUOBPE)                                                 
C4137c                   eval      zxnograbar=*blanks                                               
C4137c                   eval      c9cias = c0cias                                                  
C4137c                   eval      c9prvr = c0prvr                                                  
C4137c     kpucedi       chain     pucedi                                                           
C4137c                   if        %found(pucedi) and c9eped = '1'                                  
C4137c                   eval      zxnograbar='N'                                                   
C4137c                   endif                                                                      
C4137*                                                                                             
C4137c                   if        zxnograbar=*blanks                                               
     C                   WRITE     RTR0037                              80                          
C4137c                   endif                                                                      
C4137c                   eval      zxnograbar=*blanks                                               
FQ604C     KPUOBPE0      READE(N)  PUOBPE                                                           
FQ604C                   ENDDO                                                                      
     C                   ENDIF                                                                      
     C                   ENDDO                                                                      
      *                                                                                             
     C                   ENDIF                                                                      
FQ604C                   ENDIF                                                                      
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Envío de la dirección de entrega del pedido                                                 
      **********************************************************************                        
     C     CS_SENDDIR    BEGSR                                                                      
      *                                                                                             
      * Datos para envío general                                                                    
      *                                                                                             
     C                   EXSR      CS_SEND                                                          
      *                                                                                             
     C                   IF        ZXUTCOMU=1                                                       
      *                                                                                             
     C                   EVAL      C2OPC0=ZXOPC0                                                    
     C                   EVAL      C2EVR0=ZXEVR0                                                    
      *                                                                                             
     C                   EVAL      C2TENV=U0TENV                                                    
     C                   EVAL      C2DEST=U0DEST                                                    
     C                   EVAL      C2TDES=U0TDES                                                    
     C                   EVAL      C2CIDT=U0CIA1                                                    
     C                   EVAL      C2CLDT=U0CLP1                                                    
     C                   EVAL      C2USU0=SDSUSR                                                    
     C                   EVAL      C2PAN0=ZZPANT                                                    
     C                   EVAL      C2DAT0=ZZDATS                                                    
     C                   TIME                    ZXTIME                                             
     C                   MOVEL     ZXTIME        C2HOR0                                             
     C                   EVAL      C5PROG=SDSPGM                                                    
      *                                                                                             
     C                   EVAL      *IN81=*ON                                                        
     C                   DOU       *IN80=*OFF                                                       
     C                   EVAL      C2HOR0=C2HOR0+1                                                  
20040C                   IF        C2OPC0='4'                                                       
20040C                   EVAL      C2CIAS=C0CIAS                                                    
20040C                   EVAL      C2DLGA=C0DLGA                                                    
20040C                   EVAL      C2NPCO=C0NPCO                                                    
20040C                   EVAL      C2TPED=C0TPED                                                    
20040C                   EVAL      C2DATP=C0DATP                                                    
20040C                   EVAL      C2NOPL=C0NOPL                                                    
20040C                   EVAL      C2CDIR='1'                                                       
20040C     KPUDIPE       CHAIN     PUDIPE                                                           
20040C                   ELSE                                                                       
     C                   EXSR      CS_ENCRIP                                                        
     C                   EVAL      C0CIAS=C2CIAS                                                    
     C                   EVAL      C0DLGA=C2DLGA                                                    
     C                   EVAL      C0NPCO=C2NPCO                                                    
     C                   EVAL      C0TPED=C2TPED                                                    
     C                   EVAL      C0DATP=C2DATP                                                    
     C                   EVAL      C0NOPL=C2NOPL                                                    
     C     KPUCAPE       CHAIN(N)  PUCAPE                                                           
20040C                   ENDIF                                                                      
     C                   IF        ZXNOCONF=0                                                       
31030C                             AND C0STCO>='2A'                                                 
PD838C                   CLEAR                   ZXCDIR            1                                
PD838C                   EVAL      ZXCDIR=C2CDIR                                                    
      *                                                                                             
      * Para evitar enviar 2 veces al mismo proveedor                                               
      *                                                                                             
     C                   EVAL      *IN55=*OFF                                                       
Q0322C*    C0PRVR        LOOKUP    SPROV(1)                               55                        
Q0322C                   EVAL      ZXPR_PED=C0PRVR+C0NPCO                                           
Q0322C     ZXPR_PED      LOOKUP    SPR_PED(1)                             55                        
     C                   IF        *IN55=*OFF                                                       
     C                   IF        C2OPC0<>'1'                                                      
     C                   EVAL      C2CDIR='3'                                                       
     C                   ENDIF                                                                      
C4137c                                                                                              
C4137c                   eval      zxnograbar=*blanks                                               
C4137c                   eval      c9cias = c0cias                                                  
C4137c                   eval      c9prvr = c0prvr                                                  
C4137c     kpucedi       chain     pucedi                                                           
C4137c                   if        %found(pucedi) and c9eped = '1'                                  
C4137c                   eval      zxnograbar='N'                                                   
C4137c                   endif                                                                      
C4137*                                                                                             
C4137c                   if        zxnograbar=*blanks                                               
     C                   WRITE     RTR0038                              80                          
C4137c                   endif                                                                      
C4137c                   eval      zxnograbar=*blanks                                               
PD838 *                                                                                             
PD838C                   EVAL      Z1CIAS=T0CIA2                                                    
PD838C     KAQPEDI10     CHAIN     AQPEDI10                                                         
PD838C                   IF        %FOUND AND Z1L100='1'                                            
PD838C                   EVAL      C2HOR0=C2HOR0+1                                                  
PD838C                   EVAL      C2CDIR=ZXCDIR                                                    
C4137c                   eval      zxnograbar=*blanks                                               
C4137c                   eval      c9cias = c0cias                                                  
C4137c                   eval      c9prvr = c0prvr                                                  
C4137c     kpucedi       chain     pucedi                                                           
C4137c                   if        %found(pucedi) and c9eped = '1'                                  
C4137c                   eval      zxnograbar='N'                                                   
C4137c                   endif                                                                      
C4137*                                                                                             
C4137c                   if        zxnograbar=*blanks                                               
PD838C                   WRITE     RTR0038                              80                          
C4137c                   endif                                                                      
PD838C                   ENDIF                                                                      
PD838 *                                                                                             
     C                   EVAL      BP=BP+1                                                          
Q0322C*                  EVAL      SPROV(BP)=C0PRVR                                                 
Q0322C                   EVAL      SPR_PED(BP)=C0PRVR+C0NPCO                                        
     C                   LEAVE                                                                      
     C                   ENDIF                                                                      
      *                                                                                             
     C                   ENDIF                                                                      
     C                   ENDDO                                                                      
      *                                                                                             
     C                   ENDIF                                                                      
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA PARA CONVERTIR UNIDADES PEDIDO A UNIDADES STOCK  *                                
      **************************************************************                                
     C     CS_CNVUBS     BEGSR                                                                      
      *                                                                                             
     C                   EVAL      P6CIAS=@PCIAS                                                    
     C                   EVAL      XZAUXI=ZXAUXIBS                                                  
     C                   MOVE      ZXARTIBS      P6ARTI                                             
     C                   MOVE      ZXVARIBS      P6VARI                                             
     C                   MOVE      ZXMODEBS      P6MODE                                             
     C                   MOVE      ZXUNIMBS      P6UNIM                                             
     C                   MOVE      '0'           P6TCOF                                             
     C                   Z-ADD     0             P6COFA                                             
     C     KPMUNAL       CHAIN     PMUNAL                                                           
     C                   IF        P6TCOF<>'1'                                                      
     C                   MULT      P6COFA        XZAUXI                                             
     C                   ELSE                                                                       
     C                   IF        P6COFA<>0                                                        
     C                   DIV       P6COFA        XZAUXI                                             
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
      *                                                                                             
     C                   MOVE      '0'           XZDECI                                             
     C                   MOVE      '0'           XZAJUD                                             
      * AJUSTE Y DECIMALES                                                                          
     C/COPY *LIBL/QSRDSRC,SRD001                                                                    
      * OBTENGO LA CANTIDAD EN UNIDAD BASICA DEL ARTICULO                                           
     C                   EVAL      ZXAUXIBS=XZAUXI                                                  
      *                                                                                             
     C                   ENDSR                                                                      
      ******************************************************************                            
      * Generación DEL PUCAIM                                                                       
      ******************************************************************                            
     C     CS_PUCAIM     BEGSR                                                                      
      *                                                                                             
IN240C                   MOVE      C5NPCO        ZXJNBR                                             
IN240C*                  MOVE      SDSJNBR       ZXJNBR                                             
     C                   MOVE      UDATE         ZXDATA                                             
03060C**                 TIME                    ZXHORA                                             
     C                   EVAL      ZXHORA=ZXHORA+1                                                  
      *                                                                                             
     C                   CLEAR                   Z1COMA                                             
     C     DSLDA         CAT(P)    Z1COMA:0      Z1COMA                                             
     C                   Z-ADD     86            JOLINE                                             
     C                   CALL      'PRD935'                                                         
     C                   PARM                    JOTRAT                                             
     C                   PARM                    JOLINE                                             
     C                   PARM                    Z1COMA                                             
     C                                                                                              
     C                   EVAL      X1CIAS=ZZCIAS                                                    
     C                   EVAL      X1DLGA=C5DLGA                                                    
     C                   EVAL      X1NPCO=C5NPCO                                                    
     C                   EVAL      X1DATP=C5DATP                                                    
     C                   EVAL      X1TPED=C5TPED                                                    
     C                   EVAL      X1NOPL=C5NOPL                                                    
     C                   CLEAR                   Z1COMA                                             
     C     PU2540        CAT       Z1COMA:0      Z1COMA                                             
     C                   EVAL      JOLINE=88                                                        
     C                   CALL      'PRD935'                                                         
     C                   PARM                    JOTRAT                                             
     C                   PARM                    JOLINE                                             
     C                   PARM                    Z1COMA                                             
      *                                                                                             
     C                   EVAL      @PEPRG2='PU2540    '                                             
      *                                                                                             
     C                   Z-ADD     150           ZXLOGC           15 5                              
     C                   MOVE      *BLANKS       ZXQCM2          150                                
     C                   MOVEL     'SBMJOB'      ZXQCM2                                             
     C     ZXQCM2        CAT       'CMD(':1      ZXQCM2                                             
     C     ZXQCM2        CAT       'CALL (':0    ZXQCM2                                             
     C     ZXQCM2        CAT       'PRDGJ8':0    ZXQCM2                                             
     C     ZXQCM2        CAT       'CL)':0       ZXQCM2                                             
     C     ZXQCM2        CAT       'PARM(':1     ZXQCM2                                             
     C     ZXQCM2        CAT       C(1):0        ZXQCM2                                             
     C     ZXQCM2        CAT       JOTRAT:0      ZXQCM2                                             
     C     ZXQCM2        CAT       C(1):0        ZXQCM2                                             
     C     ZXQCM2        CAT       C(1):1        ZXQCM2                                             
     C     ZXQCM2        CAT       @PEPRG2:0     ZXQCM2                                             
     C     ZXQCM2        CAT       C(1):0        ZXQCM2                                             
     C     ZXQCM2        CAT       C(1):1        ZXQCM2                                             
     C     ZXQCM2        CAT       C(1):1        ZXQCM2                                             
     C     ZXQCM2        CAT       ')':0         ZXQCM2                                             
     C     ZXQCM2        CAT       ')':0         ZXQCM2                                             
     C     ZXQCM2        CAT       'JOB(':1      ZXQCM2                                             
     C     ZXQCM2        CAT       @PEPRG2:0     ZXQCM2                                             
     C     ZXQCM2        CAT       ')':0         ZXQCM2                                             
     C     ZXQCM2        CAT       'JOBQ(':1     ZXQCM2                                             
     C     ZXQCM2        CAT       ZZJOCC:0      ZXQCM2                                             
     C     ZXQCM2        CAT       ')':0         ZXQCM2                                             
     C                   CALL      'QCMDEXC'                                                        
     C                   PARM                    ZXQCM2                                             
     C                   PARM                    ZXLOGC                                             
      *                                                                                             
     C                   ENDSR                                                                      
      ******************************************************************                            
      * EVENTO de trazabilidad                                                                      
      ******************************************************************                            
     C     CS_TRAZAVTA   BEGSR                                                                      
      *                                                                                             
     C                   MOVEL(P)  S5DLGA        @FDDLGA                                            
     C                   MOVEL(P)  S5NPCO        @FDNPCO                                            
     C                   MOVEL(P)  S5TPED        @FDTPED                                            
      *                                                                                             
     C                   CALL      'ED0100'                                                         
     C                   PARM      S5CIAS        @FDCIAS                                            
     C                   PARM                    @FDDLGA                                            
     C                   PARM                    @FDNPCO                                            
     C                   PARM                    @FDTPED                                            
     C                   PARM      S5DATP        @FDDATP                                            
     C                   PARM      S5NOPL        @FDNOPL                                            
     C                   PARM      S5LINE        @FDLINE                                            
     C                   PARM                    @FDCIA2                                            
     C                   PARM                    @FDDLG2                                            
     C                   PARM                    @FDNPC2                                            
     C                   PARM                    @FDTPE2                                            
     C                   PARM                    @FDDAT2                                            
     C                   PARM                    @FDNOP2                                            
     C                   PARM                    @FDLIN2                                            
     C                   PARM      1             @FDLOGI                                            
     C                   PARM      0             @FDORIG                                            
     C                   PARM                    @FDEDAU                                            
     C                   PARM                    @FDERAV                                            
     C                   PARM                    @FDTEXT                                            
     C                   PARM                    @FDDATO                                            
     C                   PARM      1             @FDWAUD                                            
     C                   PARM      S5CANT        @FDCANT                                            
      *                                                                                             
     C                   ENDSR                                                                      
      ******************************************************************                            
      * Generación de la TRAZA de compras                                                           
      ******************************************************************                            
     C     CS_TRAZACOM   BEGSR                                                                      
      *                                                                                             
     C                   MOVEL(P)  C5DLGA        @FDDLGA                                            
     C                   MOVEL(P)  C5NPCO        @FDNPCO                                            
     C                   MOVEL(P)  C5TPED        @FDTPED                                            
      *                                                                                             
     C                   CALL      'ED0100'                                                         
     C                   PARM      C5CIAS        @FDCIAS                                            
     C                   PARM                    @FDDLGA                                            
     C                   PARM                    @FDNPCO                                            
     C                   PARM                    @FDTPED                                            
     C                   PARM      C5DATP        @FDDATP                                            
     C                   PARM      C5NOPL        @FDNOPL                                            
     C                   PARM      C5LINE        @FDLINE                                            
     C                   PARM                    @FDCIA2                                            
     C                   PARM                    @FDDLG2                                            
     C                   PARM                    @FDNPC2                                            
     C                   PARM                    @FDTPE2                                            
     C                   PARM                    @FDDAT2                                            
     C                   PARM                    @FDNOP2                                            
     C                   PARM                    @FDLIN2                                            
     C                   PARM      1             @FDLOGI                                            
     C                   PARM      1             @FDORIG                                            
     C                   PARM                    @FDEDAU                                            
     C                   PARM                    @FDERAV                                            
     C                   PARM                    @FDTEXT                                            
     C                   PARM                    @FDDATO                                            
     C                   PARM      1             @FDWAUD                                            
     C                   PARM      C5CANT        @FDCANT                                            
      *                                                                                             
      * Enviar el registro                                                                          
      *                                                                                             
     C                   SELECT                                                                     
     C                   WHEN      @FDEDAU='100'                                                    
     C                   EVAL      ZXOPC0='1'                                                       
     C                   WHEN      @FDEDAU='110'                                                    
     C                   EVAL      ZXOPC0='1'                                                       
     C                   WHEN      @FDEDAU='105'                                                    
     C                   EVAL      ZXOPC0='4'                                                       
     C                   WHEN      @FDEDAU='109'                                                    
     C                   EVAL      ZXOPC0='4'                                                       
     C                   WHEN      @FDEDAU='118'                                                    
     C                   EVAL      ZXOPC0='4'                                                       
C2559C                   WHEN      @FDEDAU='151'                                                    
C2559C                   EVAL      ZXOPC0='4'                                                       
     C                   WHEN      @FDEDAU='119'                                                    
14060 *Al reabrir una línea si no tiene cant. servida se debe volver                                
14060 *a crear en productiva, si tiene cant servida se debe modificar.                              
14060C                   IF        C5CANS=0                                                         
14060C                   EVAL      ZXOPC0='1'                                                       
14060C                   ELSE                                                                       
14060C                   EVAL      ZXOPC0='2'                                                       
14060C                   ENDIF                                                                      
     C                   OTHER                                                                      
     C                   EVAL      ZXOPC0='2'                                                       
     C                   ENDSL                                                                      
      *                                                                                             
In199C                   IF        @PEDAU<>'011'                                                    
M345B *                            AND @PEDAU<>'013'                                                
     C                   EXSR      CS_SENDDET                                                       
In199C                   ENDIF                                                                      
M345B * ENVIAMOS CAMBIOS DE COENVIO SOLO A LAS EMPRESAS INVICTUS                                    
M345B * LO DESACTIVO HASTA QUE NO NOS DEN EL OK                                                     
M345BC                   IF        @PEDAU='013'                                                     
M345BC*                  EVAL      Z1CIAS=T0CIA2                                                    
M345BC*    KAQPEDI10     CHAIN     AQPEDI10                                                         
M345BC*                  IF        %FOUND AND Z1L100='1'                                            
M345BC*                  EVAL      ZXOPC0='9'                                                       
M345BC*                  EXSR      CS_SENDDET                                                       
M345BC*                  ENDIF                                                                      
M345BC                   ENDIF                                                                      
      *                                                                                             
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA DE CALCULO DE CHECKSUM                           *                                
      *------------------------------------------------------------*                                
     C     CS_CHKSUM     BEGSR                                                                      
     C                   EVAL      ZXCHKS=0                                                         
C1983C                   EVAL      ZXPWP0='0'                                                       
     C                   EVAL      C5CIAS=C0CIAS                                                    
     C                   EVAL      C5DLGA=C0DLGA                                                    
     C                   EVAL      C5TPED=C0TPED                                                    
     C                   EVAL      C5NPCO=C0NPCO                                                    
     C                   EVAL      C5DATP=C0DATP                                                    
     C                   EVAL      C5NOPL=C0NOPL                                                    
     C                   EVAL      C5LINE=0                                                         
     C     KPUDEPE       SETLL     PUDEPE                                                           
     C     KPUDEPEX      READE(N)  PUDEPE                                                           
     C                   DOW       NOT %EOF(PUDEPE)                                                 
     C                   EVAL      ZXCHKS=ZXCHKS+1                                                  
C1983C*Generar variable de precio=0                                                                 
C1983C                   IF        C5PREC=0                                                         
C1983C                   EVAL      ZXPWP0='1'                                                       
C1983C                   ENDIF                                                                      
     C     KPUDEPEX      READE(N)  PUDEPE                                                           
     C                   ENDDO                                                                      
     C                   ENDSR                                                                      
      **************************************************************                                
      * ENCRIPTADOR DE DIRECCIONES                                 *                                
      *------------------------------------------------------------*                                
     C     CS_ENCRIP     BEGSR                                                                      
      *                                                                                             
      * Se encriptan los Datos de la Dirección de Envío si la Empresa                               
      * lo tiene como Parámetro y si la Dirección es para Cliente Terceros                          
      * y el País Destino es de la CEE.                                                             
      *                                                                                             
      * Las empresas con ERP Movex tampoco se encriptan porque no las ven                           
      *                                                                                             
     C                   MOVEL(P)  C2CIDT        PPCIAS                                             
     C     PPCIAS        CHAIN     PMLIBL                                                           
     C                   IF        %FOUND(PMLIBL) AND PPMVXV<>'V'                                   
      *                                                                                             
     C                   IF        (ZZENCR='1' AND C0TPE4='2' AND C2CDIR='1')                       
     C                             OR (ZZENCR='1' AND C0EDET='1' AND C2CDIR='1')                    
      *                                                                                             
     C                   EVAL      MECIAS=C2CIAS                                                    
     C                   EVAL      MEPAIS=C2PAIS                                                    
     C     KMSPAIS       CHAIN     MSPAIS                                                           
     C                   IF        (%FOUND(MSPAIS) AND MEPCEE='1' AND                               
     C                              C0TPE4='2')                                                     
     C                             OR (C0EDET='1' AND C0TPE4<>'2')                                  
      *                                                                                             
     C                   IF        C2RAOS<>*BLANKS                                                  
     C                   EVAL      @PECADENA=*BLANKS                                                
     C                   EVAL      @PECADENA=C2RAOS                                                 
     C                   CALL      'UT2570'                                                         
     C                   PARM                    @PECADENA                                          
     C                   PARM      '1'           @PEACCION                                          
     C                   PARM      *BLANKS       @PEERROR                                           
     C                   IF        @PEERROR=*BLANKS                                                 
     C                   EVAL      C2RAOS=@PECADENA                                                 
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
      *                                                                                             
     C                   IF        C2RAO2<>*BLANKS                                                  
     C                   EVAL      @PECADENA=*BLANKS                                                
     C                   EVAL      @PECADENA=C2RAO2                                                 
     C                   CALL      'UT2570'                                                         
     C                   PARM                    @PECADENA                                          
     C                   PARM      '1'           @PEACCION                                          
     C                   PARM      *BLANKS       @PEERROR                                           
     C                   IF        @PEERROR=*BLANKS                                                 
     C                   EVAL      C2RAO2=@PECADENA                                                 
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
      *                                                                                             
     C                   IF        C2DIRE<>*BLANKS                                                  
     C                   EVAL      @PECADENA=*BLANKS                                                
     C                   EVAL      @PECADENA=C2DIRE                                                 
     C                   CALL      'UT2570'                                                         
     C                   PARM                    @PECADENA                                          
     C                   PARM      '1'           @PEACCION                                          
     C                   PARM      *BLANKS       @PEERROR                                           
     C                   IF        @PEERROR=*BLANKS                                                 
     C                   EVAL      C2DIRE=@PECADENA                                                 
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
      *                                                                                             
     C                   IF        C2DIR2<>*BLANKS                                                  
     C                   EVAL      @PECADENA=*BLANKS                                                
     C                   EVAL      @PECADENA=C2DIR2                                                 
     C                   CALL      'UT2570'                                                         
     C                   PARM                    @PECADENA                                          
     C                   PARM      '1'           @PEACCION                                          
     C                   PARM      *BLANKS       @PEERROR                                           
     C                   IF        @PEERROR=*BLANKS                                                 
     C                   EVAL      C2DIR2=@PECADENA                                                 
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
      *                                                                                             
     C                   IF        C2POBL<>*BLANKS                                                  
     C                   EVAL      @PECADENA=*BLANKS                                                
     C                   EVAL      @PECADENA=C2POBL                                                 
     C                   CALL      'UT2570'                                                         
     C                   PARM                    @PECADENA                                          
     C                   PARM      '1'           @PEACCION                                          
     C                   PARM      *BLANKS       @PEERROR                                           
     C                   IF        @PEERROR=*BLANKS                                                 
     C                   EVAL      C2POBL=@PECADENA                                                 
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
      *                                                                                             
     C                   IF        C2POST<>*BLANKS                                                  
     C                   EVAL      @PECADENA=*BLANKS                                                
     C                   EVAL      @PECADENA=C2POST                                                 
     C                   CALL      'UT2570'                                                         
     C                   PARM                    @PECADENA                                          
     C                   PARM      '1'           @PEACCION                                          
     C                   PARM      *BLANKS       @PEERROR                                           
     C                   IF        @PEERROR=*BLANKS                                                 
     C                   EVAL      C2POST=@PECADENA                                                 
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
      *                                                                                             
FQ722C*                  IF        C2TELE<>*BLANKS                                                  
FQ722C*                  EVAL      @PECADENA=*BLANKS                                                
FQ722C*                  EVAL      @PECADENA=C2TELE                                                 
FQ722C*                  CALL      'UT2570'                                                         
FQ722C*                  PARM                    @PECADENA                                          
FQ722C*                  PARM      '1'           @PEACCION                                          
FQ722C*                  PARM      *BLANKS       @PEERROR                                           
FQ722C*                  IF        @PEERROR=*BLANKS                                                 
FQ722C*                  EVAL      C2TELE=@PECADENA                                                 
FQ722C*                  ENDIF                                                                      
FQ722C*                  ENDIF                                                                      
      *                                                                                             
FQ722C*                  IF        C2TEL2<>*BLANKS                                                  
FQ722C*                  EVAL      @PECADENA=*BLANKS                                                
FQ722C*                  EVAL      @PECADENA=C2TEL2                                                 
FQ722C*                  CALL      'UT2570'                                                         
FQ722C*                  PARM                    @PECADENA                                          
FQ722C*                  PARM      '1'           @PEACCION                                          
FQ722C*                  PARM      *BLANKS       @PEERROR                                           
FQ722C*                  IF        @PEERROR=*BLANKS                                                 
FQ722C*                  EVAL      C2TEL2=@PECADENA                                                 
FQ722C*                  ENDIF                                                                      
FQ722C*                  ENDIF                                                                      
      *                                                                                             
FQ722C*                  IF        C2TLEX<>*BLANKS                                                  
FQ722C*                  EVAL      @PECADENA=*BLANKS                                                
FQ722C*                  EVAL      @PECADENA=C2TLEX                                                 
FQ722C*                  CALL      'UT2570'                                                         
FQ722C*                  PARM                    @PECADENA                                          
FQ722C*                  PARM      '1'           @PEACCION                                          
FQ722C*                  PARM      *BLANKS       @PEERROR                                           
FQ722C*                  IF        @PEERROR=*BLANKS                                                 
FQ722C*                  EVAL      C2TLEX=@PECADENA                                                 
FQ722C*                  ENDIF                                                                      
FQ722C*                  ENDIF                                                                      
      *                                                                                             
FQ722C*                  IF        C2TFAX<>*BLANKS                                                  
FQ722C*                  EVAL      @PECADENA=*BLANKS                                                
FQ722C*                  EVAL      @PECADENA=C2TFAX                                                 
FQ722C*                  CALL      'UT2570'                                                         
FQ722C*                  PARM                    @PECADENA                                          
FQ722C*                  PARM      '1'           @PEACCION                                          
FQ722C*                  PARM      *BLANKS       @PEERROR                                           
FQ722C*                  IF        @PEERROR=*BLANKS                                                 
FQ722C*                  EVAL      C2TFAX=@PECADENA                                                 
FQ722C*                  ENDIF                                                                      
FQ722C*                  ENDIF                                                                      
      *                                                                                             
     C                   IF        C2EMAI<>*BLANKS                                                  
     C                   EVAL      @PECADENA=*BLANKS                                                
     C                   EVAL      @PECADENA=C2EMAI                                                 
     C                   CALL      'UT2570'                                                         
     C                   PARM                    @PECADENA                                          
     C                   PARM      '1'           @PEACCION                                          
     C                   PARM      *BLANKS       @PEERROR                                           
     C                   IF        @PEERROR=*BLANKS                                                 
     C                   EVAL      C2EMAI=@PECADENA                                                 
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
      *                                                                                             
     C                   IF        C2DPTO<>*BLANKS                                                  
     C                   EVAL      @PECADENA=*BLANKS                                                
     C                   EVAL      @PECADENA=C2DPTO                                                 
     C                   CALL      'UT2570'                                                         
     C                   PARM                    @PECADENA                                          
     C                   PARM      '1'           @PEACCION                                          
     C                   PARM      *BLANKS       @PEERROR                                           
     C                   IF        @PEERROR=*BLANKS                                                 
     C                   EVAL      C2DPTO=@PECADENA                                                 
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
      *                                                                                             
FQ722C*                  IF        C2PEGE<>*BLANKS                                                  
FQ722C*                  EVAL      @PECADENA=*BLANKS                                                
FQ722C*                  EVAL      @PECADENA=C2PEGE                                                 
FQ722C*                  CALL      'UT2570'                                                         
FQ722C*                  PARM                    @PECADENA                                          
FQ722C*                  PARM      '1'           @PEACCION                                          
FQ722C*                  PARM      *BLANKS       @PEERROR                                           
FQ722C*                  IF        @PEERROR=*BLANKS                                                 
FQ722C*                  EVAL      C2PEGE=@PECADENA                                                 
FQ722C*                  ENDIF                                                                      
FQ722C*                  ENDIF                                                                      
      *                                                                                             
     C***                IF        C2PAIS<>*BLANKS                                                  
     C***                EVAL      @PECADENA=*BLANKS                                                
     C***                EVAL      @PECADENA=C2PAIS                                                 
     C***                CALL      'UT2570'                                                         
     C***                PARM                    @PECADENA                                          
     C***                PARM      '1'           @PEACCION                                          
     C***                PARM      *BLANKS       @PEERROR                                           
     C***                IF        @PEERROR=*BLANKS                                                 
     C***                EVAL      C2PAIS=@PECADENA                                                 
     C***                ENDIF                                                                      
     C***                ENDIF                                                                      
      *                                                                                             
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
      *                                                                                             
     C                   ENDSR                                                                      
      **************************************************************                                
      * Eliminar trazabilidad e Cabecera de pedido ventas          *                                
      * si corresponde                                             *                                
      *------------------------------------------------------------*                                
     C     CS_DELTRACAB  BEGSR                                                                      
      *                                                                                             
     C                   EVAL      *IN50=*OFF                                                       
     C                   EVAL      S5CIAS=@PCIAS                                                    
     C                   EVAL      S5DLGA=@PDLGA                                                    
     C                   EVAL      S5NPCO=@PNPCO                                                    
     C                   EVAL      S5TPED=@PTPED                                                    
     C                   EVAL      S5DATP=@PDATP                                                    
     C                   EVAL      S5NOPL=@PNOPL                                                    
     C                   EVAL      S5LINE=0                                                         
     C     KCODEPE       SETLL     CODEPE                                                           
     C     KCODEPE0      READE(N)  CODEPE                                                           
     C                   DOW       NOT %EOF(CODEPE)                                                 
     C                   IF        S5NP01<>*BLANKS                                                  
     C                   EVAL      *IN50=*ON                                                        
     C                   LEAVE                                                                      
     C                   ENDIF                                                                      
     C     KCODEPE0      READE(N)  CODEPE                                                           
     C                   ENDDO                                                                      
      *                                                                                             
     C                   IF        *IN50=*OFF                                                       
     C                   EVAL      S0CIAS=@PCIAS                                                    
     C                   EVAL      S0DLGA=@PDLGA                                                    
     C                   EVAL      S0NPCO=@PNPCO                                                    
     C                   EVAL      S0TPED=@PTPED                                                    
     C                   EVAL      S0DATP=@PDATP                                                    
     C                   EVAL      S0NOPL=@PNOPL                                                    
     C     KCOCAPE       CHAIN     COCAPE                                                           
     C                   IF        %FOUND(COCAPE)                                                   
     C                   EVAL      S0CI01=*BLANKS                                                   
     C                   EVAL      S0PR01=*BLANKS                                                   
     C                   EVAL      S0DL01=*BLANKS                                                   
     C                   EVAL      S0TP01=*BLANKS                                                   
     C                   EVAL      S0NP01=*BLANKS                                                   
     C                   EVAL      S0DA01=0                                                         
     C                   EVAL      S0NO01=0                                                         
     C                   UPDATE    RCOCAPE                                                          
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
      *                                                                                             
     C                   ENDSR                                                                      
      **************************************************************                                
      * Enviar cabecera de pedido cuando sean altas               *                                 
      *------------------------------------------------------------*                                
     C     CS_SNDALTCAB  BEGSR                                                                      
      *                                                                                             
     C                   EVAL      S5CIAS=@PCIAS                                                    
     C                   EVAL      S5DLGA=@PDLGA                                                    
     C                   EVAL      S5NPCO=@PNPCO                                                    
     C                   EVAL      S5TPED=@PTPED                                                    
     C                   EVAL      S5DATP=@PDATP                                                    
     C                   EVAL      S5NOPL=@PNOPL                                                    
     C                   EVAL      S5LINE=0                                                         
     C     KCODEPE       SETLL     CODEPE                                                           
     C     KCODEPE0      READE(N)  CODEPE                                                           
     C                   DOW       NOT %EOF(CODEPE)                                                 
      *                                                                                             
      * Si es entrega directa, miramos la/las líneas de compra                                      
      *                                                                                             
     C                   IF        S5TPE4='2'                                                       
      *                                                                                             
03050C**                 EVAL      T0CIAS=@PCIAS                                                    
03050C**                 EVAL      T0DLGA=@PDLGA                                                    
03050C**                 EVAL      T0NPCO=@PNPCO                                                    
03050C**                 EVAL      T0TPED=@PTPED                                                    
03050C**                 EVAL      T0DATP=@PDATP                                                    
03050C**                 EVAL      T0NOPL=@PNOPL                                                    
03050C**                 EVAL      T0LINE=@PLINE                                                    
03050C                   EVAL      T0CIAS=S5CIAS                                                    
03050C                   EVAL      T0DLGA=S5DLGA                                                    
03050C                   EVAL      T0NPCO=S5NPCO                                                    
03050C                   EVAL      T0TPED=S5TPED                                                    
03050C                   EVAL      T0DATP=S5DATP                                                    
03050C                   EVAL      T0NOPL=S5NOPL                                                    
03050C                   EVAL      T0LINE=S5LINE                                                    
     C     KEDTRLP00     SETLL     EDTRLP00                                                         
     C     KEDTRLP00     READE     EDTRLP00                                                         
     C                   DOW       NOT %EOF(EDTRLP00)                                               
      *                                                                                             
      * Si el campo C0TOLI=*BLANKS quiere decir que no se ha enviado                                
      *                                                                                             
     C                   EVAL      C0CIAS=T0CIA1                                                    
     C                   EVAL      C0PRVR=T0PRVR                                                    
     C                   EVAL      C0DLGA=T0DLG1                                                    
     C                   EVAL      C0TPED=T0TPE1                                                    
     C                   EVAL      C0NPCO=T0NPC1                                                    
     C                   EVAL      C0DATP=T0DAT1                                                    
     C                   EVAL      C0NOPL=T0NOP1                                                    
     C     KPUCAPE       CHAIN(N)  PUCAPE                                                           
     C                   IF        %FOUND(PUCAPE) AND C0TOLI=*BLANKS                                
11050 *                                                                                             
11050 *  Activaremos el campo de CHEKSUM                                                            
11050 *                                                                                             
11050C                   EXSR      CS_CHKSUM                                                        
      *                                                                                             
11050C**                 EVAL      ZXOPC0='1'                                                       
     C                   EXSR      CS_SENDCAB                                                       
FQ604C                   EXSR      CS_SENDOBS                                                       
C1579 *                                                                                             
C1579 * Miramos si el pedido es de procedencia Poolweb                                              
C1579 *                                                                                             
C1579C                   EXSR      CS_POOLWEB                                                       
C1579                                                                                               
C1579 * Poolweb: Generación de fichero CSV con pedido compra a enviar.                              
C1579 * Movemos ' ' a @PEERRO para indicarle al PW0010 que el pedido                                
C1570 * viene de confirmación automática.                                                           
C1579 *                                                                                             
C1983C*Condicionar llamada a PW0011 Si no hay lineas sin precio                                     
C1983C* ZXPWP0=0                                                                                    
C1983c*                  if        %found(cocape) and zxpweb='1'                                    
C1983C                   if        %found(cocape) and zxpweb='1'                                    
C1983C                             AND ZXPWP0='0'                                                   
C1579C                   move      c0cias        @pcias1                                            
C1579C                   EVAL      @PEDLGA=C0DLGA                                                   
C1579C                   EVAL      @PENPCO=C0NPCO                                                   
C1579C                   EVAL      @PETPED=C0TPED                                                   
C1579C                   move      c0datp        @pdatp1                                            
C1579C                   move      c0nopl        @pnopl1                                            
C1579C                                                                                              
C1579C                   CALL      'PW0011CL'                                                       
C1579C                   PARM                    @PCIAS1                                            
C1579C                   PARM                    @PEDLGA                                            
C1579C                   PARM                    @PENPCO                                            
C1579C                   PARM                    @PETPED                                            
C1579C                   PARM                    @PDATP1                                            
C1579C                   PARM                    @PNOPL1                                            
C1579C                   PARM      ' '           @PEERRO                                            
C1579C                   endif                                                                      
C1579 *                                                                                             
      *                                                                                             
     C     KPUCAPE       CHAIN     PUCAPE                                                           
     C                   IF        %FOUND(PUCAPE) AND C0TOLI=*BLANKS                                
     C                   MOVE      ZXCHKS        C0TOLI                                             
C1983C*Si se han detectado precios a 0(ZXPWP0='1)cambiar status a '10'                              
C1983C                   IF        ZXPWP0='1' AND ZXPWEB='1'                                        
C1983C                   EVAL      C0STCO='10'                                                      
C1983C                   ENDIF                                                                      
     C                   UPDATE    RPUCAPE                                                          
     C                   ENDIF                                                                      
      *                                                                                             
     C                   ENDIF                                                                      
      *                                                                                             
     C     KEDTRLP00     READE     EDTRLP00                                                         
     C                   ENDDO                                                                      
      *                                                                                             
     C                   ENDIF                                                                      
      *                                                                                             
     C     KCODEPE0      READE(N)  CODEPE                                                           
     C                   ENDDO                                                                      
      *                                                                                             
     C                   ENDSR                                                                      
      **************************************************************                                
      * Incidencias en el pedido de compras                        *                                
      *------------------------------------------------------------*                                
     C     CS_INCICOMP   BEGSR                                                                      
      *                                                                                             
      * Comprobamos el fichero resultante del algoritmo porque                                      
      * si hay incidencias genero un e-mail y no confirmo el pedido                                 
      * de compras                                                                                  
      *                                                                                             
     C                   EVAL      ZXNOCONF=0                                                       
      *                                                                                             
     C                   EVAL      T2CIAS=@PCIAS                                                    
     C                   EVAL      T2DLGA=@PDLGA                                                    
     C                   EVAL      T2NPCO=@PNPCO                                                    
     C                   EVAL      T2TPED=@PTPED                                                    
     C                   EVAL      T2DATP=@PDATP                                                    
     C                   EVAL      T2NOPL=@PNOPL                                                    
     C                   EVAL      T2LINE=@PLINE                                                    
     C     KED0050W      CHAIN     ED0050W                                                          
     C                   IF        %FOUND(ED0050W)                                                  
     C                             AND T2ENTD=1 AND (T2INCI='002' OR                                
     C                             T2INCI='003' OR T2INCI='005')                                    
     C                   EVAL      ZXNOCONF=1                                                       
C1983**Si pedido PoolWeb no confirmar                                                               
C1983C                   IF        ZXPWEB='1'                                                       
C1983C                   EVAL      ZXNOCONF=0                                                       
C1983C                   ENDIF                                                                      
      *                                                                                             
15612C                   IF        ZXPRIVEZ='0'                                                     
15612                                                                                               
     C                   SELECT                                                                     
     C                   WHEN      T2INCI='002'                                                     
     C                   EVAL      @FDEDAU='022'                                                    
     C                   WHEN      T2INCI='003'                                                     
     C                   EVAL      @FDEDAU='023'                                                    
     C                   WHEN      T2INCI='005'                                                     
     C                   EVAL      @FDEDAU='024'                                                    
     C                   ENDSL                                                                      
      *                                                                                             
     C                   MOVEL(P)  T2DLGA        @FDDLGA                                            
     C                   MOVEL(P)  T2NPCO        @FDNPCO                                            
     C                   MOVEL(P)  T2TPED        @FDTPED                                            
      *                                                                                             
     C                   CALL      'ED0100'                                                         
     C                   PARM      T2CIAS        @FDCIAS                                            
     C                   PARM                    @FDDLGA                                            
     C                   PARM                    @FDNPCO                                            
     C                   PARM                    @FDTPED                                            
     C                   PARM      T2DATP        @FDDATP                                            
     C                   PARM      T2NOPL        @FDNOPL                                            
     C                   PARM      T2LINE        @FDLINE                                            
     C                   PARM                    @FDCIA2                                            
     C                   PARM                    @FDDLG2                                            
     C                   PARM                    @FDNPC2                                            
     C                   PARM                    @FDTPE2                                            
     C                   PARM                    @FDDAT2                                            
     C                   PARM                    @FDNOP2                                            
     C                   PARM                    @FDLIN2                                            
     C                   PARM      1             @FDLOGI                                            
     C                   PARM      0             @FDORIG                                            
     C                   PARM                    @FDEDAU                                            
     C                   PARM                    @FDERAV                                            
     C                   PARM                    @FDTEXT                                            
     C                   PARM                    @FDDATO                                            
     C                   PARM      1             @FDWAUD                                            
     C                   PARM      0             @FDCANT                                            
15612C                   ENDIF                                                                      
      *                                                                                             
     C                   ENDIF                                                                      
      *                                                                                             
     C                   ENDSR                                                                      
FQ709 **************************************************************                                
FQ709 * COMMON SUBRUTINE (CS_) :                                   *                                
FQ709 * Recuperar CATERORIA ROTACIÓN CONSERVARLA PARA ANALISIS TCT *                                
FQ709 *           PER COMPRES                                      *                                
FQ709 *------------------------------------------------------------*                                
FQ709C     CS_BUSROTNEWC BEGSR                                                                      
FQ709 * BLANQUEAMOS VALORES A BUSCAR                                                                
FQ709C                   EVAL      C5CROT=*BLANKS                                                   
FQ709C                   EVAL      C5CROP=*BLANKS                                                   
FQ709C                   EVAL      C5CROTA=*BLANKS                                                  
FQ709C                   EVAL      C5CROTB=*BLANKS                                                  
FQ709C                   EVAL      C5CROTC=*BLANKS                                                  
FQ709C                                                                                              
FQ709C                   EVAL      @QCIAS=C5CIAS                                                    
FQ709C                   EVAL      @QDLGA=C5DLGA                                                    
FQ709C                   EVAL      @QLOGE=C5LOGE                                                    
FQ709C                   EVAL      @QARTI=C5ARTI                                                    
FQ709C                   EVAL      @QVARI=C5VARI                                                    
FQ709C                   EVAL      @QMODE=C5MODE                                                    
FQ709C                   EVAL      @QTCOJ=C5TCOJ                                                    
FQ709C                   EVAL      @QCROT=*BLANKS                                                   
FQ709C                   EVAL      @QCROTA=*BLANKS                                                  
FQ709C                   EVAL      @QCROTB=*BLANKS                                                  
FQ709C                   EVAL      @QCROTC=*BLANKS                                                  
FQ709                                                                                               
CR964                                                                                               
CR964C                   EVAL      @QLOFD=' '                                                       
CR964C                   IF        C5TPE4='2'                                                       
CR964C                   EVAL      @QLOFD='1'                                                       
CR964C                   ENDIF                                                                      
FQ709C                   CALL      'CO2755'                                                         
FQ709C                   PARM                    @QCIAS                                             
FQ709C                   PARM                    @QDLGA                                             
FQ709C                   PARM                    @QLOGE                                             
FQ709C                   PARM                    @QARTI                                             
FQ709C                   PARM                    @QVARI                                             
FQ709C                   PARM                    @QMODE                                             
FQ709C                   PARM                    @QTCOJ                                             
FQ709C                   PARM                    @QCROT                                             
FQ709C                   PARM                    @QCROTA                                            
FQ709C                   PARM                    @QCROTB                                            
FQ709C                   PARM                    @QCROTC                                            
CR964C                   PARM                    @QLOFD                                             
FQ709 *                                                                                             
FQ709C                   EVAL      C5CROT=%SUBST(@QCROT:1:1)                                        
FQ709C                   EVAL      C5CROP=%SUBST(@QCROT:2:1)                                        
FQ709 *                                                                                             
FQ709C                   IF        C5TCOJ='1'                                                       
FQ709C                   MOVE      @QCROTA       C5CROTA                                            
FQ709C                   MOVE      @QCROTB       C5CROTB                                            
FQ709C                   MOVE      @QCROTC       C5CROTC                                            
FQ709C                   ENDIF                                                                      
FQ709                                                                                               
FQ709C                   ENDSR                                                                      
      ******************************************************************                            
C1579 * MIRAMOS SI EL PEDIDO ES POOLWEB Y RECUPERAMOS EL PROVEEDOR                                  
C1579 **********************************************************************                        
C1579C     CS_POOLWEB    BEGSR                                                                      
C1579 *                                                                                             
C1579C                   eval      zxpweb='0'                                                       
C1579 *                                                                                             
F-2OL *_Nueva rutina para recuperar el proveedor del campo                                          
F-2OL *___________________(MSSTOK.M1PRVR), ___________________________                              
F-2OLC*OL187             exsr      SRrecu                                                           
OL187                    zxprvr=srrecu(s5arti:s5vari:s5mode);                                       
C1579 * Recuperamos el proveedor del artículo (si luego vemos que el                                
C1579 * pedido es de procedencia Poolweb, lo sustituiremos por el que                               
C1579 * tengamos definido en la tabla).                                                             
C1579 *                                                                                             
F-2OLc                   if        ZXPRVR = *blanks                                                 
C1579C                   eval      m5cias=s5cias                                                    
C1579C                   eval      m5arti=s5arti                                                    
C1579C                   eval      m5vari=s5vari                                                    
C1579C                   eval      m5mode=s5mode                                                    
C1579C     kmsarti00     chain     msarti00                                                         
C1579 *                                                                                             
C1579c*OL187             if        %found(msarti00)                                                 
OL187c                   if        %found(msarti00) AND ZXPRVR=*BLANKS                              
C1579c                   movel     m5prvr        zxprvr                                             
C1579c                   endif                                                                      
F-2OLc                   ENDIF                                                                      
C1579 *                                                                                             
C1579 * Para saber si es un pedido Poolweb,lo buscamos en la tabla                                  
C1579 * PWEB con la procedencia del pedido, y además nos dará cual                                  
C2579 * es el proveedor                                                                             
C1579 *                                                                                             
C1579C                   eval      s0cias=@pcias                                                    
C1579C                   eval      s0dlga=@pdlga                                                    
C1579C                   eval      s0npco=@pnpco                                                    
C1579C                   eval      s0tped=@ptped                                                    
C1579C                   eval      s0datp=@pdatp                                                    
C1579C                   eval      s0nopl=@pnopl                                                    
C1579C     kcocape       chain(n)  cocape                                                           
C1579 *                                                                                             
C1579 * Para saber si es un proveedor Poolweb,lo buscamos en la tabla                               
C1579 * PWEB con la procedencia del pedido.                                                         
C1579 *                                                                                             
C1579C                   if        %found(cocape)                                                   
C1579C                   eval      pecias=@pcias                                                    
C1579C                   eval      pectab='PWEB'                                                    
C1579C                   eval      peclta=s0pped                                                    
C1579C     kpmtabd       chain     pmtabd                                                           
C1579                                                                                               
C1579C                   if        %found(pmtabd)                                                   
C1579C                   eval      zxpweb='1'                                                       
C1579C                   movel     pedesc        zxprvr                                             
C1579C                   endif                                                                      
C1579                                                                                               
C1579C                   endif                                                                      
C1579                                                                                               
C1579C                   ENDSR                                                                      
C4137**************************************************************                                
C4137* Control excepciones                                        *                                
C4137**************************************************************                                
C4406c*C4137     cs_provstok   begsr                                                                
C4137*                                                                                             
C4406c*C4137             eval      t3cias = @pcias                                                  
C4406c*C4137             eval      t3dlga = @pdlga                                                  
C4406c*C4137     kedparm       chain     edparm                                                     
C4406c*C4137             if        %found(edparm) and t3alpr = '1' and                              
C4406c*C4137                       m0PRVR <> *BLANKS                                                
C4406c*C4137             eval      zxprvr_dom = m0prvr                                              
C4406c*C4137             eval      zxprvr     = m0prvr                                              
C4406c*C4137             endif                                                                      
C4137*                                                                                             
C4406c*C4137             endsr                                                                      
C4137**************************************************************                                
C4137* Control excepciones                                        *                                
C4137**************************************************************                                
C4137c     cs_eiexce     begsr                                                                      
C4137*                                                                                             
C4137c                   select                                                                     
C4137c                   when      zxexcepcion = 1                                                  
C4137c                   eval      z0file = 'ED0015'                                                
C4137c                   eval      z0cias = @pcias                                                  
C4137c                   eval      z0pais = 'FD'                                                    
C4137c                   eval      z0grp2 = 'OPCAL'                                                 
C4137c                   eval      z0cust = %subst(c9cfac: 1: 10)                                   
C4137c                   eval      z0camp = *blanks                                                 
C4137c     keiexce       chain     eiexce                                                           
C4137c                   if        %found(eiexce)                                                   
C4137c                   exsr      cs_tr0435                                                        
C4406c                   else                                                                       
C4406c                   clear                   c0edic                                             
C4406c                   clear                   c0fedi                                             
C4406c                   clear                   c0uedi                                             
C4137c                   endif                                                                      
C4137c                   endsl                                                                      
C4137*                                                                                             
C4137c                   endsr                                                                      
C4137**************************************************************                                
C4137* Valida si grabamos TR0435                                  *                                
C4137**************************************************************                                
C4137c     cs_tr0435     begsr                                                                      
C4137*                                                                                             
C4137c                   eval      c0edic = '1'                                                     
C4137c                   eval      c0fedi = %char(*date)                                            
C4137c                   eval      c0uedi = sdsusr                                                  
C4137c                   write     rtr0435                              55                          
C4137*                                                                                             
C4137c                   endsr                                                                      
I0200 ******************************************************************                            
I0200 * Buscamos si el país de la dirección de entrega es de exportación                            
I0200 **********************************************************************                        
I0200C     CS_EXPORT     BEGSR                                                                      
I0200 *                                                                                             
I0200C                   EVAL      ZXEXPORT=' '                                                     
I0200 *                                                                                             
I0200C                   EVAL      S2CIAS=S0CIAS                                                    
I0200C                   EVAL      S2DLGA=S0DLGA                                                    
I0200C                   EVAL      S2NPCO=S0NPCO                                                    
I0200C                   EVAL      S2TPED=S0TPED                                                    
I0200C                   EVAL      S2DATP=S0DATP                                                    
I0200C                   EVAL      S2NOPL=S0NOPL                                                    
I0200C                   EVAL      S2CDIR='1'                                                       
I0200C     KCODIPE       CHAIN     CODIPE                                                           
I0200C                   IF        %FOUND(CODIPE)                                                   
I0200C                   EVAL      S0CIAS=S2CIAS                                                    
I0200C                   EVAL      S0PAIS=S2PAIS                                                    
I0200C     KMSPAIS       CHAIN     MSPAIS                                                           
I0200C                   IF        %FOUND(MSPAIS)                                                   
I0200C                   IF        MEPCEE<>'1'                                                      
I0200C                   EVAL      ZXEXPORT='1'                                                     
I0200C                   ENDIF                                                                      
I0200C                   ENDIF                                                                      
I0200C                   ENDIF                                                                      
I0200 *                                                                                             
I0200C                   ENDSR                                                                      
      ******************************************************************                            
F-2OL *   Recuperar almacén a partir de la logística del pedido venta                               
F-2OL **********************************************************************                        
OL187C*    SRrecu        BEGSR                                                                      
OL187   dcl-proc SRrecu;                                                                            
OL187   dcl-pi *n like(m1prvr);                                                                     
OL187    parti like(s5arti);                                                                        
OL187    pvari like(s5vari);                                                                        
OL187    pmode like(s5mode);                                                                        
OL187   end-pi;                                                                                     
OL187   dcl-pr getenv pointer extproc('getenv');                                                    
OL187     *n pointer value options(*string:*trim);                                                  
OL187   end-pr;                                                                                     
OL187   dcl-s EnvValue like(s5loge) inz;                                                            
E7153   dcl-s MagaPedido like(m1maga) inz;                                                          
OL187                    gprop=*off;                                                                
                                                                                                    
F-2OLC                   eval      @pcias = s5cias                                                  
E7153 *F-2OLC                   eval      @palma = s5loge                                           
E7153                    EnvValue = s5loge;                                                         
F-2OLC                   eval      @ptipo = '1'                                                     
F-2OLC                   eval      @pdlga = s5dlga                                                  
OL187                                                                                               
OL187   // Si estem traient la línia d'ED i és un Kit hem de recuperar la logística que tenia       
OL187      if @PEDAU = '009' and s5tcoj = '4';                                                      
OL187        EnvValue = %str(getenv('ED0015_LOGOLD'));                                              
OL187        if EnvValue <> *blanks;                                                                
OL187          @palma = EnvValue;                                                                   
OL187        endif;                                                                                 
OL187      endif;                                                                                   
E7153                    chain (s5cias:EnvValue) msalma05;                                          
E7153                    if %found(msalma05);                                                       
E7153                      MagaPedido = m0maga;                                                     
E7153                    endif;                                                                     
E7153                    @palma = MagaPedido;                                                       
F-2OL *                                                                                             
F-2OLC                   CALL      'MM1411'                                                         
F-2OLC                   PARM                    @PCIAS                                             
F-2OLC                   PARM                    @PALMA                                             
F-2OLC                   PARM                    @PTIPO                                             
F-2OLC                   PARM                    @PDLGA                                             
F-2OLC                   PARM      *blanks       @PRESP                                             
F-2OL *                                                                                             
F-2OLC                   if        @PRESP <>*blanks                                                 
E7153                      m1maga = @PRESP;                                                         
E7153                    else;                                                                      
E7153                      m1maga = MagaPedido;                                                     
E7153                    endif;                                                                     
F-2OLC                                                                                              
F-2OLC                   EVAL      M5CIAS = S5CIAS                                                  
E7153 *F-2OLC                   EVAL      M1MAGA = @PRESP                                           
F-2OLC*OL187             EVAL      M1ARTI = S5ARTI                                                  
F-2OLC*OL187             EVAL      M1VARI = S5VARI                                                  
F-2OLC*OL187             EVAL      M1MODE = S5MODE                                                  
OL187C                   EVAL      M1ARTI = pARTI                                                   
OL187C                   EVAL      M1VARI = pVARI                                                   
OL187C                   EVAL      M1MODE = pMODE                                                   
F-2OL *                                                                                             
F-2OLc     KMSSTOK       CHAIN     MSSTOK                             90                            
F-2OLC                   IF        %FOUND                                                           
OL187                    if m1prop='1' or m1prop='2';                                               
OL187                      gprop =*on;                                                              
OL187                    endif;                                                                     
F-2OLC                   IF        m1prvr <> *blanks                                                
F-2OLC*                  movel     M1PRVR        ZXPRVR                                             
OL187                    return M1PRVR;                                                             
F-2OLC                   ENDIF                                                  ECSTK <= *ZEROS     
F-2OLC                   ENDIF                                                  ECSTK <= *ZEROS     
F-2OL * Acceder a MSSTOK con clave                                                                  
F-2OL *                                                                                             
OL187                                                                                               
OL187    // Si NO tenim M1PRVR informat cerquem en MSALMA                                           
OL187         chain (s5cias:m1maga) msalma;                                                         
OL187         if %found(msalma) and m0tal1='8' and m0prvr <> *blanks;                               
OL187           return m0prvr;                                                                      
OL187         endif;                                                                                
E7153 *F-2OLC                   endif                                                               
OL187                    return *blanks;                                                            
OL187   end-proc;                                                                                   
F-2OL **********************************************************************                        
F-2OLC*OL187             ENDSR                                                                      
      ******************************************************************                            
** CTDATA C                                                                                         
'                                                                                                   
