      **************************************************************                                
      * APLICACIÓ: MÒDUL COMERCIAL                                 *                                
      **************************************************************                                
      * TITOL: ED0051  © FLUIDRA SERVICES                          *                                
      * DATA CREACIO:  25/01/2010                                  *                                
      * FUNCIO DEL PROGRAMA: Entregas Directas. Control Errores    *                                
      *                                                            *                                
      * DOCUMENTACIÓN PARAMETROS:                                  *                                
      * @PCIAS   CIAS de la Clave de Pedido de la empresa @PCIAS   *                                
      * @PDLGA   DLGA de la Clave de Pedido de la empresa @PCIAS   *                                
      * @PNPCO   NPCO de la Clave de Pedido de la empresa @PCIAS   *                                
      * @PTPED   TPED de la Clave de Pedido de la empresa @PCIAS   *                                
      * @PDATP   DATP de la Clave de Pedido de la empresa @PCIAS   *                                
      * @PNOPL   NOPL de la Clave de Pedido de la empresa @PCIAS   *                                
      * @PLINE   LINE de la Clave de Pedido de la empresa @PCIAS   *                                
      * @PARV1   Componente Conjunto Compra Comercial              *                                
      * @PCOM2   Componente Conjunto Productiva                    *                                
      * @PCUST   Cliente del Pedido de la empresa @PCIAS /Prep.TRACE*                               
      * @PTDI1   Dirección del Pedido de la empresa @PCIAS         *                                
      * @PEDAU   Código Auditoria                                  *                                
      * @PLOGI   Lógico de la clave  (0=Vta 1=Comp 2=Pro 3=Tra)    *                                
      * @PORIG   Origen Programa llamador(0=Vta 1=Comp 2=Pro 3=Tra)*                                
      * @PINTE   Integridad (1=línea 2=pedido 3=Cliente-Dirección) *                                
      * @PERRO   Retorna '1' Si hay Error *BLANKS si no            *                                
      * @PINCI   Retorna el código de error                        *                                
      **************************************************************                                
FQ604 * Modificación: FQ604                                        *                                
FQ604 *        Autor: Josep Aragonès                               *                                
FQ604 * Fecha Inicio: 20/05/2010                                   *                                
FQ604 *  Descripción: Fluidra direct. Gestión Observaciones.       *                                
FQ604 *                               Método entrega.              *                                
FQ604 **************************************************************                                
14060 * Modificación: 14060                                        *                                
14060 *        Autor: Josep Aragonès                               *                                
14060 * Fecha Inicio: 14/06/2010                                   *                                
14060 *  Descripción: Integridad Conjunto si un componente es X-DOC*                                
14060 *               Validar si existe EDTRLP al Preparar         *                                
14060 *               Validar si la línea EDTRLP está Cerrada.     *                                
14060 **************************************************************                                
14070 * Modificación: 14070                                        *                                
14070 *        Autor: Josep Aragonès                               *                                
14070 * Fecha Inicio: 14/07/2010                                   *                                
14070 *  Descripción: poder preparar parte de conjunto si hay una  *                                
14070 *               cantidad mínima de cada componente           *                                
14070 **************************************************************                                
In178 *      Modificació: In178                                    *                                
In178 *            Autor: Josep Aragonès                           *                                
In178 * Data modificació: 17/09/2010                               *                                
In178 *       Descripció: Cuando se crea conjunto compra C5TCOJ=' '*                                
In178 **************************************************************                                
FQ710 * Modificación: FQ710                                        *                                
FQ710 *        Autor: Josep Aragonès                               *                                
FQ710 * Fecha Inicio: 29/09/2010                                   *                                
FQ710 *  Descripción: Limite por expedición y dias bloqueo prepar. *                                
FQ710 **************************************************************                                
FQ786 * Modificación: FQ786                                        *                                
FQ786 *        Autor: JMARTINEZP                                   *                                
FQ786 * Fecha Inicio: 23/02/2011                                   *                                
FQ786 *  Descripción: Cambio fecha solicitada por cabecera.        *                                
FQ786 *               no tener en cuenta las lineas entregadas     *                                
FQ786 *               para la validación                           *                                
FQ786 **************************************************************                                
FQ787 * Modificación: FQ787                                        *                                
FQ787 *        Autor: JMARTINEZP                                   *                                
FQ787 * Fecha Inicio: 23/02/2011                                   *                                
FQ787 *  Descripción: Retener articulos contra pedido              *                                
FQ787 **************************************************************                                
      * Modificación: FQ942                                        *                                
      *        Autor: JMARTINEZP                                   *                                
      * Fecha Inicio: 19/12/2011                                   *                                
      *  Descripción: Control equivalencias cjtos CIALvsPROD       *                                
      **************************************************************                                
01022 * Modificación: 01022                                        *                                
01022 *        Autor: Lluís Campo                                  *                                
01022 * Fecha Inicio: 01/02/2012                                   *                                
01022 *  Descripción: Recuperar correctamene si un articulo es     *                                
01022 *               contrapedido en Movex.                       *                                
01022 **************************************************************                                
      **************************************************************                                
25052 * Modificación: 25052                                        *                                
25052 *        Autor: Lluís Campo                                  *                                
25052 * Fecha Inicio: 25/05/2012                                   *                                
25052 *  Descripción: Si el articulo en Movex es de orden iniciada *                                
25052 *               es igual que el contrapedido.                *                                
25052 **************************************************************                                
13812 * Modificación: 13812                                        *                                
13812 *        Autor: Josep Aragonès                               *                                
13812 * Fecha Inicio: 13/08/2012                                   *                                
13812 *  Descripción: Si hi ha error d'article dona fals error     *                                
13812 **************************************************************                                
19D12 * Modificación: 19D12                                        *                                
19D12 *        Autor: Josep Aragonès                               *                                
19D12 * Fecha Inicio: 19/12/2012                                   *                                
19D12 *  Descripción: Bilioteques M3 MOVEX                         *                                
19D12 *  S'ha de compilar el dia del canvi amb biblioteca M3EDBPRD *                                
19D12 **************************************************************                                
FDX01 *      Modificació: FDX01                                                                     
FDX01 *            Autor: Carlos del Valle                                                          
FDX01 * Data modificació: 03/01/2013                                                                
FDX01 *       Descripció: Fluidra Direct: Correcciones y mejoras                                    
FDX01 **************************************************************                                
CR528 *      Modificació: CR528                                                                     
CR528 *            Autor: Carlos del Valle                                                          
CR528 * Data modificació: 26/02/2013                                                                
CR528 *       Descripció: Fluidra Direct: despreciar FD si artículo                                 
CR528 *                   está bloqueado para compra                                                
CR528 **************************************************************                                
      *      Modificació: IN950                                                                     
      *            Autor: JMARTINEZP                                                                
      * Data modificació: 24/04/2013                                                                
      *       Descripció: SI HAY UN CAMBIO DE COENVIO (PEDAU='013')                                 
      *                   SI    CONTRA PEDIDO NO DEBE BLOQUEAR                                      
      **************************************************************                                
      *      Modificació: 31053                                                                     
      *            Autor: JMARTINEZP                                                                
      * Data modificació: 24/04/2013                                                                
      *       Descripció: ERROR , NO LIMPIA VARIABLE      ZXCANT                                    
      *                   CON LOS CONJUNTOS                                                         
      **************************************************************                                
CR527 *      Modificació: CR527                                                                     
CR527 *            Autor: Carlos del Valle                                                          
CR527 * Data modificació: 19/02/2013                                                                
CR527 *       Descripció: Fluidra Direct: Preparaciones de Fluidra Express                          
CR527 **************************************************************                                
C1350 *      Modificació: CR1350                                                                    
C1350 *            Autor: JORDI GONZALEZ                                                            
C1350 * Data modificació: 02/12/2013   Marca:C1350                                                  
C1350 *       Descripció: Permitir bloquear albaranes FD desde la comercial                         
C1350 **************************************************************                                
      *      Modificació: 213050                                                                    
      *            Autor: JONATHAN MARTINEZ                                                         
      * Data modificació: 16/12/2013   Marca:21350                                                  
      *       Descripció: Permitir bloquear albaranes FD desde la comercial                         
      **************************************************************                                
CR653 *      Modificació: CR653                                                                     
CR653 *            Autor: X.Bou                                                                     
CR653 * Data modificació: 28/10/2013                                                                
CR653 *       Descripció: Tratamiento Proveedores externos en Fluidra                               
CR653 *                   Direct: No cal fer comprobacions d'estoc                                  
CR653 *                   perque asumim que sempre tenen estoc                                      
CR653 *                   (ZXPVEX=1)                                                                
CR653 **************************************************************                                
C1579 * Modificación: CR1579                                       *                                
C1579 *        Autor: Javier Arbide                                *                                
C1579 * Fecha Inicio: 01/04/2014                                   *                                
C1579 *  Descripción: Envío automático pedidos recambios a Poolweb *                                
C1579 **************************************************************                                
C1983 * Modificación: CR1983       Marca:C1983                     *                                
C1983 *        Autor: JLMARTIN                                     *                                
C1983 * Fecha Inicio: 30/06/2014                                   *                                
C1983 *  Descripción: Control modificaciones pedidos PoolWeb       *                                
C1983 **************************************************************                                
C1078 * DATA DE MODIFICACIÓ: 19/01/2012  MARCA: C1078              *                                
C1078 * AUTOR: JMARTINEZP                                          *                                
C1078 * DOCUMENTACIÓ: DOM                                          *                                
C1078 **************************************************************                                
C2559 * DATA DE MODIFICACIÓ: 18/03/2015  MARCA: C2559      CR2559  *                                
C2559 * AUTOR: Javier Arbide                                       *                                
C2559 * DOCUMENTACIÓ: Anulación artículos tipo B en pedidos        *                                
C2559 *               Incluir cierre autómatico líneas (EDAU=051)  *                                
C2559 *               Excepto en las empresas Movex en las que el  *                                
C2559 *               pedido tenga asociada una OF                 *                                
C2559 **************************************************************                                
C2510 * DATA DE MODIFICACIÓ: 12/03/2015  MARCA: C2510      CR2510  *                                
C2510 * AUTOR: Javier Arbide                                       *                                
C2510 * DOCUMENTACIÓ: Importes pedido y expedición en ED forzada   *                                
C2510 *               Actualizar campos de importes de EDPARM      *                                
C2510 *               desde los de cliente de EDPARC si existen    *                                
C2510 **************************************************************                                
H0112 * DATA DE MODIFICACIÓ: 25/05/2015  MARCA: H0112      HD270112*                                
H0112 * AUTOR: Celia Gerber                                        *                                
H0112 * DOCUMENTACIÓ: Baja de línea en GRE que no se procesa en Inquide                             
H0112 **************************************************************                                
C2664 * DATA DE MODIFICACIÓ: 23/06/2015  MARCA: C2664              *                                
C2664 * AUTOR: Celia Gerber                                        *                                
C2664 * DOCUMENTACIÓ: Tancar línia comanda servida parcialment     *                                
C2664 **************************************************************                                
HD123 * DATA DE MODIFICACIÓ: 23/06/2015  MARCA: HD123              *                                
HD123 * AUTOR: JMARTINEZP                                          *                                
HD123 * DOCUMENTACIÓ: ARREGLAMOS INCIDENCIA DETECTADA DESDE DOM    *                                
HD123 **************************************************************                                
C3820 * DATA DE MODIFICACIÓ: 12/01/2017  MARCA: CR3820             *                                
C3820 * AUTOR: JRGONZALEZ                                          *                                
C3820 * DOCUMENTACIÓ: VALIDACION DE CAMBIO DE ALMACEN DE SERVICIO  *                                
C3820 **************************************************************                                
Q4132 * DATA DE MODIFICACIÓ: 16/01/2018  MARCA: Q4132              *                                
Q4132 * AUTOR: ALBERT SOLDEVILA                                    *                                
Q4132 * DOCUMENTACIÓ: ES CREA L'EXCEPCIO = 1, SI TROBA EL REGISTRE *                                
Q4132 * AGAFA COM PROVEEDOR PRINCIPAL EL M5PRV2                                                     
Q4132 **************************************************************                                
12030 * DATA DE MODIFICACIÓ: 12/03/2020  MARCA: 12030              *                                
12030 * AUTOR: TL                                                  *                                
12030 * DOCUMENTACIÓ: EJECUCIÓN DE LA PANTALLA W2 EN BATCH         *                                
12030 **************************************************************                                
I0164* DATA DE MODIFICACIÓ: 01/09/2020  MARCA: I0164  (ITOM164)   *                                
I0164* AUTOR: Javier Arbide                                       *                                
I0164* DOCUMENTACIÓ: Creación automática de Kit en Distribuidor   *                                
I0164**************************************************************                                
69095* Data de Modificació: 17/02/2021  Marca: 69095              *                                
69095* Autor: Lluís Albert Grau                                   *                                
69095* Documentació: Clasificación articulos empresas Movex desde *                                
69095*               As400  (FSD-69095)                           *                                
69095* ************************************************************                                
C5958* Data de Modificació: 23/02/2021  Marca: C5958              *                                
C5958* Autor: JULIAN                                              *                                
C5958* Documentació: Retroceder I0164 y 69095                     *                                
C5958* ************************************************************                                
69095* Data de Modificació: 25/02/2021  Marca: 69095              *                                
69095* Autor: Lluís Albert Grau                                   *                                
69095* Documentació: Clasificación articulos empresas Movex desde *                                
69095*               As400  (FSD-69095)                           *                                
69095*               Se vuelve a activar la modificación.         *                                
69095* ************************************************************                                
76211* Data de Modificació: 11/03/2021  Marca: 76211              *                                
76211* Autor: Lluís Albert Grau                                   *                                
76211* Documentació: Anulaciones MTS Inquide FSD-76211            *                                
76211* ************************************************************                                
I0184 * Modificación: ITOM184        MARCA:I0184                   *                                
I0184 *        Autor: Javier Arbide                                *                                
I0184 * Fecha Inicio: 12/11/2020                                   *                                
I0184 *  Descripción: Divisiones Multiplanta                       *                                
I0184 **************************************************************                                
79419 * Modificación: FSD-79419      MARCA:79419                   *                                
79419 *        Autor: Javier Arbide                                *                                
79419 * Fecha Inicio: 09/04/2021                                   *                                
79419 *  Descripción: Prolemas visualización clasif. de artículos  *                                
79419 **************************************************************                                
F-2OL * DATA DE MODIFICACIÓ: 24/09/2021  MARCA: F-2OL              *                                
F-2OL * AUTOR: DGrau                                               *                                
F-2OL * DOCUMENTACIÓ: 2OL- Obrir a més d'un OL                     *                                
F-2OL **************************************************************                                
OL205 // Date: 26/09/2022     Marca: OL205                                                          
OL205 // Modif: Correccions si envien la logística utilitzar-la enlloc de la de la línia            
OL205 // Autor: Anthony Flags                                                                       
OL205 //////////////////////////////////////////////////////////////////////////////////////////    
E7146 // Date: 21/11/2022     Marca: E7146                                                          
E7146 // Modif: Modificació per mostrar errors en validació 403                                     
E7146 // Autor: MMontana                                                                            
E7146 //////////////////////////////////////////////////////////////////////////////////////////    
E7218 * DATA DE MODIFICACIÓ: 10/01/2023  MARCA: E7218                                               
E7218 * AUTOR: MMontana                                                                             
E7218 * DOCUMENTACIÓ: Tornar a posar accés al fitxer PUPRCJ                                         
E7218 ******************************************************************************************    
E7345 * DATA DE MODIFICACIÓ: 03/03/2023  MARCA: E7345                                               
E7345 * AUTOR: MMontana                                                                             
E7345 * DOCUMENTACIÓ: ID116. Articulos MTS solicita autorización para cambiar/anular en F04         
E7345 *  Tota la codificació s'ha realitzat en format RPG de 1994                                   
E7345 * RPG IV, a.k.a. RPGLE was released in 1994 as part of the V3R2 release of OS/400             
E7345 ******************************************************************************************    
      * DATA DE MODIFICACIÓ: 15/12/2025  MARCA: OL885                                               
      * AUTOR: JMARTINEZP                                                                           
      * DOCUMENTACIÓ: ARREGLAR INCIDENCIA QUE NO SALGA                                              
      *                                                                                             
      ***********************************************************************************           
                                                                                                    
     H DATEDIT(*YMD/)                                                                               
     H OPTION(*NODEBUGIO:*SRCSTMT)                                                                  
I0184H DFTACTGRP(*NO) ACTGRP(*CALLER)                                                               
      *                                                                                             
     FEDTRLP00  IF   E           K DISK    RENAME(EDTRLP:REDTRLP00)                                 
     FEDTRLP10  IF   E           K DISK    RENAME(EDTRLP:REDTRLP10)                                 
     FEDTRLP20  IF   E           K DISK    RENAME(EDTRLP:REDTRLP20)                                 
     FEDTRLP30  UF   E           K DISK    RENAME(EDTRLP:REDTRLP30)                                 
     FEDTRLP40  IF   E           K DISK    RENAME(EDTRLP:REDTRLP40)                                 
     FEDTRLX00  IF   E           K DISK    RENAME(EDTRLX:REDTRLX00)                                 
     FEDTRLX10  IF   E           K DISK    RENAME(EDTRLX:REDTRLX10)                                 
     FEDTRLX20  IF   E           K DISK    RENAME(EDTRLX:REDTRLX20)                                 
     FEDTRLX30  UF   E           K DISK    RENAME(EDTRLX:REDTRLX30)                                 
     FEDTRLX40  IF   E           K DISK    RENAME(EDTRLX:REDTRLX40)                                 
     FCODEPE    IF   E           K DISK                                                             
     FPMLIBL    IF   E           K DISK                                                             
     FMSARTI    IF   E           K Disk    ExtFile(FileArti_erp)                                    
     F                                     RENAME(RMSARTI:RMSARTIXX)                                
     F                                     USROPN PREFIX(A_)                                        
     FUTCOM0    IF   E           K DISK                                                             
     FTR003602  IF   E           K Disk    ExtFile(FileTr36_erp)                                    
     F                                     USROPN                                                   
     FWR003602  IF   E           K Disk    ExtFile(FileWr36_erp)                                    
     F                                     USROPN                                                   
     FTR002602  IF   E           K Disk    ExtFile(FileTr26_erp)                                    
01070F                                     USROPN PREFIX(TR_)                                       
     FWR002602  IF   E           K Disk    ExtFile(FileWr26_erp)                                    
01070F                                     USROPN PREFIX(TR_)                                       
     FMSARTI00  IF   E           K DISK                                                             
     FPUPROV    IF   E           K DISK                                                             
     FPUPRP0    IF   E           K DISK                                                             
FQ942F*SCOJC    IF   E           K DISK                                                             
FQ942FMSCOJC    IF   E           K Disk    ExtFile(FileCojc_erp)                                    
FQ942F                                     RENAME(RMSCOJC:RMSCOJCXX)                                
FQ942F                                     USROPN                                                   
     FMSCOJD    IF   E           K DISK                                                             
FQ710FCOAPRP01  IF   E           K DISK    RENAME(RCOAPRP:RCOAPRP01)                                
FQ710FCOAPR101  IF   E           K DISK    RENAME(RCOAPR1:RCOAPR101)                                
     FCOAPRC    IF   E           K DISK                                                             
     FGXEQAR    IF   E           K DISK                                                             
     FMITMAS00  IF   E           K DISK    ExtFile(File_mitmas)                                     
     F                                     USROPN                                                   
     FZAQBAL00  IF   E           K DISK    USROPN                                                   
19D12F*ITBAL00  IF   E           K DISK    USROPN                                                   
19D12FMITBAL00  IF   E           K DISK    USROPN ExtFile(File_mitbal)                              
     FCMNDIV00  IF   E           K DISK    ExtFile(File_cmndiv)                                     
     F                                     USROPN                                                   
     FAQPEDI00  IF   E           K DISK    USROPN                                                   
19D12F*ITFAC00  IF   E           K DISK    USROPN                                                   
19D12FMITFAC00  IF   E           K DISK    USROPN ExtFile(File_mitfac)                              
I0184FZAQITN00  IF   E           K DISK    USROPN ExtFile(File_ZAQITN)                              
I0184FGMTABD01  IF   E           K DISK    ExtFile(File_GMTABD)                                     
I0184F                                     USROPN RENAME(GMTABD:RGMTABD01)                          
C2559FOOLINE40  IF   E           K DISK    USROPN ExtFile(File_ooline)                              
C3820FOOLINE00  IF   E           K DISK    USROPN ExtFile(File_oolin0)                              
C3820F                                     RENAME(OOLINE:ROOLINEXX)                                 
     FMSTRG1    IF   E           K DISK                                                             
     FPMTAB2    IF   E           K DISK                                                             
     FPMEMPR    IF   E           K DISK                                                             
14060FCOXDOC    IF   E           K DISK                                                             
FQ710FEDPARM    IF   E           K DISK                                                             
FQ710FPMJOBC    IF   E           K DISK                                                             
FQ710FCOAPRP    IF   E           K DISK                                                             
FQ710FCOAPR1    IF   E           K DISK                                                             
FQ942FMPDHED00  IF   E           K DISK    ExtFile(File_mpdhed)                                     
FQ942F                                     USROPN PREFIX(H_)                                        
C1579FCOCAPE    IF   E           K DISK                                                             
C1579FPMTABD    IF   E           K DISK                                                             
     FED0051FM  CF   E             WORKSTN INFDS(FMTDS) USROPN                                      
C1078FMSALMA05  IF   E           K DISK    PREFIX(AL_)                                              
OL205fmsalma    if   e           k disk    RENAME(RMSALMA:rmsalmao)                                 
C2510FEDPARC    IF   E           K DISK                                                             
Q4132feiexce    if   e           k disk                                                             
79419FMSSTOK    if   E           K DISK    ExtFile(FileStok_erp) UsrOpn                             
76211FMSSTST    IF   E           K Disk    ExtFile(FileStst_erp) usropn                             
79419FMSALMA08  if   E           K DISK    ExtFile(FileAlma_erp) UsrOpn                             
79419F                                      RENAME(RMSALMA:rmsalmax)                                
C5958F*PUPRCJ    IF   E           K DISK    PREFIX(P_)                                              
E7218FPUPRCJ    IF   E           K DISK    PREFIX(P_)                                               
F-2OLFMSSTOK01  if   E           K DISK    prefix(Ol_) rename(rmsstok:olrmstk)                      
OL885**                                                                                             
OL885FEDPAR2    IF   E           K DISK    PREFIX(ED_)                                              
                                                                                                    
     D* AREA DE DADES DE PROGRAMA I INICIALITZACIO DE VALORS COMUNS                                 
     D                SDS                                                                           
     D  SDSPGM                 1     10                                                             
     D    CCCPGM                     10    OVERLAY(SDSPGM)                                          
     D  SDSJOB               244    253                                                             
     D    CCCJOB                     10    OVERLAY(SDSJOB)                                          
     D  SDSSTS           *STATUS                                                                    
     D  SDSUSR               254    263                                                             
     D  SDSJNBR              264    269                                                             
                                                                                                    
     D* AREA DE DADES D'INFORMACIÓ ARXIU                                                            
     D  FMTDS          DS                                                                           
     D    FMTPOCUR           370    371B 0                                                          
     D    FMTPOS             378    379B 0                                                          
     D    FMTRCD         *RECORD                                                8 A                 
FQ710                                                                                               
FQ710 * AREA DE PARAMETRES DE PROGRAMA                                                              
FQ710D  CO3076       E DS                  EXTNAME('PURLIBC8/CO3076DS')                             
                                                                                                    
      * PLANTILLA D'INDICADORS DEL PROGRAMA (ELS RESERVATS NO SURTEN)                               
     D  INDICADORS   E DS                  BASED(INDICADORP)                                        
     D                                     EXTNAME(INDDS:RIND0199)                                  
     D  INDICADORP     S               *   INZ(%ADDR(*IN))                                          
                                                                                                    
     D  @PCIAS         S                   LIKE(T0CIAS)                                             
     D  @PDLGA         S              5                                                             
     D  @PNPCO         S             10                                                             
     D  @PTPED         S              2                                                             
     D  @PDATP         S                   LIKE(T0DATP)                                             
     D  @PNOPL         S                   LIKE(T0NOPL)                                             
     D  @PLINE         S              3p 0                                                          
     D  @PARV1         S             25                                                             
     D  @PCOM2         S             25                                                             
     D  @PCUST         S             10                                                             
     D  @PTDI1         S              2                                                             
     D  @PEDAU         S              3                                                             
     D  @PLOGI         S              1  0                                                          
     D  @PORIG         S              1  0                                                          
     D  @PINTE         S              1  0                                                          
     D  @PERRO         S              1                                                             
     D  @PINCI         S              3                                                             
C1078D  @PLOGE         S              3                                                             
                                                                                                    
     D SERROR          S             30    DIM(100)                                                 
     D SDERROR         S             42    DIM(100)                                                 
      *                                                                                             
      * Parámetros para PU2600 (Busqueda precio Compra)                                             
      *                                                                                             
     D  @PECIAS        S                   LIKE(C0CIAS)                                             
     D  @PECUST        S                   LIKE(S5CUST)                                             
     D  @PEPRVR        S                   LIKE(C0PRVR)                                             
     D  @PETCOJ        S                   LIKE(NDTCOJ)                                             
     D  @PEARVM        S             25                                                             
     D  @PEFPED        S                   LIKE(S5FREP)                                             
     D  @PECANT        S                   LIKE(S5CANT)                                             
     D  @PEUNIM        S                   LIKE(M5UNIM)                                             
     D  @PEMONP        S                   LIKE(C0MONE)                                             
     D  @PEMONB        S                   LIKE(C0MONE)                                             
     D  @PEZXCO        S             12  7                                                          
     D  @PECLTR        S                   LIKE(C0CLTR)                                             
     D  @PEPREC        S                   LIKE(S5PREC)                                             
     D  @PEDTO1        S                   LIKE(S5DTO1)                                             
     D  @PEDTO2        S                   LIKE(S5DTO1)                                             
     D  @PEDTO3        S                   LIKE(S5DTO1)                                             
     D  @PEDTO4        S                   LIKE(S5DTO1)                                             
     D  @PEMONE        S                   LIKE(C0MONE)                                             
     D  @PECADP        S                   LIKE(S5CADP)                                             
     D  @PEUNDP        S                   LIKE(S5UNDP)                                             
     D  @PETCST        S                   LIKE(M5TCS1)                                             
     D  @PETPPR        S              1                                                             
     D  @PEPRMO        S                   LIKE(S5PRMO)                                             
     D  @PEERR         S              1                                                             
     D  @PTIPJ         S              1                                                             
FQ710D  @PJOBC         S             18                                                             
FQ710D  @PEDLGA        S              5                                                             
FQ710D  @PENPCO        S             10                                                             
FQ710D  @PETPED        S              2                                                             
FQ710D  @PEDATP        S                   LIKE(T0DATP)                                             
FQ710D  @PENOPL        S                   LIKE(T0NOPL)                                             
FQ710D  @PELINE        S              3p 0                                                          
                                                                                                    
      * Parámetros para GX0150 (Entorno Movex)                                                      
     D  @PECONO        S              3P 0                                                          
     D  @PEDIVI        S              3                                                             
     D  @PEUSER        S             10                                                             
     D  @PEVAL         S            250                                                             
     D  ZXVAL          DS                                                                           
     D    MXCONO               1      3                                                             
     D    MXDIVI               4      6                                                             
     D    MXIDIO               7      8                                                             
     D    MXMONE               9     11                                                             
     D    MXRESTO             12    250                                                             
                                                                                                    
     D  ZXCANT         S                   LIKE(S5CANT)                                             
     D  ZXCANP         S                   LIKE(S5CANT)                                             
14060D  ZXCANC         S                   LIKE(S5CANT)                                             
14060D  ZXNPC1         S                   LIKE(S5NPCO)                                             
     D  ZXTCOJ         S                   LIKE(NDTCOJ)                                             
     D  ZXARVM         S             25                                                             
     D  ZYARVM         S             25                                                             
     D  ZXTCST         S                   LIKE(M5TCS1)                                             
     D  ZXUNIM         S                   LIKE(M5UNIM)                                             
     D  ZXCIAD         S                   LIKE(S5CIAS)                                             
     D  ZXARVP         S                   LIKE(C3ARVP)                                             
     D  ZXCOE1         S                   LIKE(SACANS)                                             
     D  ZXCOE2         S                   LIKE(SACANS)                                             
     D  ZXCOA1         S                   LIKE(SACANS)                                             
     D  ZXCOA2         S                   LIKE(SACANS)                                             
14070D  ZXCMI1         S                   LIKE(SACANS)                                             
14070D  ZXCMI2         S                   LIKE(SACANS)                                             
     D  ZXCIA3         S                   LIKE(T0CIA3)                                             
     D  ZXDLG3         S                   LIKE(T0DLG3)                                             
     D  ZXNPC3         S                   LIKE(T0NPC3)                                             
     D  ZXTPE3         S                   LIKE(T0TPE3)                                             
     D  ZXDAT3         S                   LIKE(T0DAT3)                                             
     D  ZXNOP3         S                   LIKE(T0NOP3)                                             
     D  ZXLIN3         S                   LIKE(T0LIN3)                                             
     D  ZXWIND         S              1                                                             
     D  ZXDEL          S              1                                                             
     D  ZXINCI         S              3                                                             
     D  ZXNDDP         S              4  0                                                          
     D  ZW             S              4  0                                                          
     D  X              S              4  0                                                          
     D  LIBLMVX        S             10                                                             
I0184D  LIBLAQA        S             10                                                             
     D  FileArti_erp   S             21                                                             
79419D  FileStok_erp   s             21                                                             
76211D  FileStst_erp   S             21                                                             
79419D  FileAlma_erp   s             21                                                             
     D  FileTr36_erp   S             21                                                             
     D  FileWr36_erp   S             21                                                             
     D  FileTr26_erp   S             21                                                             
     D  FileWr26_erp   S             21                                                             
     D  File_mitmas    S             21                                                             
     D  File_cmndiv    S             21                                                             
19D12D  File_mitbal    S             21                                                             
19D12D  File_mitfac    S             21                                                             
I0184D  File_ZAQITN    S             21                                                             
I0184D  File_GMTABD    S             21                                                             
C2559D  File_ooline    S             21                                                             
C3820D  File_oolin0    S             21                                                             
FQ942D  File_mpdhed    S             21                                                             
FQ942D  FileCojc_erp   S             21                                                             
FQ710D  ZXIMPEXP       S                   LIKE(T3LIME)                                             
FQ710D  ZXFURE         S                   LIKE(T0FURE)                                             
FQ710D  ZXFURED        S               D   DATFMT(*ISO)                                             
FQ710D  ZXERROVAL      S              1  0                                                          
FQ710D  ZXCIAS3        S                   LIKE(T0CIAS)                                             
FQ710D  ZXDLGA3        S                   LIKE(T0DLGA)                                             
FQ710D  ZXNPCO3        S                   LIKE(T0NPCO)                                             
FQ710D  ZXTPED3        S                   LIKE(T0TPED)                                             
FQ710D  ZXDATP3        S                   LIKE(T0DATP)                                             
FQ710D  ZXNOPL3        S                   LIKE(T0NOPL)                                             
FQ710D  ZXLINE3        S                   LIKE(T0LINE)                                             
FQ710D  ZXARV13        S                   LIKE(T0ARV1)                                             
FQ710D  ZXCOM23        S                   LIKE(T0COM2)                                             
FQ710D  ZXCIAS4        S                   LIKE(T0CIAS)                                             
FQ710D  ZXCUST4        S                   LIKE(T0CUST)                                             
FQ710D  ZXTDI14        S                   LIKE(T0TDI1)                                             
FQ710D  ZXDLGA4        S                   LIKE(T0DLGA)                                             
FQ710D  ZXNPCO4        S                   LIKE(T0NPCO)                                             
FQ710D  ZXTPED4        S                   LIKE(T0TPED)                                             
FQ710D  ZXDATP4        S                   LIKE(T0DATP)                                             
FQ710D  ZXNOPL4        S                   LIKE(T0NOPL)                                             
FQ710D  ZXLINE4        S                   LIKE(T0LINE)                                             
FQ710D  ZXARV14        S                   LIKE(T0ARV1)                                             
FQ710D  ZXCOM24        S                   LIKE(T0COM2)                                             
FQ710D  ZXNPC34        S                   LIKE(T0NPC3)                                             
FQ710D  ZXLIN34        S                   LIKE(T0LIN3)                                             
FQ710D  ZXSACANS       S                   LIKE(S5CANT)                                             
15091D  ZXSACAN2       S                   LIKE(S5CANT)                                             
FQ710D  ZXIMPO         S                   LIKE(T0IMPO)                                             
FQ710D  ZXFOPR         S                   LIKE(T0FOPR)                                             
FQ710D  ZXCONS         S              1  0                                                          
FQ942D  ZXCJTO_PROD    S              1                                                             
FQ942D  ZXCIAS_CJTO    S              3                                                             
FQ942D  ZXES_COMPO     S              1                                                             
CR653D  ZXPVEX         S              1                                                             
C5958D* KitAsigPrv     S               n                                                            
E7218D  KitAsigPrv     S               n                                                            
79419D  ZXCLAS         S              2                                                             
                                                                                                    
     D                 DS                                                                           
     D  ZXARVMX                1     25                                                             
     D    ZXARTIX              1     15                                                             
     D    ZXVARIX             16     18                                                             
     D    ZXMODEX             19     21                                                             
                                                                                                    
     D  A_M5AMPL       DS                                                                           
     D    A_M5CROP            60     61                                                             
                                                                                                    
     D  PPBL10         DS                                                                           
     D    PPSERV               6      6                                                             
     D    PPCTBP               8      8                                                             
     D    PPMVXV               9      9                                                             
     D    PPMVXE              10     10                                                             
                                                                                                    
     D  PPAMPL         DS                                                                           
     D    PPCROP               6      6                                                             
                                                                                                    
     D                 DS                                                                           
     D  WWEXTE                 1     42                                                             
     D    S01TLIN              1      3                                                             
     D    S01LINE              5      7                                                             
     D    S01TART              9     11                                                             
     D    S01ARTI             13     27                                                             
     D    S01TPRO             29     31                                                             
     D    S01PROV             33     42                                                             
                                                                                                    
31053D  ZXCANT_CJTO    S                   LIKE(S5CANT)                                             
CR653D  C0AMP2         DS                                                                           
CR653D  C0PEVT                 1      1                                                             
CR653D                                                                                              
Q4132D ZXEXCEPCION     S              5S 0                                                          
CR653D  @XCIAS         S                   LIKE(M5CIAS)                                             
CR653D  @XARTI         S                   LIKE(M5ARTI)                                             
CR653D  @XVARI         S                   LIKE(M5VARI)                                             
CR653D  @XMODE         S                   LIKE(M5MODE)                                             
CR653D  @XPRVR         S                   LIKE(M5PRVR)                                             
CR653D  @XGRUP         S              1                                                             
CR653D  @XPEVT         S              1                                                             
C1579D  ZXPWEB         S              1                                                             
C1579D  ZXPRVR         S                   LIKE(M5PRVR)                                             
C1579D  ZXPRVD         S                   LIKE(C0DES1)                                             
C1983** Parametros MMTAB1                                                                           
C1983D  @PCLTA         S                   LIKE(PECLTA)                                             
C1983D  @PCTAB         S                   LIKE(PECTAB)                                             
C1078D  ZXPRVR_DOM     S             10                                                             
C1078D  ZXPRVR_7       S             10                                                             
ol205   dcl-s g0LOGE like(AL_M0LOGE) inz;                                                           
79419 *                                                                                             
79419 * Almacén y Dlga del almacén de Trace                                                         
79419D   zxMagaTr      S              5                                                             
79419D   zxDlgaTr      S              5                                                             
79419 *                                                                                             
79419 * Nivel de red de la empresa (FAB/OL)                                                         
79419D   zxFABOL       S               N                                                            
I0184 *                                                                                             
I0184D  ZXMULTIPLA     S               N                                                            
I0184 *                                                                                             
I0184D  GET_FACI       PR                  LIKE(MMCIAS)                                             
I0184D    @DIVI                            LIKE(MMPROP) VALUE                                       
I0184D    @FACI                            LIKE(MMCIAS) VALUE                                       
I0184D    @ITNO                            LIKE(MMITNO) VALUE                                       
F-2OLD  @PECIA         S                   LIKE(S5CIAS)                                             
F-2OLD  @PALMA         S                   LIKE(m1maga)                                             
F-2OLD  @PTIPO         S              1                                                             
F-2OLD  @PRESP         S                   like(m1maga)                                             
E7345dxbwhlo           s                   like(mbwhlo)                                             
      **********************************************************************                        
      * Estructura Programa                                                                         
      **********************************************************************                        
                                                                                                    
      * Entrada de parámetros                                                                       
     C     *ENTRY        PLIST                                                                      
     C                   PARM                    @PCIAS                                             
     C                   PARM                    @PDLGA                                             
     C                   PARM                    @PNPCO                                             
     C                   PARM                    @PTPED                                             
     C                   PARM                    @PDATP                                             
     C                   PARM                    @PNOPL                                             
     C                   PARM                    @PLINE                                             
     C                   PARM                    @PARV1                                             
     C                   PARM                    @PCOM2                                             
     C                   PARM                    @PCUST                                             
     C                   PARM                    @PTDI1                                             
     C                   PARM                    @PEDAU                                             
     C                   PARM                    @PLOGI                                             
     C                   PARM                    @PORIG                                             
     C                   PARM                    @PINTE                                             
     C                   PARM                    @PERRO                                             
     C                   PARM                    @PINCI                                             
C1078C                   PARM                    @PLOGE                                             
OL885C                   CLEAR                   ZXERROR_URG       1                                
OL885C                   IF        @PERRO='D'                                                       
OL885C                   EVAL      ZXERROR_URG='D'                                                  
OL885C                   CLEAR                   @PERRO                                             
OL885C                   ENDIF                                                                      
                                                                                                    
      * Definición Claves Ficheros                                                                  
Q4132c     keiexce       klist                                                                      
Q4132c                   kfld                    z0file                                             
Q4132c                   kfld                    z0cias                                             
Q4132c                   kfld                    z0pais                                             
Q4132c                   kfld                    z0grp2                                             
Q4132c                   kfld                    z0cust                                             
Q4132c                   kfld                    z0camp                                             
     C     KEDTRLP00     KLIST                                                                      
     C                   KFLD                    T0CIAS                                             
     C                   KFLD                    T0DLGA                                             
     C                   KFLD                    T0NPCO                                             
     C                   KFLD                    T0TPED                                             
     C                   KFLD                    T0DATP                                             
     C                   KFLD                    T0NOPL                                             
     C                   KFLD                    T0LINE                                             
                                                                                                    
     C     KEDTRLP00P    KLIST                                                                      
     C                   KFLD                    T0CIAS                                             
     C                   KFLD                    T0DLGA                                             
     C                   KFLD                    T0NPCO                                             
     C                   KFLD                    T0TPED                                             
     C                   KFLD                    T0DATP                                             
     C                   KFLD                    T0NOPL                                             
                                                                                                    
     C     KEDTRLP10     KLIST                                                                      
     C                   KFLD                    T0CIA1                                             
     C                   KFLD                    T0DLG1                                             
     C                   KFLD                    T0NPC1                                             
     C                   KFLD                    T0TPE1                                             
     C                   KFLD                    T0DAT1                                             
     C                   KFLD                    T0NOP1                                             
     C                   KFLD                    T0LIN1                                             
                                                                                                    
     C     KEDTRLP10X    KLIST                                                                      
     C                   KFLD                    T0CIA1                                             
     C                   KFLD                    T0DLG1                                             
     C                   KFLD                    T0NPC1                                             
     C                   KFLD                    T0TPE1                                             
     C                   KFLD                    T0DAT1                                             
     C                   KFLD                    T0NOP1                                             
     C                   KFLD                    T0LIN1                                             
     C                   KFLD                    T0ARV1                                             
                                                                                                    
     C     KEDTRLP10P    KLIST                                                                      
     C                   KFLD                    T0CIA1                                             
     C                   KFLD                    T0DLG1                                             
     C                   KFLD                    T0NPC1                                             
     C                   KFLD                    T0TPE1                                             
     C                   KFLD                    T0DAT1                                             
     C                   KFLD                    T0NOP1                                             
                                                                                                    
     C     KEDTRLP20     KLIST                                                                      
     C                   KFLD                    T0CIA2                                             
     C                   KFLD                    T0DLG2                                             
     C                   KFLD                    T0NPC2                                             
     C                   KFLD                    T0TPE2                                             
     C                   KFLD                    T0DAT2                                             
     C                   KFLD                    T0NOP2                                             
     C                   KFLD                    T0LIN2                                             
                                                                                                    
     C     KEDTRLP20X    KLIST                                                                      
     C                   KFLD                    T0CIA2                                             
     C                   KFLD                    T0DLG2                                             
     C                   KFLD                    T0NPC2                                             
     C                   KFLD                    T0TPE2                                             
     C                   KFLD                    T0DAT2                                             
     C                   KFLD                    T0NOP2                                             
     C                   KFLD                    T0LIN2                                             
     C                   KFLD                    T0COM2                                             
                                                                                                    
     C     KEDTRLP20P    KLIST                                                                      
     C                   KFLD                    T0CIA2                                             
     C                   KFLD                    T0DLG2                                             
     C                   KFLD                    T0NPC2                                             
     C                   KFLD                    T0TPE2                                             
     C                   KFLD                    T0DAT2                                             
     C                   KFLD                    T0NOP2                                             
                                                                                                    
     C     KEDTRLP30     KLIST                                                                      
     C                   KFLD                    T0CIA3                                             
     C                   KFLD                    T0DLG3                                             
     C                   KFLD                    T0NPC3                                             
     C                   KFLD                    T0TPE3                                             
     C                   KFLD                    T0DAT3                                             
     C                   KFLD                    T0NOP3                                             
     C                   KFLD                    T0LIN3                                             
                                                                                                    
     C     KEDTRLP30P    KLIST                                                                      
     C                   KFLD                    T0CIA3                                             
     C                   KFLD                    T0DLG3                                             
     C                   KFLD                    T0NPC3                                             
     C                   KFLD                    T0TPE3                                             
     C                   KFLD                    T0DAT3                                             
     C                   KFLD                    T0NOP3                                             
FQ710                                                                                               
FQ710C     KEDTRLP300    KLIST                                                                      
FQ710C                   KFLD                    T0CIA3                                             
FQ710C                   KFLD                    T0DLG3                                             
FQ710C                   KFLD                    T0NPC3                                             
FQ710C                   KFLD                    T0TPE3                                             
FQ710C                   KFLD                    T0DAT3                                             
FQ710C                   KFLD                    T0NOP3                                             
FQ710C                   KFLD                    T0LIN3                                             
FQ710C                   KFLD                    T0CIAS                                             
FQ710C                   KFLD                    T0DLGA                                             
FQ710C                   KFLD                    T0NPCO                                             
FQ710C                   KFLD                    T0TPED                                             
FQ710C                   KFLD                    T0DATP                                             
FQ710C                   KFLD                    T0NOPL                                             
FQ710C                   KFLD                    T0LINE                                             
FQ710C                   KFLD                    T0ARV1                                             
FQ710C                   KFLD                    T0COM2                                             
                                                                                                    
     C     KEDTRLP40     KLIST                                                                      
     C                   KFLD                    T0CIAS                                             
     C                   KFLD                    T0CUST                                             
     C                   KFLD                    T0TDI1                                             
FQ710                                                                                               
FQ710C     KEDTRLP400    KLIST                                                                      
FQ710C                   KFLD                    T0CIAS                                             
FQ710C                   KFLD                    T0CUST                                             
FQ710C                   KFLD                    T0TDI1                                             
FQ710C                   KFLD                    T0DLGA                                             
FQ710C                   KFLD                    T0NPCO                                             
FQ710C                   KFLD                    T0TPED                                             
FQ710C                   KFLD                    T0DATP                                             
FQ710C                   KFLD                    T0NOPL                                             
FQ710C                   KFLD                    T0LINE                                             
FQ710C                   KFLD                    T0ARV1                                             
FQ710C                   KFLD                    T0COM2                                             
FQ710C                   KFLD                    T0NPC3                                             
FQ710C                   KFLD                    T0LIN3                                             
                                                                                                    
     C     KPMLIBL       KLIST                                                                      
     C                   KFLD                    PPCIAS                                             
C1579                                                                                               
C1579C     kcocape       KLIST                                                                      
C1579C                   KFLD                    S0CIAS                                             
C1579C                   KFLD                    S0DLGA                                             
C1579C                   KFLD                    S0NPCO                                             
C1579C                   KFLD                    S0TPED                                             
C1579C                   KFLD                    S0DATP                                             
C1579C                   KFLD                    S0NOPL                                             
                                                                                                    
     C     KCODEPE       KLIST                                                                      
     C                   KFLD                    S5CIAS                                             
     C                   KFLD                    S5DLGA                                             
     C                   KFLD                    S5NPCO                                             
     C                   KFLD                    S5TPED                                             
     C                   KFLD                    S5DATP                                             
     C                   KFLD                    S5NOPL                                             
     C                   KFLD                    S5LINE                                             
                                                                                                    
     C     KCODEPE0      KLIST                                                                      
     C                   KFLD                    S5CIAS                                             
     C                   KFLD                    S5DLGA                                             
     C                   KFLD                    S5NPCO                                             
     C                   KFLD                    S5TPED                                             
     C                   KFLD                    S5DATP                                             
     C                   KFLD                    S5NOPL                                             
                                                                                                    
     C     KMSARTI       KLIST                                                                      
     C                   KFLD                    A_M5ARTI                                           
     C                   KFLD                    A_M5VARI                                           
     C                   KFLD                    A_M5MODE                                           
                                                                                                    
     C     KMSARTI00     KLIST                                                                      
     C                   KFLD                    M5CIAS                                             
     C                   KFLD                    M5ARTI                                             
     C                   KFLD                    M5VARI                                             
     C                   KFLD                    M5MODE                                             
                                                                                                    
     C     KPUPROV       KLIST                                                                      
     C                   KFLD                    C0CIAS                                             
     C                   KFLD                    C0PRVR                                             
                                                                                                    
     C     KPUPRP0       KLIST                                                                      
     C                   KFLD                    C3CIAS                                             
     C                   KFLD                    C3PRVR                                             
     C                   KFLD                    C3ARVM                                             
                                                                                                    
     C     KMSCOJC       KLIST                                                                      
     C                   KFLD                    NDCIAS                                             
     C                   KFLD                    NDARTI                                             
     C                   KFLD                    NDVARI                                             
     C                   KFLD                    NDMODE                                             
     C                   KFLD                    NDTCOJ                                             
                                                                                                    
     C     KCOAPRP01     KLIST                                                                      
     C                   KFLD                    SACIAS                                             
     C                   KFLD                    SATNPE                                             
     C                   KFLD                    SADLGA                                             
     C                   KFLD                    SANPCO                                             
     C                   KFLD                    SATPED                                             
     C                   KFLD                    SADATP                                             
     C                   KFLD                    SANOPL                                             
     C                   KFLD                    SALINE                                             
     C                   KFLD                    SANPRP                                             
                                                                                                    
     C     KCOAPRC       KLIST                                                                      
     C                   KFLD                    SBCIAS                                             
     C                   KFLD                    SBDLGA                                             
     C                   KFLD                    SBNPRP                                             
                                                                                                    
     C     KCOAPRP00     KLIST                                                                      
     C                   KFLD                    SACIAS                                             
     C                   KFLD                    SATNPE                                             
     C                   KFLD                    SADLGA                                             
     C                   KFLD                    SANPCO                                             
     C                   KFLD                    SATPED                                             
     C                   KFLD                    SADATP                                             
     C                   KFLD                    SANOPL                                             
     C                   KFLD                    SALINE                                             
                                                                                                    
     C     KTR003602     KLIST                                                                      
     C                   KFLD                    C5CIAS                                             
     C                   KFLD                    C5DLGA                                             
     C                   KFLD                    C5NPCO                                             
     C                   KFLD                    C5TPED                                             
     C                   KFLD                    C5DATP                                             
     C                   KFLD                    C5NOPL                                             
     C                   KFLD                    C5LINE                                             
                                                                                                    
01070C     KTR002602     KLIST                                                                      
01070C                   KFLD                    TR_S5CIAS                                          
01070C                   KFLD                    TR_S5DLGA                                          
01070C                   KFLD                    TR_S5NPCO                                          
01070C                   KFLD                    TR_S5TPED                                          
01070C                   KFLD                    TR_S5DATP                                          
01070C                   KFLD                    TR_S5NOPL                                          
01070C                   KFLD                    TR_S5LINE                                          
                                                                                                    
     C     KGXEQAR       KLIST                                                                      
     C                   KFLD                    Q1CIAS                                             
     C                   KFLD                    Q1ARVM                                             
                                                                                                    
     C     KMITMAS00     KLIST                                                                      
     C                   KFLD                    MMCONO                                             
     C                   KFLD                    MMITNO                                             
                                                                                                    
     C     KZAQBAL00     KLIST                                                                      
     C                   KFLD                    MBCONO                                             
     C                   KFLD                    MBWHLO                                             
     C                   KFLD                    MBITNO                                             
                                                                                                    
25052C     KMITBAL00     KLIST                                                                      
25052C                   KFLD                    MBCONO                                             
25052C                   KFLD                    MBWHLO                                             
25052C                   KFLD                    MBITNO                                             
                                                                                                    
     C     KCMNDIV00     KLIST                                                                      
     C                   KFLD                    CCCONO                                             
     C                   KFLD                    CCDIVI                                             
                                                                                                    
     C     KAQPEDI00     KLIST                                                                      
     C                   KFLD                    Z1CONO                                             
     C                   KFLD                    Z1DIVI                                             
I0184 *                                                                                             
I0184C     KZAQITN00     KLIST                                                                      
I0184C                   KFLD                    MMCONO                                             
I0184C                   KFLD                    MMITNO                                             
I0184 *                                                                                             
I0184C     KGMTABD01     KLIST                                                                      
I0184C                   KFLD                    T1CTAB                                             
I0184C                   KFLD                    T1DESC                                             
                                                                                                    
01022C     KMITFAC00     KLIST                                                                      
01022C                   KFLD                    M9CONO                                             
01022C                   KFLD                    M9FACI                                             
01022C                   KFLD                    M9ITNO                                             
                                                                                                    
C2559C     KOOLINE40     KLIST                                                                      
C2559C                   KFLD                    OBCONO                                             
C2559C                   KFLD                    OBORNO                                             
C2559C                   KFLD                    OBRORC                                             
C3820C     KOOLINE00     KLIST                                                                      
C3820C                   KFLD                    OBCONO                                             
C3820C                   KFLD                    OBORNO                                             
C3820C                   KFLD                    OBPONR                                             
                                                                                                    
     C     KUTCOM0       KLIST                                                                      
     C                   KFLD                    U0CIAS                                             
     C                   KFLD                    U0TENV                                             
     C                   KFLD                    U0CLP0                                             
     C                   KFLD                    U0CLP2                                             
                                                                                                    
     C     KMSTRG1       KLIST                                                                      
     C                   KFLD                    NZCTAB                                             
     C                   KFLD                    NZCLTA                                             
     C                   KFLD                    NZIDIO                                             
                                                                                                    
     C     KPMTAB2       KLIST                                                                      
     C                   KFLD                    PECTAB                                             
     C                   KFLD                    PECLTA                                             
                                                                                                    
     C     KPMEMPR       KLIST                                                                      
     C                   KFLD                    P7CIAS                                             
     C                   KFLD                    P7DLGA                                             
14060                                                                                               
14060C     KCOXDOC       KLIST                                                                      
14060C                   KFLD                    TKCIAS                                             
14060C                   KFLD                    TKDLGA                                             
14060C                   KFLD                    TKNPCO                                             
14060C                   KFLD                    TKTPED                                             
14060C                   KFLD                    TKDATP                                             
14060C                   KFLD                    TKNOPL                                             
FQ710                                                                                               
FQ710C     KEDPARM       KLIST                                                                      
FQ710C                   KFLD                    T3CIAS                                             
FQ710C                   KFLD                    T3DLGA                                             
FQ710                                                                                               
FQ710C     KMJOB         KLIST                                                                      
FQ710C                   KFLD                    @PJOBC                                             
FQ710C                   KFLD                    JOLINE                                             
FQ710                                                                                               
FQ710C     KCOAPRP       KLIST                                                                      
FQ710C                   KFLD                    SACIAS                                             
FQ710C                   KFLD                    SANPRP                                             
FQ942                                                                                               
FQ942C     KMPDHED00     KLIST                                                                      
FQ942C                   KFLD                    H_PHCONO                                           
FQ942C                   KFLD                    H_PHFACI                                           
FQ942C                   KFLD                    H_PHPRNO                                           
FQ942C                   KFLD                    H_PHSTRT                                           
C1579 *                                                                                             
C1579C     KPMTABD       KLIST                                                                      
C1579C                   KFLD                    PECIAS                                             
C1579C                   KFLD                    PECTAB                                             
C1579C                   KFLD                    PECLTA                                             
C1078                                                                                               
C1078C     KMSALMA05     KLIST                                                                      
C1078C                   KFLD                    AL_M0CIAS                                          
C1078C                   KFLD                    AL_M0LOGE                                          
C2510                                                                                               
C2510C     KEDPARC       KLIST                                                                      
C2510C                   KFLD                    T4CIAS                                             
C2510C                   KFLD                    T4CUST                                             
I0164 *                                                                                             
C5958C*    KPUPRCJ       KLIST                                                                      
C5958C*                  KFLD                    P_C3CIAS                                           
C5958C*                  KFLD                    P_C3ARVM                                           
C5958C*                  KFLD                    P_C3TCOJ                                           
C5958C*                  KFLD                    P_C3PRVR                                           
I0164 *                                                                                             
C5958C*    KPUPRCJa      KLIST                                                                      
C5958C*                  KFLD                    P_C3CIAS                                           
C5958C*                  KFLD                    P_C3ARVM                                           
C5958C*                  KFLD                    P_C3TCOJ                                           
C1078                                                                                               
E7218C     KPUPRCJ       KLIST                                                                      
E7218C                   KFLD                    P_C3CIAS                                           
E7218C                   KFLD                    P_C3ARVM                                           
E7218C                   KFLD                    P_C3TCOJ                                           
E7218C                   KFLD                    P_C3PRVR                                           
E7218 *                                                                                             
E7218C     KPUPRCJa      KLIST                                                                      
E7218C                   KFLD                    P_C3CIAS                                           
E7218C                   KFLD                    P_C3ARVM                                           
E7218C                   KFLD                    P_C3TCOJ                                           
E7218 *                                                                                             
79419C     KMSSTOK       KLIST                                                                      
79419C                   KFLD                    M1CIAS                                             
79419C                   KFLD                    M1MAGA                                             
79419C                   KFLD                    M1ARTI                                             
79419C                   KFLD                    M1VARI                                             
79419C                   KFLD                    M1MODE                                             
79419 *                                                                                             
76211C     KMSSTST       KLIST                                                                      
76211C                   KFLD                    M6CIAS                                             
76211C                   KFLD                    M6DLGA                                             
76211C                   KFLD                    M6ARTI                                             
76211C                   KFLD                    M6VARI                                             
76211C                   KFLD                    M6MODE                                             
79419C                   KFLD                    M6NETL                                             
79419 *                                                                                             
79419C     KMSALMA08     KLIST                                                                      
79419C                   KFLD                    M0CIAS                                             
79419C                   KFLD                    M0TAL1                                             
79419 *                                                                                             
76211                                                                                               
C1078C                   IF        %PARMS=18                                                        
C1078C                   EVAL      AL_M0CIAS=@PCIAS                                                 
C1078C                   EVAL      AL_M0LOGE=@PLOGE                                                 
OL205                    g0LOGE = @PLOGE;                                                           
C1078C     KMSALMA05     CHAIN     MSALMA05                                                         
C1078C                   IF        %FOUND AND AL_M0TAL1='7'                                         
C1078C                   EVAL      ZXPRVR_7=AL_M0PRVR                                               
C1078C                   ENDIF                                                                      
C1078C                   ENDIF                                                                      
OL885                                                                                               
OL885C     KEDPAR2       KLIST                                                                      
OL885C                   KFLD                    ED_T4CIA1                                          
OL885C                   KFLD                    ED_T4TREG                                          
OL885C                   KFLD                    ED_T4DLGA                                          
OL885C                   KFLD                    ED_T4PRVR                                          
OL885C                   KFLD                    ED_T4ARVT                                          
OL885C                   KFLD                    ED_T4FAMT                                          
OL885C                   KFLD                    ED_T4PRIO                                          
                                                                                                    
     C* '0' SIGNIFICA BATCH                                                                         
     C* '1' SIGNIFICA INTERACTIVO                                                                   
     C                   CALL      'RTVTIJ'                                                         
     C                   PARM      *BLANKS       @PTIPJ                                             
                                                                                                    
     C                   EVAL      P7CIAS=@PCIAS                                                    
     C                   EVAL      P7DLGA=@PDLGA                                                    
     C     KPMEMPR       CHAIN     PMEMPR                                                           
                                                                                                    
      * Si estoy en Interactivo abro fichero pantalla                                               
b01  C                   IF        @PTIPJ>'0'                                                       
     C                   OPEN      ED0051FM                                                         
     C                   EVAL      CCCCTIT='TED0051'                                                
     C                   EVAL      PPPCMD1='CMD7805'                                                
x01  C                   ELSE                                                                       
e01  C                   ENDIF                                                                      
                                                                                                    
      * Inicializo Series                                                                           
FQ710C                   EVAL      ZXINCI = @PINCI                                                  
     C                   MOVEA     *BLANKS       SERROR                                             
     C                   MOVEA     *BLANKS       SDERROR                                            
     C                   EVAL      @PERRO = ' '                                                     
     C                   EVAL      ZXWIND = '0'                                                     
     C                   EVAL      ZXVAL = *BLANKS                                                  
     C                   EVAL      ZXNDDP=0                                                         
     C                   EVAL      @PINCI = *BLANKS                                                 
FQ710C                   EVAL      ZXIMPEXP = 0                                                     
FQ710C                   MOVEL     *DATE         ZXFURE                                             
                                                                                                    
FQ710 * Validación de Confirmación de toda una preparación en TRACE                                 
FQ710C                   IF        @PEDAU = '305' And @PINTE = 3                                    
FQ710C                   EVAL      ZXWIND = '1'                                                     
FQ710C                   EXSR      CS_IMPOEXP2                                                      
FQ710C                   IF        ZXFOPR = 1                                                       
FQ710C                   GOTO      TPROCESO                                                         
FQ710C                   ENDIF                                                                      
FQ710C                   GOTO      TFINREAD                                                         
FQ710C                   ENDIF                                                                      
FQ710                                                                                               
      * Lectura Fichero Trazas Según Origen e Integridad Datos EDTRLP                               
     C                   EVAL      ZXDEL = '0'                                                      
     C                   EXSR      CS_READFIL                                                       
b01  C                   IF        EOF=*ON                                                          
s02  C                   SELECT                                                                     
14060 * En el caso de validar la preparación, debe existir el EDTRLP                                
14060 * En caso contrario, No preparamos.                                                           
FQ710C                   WHEN      @PEDAU = '303' And @PINTE = 1                                    
14060C                   EVAL      @PERRO = '1'                                                     
14060C                   EVAL      ZXWIND = '1'                                                     
14060C                   EVAL      ZXINCI = '004'                                                   
14060C                   EXSR      CS_DESERR                                                        
14060 * Validación Altas. (Aún no existe EDTRLP)                                                    
     C                   WHEN      @PEDAU = '001' Or @PEDAU = '010'                                 
     C                             Or @PEDAU = '002'                                                
     C                   EVAL      ZXWIND = '1'                                                     
     C                   EXSR      CS_ARTICUL                                                       
R3820C*                  EXSR      CS_CONTPED_2                                                     
R3820C                   EXSR      CS_CONTPED_3                                                     
FQ942 * Validación Altas. (Aún no existe EDTRLP ni codepe                                           
FQ942C                   WHEN      @PEDAU = '404'                                                   
FQ942C                   EVAL      ZXWIND = '0'                                                     
C1579C                   exsr      CS_POOLWEB                                                       
C1579 * Si es PoolWeb no permitimos altas                                                           
C1579C                   if        zxpweb='1'                                                       
C1579C                   eval      zxinci = '022'                                                   
C1579C                   EVAL      @PERRO = '1'                                                     
C1579C                   EVAL      ZXWIND = '1'                                                     
C1579C                   eval      T0ARVM = @PARV1                                                  
C1579C                   exsr      CS_DESERR                                                        
C1579C                   else                                                                       
FQ942C                   EXSR      CS_ARTIC404                                                      
C1579C                   ENDIF                                                                      
14060 * Validación Algoritmo de decisión. (Aún no existe EDTRLP)                                    
     C                   WHEN      @PEDAU = '403'                                                   
C1579C                   exsr      CS_POOLWEB                                                       
E7146 *     C                   EVAL      ZXWIND = '0'                                              
E7146c                   eval      zxwind = '1'                                                     
     C                   EXSR      CS_ARTICUL                                                       
14060 * Para otros casos miramos si existe en EDTRLX, por si han                                    
14060 * eliminado la linea                                                                          
     C                   OTHER                                                                      
     C                   EXSR      CS_READFIX                                                       
b03  C                   IF        EOF=*OFF                                                         
     C                   EVAL      ZXDEL = '1'                                                      
e03  C                   ENDIF                                                                      
e02  C                   ENDSL                                                                      
e01  C                   ENDIF                                                                      
                                                                                                    
      * Validaciones anteriores a la existéncia de Fichero EDTRLP                                   
b01  C                   IF        EOF=*ON                                                          
b02  C                   IF        @PEDAU = '400' And ZXDEL = '0'                                   
14060C                   EVAL      @PERRO = '1'                                                     
14060C                   EVAL      ZXINCI = '004'                                                   
     C                   EVAL      ZXWIND = '0'                                                     
     C                   EXSR      CS_DESERR                                                        
e02  C                   ENDIF                                                                      
e01  C                   ENDIF                                                                      
                                                                                                    
      * Si ya está eliminado en EDTRLX no valido eventos                                            
b01  C                   IF        ZXDEL = '1'                                                      
14060 * En caso de Confirmar la Preparación, si han eliminado                                       
14060 * EDTRLP, no dejo Confirmar.                                                                  
14060C                   IF        @PEDAU = '305'                                                   
14060C                   EVAL      @PERRO = '1'                                                     
14060C                   EVAL      ZXWIND = '1'                                                     
14060C                   EVAL      ZXINCI = '004'                                                   
14060C                   EXSR      CS_DESERR                                                        
14060C                   ENDIF                                                                      
     C                   GOTO      TPROCESO                                                         
e01  C                   ENDIF                                                                      
      * Validaciones cuando ya existe Fichero EDTRLP                                                
d01  C                   DOW       EOF=*OFF                                                         
                                                                                                    
C1983C                   EXSR      CS_POOLWEB                                                       
      * En función del código de Auditoria hago las validaciones                                    
s02  C                   SELECT                                                                     
C1983 * Validaciones No permitir modificar pedidos PoolWeb/por usuario                              
C1983C                   WHEN      @PEDAU='005'   AND ZXPWEB='1'                                    
C1983C                             OR @PEDAU='006'   AND ZXPWEB='1'                                 
C1983C                             OR @PEDAU='007'   AND ZXPWEB='1'                                 
C1983C                             OR @PEDAU='008'   AND ZXPWEB='1'                                 
C1983C                             OR @PEDAU='011'   AND ZXPWEB='1'                                 
C1983C                             OR @PEDAU='012'   AND ZXPWEB='1'                                 
C1983C                             OR @PEDAU='018'   AND ZXPWEB='1'                                 
C1983C                             OR @PEDAU='019'   AND ZXPWEB='1'                                 
C1983C                             OR @PEDAU='026'   AND ZXPWEB='1'                                 
C1983C* Si pedido PoolWeb comprobar usuario que intenta modificar                                   
C1983C                   EVAL      PECIAS=@PCIAS                                                    
C1983C                   EVAL      PECTAB='USPW'                                                    
C1983C                   EVAL      PECLTA=SDSUSR                                                    
C1983C     KPMTABD       CHAIN     PMTABD                                                           
C1983C                   IF        NOT%FOUND(PMTABD)                                                
C1983C                   EVAL      zxinci = '024'                                                   
C1983C                   EVAL      @PERRO = '1'                                                     
C1983C                   EVAL      ZXWIND = '1'                                                     
C1983C                   EXSR      CS_DESERR                                                        
C1983C                   ENDIF                                                                      
      * Validaciones Anulación línea Comercial                                                      
     C                   WHEN      @PEDAU = '005'                                                   
     C                              OR @PEDAU = '009'                                               
     C                   EVAL      ZXWIND = '1'                                                     
     C                   EXSR      CS_VALXDOC                                                       
     C                   EXSR      CS_STSPR10                                                       
     C                   EXSR      CS_CONTPED                                                       
     C                   EXSR      CS_CANTSER                                                       
R3820C*                  EXSR      CS_CONTPED_2                                                     
R3820C                   EXSR      CS_CONTPED_3                                                     
C1579 *                                                                                             
C1579C                   if        @pedau='009'                                                     
C1579C                   exsr      CS_POOLWEB                                                       
C1579C                   if        zxpweb='1'                                                       
C1579C                   eval      zxinci = '021'                                                   
C1579C                   EVAL      @PERRO = '1'                                                     
C1579C                   EVAL      ZXWIND = '1'                                                     
C1579C                   exsr      CS_DESERR                                                        
C1579C                   endif                                                                      
C1579C                   endif                                                                      
C1579 *                                                                                             
      * Validaciones Modificaciones/anulaciones Comercial                                           
FQ787C*                  WHEN      @PEDAU = '007' Or @PEDAU = '008'                                 
FQ787C                   WHEN      @PEDAU = '007'                                                   
15090C**                           Or @PEDAU = '011' Or @PEDAU = '012'                              
15090C                             Or @PEDAU = '011'                                                
01070C                             Or @PEDAU = '013'                                                
     C                   EVAL      ZXWIND = '1'                                                     
     C                   EXSR      CS_SERVPRO                                                       
     C                   EXSR      CS_VALXDOC                                                       
     C**                 EXSR      CS_STSPR20                                                       
     C                   EXSR      CS_STSPR10                                                       
IN950C                   IF        @PEDAU<> '013'                                                   
     C                   EXSR      CS_CONTPED                                                       
ERRORC                   EXSR      CS_CONTPED_3                                                     
IN950C                   ENDIF                                                                      
R3820C*                  EXSR      CS_CONTPED_2                                                     
ERROR *                  EXSR      CS_CONTPED_3                                                     
15090C                   WHEN      @PEDAU = '012'                                                   
15090C                   EVAL      ZXWIND = '1'                                                     
15090C                   EXSR      CS_VALXDOC                                                       
15090C                   EXSR      CS_STSPR10                                                       
FQ787 *  Retener linea pedido                                                                       
FQ787C                   WHEN      @PEDAU = '008'                                                   
FQ787C                   EVAL      ZXWIND = '1'                                                     
FQ787C                   EXSR      CS_SERVPRO                                                       
FQ787C                   EXSR      CS_STSPR10                                                       
01070 *  OE Finalizar Ped vtas                                                                      
01070C                   WHEN      @PEDAU = '018'                                                   
R3820C*                  EXSR      CS_CONTPED_2                                                     
R3820C                   EXSR      CS_CONTPED_3                                                     
01070C                   EVAL      ZXWIND = '1'                                                     
01070C                   IF        S5STUL < '5'                                                     
01070C                   EXSR      CS_SERVPRO                                                       
01070C                   EXSR      CS_VALXDOC                                                       
01070C                   EXSR      CS_STSPR10                                                       
01070C                   EXSR      CS_CONTPED                                                       
01070C                   ENDIF                                                                      
C2559 *  Cial: cierre línea automático                                                              
C2559C                   WHEN      @PEDAU = '051'                                                   
C2559C                   EVAL      ZXWIND = '1'                                                     
C2559C                   IF        S5STUL < '5'                                                     
C2559C                   EXSR      CS_SERVPRO                                                       
C2559C                   EXSR      CS_VALXDOC                                                       
H0112 *  Nos interesa validar si hay algo en preparación                                            
H0112 *C2559C                   EXSR      CS_STSPR10                                                
C2559C                   EXSR      CS_CONTPED_2                                                     
R3820C                   EXSR      CS_CONTPED_3                                                     
C2559C                   ENDIF                                                                      
01070 *  36 Reabrir Ped vta                                                                         
01070C                   WHEN      @PEDAU = '019'                                                   
01070C                   EVAL      ZXWIND = '1'                                                     
C2664C                   EXSR      CS_CANTSER                                                       
      * Validaciones cambio fecha solicitada                                                        
     C                   WHEN      @PEDAU = '014'                                                   
     C                   EVAL      ZXWIND = '1'                                                     
FQ786C*                  EXSR      CS_SERVPRO                                                       
     C**                 EXSR      CS_STSPR20                                                       
     C                   EXSR      CS_STSPR10                                                       
     C                   EXSR      CS_CONTPED                                                       
      * Validaciones Mod cant (+) pedido vtas                                                       
     C                   WHEN      @PEDAU = '006'                                                   
     C                   EVAL      ZXWIND = '1'                                                     
     C                   EXSR      CS_SERVPRO                                                       
     C                   EXSR      CS_VALXDOC                                                       
     C                   EXSR      CS_STSPR20                                                       
R3820C*                  EXSR      CS_CONTPED_2                                                     
R3820C                   EXSR      CS_CONTPED_3                                                     
FQ604 * Cambio de Observaciones o Método Entrega                                                    
FQ604C                   WHEN      @PEDAU = '026'                                                   
FQ604C                   EVAL      ZXWIND = '1'                                                     
FQ604C*06051             EXSR      CS_STSPR10                                                       
FQ604C*06051             EXSR      CS_SERVPRO                                                       
FQ710 * Forzar Preparación aunque no llegue al mínimo por Expedición                                
FQ710C                   WHEN      @PEDAU = '029' Or @PEDAU = '030'                                 
FQ710C                   EVAL      ZXWIND = '1'                                                     
FQ710C                   EXSR      CS_COMEDST                                                       
      * Validaciones de desreserva en la productiva                                                 
     C                   WHEN      @PEDAU = '221'                                                   
     C                   EVAL      ZXWIND = '1'                                                     
     C                   EXSR      CS_STSPR10                                                       
     C                   EXSR      CS_STSPR20                                                       
      * Validaciones de cambio permitido logística en la productiva                                 
     C                   WHEN      @PEDAU = '222'                                                   
     C                   EVAL      ZXWIND = '0'                                                     
     C                   EXSR      CS_CHGLOG                                                        
     C                   EXSR      CS_STSPR10                                                       
     C                   EXSR      CS_STSPR20                                                       
C1350 *Validaciones de error de bloqueo de albaranes                                                
C1350C                   WHEN      @PEDAU = '231'                                                   
C1350C                   EVAL      ZXWIND = '1'                                                     
C1350C                   EXSR      CS_PEDHOLD                                                       
C1350C                   EXSR      CS_RISKCLI                                                       
C1350 *                                                                                             
FQ710 * Validaciones cuando Trace prepara a nivel de linea                                          
FQ710C                   WHEN      @PEDAU = '303' And @PINTE = 1                                    
     C                   EVAL      ZXWIND = '0'                                                     
FQ710C                   EXSR      CS_FORPREP                                                       
FQ710C                   IF        @PERRO = '1'                                                     
FQ710C                   LEAVE                                                                      
FQ710C                   ENDIF                                                                      
14060C                   EXSR      CS_LINCERR                                                       
     C                   EXSR      CS_MODCURS                                                       
     C                   EXSR      CS_PEDHOLD                                                       
     C                   EXSR      CS_RISKCLI                                                       
     C                   EXSR      CS_VALCONJ2                                                      
FQ710C                   EXSR      CS_COENVIO                                                       
FQ710 * Validaciones cuando Trace prepara a nivel de cliente-dirección                              
FQ710C                   WHEN      @PEDAU = '303' And @PINTE = 3                                    
FQ710C                   EVAL      ZXWIND = '0'                                                     
FQ710C                   EXSR      CS_IMPOEXP                                                       
      * Validaciones cuando Trace Confirma preparación                                              
FQ710C                   WHEN      @PEDAU = '305' And @PINTE = 1                                    
     C                   EVAL      ZXWIND = '1'                                                     
14060C                   EXSR      CS_LINCERR                                                       
     C                   EXSR      CS_MODCURS                                                       
     C                   EXSR      CS_PEDHOLD                                                       
     C                   EXSR      CS_RISKCLI                                                       
     C                   EXSR      CS_VALCONJ                                                       
FQ710C                   EXSR      CS_COENVIO                                                       
     C***                EXSR      CS_INTXDOC                                                       
e02  C                   ENDSL                                                                      
                                                                                                    
b02  C                   IF        ZXDEL = '0'                                                      
     C                   EXSR      CS_READFI2                                                       
x02  C                   ELSE                                                                       
     C                   EXSR      CS_READFX2                                                       
e02  C                   ENDIF                                                                      
e01  C                   ENDDO                                                                      
FQ710C     TFINREAD      TAG                                                                        
                                                                                                    
      * Caso auditoría 222                                                                          
b01  C                   IF        @PEDAU='222'                                                     
      * Si no hay ninguna línea que permita logística productiva error                              
b02  C                   IF        ZXNDDP=0                                                         
     C                   EVAL      @PERRO = '1'                                                     
     C                   EVAL      ZXINCI = '012'                                                   
     C                   EXSR      CS_DESERR                                                        
e02  C                   ENDIF                                                                      
e01  C                   ENDIF                                                                      
FQ710                                                                                               
FQ710 * Caso validación preparación para cliente-dirección final                                    
FQ710C                   IF        @PEDAU = '303' And @PINTE = 3                                    
FQ710C                             Or @PEDAU = '305' And @PINTE = 3                                 
C2510C                   EVAL      T4CIAS=T0CIAS                                                    
C2510C                   EVAL      T4CUST=T0CUST                                                    
C2510C     KEDPARC       CHAIN     EDPARC                                                           
C2510C                   IF        %FOUND(EDPARC)                                                   
C2510C**                 IF        T4LIME>0                                                         
C2510C                   EVAL      T3LIME=T4LIME                                                    
C2510C**                 ENDIF                                                                      
C2510C**                 IF        T4DIBE>0                                                         
C2510C                   EVAL      T3DIBE=T4DIBE                                                    
C2510C**                 ENDIF                                                                      
C2510C                   ENDIF                                                                      
FQ710 * añado dias de margen a la reserva mas antigua                                               
FQ710C                   MOVEL     ZXFURE        ZXFURED                                            
FQ710C     ZXFURED       ADDDUR    T3DIBE:*D     ZXFURED                                            
FQ710C                   MOVE      ZXFURED       ZXFURE                                             
FQ710 * si la reserva mas antigua + dias de margen supera la fecha de                               
FQ710 *    hoy y el importe a preparar no llega al límite parametrizado                             
FQ710 *    No dejo preparar.                                                                        
FQ710C                   IF        ZXIMPEXP < T3LIME                                                
FQ710C                             And ZXFURE > *DATE                                               
FQ710C                   EVAL      @PERRO = '1'                                                     
FQ710C                   EVAL      ZXINCI = '016'                                                   
FQ710C                   EXSR      CS_DESERR                                                        
FQ710C                   ENDIF                                                                      
FQ710C                   ENDIF                                                                      
FQ710                                                                                               
                                                                                                    
b01  C     TPROCESO      TAG                                                                        
b01  C                   IF        @PERRO <> ' '                                                    
     C                   EXSR      CS_WINDOW                                                        
C1579c                   ELSE                                                                       
C1579 *                                                                                             
C1579 * Si es proveedor Poolweb y hacen alguna modificación en el                                   
C1579 * pedido, sacamos ventana de aviso (no de error)                                              
C1579 *                                                                                             
C1579c                   if        @pedau='005' or @pedau='006' or                                  
C1579c                             @pedau='007' or @pedau='012' or                                  
C1579c                             @pedau='018' or @pedau='019'                                     
C1589c                   exsr      CS_POOLWEB                                                       
C1579C                   if        zxpweb='1'                                                       
C1579C                   EVAL      W03PRVR=zxprvr                                                   
C1579C                   EVAL      W03DES1=zxprvd                                                   
C1579C                   EXFMT     W03                                                              
C1579c                   endif                                                                      
C1579c                   endif                                                                      
C1579c                                                                                              
e01  C                   ENDIF                                                                      
79419C                   CLOSE(E)  MSSTOK                                                           
                                                                                                    
     C                   SETON                                        LR                            
      **********************************************************************                        
      * Validación Status preparación Trace  20                                                     
      **********************************************************************                        
     C     CS_STSPR20    BEGSR                                                                      
                                                                                                    
CR653C                   IF        ZXPVEX<>'1'                                                      
b01  C                   IF        T0STCP = '20'                                                    
     C                   EVAL      @PERRO = '1'                                                     
     C                   EVAL      ZXINCI = '006'                                                   
     C                   EXSR      CS_DESERR                                                        
e01  C                   ENDIF                                                                      
CR653C                   ENDIF                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Validación Status preparación Trace  10                                                     
      **********************************************************************                        
     C     CS_STSPR10    BEGSR                                                                      
                                                                                                    
CR653C                   IF        ZXPVEX<>'1'                                                      
b01  C                   IF        T0STCP >= '10'                                                   
     C                   EVAL      @PERRO = '1'                                                     
     C                   EVAL      ZXINCI = '006'                                                   
     C                   EXSR      CS_DESERR                                                        
e01  C                   ENDIF                                                                      
CR653C                   ENDIF                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Validación Riesgo Cliente                                                                   
      **********************************************************************                        
     C     CS_RISKCLI    BEGSR                                                                      
                                                                                                    
C1350C*                  IF        T0RISK = 1                                                       
C1350C                   IF        T0RISK > 0                                                       
     C                   EVAL      @PERRO = '1'                                                     
     C                   EVAL      ZXINCI = '007'                                                   
C1350C                   IF        T0RISK = 2                                                       
C1350C                   EVAL      ZXINCI = '020'                                                   
C1350C                   ENDIF                                                                      
     C                   EXSR      CS_DESERR                                                        
e01  C                   ENDIF                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Modificación en Curso                                                                       
      **********************************************************************                        
     C     CS_MODCURS    BEGSR                                                                      
                                                                                                    
b01  C                   IF        T0MODI = 1                                                       
                                                                                                    
      * Si No es Material Propio                                                                    
b02  C                   IF        T0CIA1 > 0                                                       
      * Busco modificación en TR0036 de comercial                                                   
b03  C                   IF        T0CIA1 > 0                                                       
     C                   MOVEL     T0CIA1        PPCIAS                                             
     C                   EVAL      FileTr36_erp= 'PURLIBF' + PPCIAS +                               
     C                                          '/TR003602'                                         
     C                   OPEN (E)  TR003602                                                         
b04  C                   IF        Not %ERROR                                                       
     C                   EVAL      C5CIAS=T0CIA1                                                    
     C                   EVAL      C5DLGA=T0DLG1                                                    
     C                   EVAL      C5NPCO=T0NPC1                                                    
     C                   EVAL      C5TPED=T0TPE1                                                    
     C                   EVAL      C5DATP=T0DAT1                                                    
     C                   EVAL      C5NOPL=T0NOP1                                                    
     C                   EVAL      C5LINE=T0LIN1                                                    
     C     KTR003602     CHAIN     TR003602                                                         
b05  C                   IF        %FOUND(TR003602)                                                 
FQ710C                             And C5DEST='AS400OL'                                             
     C                   EVAL      @PERRO = '1'                                                     
     C                   GOTO      TERROR                                                           
e05  C                   ENDIF                                                                      
e04  C                   ENDIF                                                                      
     C                   CLOSE(E)  TR003602                                                         
e03  C                   ENDIF                                                                      
                                                                                                    
      * Busco modificación en WR0036 de Productiva                                                  
b03  C                   IF        T0CIA1 > 0                                                       
     C                   MOVEL     T0CIA2        PPCIAS                                             
     C                   EVAL      FileWr36_erp= 'PURLIBF' + PPCIAS +                               
     C                                          '/WR003602'                                         
     C                   OPEN (E)  WR003602                                                         
b04  C                   IF        Not %ERROR                                                       
     C                   EVAL      C5CIAS=T0CIA1                                                    
     C                   EVAL      C5DLGA=T0DLG1                                                    
     C                   EVAL      C5NPCO=T0NPC1                                                    
     C                   EVAL      C5TPED=T0TPE1                                                    
     C                   EVAL      C5DATP=T0DAT1                                                    
     C                   EVAL      C5NOPL=T0NOP1                                                    
     C                   EVAL      C5LINE=T0LIN1                                                    
     C     KTR003602     CHAIN     WR003602                                                         
b05  C                   IF        %FOUND(WR003602)                                                 
     C                   EVAL      @PERRO = '1'                                                     
     C                   GOTO      TERROR                                                           
e05  C                   ENDIF                                                                      
e04  C                   ENDIF                                                                      
     C                   CLOSE(E)  WR003602                                                         
e03  C                   ENDIF                                                                      
                                                                                                    
      * Busco modificación en TR0026 de Productiva                                                  
b03  C                   IF        T0CIA2 > 0                                                       
     C                   MOVEL     T0CIA2        PPCIAS                                             
     C                   EVAL      FileTr26_erp= 'PURLIBF' + PPCIAS +                               
     C                                          '/TR002602'                                         
     C                   OPEN (E)  TR002602                                                         
b04  C                   IF        Not %ERROR                                                       
01070C                   EVAL      TR_S5CIAS=T0CIA2                                                 
01070C                   EVAL      TR_S5DLGA=T0DLG2                                                 
01070C                   EVAL      TR_S5NPCO=T0NPC2                                                 
01070C                   EVAL      TR_S5TPED=T0TPE2                                                 
01070C                   EVAL      TR_S5DATP=T0DAT2                                                 
01070C                   EVAL      TR_S5NOPL=T0NOP2                                                 
01070C                   EVAL      TR_S5LINE=T0LIN2                                                 
     C     KTR002602     CHAIN     TR002602                                                         
b05  C                   IF        %FOUND(TR002602)                                                 
FQ710C                             And TR_S5DEST='AS400OL'                                          
     C                   EVAL      @PERRO = '1'                                                     
     C                   GOTO      TERROR                                                           
e05  C                   ENDIF                                                                      
e04  C                   ENDIF                                                                      
     C                   CLOSE(E)  TR002602                                                         
e03  C                   ENDIF                                                                      
                                                                                                    
      * Busco modificación en WR0026 de Trace                                                       
b03  C                   IF        T0CIA2 > 0                                                       
     C                   MOVEL     T0CIA3        PPCIAS                                             
     C                   EVAL      FileWr26_erp= 'PURLIBF' + PPCIAS +                               
     C                                          '/WR002602'                                         
     C                   OPEN (E)  WR002602                                                         
b04  C                   IF        Not %ERROR                                                       
01070C                   EVAL      TR_S5CIAS=T0CIA2                                                 
01070C                   EVAL      TR_S5DLGA=T0DLG2                                                 
01070C                   EVAL      TR_S5NPCO=T0NPC2                                                 
01070C                   EVAL      TR_S5TPED=T0TPE2                                                 
01070C                   EVAL      TR_S5DATP=T0DAT2                                                 
01070C                   EVAL      TR_S5NOPL=T0NOP2                                                 
01070C                   EVAL      TR_S5LINE=T0LIN2                                                 
     C     KTR002602     CHAIN     WR002602                                                         
b05  C                   IF        %FOUND(WR002602)                                                 
     C                   EVAL      @PERRO = '1'                                                     
     C                   GOTO      TERROR                                                           
e05  C                   ENDIF                                                                      
e04  C                   ENDIF                                                                      
     C                   CLOSE(E)  WR002602                                                         
e03  C                   ENDIF                                                                      
                                                                                                    
x02  C                   ELSE                                                                       
      * Si es Material Propio                                                                       
                                                                                                    
      * Busco modificación en TR0026 de Comercial                                                   
b03  C                   IF        T0CIAS > 0                                                       
     C                   MOVEL     T0CIAS        PPCIAS                                             
     C                   EVAL      FileTr26_erp= 'PURLIBF' + PPCIAS +                               
     C                                          '/TR002602'                                         
     C                   OPEN (E)  TR002602                                                         
b04  C                   IF        Not %ERROR                                                       
01070C                   EVAL      TR_S5CIAS=T0CIAS                                                 
01070C                   EVAL      TR_S5DLGA=T0DLGA                                                 
01070C                   EVAL      TR_S5NPCO=T0NPCO                                                 
01070C                   EVAL      TR_S5TPED=T0TPED                                                 
01070C                   EVAL      TR_S5DATP=T0DATP                                                 
01070C                   EVAL      TR_S5NOPL=T0NOPL                                                 
01070C                   EVAL      TR_S5LINE=T0LINE                                                 
     C     KTR002602     CHAIN     TR002602                                                         
b05  C                   IF        %FOUND(TR002602)                                                 
FQ710C                             And TR_S5DEST='AS400OL'                                          
     C                   EVAL      @PERRO = '1'                                                     
     C                   GOTO      TERROR                                                           
e05  C                   ENDIF                                                                      
e04  C                   ENDIF                                                                      
     C                   CLOSE(E)  TR002602                                                         
e03  C                   ENDIF                                                                      
                                                                                                    
      * Busco modificación en WR0026 de Trace                                                       
b03  C                   IF        T0CIAS > 0                                                       
     C                   MOVEL     T0CIA3        PPCIAS                                             
     C                   EVAL      FileWr26_erp= 'PURLIBF' + PPCIAS +                               
     C                                          '/WR002602'                                         
     C                   OPEN (E)  WR002602                                                         
b04  C                   IF        Not %ERROR                                                       
01070C                   EVAL      TR_S5CIAS=T0CIAS                                                 
01070C                   EVAL      TR_S5DLGA=T0DLGA                                                 
01070C                   EVAL      TR_S5NPCO=T0NPCO                                                 
01070C                   EVAL      TR_S5TPED=T0TPED                                                 
01070C                   EVAL      TR_S5DATP=T0DATP                                                 
01070C                   EVAL      TR_S5NOPL=T0NOPL                                                 
01070C                   EVAL      TR_S5LINE=T0LINE                                                 
     C     KTR002602     CHAIN     WR002602                                                         
b05  C                   IF        %FOUND(WR002602)                                                 
     C                   EVAL      @PERRO = '1'                                                     
     C                   GOTO      TERROR                                                           
e05  C                   ENDIF                                                                      
e04  C                   ENDIF                                                                      
     C                   CLOSE(E)  WR002602                                                         
e03  C                   ENDIF                                                                      
e02  C                   ENDIF                                                                      
                                                                                                    
     C     TERROR        TAG                                                                        
b02  C                   IF        @PERRO = '1'                                                     
     C                   EVAL      ZXINCI = '014'                                                   
     C                   EXSR      CS_DESERR                                                        
x02  C                   ELSE                                                                       
      * Si ya no existen registros pendientes de procesar elimino el                                
      * campo de Modificación                                                                       
FQ710C                   IF        @PINTE <> 3                                                      
     C                   EVAL      T0MODI=0                                                         
     C                   UPDATE    REDTRLP30                                                        
FQ710C                   ENDIF                                                                      
e02  C                   ENDIF                                                                      
                                                                                                    
e01  C                   ENDIF                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Validación Pedido Retenido                                                                  
      **********************************************************************                        
     C     CS_PEDHOLD    BEGSR                                                                      
                                                                                                    
b01  C                   IF        T0PHLD = 1                                                       
     C                   EVAL      @PERRO = '1'                                                     
     C                   EVAL      ZXINCI = '013'                                                   
     C                   EXSR      CS_DESERR                                                        
e01  C                   ENDIF                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Validación X-DOC                                                                            
      **********************************************************************                        
     C     CS_VALXDOC    BEGSR                                                                      
                                                                                                    
b01  C                   IF        T0XDOC = 1                                                       
     C                   EVAL      @PERRO = '1'                                                     
     C                   EVAL      ZXINCI = '008'                                                   
     C                   EXSR      CS_DESERR                                                        
e01  C                   ENDIF                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Validación Cantidad Servida                                                                 
      **********************************************************************                        
     C     CS_SERVPRO    BEGSR                                                                      
                                                                                                    
b01  C                   IF        T0CANT = T0CANS And T0TREG = 0                                   
     C                   EVAL      @PERRO = '1'                                                     
     C                   EVAL      ZXINCI = '009'                                                   
     C                   EXSR      CS_DESERR                                                        
e01  C                   ENDIF                                                                      
                                                                                                    
     C                   ENDSR                                                                      
FQ710 **********************************************************************                        
FQ710 * Validación X-DOC                                                                            
FQ710 **********************************************************************                        
FQ710C     CS_COMEDST    BEGSR                                                                      
FQ710                                                                                               
CR653C                   IF        ZXPVEX<>'1'                                                      
FQ710C                   IF        T0EDST = '70' OR T0EDST > '75'                                   
FQ710C                   EVAL      @PERRO = '1'                                                     
FQ710C                   EVAL      ZXINCI = '018'                                                   
FQ710C                   EXSR      CS_DESERR                                                        
FQ710C                   ENDIF                                                                      
CR653C                   ENDIF                                                                      
FQ710                                                                                               
FQ710C                   ENDSR                                                                      
      **********************************************************************                        
      * Validación Artículo Proveedor para Altas desde Comercial                                    
      **********************************************************************                        
     C     CS_ARTICUL    BEGSR                                                                      
                                                                                                    
     C                   EVAL      S5CIAS=@PCIAS                                                    
     C                   EVAL      S5DLGA=@PDLGA                                                    
     C                   EVAL      S5NPCO=@PNPCO                                                    
     C                   EVAL      S5TPED=@PTPED                                                    
     C                   EVAL      S5DATP=@PDATP                                                    
     C                   EVAL      S5NOPL=@PNOPL                                                    
     C                   EVAL      S5LINE=@PLINE                                                    
                                                                                                    
s01  C                   SELECT                                                                     
     C                   WHEN      @PINTE = 1                                                       
     C     KCODEPE       SETLL     CODEPE                                                           
     C     KCODEPE       READE     CODEPE                                                           
     C                   WHEN      @PINTE = 2                                                       
     C     KCODEPE0      SETLL     CODEPE                                                           
     C     KCODEPE0      READE     CODEPE                                                           
s01  C                   ENDSL                                                                      
                                                                                                    
d01  C                   DOW       NOT %EOF(CODEPE)                                                 
C1579C                   if        zxpweb='1'                                                       
C1579C                   EVAL      M5CIAS=S5CIAS                                                    
C1579C                   EVAL      M5ARTI = S5ARTI                                                  
C1579C                   EVAL      M5VARI = S5VARI                                                  
C1579C                   EVAL      M5MODE = S5MODE                                                  
C1579C     KMSARTI00     CHAIN     MSARTI00                                                         
C1579C                   EVAL      C0CIAS=S5CIAS                                                    
C1579C                   EVAL      C0PRVR=zxprvr                                                    
C1579C     KPUPROV       CHAIN     PUPROV                                                           
C1579C                   EXSR      CS_PU2600                                                        
C1579C                   ELSE                                                                       
     C                   EXSR      CS_ARTICU2                                                       
C1579C                   ENDIF                                                                      
                                                                                                    
s02  C                   SELECT                                                                     
     C                   WHEN      @PINTE = 1                                                       
     C     KCODEPE       READE     CODEPE                                                           
     C                   WHEN      @PINTE = 2                                                       
     C     KCODEPE0      READE     CODEPE                                                           
e02  C                   ENDSL                                                                      
                                                                                                    
e01  C                   ENDDO                                                                      
                                                                                                    
     C                   ENDSR                                                                      
FQ942                                                                                               
FQ942 **********************************************************************                        
FQ942 * Validación Artículo Proveedor para Altas desde Comercial                                    
FQ942 * SIN HABER INTRODUCIDO TB LA LÍNEA DE PEDIDO                                                 
FQ942 **********************************************************************                        
FQ942C     CS_ARTIC404   BEGSR                                                                      
FQ942C                   EVAL      S5CIAS=@PCIAS                                                    
FQ942C                   EVAL      S5ARTI=%SUBST(@PARV1:1:15)                                       
FQ942C                   EVAL      S5VARI=%SUBST(@PARV1:16:3)                                       
FQ942C                   EVAL      S5MODE=%SUBST(@PARV1:19:3)                                       
FQ942C                   EVAL      S5CANT=1                                                         
FQ942C                   EXSR      CS_ARTICU2                                                       
FQ942C                   ENDSR                                                                      
      **********************************************************************                        
      * Validación Artículo Proveedor para Altas desde Comercial                                    
      **********************************************************************                        
     C     CS_ARTICU2    BEGSR                                                                      
                                                                                                    
OL205C                   EVAL      M5CIAS=S5CIAS                                                    
OL205C                   EVAL      M5ARTI = S5ARTI                                                  
OL205C                   EVAL      M5VARI = S5VARI                                                  
OL205C                   EVAL      M5MODE = S5MODE                                                  
OL205C     KMSARTI00     CHAIN     MSARTI00                                                         
     C                   EVAL      ZXCANT=S5CANT-S5CANS-S5CANR                                      
b01  C                   IF        ZXCANT<=0                                                        
     C                   EVAL      ZXCANT=0                                                         
e01  C                   ENDIF                                                                      
F-2OL *___________________(MSSTOK.M1PRVR), ___________________________                              
OL205 *F-2OLC                   exsr      SRrecu                                                    
OL205                    zxprvr_dom = SRrecu(s5arti:s5vari:s5mode);                                 
F-2OLc                   if        ZXPRVR_DOM = *blanks                                             
OL205C* Si no es artículo propio                                                                    
OL205C*                  EVAL      M5CIAS=S5CIAS                                                    
OL205C*                  EVAL      M5ARTI = S5ARTI                                                  
OL205C*                  EVAL      M5VARI = S5VARI                                                  
OL205C*                  EVAL      M5MODE = S5MODE                                                  
OL205C*    KMSARTI00     CHAIN     MSARTI00                                                         
C1078C                   EVAL      ZXPRVR_DOM=M5PRVR                                                
F-2OLC                   ENDIF                                                                      
Q4132c                   eval      zxexcepcion =  1                                                 
Q4132c                   exsr      cs_eiexce                                                        
C1078C                   IF        ZXPRVR_7<>*BLANKS                                                
C1078C                   EVAL      ZXPRVR_DOM=ZXPRVR_7                                              
C1078C                   ENDIF                                                                      
CR653C*                                                                                             
CR653C                   EXSR      CS_PRV2                                                          
CR653C                   IF        @XPEVT='2'                                                       
CR653C                   GOTO      ES2                                                              
CR653C                   ENDIF                                                                      
CR653C*                                                                                             
b01  C                   IF        M5SIOL <> '2'                                                    
C1078C                             OR  ZXPRVR_7<>*BLANKS                                            
CR653C*                                                                                             
CR653C     ES2           TAG                                                                        
                                                                                                    
CR653 * Determinar si el proveedor es externo                                                       
CR653C                   EVAL      ZXPVEX=' '                                                       
CR653C                   EVAL      C0CIAS=S5CIAS                                                    
C1078C                   EVAL      C0PRVR=ZXPRVR_DOM                                                
C1078C*                  EVAL      C0PRVR=M5PRVR                                                    
CR653C     KPUPROV       CHAIN     PUPROV                                                           
CR653C                   IF        %FOUND(PUPROV) AND C0PEVT='2'                                    
CR653C                   EVAL      ZXPVEX='1'                                                       
CR653C                   ENDIF                                                                      
FQ942C                                                                                              
FQ942C                   MOVE      M5CIAS        ZXCIAS_CJTO                                        
FQ942C                                                                                              
FQ942C* Miramos si es Conjunto de Venta                                                             
FQ942C                   EVAL      FileCojc_erp= 'PURLIBF' +                                        
FQ942C                                           ZXCIAS_CJTO +                                      
FQ942C                                          '/MSCOJC'                                           
FQ942C                   OPEN (E)  MSCOJC                                                           
FQ942C                   IF        Not %ERROR                                                       
FQ942C                                                                                              
FQ942C                   EVAL      ZXES_COMPO=*BLANKS                                               
      * Miramos si es Conjunto de Venta                                                             
     C                   EVAL      ZXTCOJ=' '                                                       
     C                   EVAL      NDCIAS=S5CIAS                                                    
     C                   EVAL      NDARTI=S5ARTI                                                    
     C                   EVAL      NDMODE=S5MODE                                                    
     C                   EVAL      NDVARI=S5VARI                                                    
     C                   EVAL      NDTCOJ='4'                                                       
     C     KMSCOJC       CHAIN     MSCOJC                                                           
b02  C                   IF        %FOUND(MSCOJC) AND NDBAJA<'1'                                    
I0164 *                                                                                             
I0164 * Miramos que el conjunto está asignado al proveedor para poder comprarse como Kit;           
I0164 * sino, deberán de comprarse por los componentes de venta (no existira como Kit)              
I0164 *                                                                                             
C5958C*                  EVAL      KitAsigPrv=*on                                                   
I0164 *     Primero miramos si existe alguna asignación para el Kit                                 
C5958C*                  EVAL      P_C3CIAS=S5CIAS                                                  
C5958C*                  EVAL      P_C3ARVM=S5ARTI                                                  
C5958C*                  EVAL      P_C3TCOJ='1'                                                     
C5958C*    KPUPRCJa      CHAIN     PUPRCJ                                                           
I0164 *                                                                                             
I0164 *     Si existe, miramos si existe para nuestro proveedor                                     
C5958C*                  IF        %FOUND(PUPRCJ)                                                   
C5958C*                  EVAL      P_C3PRVR=ZXPRVR                                                  
C5958C*    KPUPRCJ       CHAIN     PUPRCJ                                                           
C5958C*                  IF        not %FOUND(PUPRCJ)                                               
C5958C*                  EVAL      KitAsigPrv=*off                                                  
C5958C*                  ENDIF                                                                      
C5958C*                  ENDIF                                                                      
I0164 *                                                                                             
E7218 *                                                                                             
E7218C                   EVAL      KitAsigPrv=*oFF                                                  
E7218C                   EVAL      P_C3CIAS=S5CIAS                                                  
E7218C                   EVAL      P_C3ARVM=S5ARTI                                                  
E7218C                   EVAL      P_C3TCOJ='1'                                                     
E7218C                   EVAL      P_C3PRVR=ZXPRVR                                                  
E7218C     KPUPRCJ       CHAIN     PUPRCJ                                                           
E7218C                   IF        NOT %FOUND(PUPRCJ)                                               
E7218C     KPUPRCJa      CHAIN     PUPRCJ                                                           
E7218C                   IF        %FOUND(PUPRCJ)                                                   
E7218C                   EVAL      KitAsigPrv=*off                                                  
E7218C                   ELSE                                                                       
E7218C                   EVAL      KitAsigPrv=*oN                                                   
E7218C                   ENDIF                                                                      
E7218C                   ELSE                                                                       
E7218C                   EVAL      KitAsigPrv=*oN                                                   
E7218C                   ENDIF                                                                      
E7218 *                                                                                             
      * Miramos si es Conjunto de Compra                                                            
     C                   EVAL      NDTCOJ='1'                                                       
     C     KMSCOJC       CHAIN     MSCOJC                                                           
b03  C                   IF        %FOUND(MSCOJC) AND NDBAJA<'1'                                    
E7218C                             and KitAsigPrv=*on                                               
C5958C*                            and KitAsigPrv=*on                                               
      * Si es Conjunto de Ventas y de Compra No lo trataremos como Cjto                             
In178C**                 EVAL      ZXTCOJ=' '                                                       
In178C                   EVAL      ZXTCOJ='1'                                                       
x03  C                   ELSE                                                                       
      * Si es Conjunto de Ventas y No de Compra Si lo tratamos                                      
     C                   EVAL      ZXTCOJ='4'                                                       
e03  C                   ENDIF                                                                      
x02  C                   ELSE                                                                       
      * Si No es Conjunto de Venta , Pues no es Conjunto y punto                                    
     C                   EVAL      ZXTCOJ=' '                                                       
e02  C                   ENDIF                                                                      
FQ942C                   CLOSE(E)  MSCOJC                                                           
      * Es Conjunto                                                                                 
b02  C                   IF        ZXTCOJ='4'                                                       
FQ942 * miramos si a nivel de proveedor existe el cjto                                              
FQ942C                   EXSR      CS_UTCOM0                                                        
FQ94XC*                  IF        @PERRO = *BLANKS                                                 
FQ94XC*                  EXSR      CS_ARTEXIS                                                       
FQ94XC*                  ENDIF                                                                      
FQ942C                   IF        @PERRO = '1'                                                     
FQ942C                             AND ZXINCI='050'                                                 
FQ942C                   GOTO      TARTICUL                                                         
FQ942C                   ELSE                                                                       
FQ942C                   EVAL      @PERRO=*BLANKS                                                   
FQ942C                   EVAL      ZXINCI=*BLANKS                                                   
10O12C                   EVAL      @PINCI = *BLANKS                                                 
FQ942C                   ENDIF                                                                      
FQ942C                   EVAL      ZXES_COMPO='1'                                                   
FQ942                                                                                               
31053C                   EVAL      ZXCANT_CJTO=ZXCANT                                               
     C                   EVAL      NDTCOJ = ZXTCOJ                                                  
     C     KMSCOJC       SETLL     MSCOJD                                                           
     C     KMSCOJC       READE     MSCOJD                                                           
d03  C                   DOW       NOT %EOF(MSCOJD)                                                 
OL205 *F-2OLC                   exsr      SRrecu2                                                   
OL205                    zxprvr_dom = SRrecu(ndcomp:ndvar2:ndmod2);                                 
C6665c*F-2OL             if        ZXPRVR_DOM = *blanks                                             
     C                   EVAL      M5ARTI=NDCOMP                                                    
     C                   EVAL      M5VARI=NDVAR2                                                    
     C                   EVAL      M5MODE=NDMOD2                                                    
     C     KMSARTI00     CHAIN     MSARTI00                                                         
C1078C                   EVAL      ZXPRVR_DOM=M5PRVR                                                
C6665C*F-2OL             ENDIF                                                                      
Q4132c                   eval      zxexcepcion =  1                                                 
Q4132c                   exsr      cs_eiexce                                                        
C1078C                   IF        ZXPRVR_7<>*BLANKS                                                
C1078C                   EVAL      ZXPRVR_DOM=ZXPRVR_7                                              
C1078C                   ENDIF                                                                      
     C                   EVAL      ZXUNIM=NDUNIM                                                    
31053C                   EVAL      ZXCANT=ZXCANT_CJTO                                               
     C                   EVAL      ZXCANT = ZXCANT * NDCANT                                         
      * Valido si existe Equivaléncia EDI                                                           
     C                   EXSR      CS_UTCOM0                                                        
b04  C                   IF        @PERRO = '1'                                                     
     C                   LEAVE                                                                      
e04  C                   ENDIF                                                                      
      * Valido si existe Artículo en la Productiva                                                  
CR653C                   IF        ZXPVEX<>'1'                                                      
     C                   EXSR      CS_ARTEXIS                                                       
b04  C                   IF        @PERRO = '1'                                                     
     C                   LEAVE                                                                      
e04  C                   ENDIF                                                                      
CR653C                   ENDIF                                                                      
CR528 * Valido que el artículo no este bloqueado para compra                                        
CR528C                   IF        M5PPC2>='1'                                                      
CR528C                   EVAL      ZXINCI='019'                                                     
CR528C                   EXSR      CS_DESERR                                                        
CR528C                   EVAL      @PERRO='1'                                                       
12030C                   IF        @PTIPJ>'0'                                                       
CR528C                   EVAL      W02ARVM=M5ARTI+M5VARI+M5MODE                                     
CR528C                   EVAL      W02DES1=M5DES1                                                   
CR528C                   EXFMT     W02                                                              
12030C                   ENDIF                                                                      
CR528C                   LEAVE                                                                      
CR528C                   ENDIF                                                                      
CR528 *                                                                                             
      * Valido si existe Precio Compra en la Comercial                                              
     C                   EXSR      CS_PU2600                                                        
b04  C                   IF        @PERRO = '1'                                                     
     C                   LEAVE                                                                      
e04  C                   ENDIF                                                                      
     C     KMSCOJC       READE     MSCOJD                                                           
e03  C                   ENDDO                                                                      
31053C                   EVAL      ZXCANT=ZXCANT_CJTO                                               
x02  C                   ELSE                                                                       
      * NO Es Conjunto                                                                              
OL205C*                  EVAL      M5ARTI=S5ARTI                                                    
OL205C*                  EVAL      M5VARI=S5VARI                                                    
OL205C*                  EVAL      M5MODE=S5MODE                                                    
OL205C*    KMSARTI00     CHAIN     MSARTI00                                                         
C1078C*OL205             EVAL      ZXPRVR_DOM=M5PRVR                                                
Q4132c                   eval      zxexcepcion =  1                                                 
Q4132c                   exsr      cs_eiexce                                                        
C1078C*OL205             IF        ZXPRVR_7<>*BLANKS                                                
C1078C*OL205             EVAL      ZXPRVR_DOM=ZXPRVR_7                                              
C1078C*OL205             ENDIF                                                                      
     C                   EVAL      ZXUNIM=M5UNIM                                                    
      * Valido si existe Equivaléncia EDI                                                           
     C                   EXSR      CS_UTCOM0                                                        
b03  C                   IF        @PERRO = '1'                                                     
     C                   GOTO      TARTICUL                                                         
e03  C                   ENDIF                                                                      
      * Valido si existe Artículo en la Productiva                                                  
CR653C                   IF        ZXPVEX<>'1'                                                      
     C                   EXSR      CS_ARTEXIS                                                       
b03  C                   IF        @PERRO = '1'                                                     
     C                   GOTO      TARTICUL                                                         
e03  C                   ENDIF                                                                      
CR653C                   ENDIF                                                                      
CR528 * Valido que el artículo no este bloqueado para compra                                        
CR528C*040413            IF        M5PPC2>='1'                                                      
04043C                   IF        M5PPC2>='1' AND @PTIPJ>'0'                                       
CR528C                   EVAL      ZXINCI='019'                                                     
CR528C                   EXSR      CS_DESERR                                                        
CR528C                   EVAL      @PERRO='1'                                                       
CR528C                   EVAL      W02ARVM=M5ARTI+M5VARI+M5MODE                                     
CR528C                   EVAL      W02DES1=M5DES1                                                   
CR528C                   EXFMT     W02                                                              
CR528C                   GOTO      TARTICUL                                                         
CR528C                   ENDIF                                                                      
CR528 *                                                                                             
      * Valido si existe Precio Compra en la Comercial                                              
     C                   EXSR      CS_PU2600                                                        
CR528C                   IF        @PERRO = '1'                                                     
CR528C                   GOTO      TARTICUL                                                         
CR528C                   ENDIF                                                                      
e02  C                   ENDIF                                                                      
e01  C                   ENDIF                                                                      
FQ942C                   ENDIF                                                                      
                                                                                                    
     C     TARTICUL      ENDSR                                                                      
      **********************************************************************                        
      * Validación Equivalencia EDI                                                                 
      **********************************************************************                        
     C     CS_UTCOM0     BEGSR                                                                      
OL885C                   IF        ZXERROR_URG='D'                                                  
OL885C                   CLEAR                   REDPAR2                                            
OL885C                   EVAL      ED_T4CIA1=@PCIAS                                                 
OL885C                   EVAL      ED_T4TREG='B'                                                    
OL885C                   EVAL      ED_T4DLGA=@PDLGA                                                 
OL885C                   EVAL      ED_T4PRVR=ZXPRVR_DOM                                             
OL885C                   EVAL      ED_T4ARVT=*BLANKS                                                
OL885C                   EVAL      ED_T4FAMT=*BLANKS                                                
OL885C                   EVAL      ED_T4PRIO=1                                                      
OL885C     KEDPAR2       CHAIN     EDPAR2                                                           
OL885C                   IF        %FOUND AND (ED_T4MAGA<>'OL'                                      
OL885C                             AND ED_T4MAGA<>'OL5')                                            
OL885C                   LEAVESR                                                                    
OL885C                   ENDIF                                                                      
OL885C                   ENDIF                                                                      
FDX01 *                                                                                             
FDX01 * Siempre que el componente no sea artículo propio                                            
FDX01 *                                                                                             
FDX01C                   IF        M5SIOL='2'                                                       
FDX01C                   MOVE      @PCIAS        ZXCIAD                                             
FDX01C                   ELSE                                                                       
                                                                                                    
CR653C                   IF        ZXPVEX<>'1'                                                      
     C                   EVAL      U0CIAS = @PCIAS                                                  
     C                   EVAL      U0TENV = '5'                                                     
C1078C*                  EVAL      U0CLP0 = M5PRVR                                                  
C1078C                   EVAL      U0CLP0 = ZXPRVR_DOM                                              
     C                   EVAL      U0CLP2 = *BLANKS                                                 
     C     KUTCOM0       CHAIN     UTCOM0                                                           
b01  C                   IF        Not %FOUND(UTCOM0)                                               
     C                   EVAL      @PERRO = '1'                                                     
     C                   EVAL      ZXINCI = '003'                                                   
     C                   EXSR      CS_DESERR                                                        
x01  C                   ELSE                                                                       
     C                   MOVEL     U0CIA1        ZXCIAD                                             
e01  C                   ENDIF                                                                      
CR653C                   ELSE                                                                       
CR653C                   MOVE      @PCIAS        ZXCIAD                                             
CR653C                   ENDIF                                                                      
FDX01 *                                                                                             
FDX01C                   ENDIF                                                                      
FDX01 *                                                                                             
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Comprobar si el artículo existe en la productiva                                            
      **********************************************************************                        
     C     CS_ARTEXIS    BEGSR                                                                      
                                                                                                    
     C                   EVAL      ZXARTIX=M5ARTI                                                   
     C                   EVAL      ZXVARIX=M5VARI                                                   
     C                   EVAL      ZXMODEX=M5MODE                                                   
     C                   EVAL      ZXARVM=ZXARVMX                                                   
     C                   EVAL      ZXTCST=M5TCS1                                                    
     C                   EVAL      ZXARVP=*BLANKS                                                   
                                                                                                    
     C                   EVAL      C0CIAS=S5CIAS                                                    
C1078C*                  EVAL      C0PRVR=M5PRVR                                                    
C1078C                   EVAL      C0PRVR=ZXPRVR_DOM                                                
     C     KPUPROV       CHAIN     PUPROV                                                           
b01  C                   IF        %FOUND(PUPROV)                                                   
                                                                                                    
     C                   EVAL      C3CIAS=S5CIAS                                                    
C1078C*                  EVAL      C3PRVR=M5PRVR                                                    
C1078C                   EVAL      C3PRVR=ZXPRVR_DOM                                                
     C                   EVAL      C3ARVM=ZXARVM                                                    
     C     KPUPRP0       CHAIN     PUPRP0                                                           
b02  C                   IF        %FOUND(PUPRP0)                                                   
     C                   EVAL      ZXARVP=C3ARVP                                                    
     C                   EVAL      ZXTCST=C3TCST                                                    
b03  C                   IF        ZXTCST=*BLANKS                                                   
     C                   EVAL      ZXTCST=M5TCS1                                                    
e03  C                   ENDIF                                                                      
e02  C                   ENDIF                                                                      
                                                                                                    
b02  C                   IF        ZXARVP <> *BLANKS                                                
     C                   EVAL      ZYARVM=ZXARVP                                                    
     C                   EXSR      CS_ARTEXI2                                                       
b03  C                   IF        ZXINCI = '005'                                                   
     C                   EVAL      ZYARVM=ZXARVM                                                    
     C                   EVAL      ZXINCI = *BLANKS                                                 
29100C                   EVAL      @PERRO = *BLANKS                                                 
29100C                   EVAL      @PINCI = *BLANKS                                                 
     C                   EXSR      CS_ARTEXI2                                                       
e03  C                   ENDIF                                                                      
x02  C                   ELSE                                                                       
     C                   EVAL      ZYARVM=ZXARVM                                                    
     C                   EXSR      CS_ARTEXI2                                                       
e02  C                   ENDIF                                                                      
x01  C                   ELSE                                                                       
     C                   EVAL      @PERRO = '1'                                                     
     C                   EVAL      ZXINCI = '001'                                                   
     C                   EXSR      CS_DESERR                                                        
e01  C                   ENDIF                                                                      
                                                                                                    
FQ942C                   IF        ZXINCI=*BLANKS                                                   
FQ942C                   CLOSE(E)  MSCOJC                                                           
FQ94xC*                  EXSR      CS_CONJPRO                                                       
FQ942C                   ENDIF                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Comprobar si el artículo existe en la productiva                                            
      **********************************************************************                        
     C     CS_ARTEXI2    BEGSR                                                                      
                                                                                                    
     C                   EVAL      Q1CIAS = ZXCIAD                                                  
     C                   EVAL      Q1ARVM = ZYARVM                                                  
FQ942C*    KGXEQAR       CHAIN     GXEQAR                                                           
      * Si el artículo no existe en GXEQAR buscamos en MSARTI Productiva                            
FQ942C*                  IF        Not %FOUND(GXEQAR)                                               
                                                                                                    
     C                   MOVEL     ZXCIAD        PPCIAS                                             
     C     KPMLIBL       CHAIN     PMLIBL                                                           
      * MOVEX                                                                                       
b03  C                   IF        %FOUND(PMLIBL) And PPMVXV = 'V'                                  
      * Buscar Compañía MOVEX                                                                       
     C                   EXSR      CS_CIASMVX                                                       
     C                   EXSR      CS_MVXLIBL                                                       
      * Abrir Ficheros MOVEX                                                                        
P1344C*                  Eval      File_mitmas = LIBLMVX + '/MITMAS00'                              
P1344C                   Eval      File_mitmas = (%trim(LIBLMVX)) + '/MITMAS00'                     
     C                   OPEN (E)  MITMAS00                                                         
b04  C                   IF        Not %ERROR                                                       
     C                   MOVEL     MXCONO        MMCONO                                             
     C                   EVAL      MMITNO = M5ARTI                                                  
     C                   MOVEL     ZYARVM        MMITNO                                             
     C     KMITMAS00     CHAIN     MITMAS00                                                         
b05  C                   IF        Not %FOUND(MITMAS00)                                             
FQ942C**                           OR MMSTAT<>'20'                                                  
23072C                             OR (MMSTAT<'20') OR (MMSTAT>'50')                                
     C                   EVAL      @PERRO = '1'                                                     
     C                   EVAL      ZXINCI = '005'                                                   
     C                   EXSR      CS_DESERR                                                        
e05  C                   ENDIF                                                                      
e04  C                   ENDIF                                                                      
     C                   CLOSE(E)  MITMAS00                                                         
                                                                                                    
x03  C                   ELSE                                                                       
      * AS400                                                                                       
     C                   EVAL      Filearti_erp= 'PURLIBF' + PPCIAS +                               
     C                                          '/MSARTI'                                           
     C                   OPEN (E)  MSARTI                                                           
b04  C                   IF        Not %ERROR                                                       
     C                   EVAL      ZXARVMX = ZYARVM                                                 
     C                   EVAL      A_M5ARTI = ZXARTIX                                               
     C                   EVAL      A_M5VARI = ZXVARIX                                               
     C                   EVAL      A_M5MODE = ZXMODEX                                               
     C     KMSARTI       CHAIN     MSARTI                                                           
b05  C                   IF        Not %FOUND(MSARTI)                                               
HD123C*                            OR M5BAJA='1'                                                    
HD123C                             OR A_M5BAJA='1'                                                  
     C                   EVAL      @PERRO = '1'                                                     
     C                   EVAL      ZXINCI = '005'                                                   
     C                   EXSR      CS_DESERR                                                        
e05  C                   ENDIF                                                                      
e04  C                   ENDIF                                                                      
                                                                                                    
     C                   CLOSE(E)  MSARTI                                                           
                                                                                                    
e03  C                   ENDIF                                                                      
FQ942C                                                                                              
FQ942C*                  ENDIF                                                                      
                                                                                                    
     C     TARTEXIS      ENDSR                                                                      
      **********************************************************************                        
      * Recuperar Precio Compra                                                                     
      **********************************************************************                        
     C     CS_PU2600     BEGSR                                                                      
FQ942C                   EVAL      @PETCOJ=*BLANKS                                                  
FQ942C                   IF        ZXTCOJ<>'4'                                                      
FQ942C                   EVAL      @PETCOJ=ZXTCOJ                                                   
FQ942C                   ENDIF                                                                      
CR653C                                                                                              
CR653C                   EVAL      ZXARTIX=M5ARTI                                                   
CR653C                   EVAL      ZXVARIX=M5VARI                                                   
CR653C                   EVAL      ZXMODEX=M5MODE                                                   
CR653C                   EVAL      ZXARVM=ZXARVMX                                                   
CR653C                                                                                              
                                                                                                    
      * PROBAMOS PRIMERO DE IR AL PU2601                                                            
      * QUE SON PRECIOS ESPECIALES DE COMPRA SEGUN CLIENTE                                          
b01  C                   IF        P7CPP1='1'                                                       
     C                   CALL      'PU2601'                                                         
     C                   PARM      @PCIAS        @PECIAS                                            
     C                   PARM      S5CUST        @PECUST                                            
C1078C*                  PARM      M5PRVR        @PEPRVR                                            
C1078C                   PARM      ZXPRVR_DOM    @PEPRVR                                            
     C                   PARM      ZXARVM        @PEARVM                                            
FQ942C*                  PARM      ZXTCOJ        @PETCOJ                                            
FQ942C                   PARM                    @PETCOJ                                            
     C                   PARM      *DATE         @PEFPED                                            
     C                   PARM      ZXCANT        @PECANT                                            
     C                   PARM      ZXUNIM        @PEUNIM                                            
     C                   PARM      C0MONE        @PEMONP                                            
     C                   PARM      *BLANKS       @PEMONB                                            
     C                   PARM                    @PEZXCO                                            
     C                   PARM      C0CLTR        @PECLTR                                            
     C                   PARM      0             @PEPREC                                            
     C                   PARM      0             @PEDTO1                                            
     C                   PARM      0             @PEDTO2                                            
     C                   PARM      0             @PEDTO3                                            
     C                   PARM      0             @PEDTO4                                            
     C                   PARM      *BLANKS       @PEMONE                                            
     C                   PARM      0             @PECADP                                            
     C                   PARM      *BLANKS       @PEUNDP                                            
     C                   PARM      *BLANKS       @PETPPR                                            
     C                   PARM                    @PEERR                                             
      * YA NOS HA RECUPERADO EL PRECIO                                                              
b02  C                   IF        @PEERR<'1' AND @PETPPR<>'5'                                      
     C                   GOTO      BPU2600                                                          
e02  C                   ENDIF                                                                      
e01  C                   ENDIF                                                                      
                                                                                                    
      * EN CASO DE NO RECUPERAR PRECIO, DEBE PASAR POR EL PGM NORMAL                                
     C                   CALL      'PU2600'                                                         
     C                   PARM      @PCIAS        @PECIAS                                            
     C                   PARM      C0PRVR        @PEPRVR                                            
     C                   PARM      ZXARVM        @PEARVM                                            
FQ942C*                  PARM      ZXTCOJ        @PETCOJ                                            
FQ942C                   PARM                    @PETCOJ                                            
     C                   PARM      *DATE         @PEFPED                                            
     C                   PARM      ZXCANT        @PECANT                                            
     C                   PARM      ZXUNIM        @PEUNIM                                            
     C                   PARM      C0MONE        @PEMONP                                            
     C                   PARM      *BLANKS       @PEMONB                                            
     C                   PARM                    @PEZXCO                                            
     C                   PARM      C0CLTR        @PECLTR                                            
     C                   PARM      0             @PEPREC                                            
     C                   PARM      0             @PEDTO1                                            
     C                   PARM      0             @PEDTO2                                            
     C                   PARM      0             @PEDTO3                                            
     C                   PARM      0             @PEDTO4                                            
     C                   PARM      *BLANKS       @PEMONE                                            
     C                   PARM      0             @PECADP                                            
     C                   PARM      *BLANKS       @PEUNDP                                            
     C                   PARM      ZXTCST        @PETCST                                            
     C                   PARM      *BLANKS       @PETPPR                                            
     C                   PARM      *BLANKS       @PEPRMO                                            
     C                   PARM      'F'           @PEERR                                             
OL885C                   IF        ZXERROR_URG='D'                                                  
OL885C                   CLEAR                   REDPAR2                                            
OL885C                   EVAL      ED_T4CIA1=@PCIAS                                                 
OL885C                   EVAL      ED_T4TREG='B'                                                    
OL885C                   EVAL      ED_T4DLGA=@PDLGA                                                 
OL885C                   EVAL      ED_T4PRVR=C0PRVR                                                 
OL885C                   EVAL      ED_T4ARVT=*BLANKS                                                
OL885C                   EVAL      ED_T4FAMT=*BLANKS                                                
OL885C                   EVAL      ED_T4PRIO=1                                                      
OL885C     KEDPAR2       CHAIN     EDPAR2                                                           
OL885C                   IF        %FOUND AND (ED_T4MAGA<>'OL'                                      
OL885C                             AND ED_T4MAGA<>'OL5')                                            
OL885C                   EVAL      @PEPREC = 0,01                                                   
OL885C                   ENDIF                                                                      
OL885C                   ENDIF                                                                      
b01  C                   IF        @PEPREC = 0                                                      
     C                   EVAL      @PERRO = '1'                                                     
     C                   EVAL      ZXINCI = '002'                                                   
     C                   EXSR      CS_DESERR                                                        
e01  C                   ENDIF                                                                      
                                                                                                    
     C     BPU2600       TAG                                                                        
                                                                                                    
     C                   ENDSR                                                                      
      **********************************************************************                        
0     * Comprobar si el artículo en productiva es Contrapedido                                      
      **********************************************************************                        
     C     CS_CONTPED    BEGSR                                                                      
                                                                                                    
CR653C                   IF        ZXPVEX<>'1'                                                      
      * Ya tenemos trazabilidad en Productiva                                                       
b01  C                   IF        T0CIA2 <> 0                                                      
                                                                                                    
      * Componente Conjunto                                                                         
b02  C                   IF        T0COM2 <> *BLANKS                                                
     C                   EVAL      ZXARVMX = T0COM2                                                 
x02  C                   ELSE                                                                       
      * Artículo Normal                                                                             
     C                   EVAL      ZXARVMX = T0ARV2                                                 
e02  C                   ENDIF                                                                      
                                                                                                    
     C                   MOVEL     T0CIA2        PPCIAS                                             
     C     KPMLIBL       CHAIN     PMLIBL                                                           
      * MOVEX                                                                                       
b02  C                   IF        %FOUND(PMLIBL) And PPMVXV = 'V'                                  
      * Buscar Compañía MOVEX                                                                       
     C                   EXSR      CS_CIASMVX                                                       
     C                   EXSR      CS_MVXLIBL                                                       
      * Si empresa es Productiva                                                                    
P1344C*                  Eval      File_cmndiv = LIBLMVX + '/CMNDIV00'                              
P1344C                   Eval      File_cmndiv = (%trim(LIBLMVX)) + '/CMNDIV00'                     
P1344C*                  Eval      File_mitbal = LIBLMVX + '/MITBAL00'                              
P1344C                   Eval      File_mitbal = (%trim(LIBLMVX)) + '/MITBAL00'                     
P1344C*                  Eval      File_mitfac = LIBLMVX + '/MITFAC00'                              
P1344C                   Eval      File_mitfac = (%trim(LIBLMVX)) + '/MITFAC00'                     
I0184C                   Eval      File_ZAQITN = (%trim(LIBLAQA)) + '/ZAQITN00'                     
I0184C                   Eval      File_GMTABD = (%trim(LIBLAQA)) + '/GMTABD01'                     
     C                   OPEN (E)  CMNDIV00                                                         
     C                   OPEN (E)  ZAQBAL00                                                         
25052C                   OPEN (E)  MITBAL00                                                         
     C                   OPEN (E)  AQPEDI00                                                         
01022C                   OPEN (E)  MITFAC00                                                         
I0184C                   OPEN (E)  ZAQITN00                                                         
I0184C                   OPEN (E)  GMTABD01                                                         
b03  C                   IF        Not %ERROR                                                       
     C                   MOVEL     MXCONO        Z1CONO                                             
     C                   MOVEL     MXDIVI        Z1DIVI                                             
     C     KAQPEDI00     CHAIN     AQPEDI00                                                         
b04  C                   IF        %FOUND(AQPEDI00)                                                 
     C                   MOVEL     MXCONO        CCCONO                                             
     C                   MOVEL     MXDIVI        CCDIVI                                             
     C     KCMNDIV00     CHAIN     CMNDIV00                                                         
b05  C                   IF        %FOUND(CMNDIV00)                                                 
01022 *Buscar almacén principal de la planta de la división                                         
I0184 *             Ver si estamos en una división Multiplanta                                      
I0184C                   EVAL      ZXMULTIPLA = %FOUND(AQPEDI00)                                    
I0184C                                          AND  Z1L101 = '1'                                   
01022C                   EVAL      M9CONO=CCCONO                                                    
I0184C**01022            EVAL      M9FACI=CCFACI                                                    
01022C                   MOVEL     ZXARVMX       M9ITNO                                             
I0184C                   EVAL      M9FACI=GET_FACI(MXDIVI:CCFACI:M9ITNO)                            
01022C     KMITFAC00     CHAIN     MITFAC00                                                         
01022C                   IF        %FOUND(MITFAC00)                                                 
     C                   MOVEL     MXCONO        MBCONO                                             
01022C***                MOVEL     CCWHLO        MBWHLO                                             
01022C                   MOVEL     M9REWH        MBWHLO                                             
     C                   MOVEL     ZXARVMX       MBITNO                                             
E7345 *                                                                                             
E7345c                   exsr      CS_LOG_WHSE                                                      
E7345c                   eval      MBWHLO = xbwhlo                                                  
E7345c     KZAQBAL00     CHAIN     ZAQBAL00                                                         
E7345c                   if        not %found(ZAQBAL00)                                             
E7345C                   MOVEL     M9REWH        MBWHLO                                             
     C     KZAQBAL00     CHAIN     ZAQBAL00                                                         
E7345c                   endif                                                                      
25052C     KMITBAL00     CHAIN     MITBAL00                                                         
01022 *Si está marcado como contra pedido mirar en almacén logístico(AQPEDI)                        
69095C* C5958            IF        (%FOUND(ZAQBAL00) And MBTCON = 1)                                
69095C                   IF        (%FOUND(ZAQBAL00) And MBMTSO = 'MTO')                            
25052C                             OR (%FOUND(MITBAL00) And MBOPLC = 3)                             
     C                   MOVEL     Z1WHLO        MBWHLO                                             
     C     KZAQBAL00     CHAIN     ZAQBAL00                                                         
I0184C     KMITBAL00     CHAIN     MITBAL00                                                         
01022 *Si no existe en OL o existe y está marcado para contra pedido       )                        
01022 *entonces es contra pedido.                                                                   
b07  C                   IF        ((Not %FOUND(ZAQBAL00)) Or                                       
69095C* C5958                      (%FOUND(ZAQBAL00) And MBTCON = 1) Or                             
69095C                             (%FOUND(ZAQBAL00) And MBMTSO = 'MTO') Or                         
25052C                              (%FOUND(MITBAL00) And MBOPLC = 3))                              
     C                             And T0AUCP <> 1                                                  
     C                   EVAL      @PERRO = '1'                                                     
     C                   EVAL      ZXINCI = '011'                                                   
     C                   EXSR      CS_DESERR                                                        
e07  C                   ENDIF                                                                      
e06  C                   ENDIF                                                                      
e05  C                   ENDIF                                                                      
e04  C                   ENDIF                                                                      
e03  C                   ENDIF                                                                      
01022C                   ENDIF                                                                      
     C                   CLOSE(E)  CMNDIV00                                                         
     C                   CLOSE(E)  ZAQBAL00                                                         
25052C                   CLOSE(E)  MITBAL00                                                         
     C                   CLOSE(E)  AQPEDI00                                                         
01022C                   CLOSE(E)  MITFAC00                                                         
I0184C                   CLOSE(E)  ZAQITN00                                                         
I0184C                   CLOSE(E)  GMTABD01                                                         
                                                                                                    
x02  C                   ELSE                                                                       
      * AS400                                                                                       
      * Si empresa es Productiva                                                                    
21350C*                  IF        PPCROP = '0'                                                     
     C                   EVAL      Filearti_erp= 'PURLIBF' + PPCIAS +                               
     C                                          '/MSARTI'                                           
76211C*                                                                                             
79419C                   EVAL      FileStok_erp= *blanks                                            
76211C                   EVAL      FileStst_erp= *blanks                                            
79419c                   Eval      FileAlma_erp= *blanks                                            
76211C                   EVAL      ppcias = %editc(t0cia2:'X')                                      
79419C                   EVAL      FileStok_erp= 'PURLIBF' + PPCIAS +                               
79419C                                          '/MSSTOK'                                           
76211C                   EVAL      FileStst_erp= 'PURLIBF' + PPCIAS +                               
76211C                                          '/MSSTST'                                           
79419C                   EVAL      FileAlma_erp= 'PURLIBF' + PPCIAS +                               
79419C                                          '/MSALMA08'                                         
79419C                   OPEN (E)  MSSTOK                                                           
76211C                   OPEN (E)  MSSTST                                                           
79419c                   OPEN (E)  MSALMA08                                                         
76211C                   IF        Not %ERROR                                                       
79419 *                                                                                             
79419 * Miramos nivel de red de la empresa (Si trabaja con FAB/OL)                                  
79419 *                                                                                             
79419c                   eval      zxFABOL = *off                                                   
79419c                   If        %subst(ppampl:46:1) = '1'                                        
79419c                   eval      zxFABOL = *on                                                    
79419c                   endif                                                                      
79419 *                                                                                             
79419 * Buscamos el almacén de Trace y la delegación del almacén de Trace                           
79419 *                                                                                             
79419c                   eval      zxMagaTr = *blanks                                               
79419c                   eval      zxDlgaTr = *blanks                                               
79419 *                                                                                             
79419c                   Eval      M0CIAS = %int(ppcias)                                            
79419c                   Eval      M0TAL1 = '8'                                                     
79419c     KMsalma08     Chain     Msalma08                                                         
79419c                   if        %found(Msalma08)                                                 
79419c                   movel(p)  m0maga        zxMagaTr                                           
79419c                   movel(p)  m0dlga        zxDlgaTr                                           
79419c                   if        m0dlga =  *blanks and                                            
79419c                             m0m003 <> *blanks                                                
79419c                   movel(p)  m0m003        zxDlgaTr                                           
79419c                   endif                                                                      
79419c                   endif                                                                      
79419 *                                                                                             
79419 * Buscamos clasificación artículo:                                                            
79419c                   eval      zxclas = *blanks                                                 
79419 *                                                                                             
79419c                   If        %subst(ppampl:6:1) = '1'                                         
79419 *===  Por Propuesta de compra                                                                 
79419c                   Eval      M1CIAS = %int(ppcias)                                            
79419c                   Eval      M1MAGA = zxMagaTr                                                
79419c                   Eval      M1ARTI = ZXARTIX                                                 
79419c                   Eval      M1VARI = ZXVARIX                                                 
79419c                   Eval      M1MODE = ZXMODEX                                                 
79419c     KMsstok       Chain     Msstok                                                           
79419c                   if        %found(Msstok)                                                   
79419c                   eval      ZXCLAS = M1CROT                                                  
79419c                   endif                                                                      
79419 *                                                                                             
79419c                   else                                                                       
79419 *===  Por MRP                                                                                 
76211C                   EVAL      m6cias = %int(ppcias)                                            
79419C*76211             EVAL      m6dlga = 'TRACE'                                                 
76211C                   EVAL      m6arti = ZXARTIX                                                 
76211C                   EVAL      m6vari = ZXVARIX                                                 
76211C                   EVAL      m6mode = ZXMODEX                                                 
79419c                   if        zxFABOL = *on                                                    
79419c                   Eval      M6DLGA = *blanks                                                 
79419c                   Eval      M6NETL = 2                                                       
79419c                   Else                                                                       
79419c                   Eval      M6DLGA = zxDlgaTr                                                
79419c                   Eval      M6NETL = 1                                                       
79419c                   endif                                                                      
76211C     KMSSTST       CHAIN     MSSTST                                                           
79419c                   if        %found(MSSTST) And m6omit <> '1'                                 
79419c                   eval      ZXCLAS = M6CLAS                                                  
79419C                   endif                                                                      
76211C                   ENDIF                                                                      
76211C*                                                                                             
79419C                   endif                                                                      
79419C*                                                                                             
     C                   OPEN (E)  MSARTI                                                           
b04  C                   IF        Not %ERROR                                                       
     C                   EVAL      A_M5ARTI = ZXARTIX                                               
     C                   EVAL      A_M5VARI = ZXVARIX                                               
     C                   EVAL      A_M5MODE = ZXMODEX                                               
     C     KMSARTI       CHAIN     MSARTI                                                           
b05  C                   IF        Not %FOUND(MSARTI)                                               
13812C                             Or %FOUND(MSARTI) And A_M5BAJA='1'                               
13812C**                 EVAL      @PERRO = '1'                                                     
13812C**                 EVAL      ZXINCI = '005'                                                   
13812C**                 EXSR      CS_DESERR                                                        
x05  C                   ELSE                                                                       
76211C*                  IF        A_M5CROP <> 'A ' And A_M5CROP <> 'A+'                            
76211C*                            And T0AUCP <> 1                                                  
79419C*76211             IF        (A_M5CROP <> 'A ' And A_M5CROP <> 'A+'                           
79419C*76211                       And T0AUCP <> 1)                                                 
79419C*76211                       or                                                               
79419C*76211                       (%found(MSSTST)   And m6clas <> 'A '                             
79419C*76211                       And m6clas <> 'A+'And T0AUCP <> 1)                               
79419c                   IF        zxclas <>'A ' and zxclas <> 'A+'                                 
79419c                             And T0AUCP <> 1                                                  
     C                   EVAL      @PERRO = '1'                                                     
     C                   EVAL      ZXINCI = '011'                                                   
     C                   EXSR      CS_DESERR                                                        
e06  C                   ENDIF                                                                      
e05  C                   ENDIF                                                                      
e04  C                   ENDIF                                                                      
                                                                                                    
     C                   CLOSE(E)  MSARTI                                                           
79419C                   CLOSE(E)  MSSTOK                                                           
79419C                   CLOSE(E)  MSSTST                                                           
79419C                   CLOSE(E)  MSALMA08                                                         
                                                                                                    
21350C*                  ELSE                                                                       
21350C*                  ENDIF                                                                      
e02  C                   ENDIF                                                                      
e01  C                   ENDIF                                                                      
                                                                                                    
CR653C                   ENDIF                                                                      
     C                   ENDSR                                                                      
C2559 **********************************************************************                        
C2559 * Comprobar si el artículo en productiva es Contrapedido                                      
C2559 * (Y para Cia Movex si tiene Orden de fabricacion asociada)                                   
C2559 **********************************************************************                        
C2559C     CS_CONTPED_2  BEGSR                                                                      
C2559                                                                                               
C2559 * Si no es proveedor externo                                                                  
C2559C                   IF        ZXPVEX<>'1'                                                      
C2559 * Ya tenemos trazabilidad en Productiva                                                       
C2559C                   IF        T0CIA2 <> 0                                                      
C2559                                                                                               
C2559 * Componente Conjunto                                                                         
C2559C                   IF        T0COM2 <> *BLANKS                                                
C2559C                   EVAL      ZXARVMX = T0COM2                                                 
C2559C                   ELSE                                                                       
C2559 * Artículo Normal                                                                             
C2559C                   EVAL      ZXARVMX = T0ARV2                                                 
C2559C                   ENDIF                                                                      
C2559                                                                                               
C2559C                   MOVEL     T0CIA2        PPCIAS                                             
C2559C     KPMLIBL       CHAIN     PMLIBL                                                           
C2559 * Empresa MOVEX                                                                               
C2559C                   IF        %FOUND(PMLIBL) And PPMVXV = 'V'                                  
C2559 * Buscar Compañía MOVEX                                                                       
C2559C                   EXSR      CS_CIASMVX                                                       
C2559C                   EXSR      CS_MVXLIBL                                                       
C2559 *                                                                                             
C2559 * Si existe orden de fabricacion asociada al pedido de ventas                                 
C2559 * (OBRORC=1)                                                                                  
C2559 *                                                                                             
C2559 * [Mientras las empresas no estén completamente en Movex, no                                  
C2559 * tenemos trazabilidad desde el pedido a la OF y nunca se va                                  
C2559 * a encontrar el registro en OOLINE; por lo que no va a haber                                 
C2559 * problema para cerrar la línea. No se va a generar el error.                                 
C2559 * Esta validación funcionará bien en un futuro cuando se esté                                 
C2559 * trabajando completamente en Movex y dispongamos de completa                                 
C2559 * trazabilidad]                                                                               
P1344C*                  Eval      File_ooline = LIBLMVX + '/OOLINE40'                              
P1344C                   Eval      File_ooline = (%trim(LIBLMVX)) + '/OOLINE40'                     
C2559C                   OPEN (E)  OOLINE40                                                         
P1344C*                  Eval      File_oolin0 = LIBLMVX + '/OOLINE00'                              
P1344C                   Eval      File_oolin0 = (%trim(LIBLMVX)) + '/OOLINE00'                     
R3820C*                  OPEN (E)  OOLINE00                                                         
C2559 *                                                                                             
C2559C                   IF        Not %ERROR                                                       
C2559C                   MOVE      MXCONO        OBCONO                                             
C2559C                   MOVE      T0NPC2        OBORNO                                             
C2559C                   EVAL      OBRORC=1                                                         
C2559C     KOOLINE40     CHAIN     OOLINE40                                                         
C2559C                   IF        %FOUND(OOLINE40)                                                 
C2559C                   EVAL      @PERRO = '1'                                                     
C2559C                   EVAL      ZXINCI = '011'                                                   
C2559C                   EXSR      CS_DESERR                                                        
C2559C                   ENDIF                                                                      
C2559C                   ENDIF                                                                      
R3820C*                                                                                             
R3820C* Validamos que no hayan lineas abiertas en el proveedor                                      
R3820C*                  MOVE      MXCONO        OBCONO                                             
R3820C*                  MOVE      T0NPC2        OBORNO                                             
R3820C*                  MOVE      T0LIN2        OBPONR                                             
R3820C*    KOOLINE00     CHAIN     OOLINE00                                                         
R3820C*                  IF        OBRORC <> 0                                                      
R3820C*                  EVAL      @PERRO = '1'                                                     
R3820C*                  EVAL      ZXINCI = '060'                                                   
R3820C*                  EXSR      CS_DESERR                                                        
R3820C*                  ENDIF                                                                      
R3820C*                                                                                             
R3820C*                  CLOSE(E)  OOLINE00                                                         
R3820C*                                                                                             
R3820C* Validamos que el articulo en el proveedor no sea MTO                                        
R3820C*                  OPEN (E)  ZAQBAL00                                                         
R3820C*                  IF        Not %ERROR                                                       
R3820C*                                                                                             
R3820C*Buscar almacén principal de la planta de la división                                         
R3820C*                  Eval      File_mitfac = LIBLMVX + '/MITFAC00'                              
R3820C*                  OPEN (E)  MITFAC00                                                         
R3820C*                  MOVEL     MXCONO        M9CONO                                             
R3820C*                  EVAL      M9FACI=CCFACI                                                    
R3820C*                  MOVEL     ZXARVMX       M9ITNO                                             
R3820C*    KMITFAC00     CHAIN     MITFAC00                                                         
R3820C*                  IF        %FOUND(MITFAC00)                                                 
R3820C*                  MOVEL     MXCONO        MBCONO                                             
R3820C*                  MOVEL     M9REWH        MBWHLO                                             
R3820C*                  MOVEL     ZXARVMX       MBITNO                                             
R3820C*    KZAQBAL00     CHAIN     ZAQBAL00                                                         
R3820C*                  IF        MBMTSO='MTO'                                                     
R3820C*                  EVAL      @PERRO = '1'                                                     
R3820C*                  EVAL      ZXINCI = '060'                                                   
R3820C*                  EXSR      CS_DESERR                                                        
R3820C*                  ENDIF                                                                      
R3820C*                  ENDIF                                                                      
R3820C*                  CLOSE(E)  MITFAC00                                                         
R3820C*                                                                                             
R3820C*                  Eval      File_mitbal = LIBLMVX + '/MITBAL00'                              
R3820C*                  OPEN (E)  MITBAL00                                                         
R3820C*                  MOVEL     MXCONO        MBCONO                                             
R3820C*                  MOVEL     M9REWH        MBWHLO                                             
R3820C*                  MOVEL     ZXARVMX       MBITNO                                             
R3820C*    KMITBAL00     CHAIN     MITBAL00                                                         
R3820C*                  IF        MBOPLC = 1                                                       
R3820C*                  EVAL      @PERRO = '1'                                                     
R3820C*                  EVAL      ZXINCI = '060'                                                   
R3820C*                  EXSR      CS_DESERR                                                        
R3820C*                  ENDIF                                                                      
R3820C*                  CLOSE(E)  MITBAL00                                                         
R3820C*                                                                                             
R3820C*                  ENDIF                                                                      
C2559C                   ENDIF                                                                      
C2559C                   ENDIF                                                                      
C2559C                   ENDIF                                                                      
C2559C     FI_CONTPED_2  ENDSR                                                                      
R3820 **********************************************************************                        
R3820 * Comprobar si existe orden abierta en el Proveedor                                           
R3820 **********************************************************************                        
R3820C     CS_CONTPED_3  BEGSR                                                                      
R3820                                                                                               
R3820 * En caso de que el pedido este autorizado no validamos                                       
R3820C                   IF        T0AUCP<>1                                                        
R3820 * Si no es proveedor externo                                                                  
R3820C                   IF        ZXPVEX<>'1'                                                      
R3820 * Ya tenemos trazabilidad en Productiva                                                       
R3820C                   IF        T0CIA2 <> 0                                                      
R3820                                                                                               
R3820 * Componente Conjunto                                                                         
R3820C                   IF        T0COM2 <> *BLANKS                                                
R3820C                   EVAL      ZXARVMX = T0COM2                                                 
R3820C                   ELSE                                                                       
R3820 * Artículo Normal                                                                             
R3820C                   EVAL      ZXARVMX = T0ARV2                                                 
R3820C                   ENDIF                                                                      
R3820                                                                                               
R3820C                   MOVEL     T0CIA2        PPCIAS                                             
R3820C     KPMLIBL       CHAIN     PMLIBL                                                           
R3820 * Empresa MOVEX                                                                               
R3820C                   IF        %FOUND(PMLIBL) And PPMVXV = 'V'                                  
R3820 * Buscar Compañía MOVEX                                                                       
R3820C                   EXSR      CS_CIASMVX                                                       
R3820C                   EXSR      CS_MVXLIBL                                                       
R3820 *                                                                                             
P1344C*                  Eval      File_oolin0 = LIBLMVX + '/OOLINE00'                              
P1344C                   Eval      File_oolin0 = (%trim(LIBLMVX)) + '/OOLINE00'                     
R3820C                   OPEN (E)  OOLINE00                                                         
P1344C                   Eval      File_cmndiv = (%trim(LIBLMVX)) + '/CMNDIV00'                     
P1344C                   Eval      File_mitbal = (%trim(LIBLMVX)) + '/MITBAL00'                     
P1344C                   Eval      File_mitfac = (%trim(LIBLMVX)) + '/MITFAC00'                     
P1344C                   OPEN (E)  CMNDIV00                                                         
P1344C                   MOVEL     MXCONO        CCCONO                                             
P1344C                   MOVEL     MXDIVI        CCDIVI                                             
P1344C     KCMNDIV00     CHAIN     CMNDIV00                                                         
R3820C*                                                                                             
R3820C* Validamos que no hayan lineas abiertas en el proveedor                                      
R3820C                   MOVE      MXCONO        OBCONO                                             
R3820C                   MOVE      T0NPC2        OBORNO                                             
R3820C                   MOVE      T0LIN2        OBPONR                                             
R3820C     KOOLINE00     CHAIN     OOLINE00                                                         
76211C                   if        %found                                                           
76211C*                                                                                             
R3820C                   IF        OBRORC <> 0                                                      
R3820C                   EVAL      @PERRO = '1'                                                     
R3820C                   EVAL      ZXINCI = '060'                                                   
R3820C                   EXSR      CS_DESERR                                                        
R3820C                   ENDIF                                                                      
R3820C*                                                                                             
R3820C                   CLOSE(E)  OOLINE00                                                         
R3820C*                                                                                             
R3820C* Validamos que el articulo en el proveedor no sea MTO                                        
R3820C                   OPEN (E)  ZAQBAL00                                                         
I0184C                   OPEN (E)  AQPEDI00                                                         
I0184C                   OPEN (E)  ZAQITN00                                                         
I0184C                   OPEN (E)  GMTABD01                                                         
R3820C                   IF        Not %ERROR                                                       
R3820C*                                                                                             
R3820C*Buscar almacén principal de la planta de la división                                         
P1344C*                  Eval      File_mitfac = LIBLMVX + '/MITFAC00'                              
P1344C                   Eval      File_mitfac = (%trim(LIBLMVX)) + '/MITFAC00'                     
R3820C                   OPEN (E)  MITFAC00                                                         
I0184 *                                                                                             
I0184 *            Ver si estamos en una división Multiplanta                                       
I0184C                   MOVEL(P)  MXCONO        Z1CONO                                             
I0184C                   EVAL      Z1DIVI = MXDIVI                                                  
I0184C     KAQPEDI00     CHAIN     AQPEDI00                                                         
I0184C                   EVAL      ZXMULTIPLA = %FOUND(AQPEDI00)                                    
I0184C                                          AND  Z1L101 = '1'                                   
R3820C                   MOVEL     MXCONO        M9CONO                                             
I0184C**R3820            EVAL      M9FACI=CCFACI                                                    
R3820C                   MOVEL     ZXARVMX       M9ITNO                                             
I0184C                   EVAL      M9FACI=GET_FACI(MXDIVI:CCFACI:M9ITNO)                            
R3820C     KMITFAC00     CHAIN     MITFAC00                                                         
R3820C                   IF        %FOUND(MITFAC00)                                                 
R3820C                   MOVEL     MXCONO        MBCONO                                             
76211C* R3820            MOVEL     M9REWH        MBWHLO                                             
76211C                   MOVEL     OBWHLO        MBWHLO                                             
R3820C                   MOVEL     ZXARVMX       MBITNO                                             
E7345 *                                                                                             
E7345c                   exsr      CS_LOG_WHSE                                                      
E7345c                   eval      MBWHLO = xbwhlo                                                  
E7345c     kZAQBAL00     CHAIN     ZAQBAL00                                                         
E7345c                   if        not %found(ZAQBAL00)                                             
E7345C                   MOVEL     OBWHLO        MBWHLO                                             
R3820C     KZAQBAL00     CHAIN     ZAQBAL00                                                         
E7345c                   endif                                                                      
R3820C                   IF        MBMTSO='MTO'                                                     
R3820C                   EVAL      @PERRO = '1'                                                     
R3820C                   EVAL      ZXINCI ='060'                                                    
R3820C                   EXSR      CS_DESERR                                                        
R3820C                   ENDIF                                                                      
R3820C                   ENDIF                                                                      
R3820C                   CLOSE(E)  MITFAC00                                                         
R3820C*                                                                                             
P1344C*                  Eval      File_mitbal = LIBLMVX + '/MITBAL00'                              
P1344C                   Eval      File_mitbal = (%trim(LIBLMVX)) + '/MITBAL00'                     
R3820C                   OPEN (E)  MITBAL00                                                         
R3820C                   MOVEL     MXCONO        MBCONO                                             
76211C* R3820            MOVEL     M9REWH        MBWHLO                                             
76211C                   MOVEL     OBWHLO        MBWHLO                                             
R3820C                   MOVEL     ZXARVMX       MBITNO                                             
R3820C     KMITBAL00     CHAIN     MITBAL00                                                         
R3820C                   IF        MBOPLC = 3                                                       
R3820C                   EVAL      @PERRO = '1'                                                     
R3820C                   EVAL      ZXINCI = '060'                                                   
R3820C                   EXSR      CS_DESERR                                                        
R3820C                   ENDIF                                                                      
I0184C                   CLOSE(E)  CMNDIV00                                                         
R3820C                   CLOSE(E)  MITBAL00                                                         
I0184C                   CLOSE(E)  ZAQBAL00                                                         
I0184C                   CLOSE(E)  AQPEDI00                                                         
I0184C                   CLOSE(E)  ZAQITN00                                                         
I0184C                   CLOSE(E)  GMTABD01                                                         
R3820C                   ENDIF                                                                      
76211C                   endif                                                                      
R3820C                   ENDIF                                                                      
R3820C                   ENDIF                                                                      
R3820C                   ENDIF                                                                      
R3820C                   ENDIF                                                                      
R3820C*                                                                                             
R3820C     FI_CONTPED_3  ENDSR                                                                      
      **********************************************************************                        
      * Validación Integridad de Conjuntos en Trace                                                 
      **********************************************************************                        
     C     CS_VALCONJ    BEGSR                                                                      
                                                                                                    
CR653C                   IF        ZXPVEX<>'1'                                                      
      * guardo clave lógico 30                                                                      
FQ710C                   EXSR      CS_SAVLOG3                                                       
                                                                                                    
     C                   EVAL      ZXCOE1 = 0                                                       
     C                   EVAL      ZXCOE2 = 0                                                       
     C                   EVAL      ZXCOA1 = 0                                                       
     C                   EVAL      ZXCOA2 = 0                                                       
                                                                                                    
      * leo fichero por la clave principal la linea de Vtas de Comercial                            
     C     KEDTRLP00     SETLL     EDTRLP00                                                         
     C     KEDTRLP00     READE     EDTRLP00                                                         
d01  C                   DOW       NOT %EOF(EDTRLP00)                                               
                                                                                                    
14060C                   IF        T0TREG < 3                                                       
      * Si hay algún conjunto de Compra-Cial o Venta-Product                                        
b02  C                   IF        T0CFC1 > 0 Or T0CFC2 > 0                                         
14060C                   MOVEL     T0NPC1        ZXNPC1                                             
      * busco cantidad preparada en preparación de Trace                                            
     C                   EVAL      SACIAS = T0CIA3                                                  
     C                   EVAL      SATNPE = ' '                                                     
     C                   MOVEL     T0DLG3        SADLGA                                             
     C                   MOVEL     T0NPC3        SANPCO                                             
     C                   MOVEL     T0TPE3        SATPED                                             
     C                   EVAL      SADATP = T0DAT3                                                  
     C                   EVAL      SANOPL = T0NOP3                                                  
     C                   EVAL      SALINE = T0LIN3                                                  
     C                   EVAL      SANPRP = @PCUST                                                  
     C     KCOAPRP01     CHAIN     COAPRP01                                                         
b03  C                   IF        Not %FOUND(COAPRP01)                                             
     C     KCOAPRP01     CHAIN     COAPR101                                                         
e03  C                   ENDIF                                                                      
      * calculo coeficiente cantidad preparada                                                      
b03  C                   IF        %FOUND(COAPRP01) Or %FOUND(COAPR101)                             
14060 * Si es X-DOC Busco cantidad en X-DOC                                                         
14060C                   IF        SACCPP = '1' And T0CFC1 > 0                                      
14060C                   EVAL      TKCIAS = SACIAS                                                  
14060C                   EVAL      TKDLGA = SADLGA                                                  
14060C                   EVAL      TKNPCO = SANPCO                                                  
14060C                   EVAL      TKTPED = SATPED                                                  
14060C                   EVAL      TKDATP = SADATP                                                  
14060C                   EVAL      TKNOPL = SANOPL                                                  
14060C     KCOXDOC       CHAIN     COXDOC                                                           
14060C                   IF        %FOUND(COXDOC)                                                   
14060C                   EVAL      SACANS = 0                                                       
14060C                   DOW       NOT %EOF(COXDOC)                                                 
14060C                   IF        TKNP01=ZXNPC1 And TKLI01=T0LIN1                                  
14060C                   EVAL      SACANS = SACANS + TKCANT                                         
14060C                   ENDIF                                                                      
14060C     KCOXDOC       READE     COXDOC                                                           
14060C                   ENDDO                                                                      
14060C                   ENDIF                                                                      
14060C                   ENDIF                                                                      
b04  C                   IF        T0CFC1 > 0                                                       
     C                   EVAL      ZXCOE1 = SACANS / T0CFC1                                         
b05  C                   IF        ZXCOE1 = 0                                                       
     C                   EVAL      ZXCOE1 = 999999                                                  
e05  C                   ENDIF                                                                      
e04  C                   ENDIF                                                                      
b04  C                   IF        T0CFC2 > 0                                                       
     C                   EVAL      ZXCOE2 = SACANS / T0CFC2                                         
b05  C                   IF        ZXCOE2 = 0                                                       
     C                   EVAL      ZXCOE2 = 999999                                                  
e05  C                   ENDIF                                                                      
e04  C                   ENDIF                                                                      
x03  C                   ELSE                                                                       
b04  C                   IF        T0CFC1 > 0                                                       
     C                   EVAL      ZXCOE1 = 999999                                                  
e04  C                   ENDIF                                                                      
b04  C                   IF        T0CFC2 > 0                                                       
     C                   EVAL      ZXCOE2 = 999999                                                  
e04  C                   ENDIF                                                                      
e03  C                   ENDIF                                                                      
      * si el coeficiente en conjunto compra comercial es diferente                                 
b03  C                   IF        ZXCOA1 > 0 And (ZXCOA1 <> ZXCOE1                                 
     C                                        Or ZXCOA1 = 999999)                                   
     C                   EVAL      @PERRO = '1'                                                     
     C                   EVAL      ZXINCI = '010'                                                   
     C                   EXSR      CS_DESERR                                                        
FQ710C                   LEAVE                                                                      
e03  C                   ENDIF                                                                      
      * si el coeficiente en conjunto venta productiva es diferente                                 
b03  C                   IF        ZXCOA2 > 0 And (ZXCOA2 <> ZXCOE2                                 
     C                                        Or ZXCOA2 = 999999)                                   
     C                   EVAL      @PERRO = '1'                                                     
     C                   EVAL      ZXINCI = '010'                                                   
     C                   EXSR      CS_DESERR                                                        
FQ710C                   LEAVE                                                                      
e03  C                   ENDIF                                                                      
      * guardo valores para siguiente componente                                                    
     C                   EVAL      ZXCOA1 = ZXCOE1                                                  
     C                   EVAL      ZXCOA2 = ZXCOE2                                                  
                                                                                                    
e02  C                   ENDIF                                                                      
14060C                   ENDIF                                                                      
                                                                                                    
     C     KEDTRLP00     READE     EDTRLP00                                                         
e01  C                   ENDDO                                                                      
                                                                                                    
      * recupero clave lógico 30                                                                    
FQ710C                   EXSR      CS_RSTLOG3                                                       
                                                                                                    
CR653C                   ENDIF                                                                      
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Validación Integridad de Conjuntos en Trace                                                 
      **********************************************************************                        
     C     CS_VALCONJ2   BEGSR                                                                      
                                                                                                    
CR653C                   IF        ZXPVEX<>'1'                                                      
      * guardo clave lógico 30                                                                      
FQ710C                   EXSR      CS_SAVLOG3                                                       
                                                                                                    
     C                   EVAL      ZXCOE1 = 0                                                       
     C                   EVAL      ZXCOE2 = 0                                                       
     C                   EVAL      ZXCOA1 = 0                                                       
     C                   EVAL      ZXCOA2 = 0                                                       
14070C                   EVAL      ZXCMI1 = 0                                                       
14070C                   EVAL      ZXCMI2 = 0                                                       
FQ710C                   EVAL      ZXSACANS = 0                                                     
                                                                                                    
      * leo fichero por la clave principal la linea de Vtas de Comercial                            
     C     KEDTRLP00     SETLL     EDTRLP00                                                         
     C     KEDTRLP00     READE     EDTRLP00                                                         
d01  C                   DOW       NOT %EOF(EDTRLP00)                                               
                                                                                                    
14060C                   IF        T0TREG < 3                                                       
      * Si hay algún conjunto de Compra-Cial o Venta-Product                                        
b02  C                   IF        T0CFC1 > 0 Or T0CFC2 > 0                                         
14060C                   MOVEL     T0NPC1        ZXNPC1                                             
      * busco cantidad pendiente de preparar en CODEPE TRACE                                        
     C                   EVAL      S5CIAS = T0CIA3                                                  
     C                   MOVEL     T0DLG3        S5DLGA                                             
     C                   MOVEL     T0NPC3        S5NPCO                                             
     C                   MOVEL     T0TPE3        S5TPED                                             
     C                   EVAL      S5DATP = T0DAT3                                                  
     C                   EVAL      S5NOPL = T0NOP3                                                  
     C                   EVAL      S5LINE = T0LIN3                                                  
     C     KCODEPE       CHAIN     CODEPE                                                           
      * calculo coeficiente cantidad preparada                                                      
b03  C                   IF        %FOUND(CODEPE)                                                   
     C                   EVAL      ZXCANP = 0                                                       
14060C                   EVAL      ZXCANC = S5CANR-S5CAPP                                           
14060 * Si es X-DOC Busco cantidad en X-DOC                                                         
14060C                   IF        S5CCPP = '1' And T0CFC1 > 0                                      
14060C                   EVAL      TKCIAS = S5CIAS                                                  
14060C                   EVAL      TKDLGA = S5DLGA                                                  
14060C                   EVAL      TKNPCO = S5NPCO                                                  
14060C                   EVAL      TKTPED = S5TPED                                                  
14060C                   EVAL      TKDATP = S5DATP                                                  
14060C                   EVAL      TKNOPL = S5NOPL                                                  
14060C     KCOXDOC       CHAIN     COXDOC                                                           
14060C                   IF        %FOUND(COXDOC) And S5CANR>0                                      
14060C                   EVAL      ZXCANC = 0                                                       
14060C                   DOW       NOT %EOF(COXDOC)                                                 
14060C                   IF        TKNP01=ZXNPC1 And TKLI01=T0LIN1                                  
14060C                   EVAL      ZXCANC = ZXCANC + TKCANT                                         
14060C                   ENDIF                                                                      
14060C     KCOXDOC       READE     COXDOC                                                           
14060C                   ENDDO                                                                      
14060C                   ENDIF                                                                      
14060C                   ENDIF                                                                      
      * Si esta en preparación miro si es la que estoy creando o otra                               
b04  C                   IF        S5MPRP='1'                                                       
      * busco cantidad preparada en preparación de Trace                                            
     C                   EVAL      SACIAS = S5CIAS                                                  
     C                   EVAL      SATNPE = ' '                                                     
     C                   EVAL      SADLGA = S5DLGA                                                  
     C                   EVAL      SANPCO = S5NPCO                                                  
     C                   EVAL      SATPED = S5TPED                                                  
     C                   EVAL      SADATP = S5DATP                                                  
     C                   EVAL      SANOPL = S5NOPL                                                  
     C                   EVAL      SALINE = S5LINE                                                  
     C     KCOAPRP00     CHAIN     COAPR101                                                         
d05  C                   DOW       NOT %EOF(COAPR101)                                               
      * busco status cabecera                                                                       
     C                   EVAL      SBCIAS = SACIAS                                                  
     C                   EVAL      SBDLGA = *BLANKS                                                 
     C                   EVAL      SBNPRP = SANPRP                                                  
     C     KCOAPRC       CHAIN     COAPRC                                                           
b06  C                   IF        %FOUND(COAPRC) And SBSTCO<'20'                                   
     C                   EVAL      ZXCANP = ZXCANP + SACANS                                         
e06  C                   ENDIF                                                                      
     C     KCOAPRP00     READE     COAPR101                                                         
e05  C                   ENDDO                                                                      
e04  C                   ENDIF                                                                      
                                                                                                    
b04  C                   IF        T0CFC1 > 0                                                       
14060C                   EVAL      ZXCOE1 = (ZXCANC+ZXCANP) / T0CFC1                                
b05  C                   IF        ZXCOE1 = 0                                                       
     C                   EVAL      ZXCOE1 = 999999                                                  
14070C                   EVAL      ZXCMI1 = 0                                                       
14070C                   ELSE                                                                       
14070C                   IF        ZXCOE1 < ZXCMI1 Or ZXCOA1 = 0                                    
FQ710C**                 EVAL      ZXCMI1 = ZXCOE1                                                  
FQ710C                   EVAL      ZXCMI1 = %INT(ZXCOE1)                                            
14070C                   ENDIF                                                                      
e05  C                   ENDIF                                                                      
e04  C                   ENDIF                                                                      
b04  C                   IF        T0CFC2 > 0                                                       
06070C                   EVAL      ZXCOE2 = (ZXCANC+ZXCANP) / T0CFC2                                
b05  C                   IF        ZXCOE2 = 0                                                       
     C                   EVAL      ZXCOE2 = 999999                                                  
14070C                   EVAL      ZXCMI2 = 0                                                       
14070C                   ELSE                                                                       
14070C                   IF        ZXCOE2 < ZXCMI2 Or ZXCOA2 = 0                                    
FQ710C**                 EVAL      ZXCMI2 = ZXCOE2                                                  
FQ710C                   EVAL      ZXCMI2 = %INT(ZXCOE2)                                            
14070C                   ENDIF                                                                      
e05  C                   ENDIF                                                                      
e04  C                   ENDIF                                                                      
x03  C                   ELSE                                                                       
b04  C                   IF        T0CFC1 > 0                                                       
     C                   EVAL      ZXCOE1 = 999999                                                  
14070C                   EVAL      ZXCMI1 = 0                                                       
e04  C                   ENDIF                                                                      
b04  C                   IF        T0CFC2 > 0                                                       
     C                   EVAL      ZXCOE2 = 999999                                                  
14070C                   EVAL      ZXCMI2 = 0                                                       
e04  C                   ENDIF                                                                      
e03  C                   ENDIF                                                                      
      * si el coeficiente en conjunto compra comercial es diferente                                 
14070C**                 IF        ZXCOA1 > 0 And (ZXCOA1 <> ZXCOE1                                 
14070C**                                      Or ZXCOA1 = 999999)                                   
14070C                   IF        ZXCMI1 = 0 And T0CFC1 > 0                                        
     C                   EVAL      @PERRO = '1'                                                     
     C                   EVAL      ZXINCI = '010'                                                   
     C                   EXSR      CS_DESERR                                                        
FQ710C                   LEAVE                                                                      
e03  C                   ENDIF                                                                      
      * si el coeficiente en conjunto venta productiva es diferente                                 
14070C**                 IF        ZXCOA2 > 0 And (ZXCOA2 <> ZXCOE2                                 
14070C**                                      Or ZXCOA2 = 999999)                                   
14070C                   IF        ZXCMI2 = 0 And T0CFC2 > 0                                        
     C                   EVAL      @PERRO = '1'                                                     
     C                   EVAL      ZXINCI = '010'                                                   
     C                   EXSR      CS_DESERR                                                        
FQ710C                   LEAVE                                                                      
e03  C                   ENDIF                                                                      
      * guardo valores para siguiente componente                                                    
     C                   EVAL      ZXCOA1 = ZXCOE1                                                  
     C                   EVAL      ZXCOA2 = ZXCOE2                                                  
                                                                                                    
e02  C                   ENDIF                                                                      
14060C                   ENDIF                                                                      
                                                                                                    
     C     KEDTRLP00     READE     EDTRLP00                                                         
e01  C                   ENDDO                                                                      
FQ710                                                                                               
FQ710C                   IF        ZXCMI1 > 0                                                       
FQ710C                   EVAL      ZXSACANS = ZXCMI1                                                
FQ710C                   ENDIF                                                                      
FQ710C                   IF        ZXCMI2 > 0                                                       
FQ710C                   EVAL      ZXSACANS = ZXCMI2                                                
FQ710C                   ENDIF                                                                      
                                                                                                    
      * recupero clave lógico 30                                                                    
FQ710C                   EXSR      CS_RSTLOG3                                                       
CR653C                   ENDIF                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Validación Integridad del X-DOC                                                             
      **********************************************************************                        
     C**   CS_INTXDOC    BEGSR                                                                      
      **                                                                                            
     C**                 ENDSR                                                                      
FQ710 **********************************************************************                        
FQ710 * Validación Coenvio                                                                          
FQ710 **********************************************************************                        
FQ710C     CS_COENVIO    BEGSR                                                                      
CR653C                   IF        ZXPVEX<>'1'                                                      
FQ710                                                                                               
FQ710C                   MOVEL     T0DLG3        @PEDLGA                                            
FQ710C                   MOVEL     T0NPC3        @PENPCO                                            
FQ710C                   MOVEL     T0TPE3        @PETPED                                            
FQ710                                                                                               
FQ710C                   CALL      'CO2696'                                                         
FQ710C                   PARM      T0CIA3        @PECIAS                                            
FQ710C                   PARM                    @PEDLGA                                            
FQ710C                   PARM                    @PENPCO                                            
FQ710C                   PARM                    @PETPED                                            
FQ710C                   PARM      T0DAT3        @PEDATP                                            
FQ710C                   PARM      T0NOP3        @PENOPL                                            
FQ710C                   PARM      T0LIN3        @PELINE                                            
FQ710C                   PARM      *BLANKS       @PEERR                                             
FQ710 *                                                                                             
FQ710C                   IF        @PEERR>'0'                                                       
C3690C                   SELECT                                                                     
C3690C                   WHEN      @PEERR = '5'                                                     
C3690C                   EVAL      ZXINCI = '013'                                                   
C3690C                   EVAL      @PERRO = '1'                                                     
C3690C                   WHEN      @PEERR = '6'                                                     
C3690C                   EVAL      ZXINCI = '007'                                                   
C3690C                   EVAL      @PERRO = '1'                                                     
C3690C                   WHEN      @PEERR = '7'                                                     
C3690C                   EVAL      ZXINCI = '020'                                                   
C3690C                   EVAL      @PERRO = '1'                                                     
C3690C                   OTHER                                                                      
FQ710C                   EVAL      ZXINCI = '017'                                                   
C3690C                   EVAL      @PERRO = '1'                                                     
C3690C                   ENDSL                                                                      
FQ710C*                  EVAL      @PERRO = '1'                                                     
FQ710C*                  EVAL      ZXINCI = '017'                                                   
FQ710C                   EXSR      CS_DESERR                                                        
FQ710C                   ENDIF                                                                      
FQ710                                                                                               
CR653C                   ENDIF                                                                      
FQ710C                   ENDSR                                                                      
FQ710 **********************************************************************                        
FQ710 * Validación Forzar Preparación                                                               
FQ710 **********************************************************************                        
FQ710C     CS_FORPREP    BEGSR                                                                      
FQ710                                                                                               
CR653C                   IF        ZXPVEX<>'1'                                                      
FQ710 * si No han forzado la preparación y teniamos incidencia minimo                               
FQ710 *    por expedición no puedo preparar.                                                        
FQ710C                   IF        T0FOPR = 0  And ZXINCI = '016'                                   
FQ710C                   EVAL      @PERRO = '1'                                                     
FQ710C                   EXSR      CS_DESERR                                                        
FQ710C                   ELSE                                                                       
FQ710C                   EVAL      ZXINCI = *BLANKS                                                 
FQ710C                   ENDIF                                                                      
CR653C                   ENDIF                                                                      
FQ710                                                                                               
FQ710C                   ENDSR                                                                      
FQ710 **********************************************************************                        
FQ710 * Validación importe minimo por expedición en un cliente-direcc.                              
FQ710 **********************************************************************                        
FQ710C     CS_IMPOEXP    BEGSR                                                                      
CR653C                   IF        ZXPVEX<>'1'                                                      
FQ710                                                                                               
FQ710 * Recuperamos valores de selección del OPENQRYFILE                                            
FQ710C                   EVAL      JOLINE=99                                                        
FQ710C     KMJOB         CHAIN     PMJOBC                             81                            
FQ710C                   IF        CHAIN=*OFF                                                       
FQ710C     JODATO        CAT       CO3076:0      CO3076                                             
FQ710C                   ENDIF                                                                      
FQ710                                                                                               
FQ710 * si la linea está reservada, y no tiene errores, acumulo importe                             
FQ710C                   IF        (T0CANR - T0CANP) > 0                                            
FQ710 *           guardo clave lógico 40                                                            
FQ710C                   EXSR      CS_SAVLOG4                                                       
FQ710C                   EVAL      ZXSACANS = 0                                                     
FQ710 * Validación Pedido Trace                                                                     
FQ710C                   IF        YDNPCO > T0NPC3 Or YHNPCO < T0NPC3                               
FQ710C                   EVAL      @PERRO = '1'                                                     
FQ710C                   GOTO      NOMAS                                                            
FQ710C                   ENDIF                                                                      
CR527 *                                                                                             
CR527 * Omitimos todos los condicionantes si es Fluidra Direct Express                              
CR527 *                                                                                             
CR527C                   IF        Z1SFDE<>'1'                                                      
FQ710 * Validación Fecha prevista envio                                                             
FQ710C                   IF        ZDFREP > T0FREP Or ZHFREP < T0FREP                               
FQ710C                   EVAL      @PERRO = '1'                                                     
FQ710C                   GOTO      NOMAS                                                            
FQ710C                   ENDIF                                                                      
CR527C                   ENDIF                                                                      
FQ710 * Validación si la linea esta cerrada                                                         
FQ710C                   EXSR      CS_LINCERR                                                       
FQ710C                   IF        @PERRO = '1'                                                     
FQ710C                   GOTO      NOMAS                                                            
FQ710C                   ENDIF                                                                      
FQ710 * Validación Pedido Retenido                                                                  
FQ710C                   EXSR      CS_PEDHOLD                                                       
FQ710C                   IF        @PERRO = '1'                                                     
FQ710C                   GOTO      NOMAS                                                            
FQ710C                   ENDIF                                                                      
FQ710 * Validación Riesgo Cliente                                                                   
FQ710C                   EXSR      CS_RISKCLI                                                       
FQ710C                   IF        @PERRO = '1'                                                     
FQ710C                   GOTO      NOMAS                                                            
FQ710C                   ENDIF                                                                      
FQ710 * Validación Integridad de Conjuntos en Trace                                                 
FQ710C                   EXSR      CS_VALCONJ2                                                      
FQ710C                   IF        @PERRO = '1'                                                     
FQ710C                   GOTO      NOMAS                                                            
FQ710C                   ENDIF                                                                      
FQ710 * Modificación en Curso                                                                       
FQ710C                   EXSR      CS_MODCURS                                                       
FQ710C                   IF        @PERRO = '1'                                                     
FQ710C                   GOTO      NOMAS                                                            
FQ710C                   ENDIF                                                                      
FQ710 * Coenvio                                                                                     
FQ710C                   EXSR      CS_COENVIO                                                       
FQ710C                   IF        @PERRO = '1'                                                     
FQ710C                   GOTO      NOMAS                                                            
FQ710C                   ENDIF                                                                      
FQ710C     NOMAS         TAG                                                                        
FQ710                                                                                               
FQ710C                   IF        @PERRO = *BLANKS                                                 
FQ710 * busco parámetros de la comercial                                                            
FQ710C                   EVAL      T3CIAS = T0CIAS                                                  
FQ710C                   EVAL      T3DLGA = T0DLGA                                                  
FQ710C     KEDPARM       CHAIN     EDPARM                                                           
FQ710 * acumulo importe de la preparación                                                           
FQ710C                   IF        ZXSACANS > 0                                                     
      ***                                                                                           
15091 * en el caso de conversión de unidades entre comercial y Trace                                
15091C                   IF        T0COFA > 1                                                       
15091C                   IF        T0TCOF = '0'                                                     
15091C                   EVAL(H)   ZXSACANS = ZXSACANS * T0COFA                                     
15091C                   ELSE                                                                       
15091C                   EVAL(H)   ZXSACANS = ZXSACANS / T0COFA                                     
15091C                   ENDIF                                                                      
15091C                   ENDIF                                                                      
15091 * en el caso de que sea Conjunto con coeficiente superior a 1                                 
15091C                   IF        T0CFC1 > 1                                                       
15091C                   EVAL(H)   ZXSACANS = ZXSACANS / T0CFC1                                     
15091C                   ENDIF                                                                      
15091C                   IF        T0CFC2 > 1                                                       
15091C                   EVAL(H)   ZXSACANS = ZXSACANS / T0CFC2                                     
15091C                   ENDIF                                                                      
      ***                                                                                           
FQ710C                   EVAL      ZXIMPEXP = ZXIMPEXP +                                            
FQ710C                             (ZXSACANS * T0IMPO)                                              
FQ710C                   ELSE                                                                       
15091C                   EVAL      ZXSACAN2 = 0                                                     
15091C                   EVAL      ZXSACAN2 = T0CANR - T0CANP                                       
15091 * en el caso de conversión de unidades entre comercial y Trace                                
15091C                   IF        T0COFA > 1                                                       
15091C                   IF        T0TCOF = '0'                                                     
15091C                   EVAL(H)   ZXSACAN2 = ZXSACAN2 * T0COFA                                     
15091C                   ELSE                                                                       
15091C                   EVAL(H)   ZXSACAN2 = ZXSACAN2 / T0COFA                                     
15091C                   ENDIF                                                                      
15091C                   ENDIF                                                                      
15091 * en el caso de que sea Conjunto con coeficiente superior a 1                                 
15091C                   IF        T0CFC1 > 1                                                       
15091C                   EVAL(H)   ZXSACAN2 = ZXSACAN2 / T0CFC1                                     
15091C                   ENDIF                                                                      
15091C                   IF        T0CFC2 > 1                                                       
15091C                   EVAL(H)   ZXSACAN2 = ZXSACAN2 / T0CFC2                                     
15091C                   ENDIF                                                                      
15091C                   EVAL      ZXIMPEXP = ZXIMPEXP +                                            
15091C                             (ZXSACAN2 * T0IMPO)                                              
15091C*                  EVAL      ZXIMPEXP = ZXIMPEXP +                                            
15091C*                            ((T0CANR - T0CANP) * T0IMPO)                                     
FQ710C                   ENDIF                                                                      
FQ710 * si fecha ultima reseva es anterior, la guardo                                               
FQ710C                   IF        T0FURE > 0 And T0FURE < ZXFURE                                   
FQ710C                   EVAL      ZXFURE = T0FURE                                                  
FQ710C                   ENDIF                                                                      
FQ710C                   ENDIF                                                                      
FQ710                                                                                               
FQ710C                   EVAL      ZXINCI = *BLANKS                                                 
FQ710C                   EVAL      @PERRO = *BLANKS                                                 
FQ710 *           recupero clave lógico 40                                                          
FQ710C                   EXSR      CS_RSTLOG4                                                       
FQ710                                                                                               
FQ710C                   ENDIF                                                                      
FQ710                                                                                               
CR653C                   ENDIF                                                                      
FQ710C                   ENDSR                                                                      
FQ710 **********************************************************************                        
FQ710 * Validación importe minimo por expedición en una preparación                                 
FQ710 **********************************************************************                        
FQ710C     CS_IMPOEXP2   BEGSR                                                                      
CR653C                   IF        ZXPVEX<>'1'                                                      
FQ710                                                                                               
CR527 *                                                                                             
CR527 * Omitimos todos los condicionantes si es Fluidra Direct Express                              
CR527 *                                                                                             
CR527C                   IF        Z1SFDE<>'1'                                                      
CR527 *                                                                                             
FQ710C                   EVAL      ZXFOPR = 1                                                       
FQ710 * leo toda la preparación                                                                     
FQ710C                   EVAL      SACIAS = @PCIAS                                                  
FQ710C                   EVAL      SANPRP = @PCUST                                                  
FQ710C     KCOAPRP       CHAIN     COAPR1                             83                            
FQ710C                   IF        %FOUND(COAPR1)                                                   
FQ710C                   EVAL      ZXCONS = 1                                                       
FQ710C                   ELSE                                                                       
FQ710C     KCOAPRP       CHAIN     COAPRP                             83                            
FQ710C                   EVAL      ZXCONS = 0                                                       
FQ710C                   ENDIF                                                                      
FQ710                                                                                               
FQ710C                   DOW       *IN83=*OFF                                                       
FQ710                                                                                               
FQ710C                   EVAL      ZXIMPO = 0                                                       
FQ710C                   EVAL      ZXSACANS = 0                                                     
FQ710 * leo todos los registros de EDTRLP con la clave de TRACE                                     
FQ710C                   EVAL      T0CIA3 = SACIAS                                                  
FQ710C                   EVAL      T0DLG3 = SADLGA                                                  
FQ710C                   EVAL      T0NPC3 = SANPCO                                                  
FQ710C                   EVAL      T0TPE3 = SATPED                                                  
FQ710C                   EVAL      T0DAT3 = SADATP                                                  
FQ710C                   EVAL      T0NOP3 = SANOPL                                                  
FQ710C                   EVAL      T0LIN3 = SALINE                                                  
FQ710C                   EVAL      T0CIAS = 0                                                       
FQ710C                   EVAL      T0DLGA = *BLANKS                                                 
FQ710C                   EVAL      T0NPCO = *BLANKS                                                 
FQ710C                   EVAL      T0TPED = *BLANKS                                                 
FQ710C                   EVAL      T0DATP = 0                                                       
FQ710C                   EVAL      T0NOPL = 0                                                       
FQ710C                   EVAL      T0LINE = 0                                                       
FQ710C                   EVAL      T0ARV1 = *BLANKS                                                 
FQ710C                   EVAL      T0COM2 = *BLANKS                                                 
FQ710C     KEDTRLP300    SETLL     EDTRLP30                                                         
FQ710C     KEDTRLP30     READE(N)  EDTRLP30                                                         
FQ710                                                                                               
FQ710 * busco parámetros de la comercial                                                            
FQ710C                   EVAL      T3CIAS = T0CIAS                                                  
FQ710C                   EVAL      T3DLGA = T0DLGA                                                  
FQ710C     KEDPARM       CHAIN     EDPARM                                                           
FQ710                                                                                               
FQ710C                   DOW       NOT %EOF(EDTRLP30)                                               
FQ710C                   IF        T0TREG = 0 Or T0TREG = 3                                         
FQ710 * si fecha ultima reseva es anterior, la guardo                                               
FQ710C                   IF        T0FURE > 0 And T0FURE < ZXFURE                                   
FQ710C                   EVAL      ZXFURE = T0FURE                                                  
FQ710C                   ENDIF                                                                      
FQ710 * si no han forzado preparación lo marco                                                      
FQ710C                   IF        T0FOPR = 0                                                       
FQ710C                   EVAL      ZXFOPR = 0                                                       
FQ710C                   ENDIF                                                                      
FQ710 * en el caso de x-doc la cantidad la cojo del EDTRLP                                          
FQ710C                   IF        T0XDOC = 1                                                       
FQ710C                   EVAL      ZXSACANS = T0CAN3                                                
FQ710C                   ELSE                                                                       
FQ710C                   EVAL      ZXSACANS = SACANS                                                
FQ710C                   ENDIF                                                                      
FQ710 * en el caso de conversión de unidades entre comercial y Trace                                
FQ710C                   IF        T0COFA > 1                                                       
FQ710C                   IF        T0TCOF = '0'                                                     
FQ710C                   EVAL(H)   ZXSACANS = ZXSACANS * T0COFA                                     
FQ710C                   ELSE                                                                       
FQ710C                   EVAL(H)   ZXSACANS = ZXSACANS / T0COFA                                     
FQ710C                   ENDIF                                                                      
FQ710C                   ENDIF                                                                      
FQ710 * en el caso de que sea Conjunto con coeficiente superior a 1                                 
FQ710C                   IF        T0CFC1 > 1                                                       
FQ710C                   EVAL(H)   ZXSACANS = ZXSACANS / T0CFC1                                     
FQ710C                   ENDIF                                                                      
FQ710C                   IF        T0CFC2 > 1                                                       
FQ710C                   EVAL(H)   ZXSACANS = ZXSACANS / T0CFC2                                     
FQ710C                   ENDIF                                                                      
FQ710                                                                                               
FQ710 * acumulo importe de la linea de la preparación                                               
FQ710C                   EVAL(H)   ZXIMPEXP = ZXIMPEXP +                                            
FQ710C                                        (ZXSACANS * T0IMPO)                                   
FQ710                                                                                               
FQ710C                   ENDIF                                                                      
FQ710C     KEDTRLP30     READE(N)  EDTRLP30                                                         
FQ710C                   ENDDO                                                                      
FQ710                                                                                               
FQ710C                   IF        ZXCONS = 0                                                       
FQ710C     KCOAPRP       READE     COAPRP                                 83                        
FQ710C                   ELSE                                                                       
FQ710C     KCOAPRP       READE     COAPR1                                 83                        
FQ710C                   ENDIF                                                                      
FQ710C                   ENDDO                                                                      
CR527                                                                                               
CR527C                   ENDIF                                                                      
CR527                                                                                               
FQ710                                                                                               
CR653C                   ENDIF                                                                      
FQ710C                   ENDSR                                                                      
      **********************************************************************                        
      * Lectura Fichero Trazas Según Origen e Integridad Datos                                      
      **********************************************************************                        
     C     CS_READFIL    BEGSR                                                                      
                                                                                                    
      * Monto claves en función del Origen                                                          
FQ710C                   IF        @PEDAU = '303' And @PINTE = 3                                    
FQ710C                   MOVEL     @PARV1        @PJOBC                                             
FQ710C                   EVAL      @PARV1 = *BLANKS                                                 
FQ710C                   ENDIF                                                                      
b01  C                   IF        @PEDAU <> '305'                                                  
     C                   EVAL      T0CUST = @PCUST                                                  
     C                   EVAL      T0TDI1 = @PTDI1                                                  
e01  C                   ENDIF                                                                      
s01  C                   SELECT                                                                     
FQ710C                   WHEN      @PLOGI = 0 And @PINTE <> 3                                       
     C                   EVAL      T0CIAS = @PCIAS                                                  
     C                   EVAL      T0DLGA = @PDLGA                                                  
     C                   EVAL      T0NPCO = @PNPCO                                                  
     C                   EVAL      T0TPED = @PTPED                                                  
     C                   EVAL      T0DATP = @PDATP                                                  
     C                   EVAL      T0NOPL = @PNOPL                                                  
     C                   EVAL      T0LINE = @PLINE                                                  
FQ710C                   WHEN      @PLOGI = 1 And @PINTE <> 3                                       
     C                   EVAL      T0CIA1 = @PCIAS                                                  
     C                   EVAL      T0DLG1 = @PDLGA                                                  
     C                   EVAL      T0NPC1 = @PNPCO                                                  
     C                   EVAL      T0TPE1 = @PTPED                                                  
     C                   EVAL      T0DAT1 = @PDATP                                                  
     C                   EVAL      T0NOP1 = @PNOPL                                                  
     C                   EVAL      T0LIN1 = @PLINE                                                  
     C                   EVAL      T0ARV1 = @PARV1                                                  
FQ710C                   WHEN      @PLOGI = 2 And @PINTE <> 3                                       
     C                   EVAL      T0CIA2 = @PCIAS                                                  
     C                   EVAL      T0DLG2 = @PDLGA                                                  
     C                   EVAL      T0NPC2 = @PNPCO                                                  
     C                   EVAL      T0TPE2 = @PTPED                                                  
     C                   EVAL      T0DAT2 = @PDATP                                                  
     C                   EVAL      T0NOP2 = @PNOPL                                                  
     C                   EVAL      T0LIN2 = @PLINE                                                  
     C                   EVAL      T0COM2 = @PCOM2                                                  
FQ710C                   WHEN      @PLOGI = 3 And @PINTE <> 3                                       
     C                   EVAL      T0CIA3 = @PCIAS                                                  
     C                   EVAL      T0DLG3 = @PDLGA                                                  
     C                   EVAL      T0NPC3 = @PNPCO                                                  
     C                   EVAL      T0TPE3 = @PTPED                                                  
     C                   EVAL      T0DAT3 = @PDATP                                                  
     C                   EVAL      T0NOP3 = @PNOPL                                                  
     C                   EVAL      T0LIN3 = @PLINE                                                  
FQ710C                   WHEN      @PINTE = 3                                                       
FQ710C                   EVAL      T0CIAS = @PCIAS                                                  
FQ710C                   EVAL      T0CUST = @PCUST                                                  
FQ710C                   EVAL      T0TDI1 = @PTDI1                                                  
e01  C                   ENDSL                                                                      
01070                                                                                               
01070C                   EVAL      S5CIAS=@PCIAS                                                    
01070C                   EVAL      S5DLGA=@PDLGA                                                    
01070C                   EVAL      S5NPCO=@PNPCO                                                    
01070C                   EVAL      S5TPED=@PTPED                                                    
01070C                   EVAL      S5DATP=@PDATP                                                    
01070C                   EVAL      S5NOPL=@PNOPL                                                    
01070C                   EVAL      S5LINE=@PLINE                                                    
                                                                                                    
      * Leo lógicos en función a la Integridad de datos a Comprobar                                 
s01  C                   SELECT                                                                     
     C                   WHEN      @PLOGI = 0 And @PINTE = 1                                        
     C     KEDTRLP00     SETLL     EDTRLP00                                                         
     C     KEDTRLP00     READE     EDTRLP00                               82                        
     C                   WHEN      @PLOGI = 0 And @PINTE = 2                                        
     C     KEDTRLP00P    SETLL     EDTRLP00                                                         
     C     KEDTRLP00P    READE     EDTRLP00                               82                        
01070C                   EVAL      S5LINE=T0LINE                                                    
     C                   WHEN      @PLOGI = 1 And @PINTE = 1                                        
     C                             And @PARV1 = *BLANKS                                             
     C     KEDTRLP10     SETLL     EDTRLP10                                                         
     C     KEDTRLP10     READE     EDTRLP10                               82                        
01070C                   EVAL      S5CIAS=T0CIAS                                                    
01070C                   EVAL      S5DLGA=T0DLGA                                                    
01070C                   EVAL      S5NPCO=T0NPCO                                                    
01070C                   EVAL      S5TPED=T0TPED                                                    
01070C                   EVAL      S5DATP=T0DATP                                                    
01070C                   EVAL      S5NOPL=T0NOPL                                                    
01070C                   EVAL      S5LINE=T0LINE                                                    
     C                   WHEN      @PLOGI = 1 And @PINTE = 1                                        
     C                             And @PARV1 <> *BLANKS                                            
     C     KEDTRLP10X    SETLL     EDTRLP10                                                         
     C     KEDTRLP10X    READE     EDTRLP10                               82                        
01070C                   EVAL      S5CIAS=T0CIAS                                                    
01070C                   EVAL      S5DLGA=T0DLGA                                                    
01070C                   EVAL      S5NPCO=T0NPCO                                                    
01070C                   EVAL      S5TPED=T0TPED                                                    
01070C                   EVAL      S5DATP=T0DATP                                                    
01070C                   EVAL      S5NOPL=T0NOPL                                                    
01070C                   EVAL      S5LINE=T0LINE                                                    
     C                   WHEN      @PLOGI = 1 And @PINTE = 2                                        
     C     KEDTRLP10P    SETLL     EDTRLP10                                                         
     C     KEDTRLP10P    READE     EDTRLP10                               82                        
01070C                   EVAL      S5CIAS=T0CIAS                                                    
01070C                   EVAL      S5DLGA=T0DLGA                                                    
01070C                   EVAL      S5NPCO=T0NPCO                                                    
01070C                   EVAL      S5TPED=T0TPED                                                    
01070C                   EVAL      S5DATP=T0DATP                                                    
01070C                   EVAL      S5NOPL=T0NOPL                                                    
01070C                   EVAL      S5LINE=T0LINE                                                    
     C                   WHEN      @PLOGI = 2 And @PINTE = 1                                        
     C                             And @PCOM2 = *BLANKS                                             
     C     KEDTRLP20     SETLL     EDTRLP20                                                         
     C     KEDTRLP20     READE     EDTRLP20                               82                        
     C                   WHEN      @PLOGI = 2 And @PINTE = 1                                        
     C                             And @PCOM2 <> *BLANKS                                            
     C     KEDTRLP20X    SETLL     EDTRLP20                                                         
     C     KEDTRLP20X    READE     EDTRLP20                               82                        
     C                   WHEN      @PLOGI = 2 And @PINTE = 2                                        
     C     KEDTRLP20P    SETLL     EDTRLP20                                                         
     C     KEDTRLP20P    READE     EDTRLP20                               82                        
01070C                   EVAL      S5LINE=T0LIN2                                                    
     C                   WHEN      @PLOGI = 3 And @PINTE = 1                                        
     C                             And @PEDAU <> '303' And @PEDAU <> '305'                          
     C     KEDTRLP30     SETLL     EDTRLP30                                                         
     C     KEDTRLP30     READE(N)  EDTRLP30                               82                        
     C                   WHEN      @PLOGI = 3 And @PINTE = 2                                        
     C                             And @PEDAU <> '303' And @PEDAU <> '305'                          
     C     KEDTRLP30P    SETLL     EDTRLP30                                                         
     C     KEDTRLP30P    READE(N)  EDTRLP30                               82                        
01070C                   EVAL      S5LINE=T0LIN3                                                    
     C                   WHEN      @PLOGI = 3 And @PINTE = 1                                        
     C                             And (@PEDAU = '303' Or @PEDAU = '305')                           
     C     KEDTRLP30     SETLL     EDTRLP30                                                         
     C     KEDTRLP30     READE     EDTRLP30                               82                        
     C                   WHEN      @PLOGI = 3 And @PINTE = 2                                        
     C                             And (@PEDAU = '303' Or @PEDAU = '305')                           
     C     KEDTRLP30P    SETLL     EDTRLP30                                                         
     C     KEDTRLP30P    READE     EDTRLP30                               82                        
01070C                   EVAL      S5LINE=T0LIN3                                                    
     C                   WHEN      (@PLOGI=0 Or @PLOGI=1 Or @PLOGI=2                                
     C                             Or @PLOGI = 3) And @PINTE = 3                                    
     C     KEDTRLP40     SETLL     EDTRLP40                                                         
     C     KEDTRLP40     READE     EDTRLP40                               82                        
01070C                   EVAL      S5LINE=T0LINE                                                    
e01  C                   ENDSL                                                                      
                                                                                                    
01070C     KCODEPE       CHAIN     CODEPE                                                           
01070                                                                                               
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Lectura Fichero Eliminados Según Origen e Integridad Datos                                  
      **********************************************************************                        
     C     CS_READFIX    BEGSR                                                                      
                                                                                                    
      * Monto claves en función del Origen                                                          
b01  C                   IF        @PEDAU <> '305'                                                  
     C                   EVAL      T0CUST = @PCUST                                                  
     C                   EVAL      T0TDI1 = @PTDI1                                                  
e01  C                   ENDIF                                                                      
s01  C                   SELECT                                                                     
FQ710C                   WHEN      @PLOGI = 0 And @PINTE <> 3                                       
     C                   EVAL      T0CIAS = @PCIAS                                                  
     C                   EVAL      T0DLGA = @PDLGA                                                  
     C                   EVAL      T0NPCO = @PNPCO                                                  
     C                   EVAL      T0TPED = @PTPED                                                  
     C                   EVAL      T0DATP = @PDATP                                                  
     C                   EVAL      T0NOPL = @PNOPL                                                  
     C                   EVAL      T0LINE = @PLINE                                                  
FQ710C                   WHEN      @PLOGI = 1 And @PINTE <> 3                                       
     C                   EVAL      T0CIA1 = @PCIAS                                                  
     C                   EVAL      T0DLG1 = @PDLGA                                                  
     C                   EVAL      T0NPC1 = @PNPCO                                                  
     C                   EVAL      T0TPE1 = @PTPED                                                  
     C                   EVAL      T0DAT1 = @PDATP                                                  
     C                   EVAL      T0NOP1 = @PNOPL                                                  
     C                   EVAL      T0LIN1 = @PLINE                                                  
     C                   EVAL      T0ARV1 = @PARV1                                                  
FQ710C                   WHEN      @PLOGI = 2 And @PINTE <> 3                                       
     C                   EVAL      T0CIA2 = @PCIAS                                                  
     C                   EVAL      T0DLG2 = @PDLGA                                                  
     C                   EVAL      T0NPC2 = @PNPCO                                                  
     C                   EVAL      T0TPE2 = @PTPED                                                  
     C                   EVAL      T0DAT2 = @PDATP                                                  
     C                   EVAL      T0NOP2 = @PNOPL                                                  
     C                   EVAL      T0LIN2 = @PLINE                                                  
     C                   EVAL      T0COM2 = @PCOM2                                                  
FQ710C                   WHEN      @PLOGI = 3 And @PINTE <> 3                                       
     C                   EVAL      T0CIA3 = @PCIAS                                                  
     C                   EVAL      T0DLG3 = @PDLGA                                                  
     C                   EVAL      T0NPC3 = @PNPCO                                                  
     C                   EVAL      T0TPE3 = @PTPED                                                  
     C                   EVAL      T0DAT3 = @PDATP                                                  
     C                   EVAL      T0NOP3 = @PNOPL                                                  
     C                   EVAL      T0LIN3 = @PLINE                                                  
FQ710C                   WHEN      @PINTE = 3                                                       
FQ710C                   EVAL      T0CIAS = @PCIAS                                                  
FQ710C                   EVAL      T0CUST = @PCUST                                                  
FQ710C                   EVAL      T0TDI1 = @PTDI1                                                  
e01  C                   ENDSL                                                                      
                                                                                                    
      * Leo lógicos en función a la Integridad de datos a Comprobar                                 
s01  C                   SELECT                                                                     
     C                   WHEN      @PLOGI = 0 And @PINTE = 1                                        
     C     KEDTRLP00     SETLL     EDTRLX00                                                         
     C     KEDTRLP00     READE     EDTRLX00                               82                        
     C                   WHEN      @PLOGI = 0 And @PINTE = 2                                        
     C     KEDTRLP00P    SETLL     EDTRLX00                                                         
     C     KEDTRLP00P    READE     EDTRLX00                               82                        
     C                   WHEN      @PLOGI = 1 And @PINTE = 1                                        
     C                             And @PARV1 = *BLANKS                                             
     C     KEDTRLP10     SETLL     EDTRLX10                                                         
     C     KEDTRLP10     READE     EDTRLX10                               82                        
     C                   WHEN      @PLOGI = 1 And @PINTE = 1                                        
     C                             And @PARV1 <> *BLANKS                                            
     C     KEDTRLP10X    SETLL     EDTRLX10                                                         
     C     KEDTRLP10X    READE     EDTRLX10                               82                        
     C                   WHEN      @PLOGI = 1 And @PINTE = 2                                        
     C     KEDTRLP10P    SETLL     EDTRLX10                                                         
     C     KEDTRLP10P    READE     EDTRLX10                               82                        
     C                   WHEN      @PLOGI = 2 And @PINTE = 1                                        
     C                             And @PCOM2 = *BLANKS                                             
     C     KEDTRLP20     SETLL     EDTRLX20                                                         
     C     KEDTRLP20     READE     EDTRLX20                               82                        
     C                   WHEN      @PLOGI = 2 And @PINTE = 1                                        
     C                             And @PCOM2 <> *BLANKS                                            
     C     KEDTRLP20X    SETLL     EDTRLX20                                                         
     C     KEDTRLP20X    READE     EDTRLX20                               82                        
     C                   WHEN      @PLOGI = 2 And @PINTE = 2                                        
     C     KEDTRLP20P    SETLL     EDTRLX20                                                         
     C     KEDTRLP20P    READE     EDTRLX20                               82                        
     C                   WHEN      @PLOGI = 3 And @PINTE = 1                                        
     C                             And @PEDAU <> '303' And @PEDAU <> '305'                          
     C     KEDTRLP30     SETLL     EDTRLX30                                                         
     C     KEDTRLP30     READE(N)  EDTRLX30                               82                        
     C                   WHEN      @PLOGI = 3 And @PINTE = 2                                        
     C                             And @PEDAU <> '303' And @PEDAU <> '305'                          
     C     KEDTRLP30P    SETLL     EDTRLX30                                                         
     C     KEDTRLP30P    READE(N)  EDTRLX30                               82                        
     C                   WHEN      @PLOGI = 3 And @PINTE = 1                                        
     C                             And (@PEDAU = '303' Or @PEDAU = '305')                           
     C     KEDTRLP30     SETLL     EDTRLX30                                                         
     C     KEDTRLP30     READE     EDTRLX30                               82                        
     C                   WHEN      @PLOGI = 3 And @PINTE = 2                                        
     C                             And (@PEDAU = '303' Or @PEDAU = '305')                           
     C     KEDTRLP30P    SETLL     EDTRLX30                                                         
     C     KEDTRLP30P    READE     EDTRLX30                               82                        
     C                   WHEN      (@PLOGI=0 Or @PLOGI=1 Or @PLOGI=2                                
     C                             Or @PLOGI = 3) And @PINTE = 3                                    
     C     KEDTRLP40     SETLL     EDTRLX40                                                         
     C     KEDTRLP40     READE     EDTRLX40                               82                        
e01  C                   ENDSL                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Lectura Fichero Trazas Según Origen e Integridad Datos                                      
      **********************************************************************                        
     C     CS_READFI2    BEGSR                                                                      
                                                                                                    
01070C                   EVAL      S5CIAS=@PCIAS                                                    
01070C                   EVAL      S5DLGA=@PDLGA                                                    
01070C                   EVAL      S5NPCO=@PNPCO                                                    
01070C                   EVAL      S5TPED=@PTPED                                                    
01070C                   EVAL      S5DATP=@PDATP                                                    
01070C                   EVAL      S5NOPL=@PNOPL                                                    
01070C                   EVAL      S5LINE=@PLINE                                                    
01070                                                                                               
      * Leo lógicos en función a la Integridad de datos a Comprobar                                 
s01  C                   SELECT                                                                     
     C                   WHEN      @PLOGI = 0 And @PINTE = 1                                        
     C     KEDTRLP00     READE     EDTRLP00                               82                        
     C                   WHEN      @PLOGI = 0 And @PINTE = 2                                        
     C     KEDTRLP00P    READE     EDTRLP00                               82                        
01070C                   EVAL      S5CIAS=@PCIAS                                                    
01070C                   EVAL      S5DLGA=@PDLGA                                                    
01070C                   EVAL      S5NPCO=@PNPCO                                                    
01070C                   EVAL      S5TPED=@PTPED                                                    
01070C                   EVAL      S5DATP=@PDATP                                                    
01070C                   EVAL      S5NOPL=@PNOPL                                                    
01070C                   EVAL      S5LINE=T0LINE                                                    
01070C     KCODEPE       CHAIN     CODEPE                                                           
     C                   WHEN      @PLOGI = 1 And @PINTE = 1                                        
     C                             And @PARV1 = *BLANKS                                             
     C     KEDTRLP10     READE     EDTRLP10                               82                        
01070C                   EVAL      S5CIAS=@PCIAS                                                    
01070C                   EVAL      S5DLGA=@PDLGA                                                    
01070C                   EVAL      S5NPCO=@PNPCO                                                    
01070C                   EVAL      S5TPED=@PTPED                                                    
01070C                   EVAL      S5DATP=@PDATP                                                    
01070C                   EVAL      S5NOPL=@PNOPL                                                    
01070C                   EVAL      S5LINE=T0LINE                                                    
     C                   WHEN      @PLOGI = 1 And @PINTE = 1                                        
     C                             And @PARV1 <> *BLANKS                                            
     C     KEDTRLP10X    READE     EDTRLP10                               82                        
01070C                   EVAL      S5CIAS=@PCIAS                                                    
01070C                   EVAL      S5DLGA=@PDLGA                                                    
01070C                   EVAL      S5NPCO=@PNPCO                                                    
01070C                   EVAL      S5TPED=@PTPED                                                    
01070C                   EVAL      S5DATP=@PDATP                                                    
01070C                   EVAL      S5NOPL=@PNOPL                                                    
01070C                   EVAL      S5LINE=T0LINE                                                    
     C                   WHEN      @PLOGI = 1 And @PINTE = 2                                        
     C     KEDTRLP10P    READE     EDTRLP10                               82                        
01070C                   EVAL      S5CIAS=@PCIAS                                                    
01070C                   EVAL      S5DLGA=@PDLGA                                                    
01070C                   EVAL      S5NPCO=@PNPCO                                                    
01070C                   EVAL      S5TPED=@PTPED                                                    
01070C                   EVAL      S5DATP=@PDATP                                                    
01070C                   EVAL      S5NOPL=@PNOPL                                                    
01070C                   EVAL      S5LINE=T0LINE                                                    
     C                   WHEN      @PLOGI = 2 And @PINTE = 1                                        
     C                             And @PCOM2 = *BLANKS                                             
     C     KEDTRLP20     READE     EDTRLP20                               82                        
     C                   WHEN      @PLOGI = 2 And @PINTE = 1                                        
     C                             And @PCOM2 <> *BLANKS                                            
     C     KEDTRLP20X    READE     EDTRLP20                               82                        
     C                   WHEN      @PLOGI = 2 And @PINTE = 2                                        
     C     KEDTRLP20P    READE     EDTRLP20                               82                        
01070C                   EVAL      S5LINE=T0LIN2                                                    
     C                   WHEN      @PLOGI = 3 And @PINTE = 1                                        
     C                             And @PEDAU <> '303' And @PEDAU <> '305'                          
     C     KEDTRLP30     READE(N)  EDTRLP30                               82                        
     C                   WHEN      @PLOGI = 3 And @PINTE = 2                                        
     C                             And @PEDAU <> '303' And @PEDAU <> '305'                          
     C     KEDTRLP30P    READE(N)  EDTRLP30                               82                        
01070C                   EVAL      S5LINE=T0LIN3                                                    
     C                   WHEN      @PLOGI = 3 And @PINTE = 1                                        
     C                             And (@PEDAU = '303' Or @PEDAU = '305')                           
     C     KEDTRLP30     READE     EDTRLP30                               82                        
     C                   WHEN      @PLOGI = 3 And @PINTE = 2                                        
     C                             And (@PEDAU = '303' Or @PEDAU = '305')                           
     C     KEDTRLP30P    READE     EDTRLP30                               82                        
01070C                   EVAL      S5LINE=T0LIN3                                                    
     C                   WHEN      (@PLOGI=0 Or @PLOGI=1 Or @PLOGI=2                                
     C                             Or @PLOGI = 3) And @PINTE = 3                                    
     C     KEDTRLP40     READE     EDTRLP40                               82                        
01070C                   EVAL      S5LINE=T0LINE                                                    
e01  C                   ENDSL                                                                      
01070                                                                                               
01070C     KCODEPE       CHAIN     CODEPE                                                           
                                                                                                    
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Lectura Fichero Eliminados Según Origen e Integridad Datos                                  
      **********************************************************************                        
     C     CS_READFX2    BEGSR                                                                      
                                                                                                    
      * Leo lógicos en función a la Integridad de datos a Comprobar                                 
s01  C                   SELECT                                                                     
     C                   WHEN      @PLOGI = 0 And @PINTE = 1                                        
     C     KEDTRLP00     READE     EDTRLX00                               82                        
     C                   WHEN      @PLOGI = 0 And @PINTE = 2                                        
     C     KEDTRLP00P    READE     EDTRLX00                               82                        
     C                   WHEN      @PLOGI = 1 And @PINTE = 1                                        
     C                             And @PARV1 = *BLANKS                                             
     C     KEDTRLP10     READE     EDTRLX10                               82                        
     C                   WHEN      @PLOGI = 1 And @PINTE = 1                                        
     C                             And @PARV1 <> *BLANKS                                            
     C     KEDTRLP10X    READE     EDTRLX10                               82                        
     C                   WHEN      @PLOGI = 1 And @PINTE = 2                                        
     C     KEDTRLP10P    READE     EDTRLX10                               82                        
     C                   WHEN      @PLOGI = 2 And @PINTE = 1                                        
     C                             And @PCOM2 = *BLANKS                                             
     C     KEDTRLP20     READE     EDTRLX20                               82                        
     C                   WHEN      @PLOGI = 2 And @PINTE = 1                                        
     C                             And @PCOM2 <> *BLANKS                                            
     C     KEDTRLP20X    READE     EDTRLX20                               82                        
     C                   WHEN      @PLOGI = 2 And @PINTE = 2                                        
     C     KEDTRLP20P    READE     EDTRLX20                               82                        
     C                   WHEN      @PLOGI = 3 And @PINTE = 1                                        
     C                             And @PEDAU <> '303' And @PEDAU <> '305'                          
     C     KEDTRLP30     READE(N)  EDTRLX30                               82                        
     C                   WHEN      @PLOGI = 3 And @PINTE = 2                                        
     C                             And @PEDAU <> '303' And @PEDAU <> '305'                          
     C     KEDTRLP30P    READE(N)  EDTRLX30                               82                        
     C                   WHEN      @PLOGI = 3 And @PINTE = 1                                        
     C                             And (@PEDAU = '303' Or @PEDAU = '305')                           
     C     KEDTRLP30     READE     EDTRLX30                               82                        
     C                   WHEN      @PLOGI = 3 And @PINTE = 2                                        
     C                             And (@PEDAU = '303' Or @PEDAU = '305')                           
     C     KEDTRLP30P    READE     EDTRLX30                               82                        
     C                   WHEN      (@PLOGI=0 Or @PLOGI=1 Or @PLOGI=2                                
     C                             Or @PLOGI = 3) And @PINTE = 3                                    
     C     KEDTRLP40     READE     EDTRLX40                               82                        
e01  C                   ENDSL                                                                      
                                                                                                    
     C                   ENDSR                                                                      
FQ710 **********************************************************************                        
FQ710 * Salvo clave logico 30                                                                       
FQ710 **********************************************************************                        
FQ710C     CS_SAVLOG3    BEGSR                                                                      
FQ710                                                                                               
FQ710C                   EVAL      ZXCIA3 = T0CIA3                                                  
FQ710C                   EVAL      ZXDLG3 = T0DLG3                                                  
FQ710C                   EVAL      ZXNPC3 = T0NPC3                                                  
FQ710C                   EVAL      ZXTPE3 = T0TPE3                                                  
FQ710C                   EVAL      ZXDAT3 = T0DAT3                                                  
FQ710C                   EVAL      ZXNOP3 = T0NOP3                                                  
FQ710C                   EVAL      ZXLIN3 = T0LIN3                                                  
FQ710C                   EVAL      ZXCIAS3 = T0CIAS                                                 
FQ710C                   EVAL      ZXDLGA3 = T0DLGA                                                 
FQ710C                   EVAL      ZXNPCO3 = T0NPCO                                                 
FQ710C                   EVAL      ZXTPED3 = T0TPED                                                 
FQ710C                   EVAL      ZXDATP3 = T0DATP                                                 
FQ710C                   EVAL      ZXNOPL3 = T0NOPL                                                 
FQ710C                   EVAL      ZXLINE3 = T0LINE                                                 
FQ710C                   EVAL      ZXARV13 = T0ARV1                                                 
FQ710C                   EVAL      ZXCOM23 = T0COM2                                                 
FQ710                                                                                               
FQ710C                   ENDSR                                                                      
FQ710 **********************************************************************                        
FQ710 * Salvo clave logico 40                                                                       
FQ710 **********************************************************************                        
FQ710C     CS_SAVLOG4    BEGSR                                                                      
FQ710                                                                                               
FQ710C                   EVAL      ZXCIAS4 = T0CIAS                                                 
FQ710C                   EVAL      ZXCUST4 = T0CUST                                                 
FQ710C                   EVAL      ZXTDI14 = T0TDI1                                                 
FQ710C                   EVAL      ZXDLGA4 = T0DLGA                                                 
FQ710C                   EVAL      ZXNPCO4 = T0NPCO                                                 
FQ710C                   EVAL      ZXTPED4 = T0TPED                                                 
FQ710C                   EVAL      ZXDATP4 = T0DATP                                                 
FQ710C                   EVAL      ZXNOPL4 = T0NOPL                                                 
FQ710C                   EVAL      ZXLINE4 = T0LINE                                                 
FQ710C                   EVAL      ZXARV14 = T0ARV1                                                 
FQ710C                   EVAL      ZXCOM24 = T0COM2                                                 
FQ710C                   EVAL      ZXNPC34 = T0NPC3                                                 
FQ710C                   EVAL      ZXLIN34 = T0LIN3                                                 
FQ710                                                                                               
FQ710C                   ENDSR                                                                      
FQ710 **********************************************************************                        
FQ710 * Restauro clave lógico 30                                                                    
FQ710 **********************************************************************                        
FQ710C     CS_RSTLOG3    BEGSR                                                                      
FQ710                                                                                               
FQ710C                   IF        T0CIA3<>ZXCIA3 Or T0DLG3<>ZXDLG3 Or                              
FQ710C                             T0NPC3<>ZXNPC3 Or T0TPE3<>ZXTPE3 Or                              
FQ710C                             T0DAT3<>ZXDAT3 Or T0NOP3<>ZXNOP3 Or                              
FQ710C                             T0LIN3<>ZXLIN3                                                   
FQ710C                             Or T0CIAS<>ZXCIAS3 Or T0DLGA<>ZXDLGA3                            
FQ710C                             Or T0NPCO<>ZXNPCO3 Or T0TPED<>ZXTPED3                            
FQ710C                             Or T0DATP<>ZXDATP3 Or T0NOPL<>ZXNOPL3                            
FQ710C                             Or T0LINE<>ZXLINE3 Or T0ARV1<>ZXARV13                            
FQ710C                             Or T0COM2<>ZXCOM23                                               
FQ710C                   EVAL      T0CIA3 = ZXCIA3                                                  
FQ710C                   EVAL      T0DLG3 = ZXDLG3                                                  
FQ710C                   EVAL      T0NPC3 = ZXNPC3                                                  
FQ710C                   EVAL      T0TPE3 = ZXTPE3                                                  
FQ710C                   EVAL      T0DAT3 = ZXDAT3                                                  
FQ710C                   EVAL      T0NOP3 = ZXNOP3                                                  
FQ710C                   EVAL      T0LIN3 = ZXLIN3                                                  
FQ710C                   EVAL      T0CIAS = ZXCIAS3                                                 
FQ710C                   EVAL      T0DLGA = ZXDLGA3                                                 
FQ710C                   EVAL      T0NPCO = ZXNPCO3                                                 
FQ710C                   EVAL      T0TPED = ZXTPED3                                                 
FQ710C                   EVAL      T0DATP = ZXDATP3                                                 
FQ710C                   EVAL      T0NOPL = ZXNOPL3                                                 
FQ710C                   EVAL      T0LINE = ZXLINE3                                                 
FQ710C                   EVAL      T0ARV1 = ZXARV13                                                 
FQ710C                   EVAL      T0COM2 = ZXCOM23                                                 
FQ710C     KEDTRLP300    CHAIN(N)  EDTRLP30                                                         
FQ710C                   ENDIF                                                                      
FQ710                                                                                               
FQ710C                   ENDSR                                                                      
FQ710 **********************************************************************                        
FQ710 * Restauro clave lógico 40                                                                    
FQ710 **********************************************************************                        
FQ710C     CS_RSTLOG4    BEGSR                                                                      
FQ710                                                                                               
FQ710C                   IF        T0CIAS<>ZXCIAS4 Or T0CUST<>ZXCUST4 Or                            
FQ710C                             T0TDI1<>ZXTDI14 Or T0DLGA<>ZXDLGA4 Or                            
FQ710C                             T0NPCO<>ZXNPCO4 Or T0TPED<>ZXTPED4 Or                            
FQ710C                             T0DATP<>ZXDATP4 Or T0NOPL<>ZXNOPL4 Or                            
FQ710C                             T0LINE<>ZXLINE4 Or T0ARV1<>ZXARV14 Or                            
FQ710C                             T0COM2<>ZXCOM24 Or T0NPC3<>ZXNPC34 Or                            
FQ710C                             T0LIN3<>ZXLIN34                                                  
FQ710C                   EVAL      T0CIAS = ZXCIAS4                                                 
FQ710C                   EVAL      T0CUST = ZXCUST4                                                 
FQ710C                   EVAL      T0TDI1 = ZXTDI14                                                 
FQ710C                   EVAL      T0DLGA = ZXDLGA4                                                 
FQ710C                   EVAL      T0NPCO = ZXNPCO4                                                 
FQ710C                   EVAL      T0TPED = ZXTPED4                                                 
FQ710C                   EVAL      T0DATP = ZXDATP4                                                 
FQ710C                   EVAL      T0NOPL = ZXNOPL4                                                 
FQ710C                   EVAL      T0LINE = ZXLINE4                                                 
FQ710C                   EVAL      T0ARV1 = ZXARV14                                                 
FQ710C                   EVAL      T0COM2 = ZXCOM24                                                 
FQ710C                   EVAL      T0NPC3 = ZXNPC34                                                 
FQ710C                   EVAL      T0LIN3 = ZXLIN34                                                 
FQ710C     KEDTRLP400    CHAIN     EDTRLP40                                                         
FQ710C                   ENDIF                                                                      
FQ710                                                                                               
FQ710C                   ENDSR                                                                      
      **********************************************************************                        
      * Descripción Errores                                                                         
      **********************************************************************                        
     C     CS_DESERR     BEGSR                                                                      
                                                                                                    
      * Monto extensión del Error                                                                   
     C                   MOVEL     *BLANKS       WWEXTE                                             
                                                                                                    
     C                   EVAL      @PINCI = ZXINCI                                                  
FQ710                                                                                               
FQ710C                   IF        @PINTE <> 3 Or @PEDAU = '305'                                    
s01  C                   SELECT                                                                     
      * Errores en Alta linea comercial                                                             
     C                   WHEN      ZXINCI = '001' Or ZXINCI = '002'                                 
     C                             Or ZXINCI = '003' Or ZXINCI = '005'                              
CR528C                             or ZXINCI='019'                                                  
     C                   EVAL      S01TLIN = 'Lín'                                                  
     C                   MOVEL     S5LINE        S01LINE                                            
     C                   EVAL      S01TART = 'Art'                                                  
     C                   EVAL      S01ARTI = M5ARTI                                                 
     C                   EVAL      S01TPRO = 'Pro'                                                  
C1078C*                  EVAL      S01PROV = M5PRVR                                                 
C1078C                   EVAL      S01PROV = ZXPRVR_DOM                                             
      * Errores en modificaciones/bajas linea comercial                                             
     C                   WHEN      ZXINCI = '006'                                                   
     C                             Or ZXINCI = '007' Or ZXINCI = '008'                              
     C                             Or ZXINCI = '009' Or ZXINCI = '011'                              
     C                             Or ZXINCI = '012' Or ZXINCI = '013'                              
14060C                             Or ZXINCI = '014' Or ZXINCI = '015'                              
FQ710C                             Or ZXINCI = '018'                                                
C1350C                             Or ZXINCI = '020'                                                
C1579C                             Or ZXINCI = '021'                                                
C1579C                             Or ZXINCI = '022'                                                
C1983C                             Or ZXINCI = '024'                                                
     C                   EVAL      S01TLIN = 'Lín'                                                  
     C                   MOVEL     T0LINE        S01LINE                                            
     C                   EVAL      S01TART = 'Art'                                                  
     C                   MOVEL     T0ARVM        S01ARTI                                            
     C                   EVAL      S01TPRO = 'Cli'                                                  
     C                   MOVEL     T0CUST        S01PROV                                            
      * Errores en trazabilidad EDTRLP                                                              
     C                   WHEN      ZXINCI = '004'                                                   
     C                   EVAL      S01TLIN = 'Lín'                                                  
     C                   MOVEL     T0LINE        S01LINE                                            
     C                   EVAL      S01TART = 'Ped'                                                  
     C                   MOVEL     T0NPCO        S01ARTI                                            
     C                   EVAL      S01TPRO = 'Cli'                                                  
     C                   MOVEL     T0CUST        S01PROV                                            
      * Errores en integridad conjunto en Trace                                                     
     C                   WHEN      ZXINCI = '010'                                                   
FQ710C                             Or ZXINCI = '016' Or ZXINCI = '017'                              
     C                   EVAL      S01TLIN = 'Lín'                                                  
     C                   MOVEL     T0LIN3        S01LINE                                            
     C                   EVAL      S01TART = 'Art'                                                  
b02  C                   IF        SAARTI <> *BLANKS                                                
     C                   MOVEL     SAARTI        S01ARTI                                            
x02  C                   ELSE                                                                       
     C                   MOVEL     S5ARTI        S01ARTI                                            
e02  C                   ENDIF                                                                      
     C                   EVAL      S01TPRO = 'Ped'                                                  
     C                   MOVEL     T0NPC3        S01PROV                                            
e01  C                   ENDSL                                                                      
                                                                                                    
      * Busco el numero de error que toca                                                           
     C                   EVAL      ZW=1                                                             
     C     *BLANKS       LOOKUP    SERROR(ZW)                             81                        
                                                                                                    
      * Busco descripción error y lleno las series                                                  
     C                   EVAL      NZCTAB = 'EDER'                                                  
     C                   EVAL      NZCLTA = ZXINCI                                                  
     C                   EVAL      NZIDIO = P7IDIO                                                  
     C     KMSTRG1       CHAIN     MSTRG1                                                           
b01  C                   IF        %FOUND(MSTRG1)                                                   
     C                   MOVEL     NZDESC        SERROR(ZW)                                         
     C                   MOVEL     WWEXTE        SDERROR(ZW)                                        
x01  C                   ELSE                                                                       
     C                   EVAL      PECTAB = 'EDER'                                                  
     C                   EVAL      PECLTA = ZXINCI                                                  
     C     KPMTAB2       CHAIN     PMTAB2                                                           
b02  C                   IF        %FOUND(PMTAB2)                                                   
     C                   MOVEL     PEDESC        SERROR(ZW)                                         
     C                   MOVEL     WWEXTE        SDERROR(ZW)                                        
e02  C                   ENDIF                                                                      
e01  C                   ENDIF                                                                      
FQ710C                   ENDIF                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Mostrar Pantalla Error                                                                      
      **********************************************************************                        
     C     CS_WINDOW     BEGSR                                                                      
                                                                                                    
b01  C                   IF        @PTIPJ>'0' And ZXWIND = '1'                                      
     C                             And @PERRO = '1'                                                 
      * Grabo campos de Pantallas si hay errores en las series                                      
     C                   EVAL      ZW=1                                                             
     C     *BLANKS       LOOKUP    SERROR(ZW)                             81                        
                                                                                                    
b02  C                   IF        ZW>1                                                             
     C                   EVAL      ZW=ZW-1                                                          
      * Grabo fichero de Control                                                                    
f03  C                   FOR       X=1 to ZW                                                        
s04  C                   SELECT                                                                     
     C                   WHEN      X=1                                                              
     C                   MOVEL     SERROR(X)     W01ERR1                                            
     C                   MOVEL     SDERROR(X)    W01EXT1                                            
     C                   WHEN      X=2                                                              
     C                   MOVEL     SERROR(X)     W01ERR2                                            
     C                   MOVEL     SDERROR(X)    W01EXT2                                            
     C                   WHEN      X=3                                                              
     C                   MOVEL     SERROR(X)     W01ERR3                                            
     C                   MOVEL     SDERROR(X)    W01EXT3                                            
     C                   WHEN      X=4                                                              
     C                   MOVEL     SERROR(X)     W01ERR4                                            
     C                   MOVEL     SDERROR(X)    W01EXT4                                            
     C                   WHEN      X=5                                                              
     C                   MOVEL     SERROR(X)     W01ERR5                                            
     C                   MOVEL     SDERROR(X)    W01EXT5                                            
     C                   OTHER                                                                      
     C                   LEAVE                                                                      
e04  C                   ENDSL                                                                      
                                                                                                    
e03  C                   ENDFOR                                                                     
e02  C                   ENDIF                                                                      
                                                                                                    
      * Visualizo Pantalla                                                                          
     C                   EXFMT     W01                                                              
                                                                                                    
e01  C                   ENDIF                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Recuperar Compañía de MOVEX                                                                 
      **********************************************************************                        
     C     CS_CIASMVX    BEGSR                                                                      
                                                                                                    
      *          Establecer Entorno de Trabajo Movex                                                
     C                   MOVEL     PPCIAS        @PEDIVI                                            
     C                   CALL      'GX0150'                                                         
     C                   PARM                    @PEDIVI                                            
     C                   PARM      SDSUSR        @PEUSER                                            
     C                   PARM      *BLANKS       @PEVAL                                             
     C                   EVAL      ZXVAL=@PEVAL                                                     
                                                                                                    
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Recuperar Biblioteca de Movex                                                               
      **********************************************************************                        
     C     CS_MVXLIBL    BEGSR                                                                      
                                                                                                    
     C                   EVAL      LIBLMVX = *BLANKS                                                
                                                                                                    
s01  C                   SELECT                                                                     
     C                   WHEN      %SUBST(PPBIBL:1:7) = 'MVXJDTA'                                   
19D12C                             Or %SUBST(PPBIBL:1:5) = 'M3EDB'                                  
     C                   EVAL      LIBLMVX = PPBIBL                                                 
     C                   WHEN      %SUBST(PPBIB1:1:7) = 'MVXJDTA'                                   
19D12C                             Or %SUBST(PPBIB1:1:5) = 'M3EDB'                                  
     C                   EVAL      LIBLMVX = PPBIB1                                                 
     C                   WHEN      %SUBST(PPBIB2:1:7) = 'MVXJDTA'                                   
19D12C                             Or %SUBST(PPBIB2:1:5) = 'M3EDB'                                  
     C                   EVAL      LIBLMVX = PPBIB2                                                 
     C                   WHEN      %SUBST(PPBIB3:1:7) = 'MVXJDTA'                                   
19D12C                             Or %SUBST(PPBIB3:1:5) = 'M3EDB'                                  
     C                   EVAL      LIBLMVX = PPBIB3                                                 
     C                   WHEN      %SUBST(PPBIB4:1:7) = 'MVXJDTA'                                   
19D12C                             Or %SUBST(PPBIB4:1:5) = 'M3EDB'                                  
     C                   EVAL      LIBLMVX = PPBIB4                                                 
     C                   WHEN      %SUBST(PPBIB5:1:7) = 'MVXJDTA'                                   
19D12C                             Or %SUBST(PPBIB5:1:5) = 'M3EDB'                                  
     C                   EVAL      LIBLMVX = PPBIB5                                                 
     C                   WHEN      %SUBST(PPBIB6:1:7) = 'MVXJDTA'                                   
19D12C                             Or %SUBST(PPBIB6:1:5) = 'M3EDB'                                  
     C                   EVAL      LIBLMVX = PPBIB6                                                 
     C                   WHEN      %SUBST(PPBIB7:1:7) = 'MVXJDTA'                                   
19D12C                             Or %SUBST(PPBIB7:1:5) = 'M3EDB'                                  
     C                   EVAL      LIBLMVX = PPBIB7                                                 
     C                   WHEN      %SUBST(PPBIB8:1:7) = 'MVXJDTA'                                   
19D12C                             Or %SUBST(PPBIB8:1:5) = 'M3EDB'                                  
     C                   EVAL      LIBLMVX = PPBIB8                                                 
     C                   WHEN      %SUBST(PPBIB9:1:7) = 'MVXJDTA'                                   
19D12C                             Or %SUBST(PPBIB9:1:5) = 'M3EDB'                                  
     C                   EVAL      LIBLMVX = PPBIB9                                                 
     C                   WHEN      %SUBST(PPBI10:1:7) = 'MVXJDTA'                                   
19D12C                             Or %SUBST(PPBI10:1:5) = 'M3EDB'                                  
     C                   EVAL      LIBLMVX = PPBI10                                                 
     C                   WHEN      %SUBST(PPBI11:1:7) = 'MVXJDTA'                                   
19D12C                             Or %SUBST(PPBI11:1:5) = 'M3EDB'                                  
     C                   EVAL      LIBLMVX = PPBI11                                                 
     C                   WHEN      %SUBST(PPBI12:1:7) = 'MVXJDTA'                                   
19D12C                             Or %SUBST(PPBI12:1:5) = 'M3EDB'                                  
     C                   EVAL      LIBLMVX = PPBI12                                                 
     C                   WHEN      %SUBST(PPBI13:1:7) = 'MVXJDTA'                                   
19D12C                             Or %SUBST(PPBI13:1:5) = 'M3EDB'                                  
     C                   EVAL      LIBLMVX = PPBI13                                                 
     C                   WHEN      %SUBST(PPBI14:1:7) = 'MVXJDTA'                                   
19D12C                             Or %SUBST(PPBI14:1:5) = 'M3EDB'                                  
     C                   EVAL      LIBLMVX = PPBI14                                                 
     C                   WHEN      %SUBST(PPBI15:1:7) = 'MVXJDTA'                                   
19D12C                             Or %SUBST(PPBI15:1:5) = 'M3EDB'                                  
     C                   EVAL      LIBLMVX = PPBI15                                                 
     C                   WHEN      %SUBST(PPBI16:1:7) = 'MVXJDTA'                                   
19D12C                             Or %SUBST(PPBI16:1:5) = 'M3EDB'                                  
     C                   EVAL      LIBLMVX = PPBI16                                                 
     C                   WHEN      %SUBST(PPBI17:1:7) = 'MVXJDTA'                                   
19D12C                             Or %SUBST(PPBI17:1:5) = 'M3EDB'                                  
     C                   EVAL      LIBLMVX = PPBI17                                                 
     C                   WHEN      %SUBST(PPBI18:1:7) = 'MVXJDTA'                                   
19D12C                             Or %SUBST(PPBI18:1:5) = 'M3EDB'                                  
     C                   EVAL      LIBLMVX = PPBI18                                                 
     C                   WHEN      %SUBST(PPBI19:1:7) = 'MVXJDTA'                                   
19D12C                             Or %SUBST(PPBI19:1:5) = 'M3EDB'                                  
     C                   EVAL      LIBLMVX = PPBI19                                                 
     C                   WHEN      %SUBST(PPBI20:1:7) = 'MVXJDTA'                                   
19D12C                             Or %SUBST(PPBI20:1:5) = 'M3EDB'                                  
     C                   EVAL      LIBLMVX = PPBI20                                                 
     C                   WHEN      %SUBST(PPBI21:1:7) = 'MVXJDTA'                                   
19D12C                             Or %SUBST(PPBI21:1:5) = 'M3EDB'                                  
     C                   EVAL      LIBLMVX = PPBI21                                                 
     C                   WHEN      %SUBST(PPBI22:1:7) = 'MVXJDTA'                                   
19D12C                             Or %SUBST(PPBI22:1:5) = 'M3EDB'                                  
     C                   EVAL      LIBLMVX = PPBI22                                                 
     C                   WHEN      %SUBST(PPBI23:1:7) = 'MVXJDTA'                                   
19D12C                             Or %SUBST(PPBI23:1:5) = 'M3EDB'                                  
     C                   EVAL      LIBLMVX = PPBI23                                                 
     C                   WHEN      %SUBST(PPBI24:1:7) = 'MVXJDTA'                                   
19D12C                             Or %SUBST(PPBI24:1:5) = 'M3EDB'                                  
     C                   EVAL      LIBLMVX = PPBI24                                                 
     C                   WHEN      %SUBST(PPBI25:1:7) = 'MVXJDTA'                                   
19D12C                             Or %SUBST(PPBI25:1:5) = 'M3EDB'                                  
     C                   EVAL      LIBLMVX = PPBI25                                                 
     C                   OTHER                                                                      
     C                   EVAL      LIBLMVX = 'MVXJDTA'                                              
e01  C                   ENDSL                                                                      
                                                                                                    
I0184C                   EVAL      LIBLAQA = *BLANKS                                                
I0184                                                                                               
I0184C                   SELECT                                                                     
I0184C                   WHEN      %SUBST(PPBIBL:1:5) = 'M3AQA'                                     
I0184C                   EVAL      LIBLAQA = PPBIBL                                                 
I0184C                   WHEN      %SUBST(PPBIB1:1:5) = 'M3AQA'                                     
I0184C                   EVAL      LIBLAQA = PPBIB1                                                 
I0184C                   WHEN      %SUBST(PPBIB2:1:5) = 'M3AQA'                                     
I0184C                   EVAL      LIBLAQA = PPBIB2                                                 
I0184C                   WHEN      %SUBST(PPBIB3:1:5) = 'M3AQA'                                     
I0184C                   EVAL      LIBLAQA = PPBIB3                                                 
I0184C                   WHEN      %SUBST(PPBIB4:1:5) = 'M3AQA'                                     
I0184C                   EVAL      LIBLAQA = PPBIB4                                                 
I0184C                   WHEN      %SUBST(PPBIB5:1:5) = 'M3AQA'                                     
I0184C                   EVAL      LIBLAQA = PPBIB5                                                 
I0184C                   WHEN      %SUBST(PPBIB6:1:5) = 'M3AQA'                                     
I0184C                   EVAL      LIBLAQA = PPBIB6                                                 
I0184C                   WHEN      %SUBST(PPBIB7:1:5) = 'M3AQA'                                     
I0184C                   EVAL      LIBLAQA = PPBIB7                                                 
I0184C                   WHEN      %SUBST(PPBIB8:1:5) = 'M3AQA'                                     
I0184C                   EVAL      LIBLAQA = PPBIB8                                                 
I0184C                   WHEN      %SUBST(PPBIB9:1:5) = 'M3AQA'                                     
I0184C                   EVAL      LIBLAQA = PPBIB9                                                 
I0184C                   WHEN      %SUBST(PPBI10:1:5) = 'M3AQA'                                     
I0184C                   EVAL      LIBLAQA = PPBI10                                                 
I0184C                   WHEN      %SUBST(PPBI11:1:5) = 'M3AQA'                                     
I0184C                   EVAL      LIBLAQA = PPBI11                                                 
I0184C                   WHEN      %SUBST(PPBI12:1:5) = 'M3AQA'                                     
I0184C                   EVAL      LIBLAQA = PPBI12                                                 
I0184C                   WHEN      %SUBST(PPBI13:1:5) = 'M3AQA'                                     
I0184C                   EVAL      LIBLAQA = PPBI13                                                 
I0184C                   WHEN      %SUBST(PPBI14:1:5) = 'M3AQA'                                     
I0184C                   EVAL      LIBLAQA = PPBI14                                                 
I0184C                   WHEN      %SUBST(PPBI15:1:5) = 'M3AQA'                                     
I0184C                   EVAL      LIBLAQA = PPBI15                                                 
I0184C                   WHEN      %SUBST(PPBI16:1:5) = 'M3AQA'                                     
I0184C                   EVAL      LIBLAQA = PPBI16                                                 
I0184C                   WHEN      %SUBST(PPBI17:1:5) = 'M3AQA'                                     
I0184C                   EVAL      LIBLAQA = PPBI17                                                 
I0184C                   WHEN      %SUBST(PPBI18:1:5) = 'M3AQA'                                     
I0184C                   EVAL      LIBLAQA = PPBI18                                                 
I0184C                   WHEN      %SUBST(PPBI19:1:5) = 'M3AQA'                                     
I0184C                   EVAL      LIBLAQA = PPBI19                                                 
I0184C                   WHEN      %SUBST(PPBI20:1:5) = 'M3AQA'                                     
I0184C                   EVAL      LIBLAQA = PPBI20                                                 
I0184C                   WHEN      %SUBST(PPBI21:1:5) = 'M3AQA'                                     
I0184C                   EVAL      LIBLAQA = PPBI21                                                 
I0184C                   WHEN      %SUBST(PPBI22:1:5) = 'M3AQA'                                     
I0184C                   EVAL      LIBLAQA = PPBI22                                                 
I0184C                   WHEN      %SUBST(PPBI23:1:5) = 'M3AQA'                                     
I0184C                   EVAL      LIBLAQA = PPBI23                                                 
I0184C                   WHEN      %SUBST(PPBI24:1:5) = 'M3AQA'                                     
I0184C                   EVAL      LIBLAQA = PPBI24                                                 
I0184C                   WHEN      %SUBST(PPBI25:1:5) = 'M3AQA'                                     
I0184C                   EVAL      LIBLAQA = PPBI25                                                 
I0184C                   OTHER                                                                      
I0184C                   EVAL      LIBLAQA = 'MVXJDTA'                                              
I0184C                   ENDSL                                                                      
I0184 *                                                                                             
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Validación Cambio de logística en productiva                                                
      **********************************************************************                        
     C     CS_CHGLOG     BEGSR                                                                      
                                                                                                    
      *Sumaré líneas que si permiten servir logística productiva                                    
b01  C                   IF        T0EDDP = 1                                                       
     C                   EVAL      ZXNDDP=ZXNDDP + 1                                                
e01  C                   ENDIF                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Validación Cantidad Servida aunque sea Parcial y no importa                                 
      * quien la ha servido si Trace o Productiva.                                                  
      **********************************************************************                        
     C     CS_CANTSER    BEGSR                                                                      
                                                                                                    
b01  C                   IF        T0CANS<>0                                                        
     C                   EVAL      @PERRO = '1'                                                     
     C                   EVAL      ZXINCI = '009'                                                   
     C                   EXSR      CS_DESERR                                                        
e01  C                   ENDIF                                                                      
                                                                                                    
     C                   ENDSR                                                                      
14060 **********************************************************************                        
14060 * Validación si la linea esta cerrada                                                         
14060 **********************************************************************                        
14060C     CS_LINCERR    BEGSR                                                                      
14060                                                                                               
14060C                   IF        T0EDST = '95'                                                    
14060C                   EVAL      @PERRO = '1'                                                     
14060C                   EVAL      ZXINCI = '015'                                                   
14060C                   EXSR      CS_DESERR                                                        
14060C                   ENDIF                                                                      
14060                                                                                               
14060C                   ENDSR                                                                      
FQ942                                                                                               
FQ942 **********************************************************************                        
FQ942 * Comprobar si es Conjunto en Productiva                                                      
FQ942 **********************************************************************                        
FQ942C     CS_CONJPRO    BEGSR                                                                      
FQ942                                                                                               
FQ942C                   IF        ZXES_COMPO<'1'                                                   
FQ942C                   CLEAR                   ZXCJTO_PROD                                        
FQ942C                   EVAL      ZXARVMX = ZYARVM                                                 
FQ942                                                                                               
FQ942C                   MOVEL     ZXCIAD        PPCIAS                                             
FQ942C     KPMLIBL       CHAIN     PMLIBL                                                           
FQ942 * MOVEX                                                                                       
FQ942C                   IF        %FOUND(PMLIBL) And PPMVXV = 'V'                                  
FQ942 * Buscar Compañía MOVEX                                                                       
FQ942C                   EXSR      CS_CIASMVX                                                       
FQ942C                   EXSR      CS_MVXLIBL                                                       
FQ942 * Busco Planta por defecto en la División                                                     
P1344C*                  Eval      File_cmndiv = LIBLMVX + '/CMNDIV00'                              
P1344C                   Eval      File_cmndiv = (%trim(LIBLMVX)) + '/CMNDIV00'                     
FQ942C                   OPEN (E)  CMNDIV00                                                         
FQ942C                   IF        Not %ERROR                                                       
FQ942C                   MOVEL     MXCONO        CCCONO                                             
FQ942C                   MOVEL     MXDIVI        CCDIVI                                             
FQ942C     KCMNDIV00     CHAIN     CMNDIV00                                                         
FQ942C                   IF        %FOUND(CMNDIV00)                                                 
FQ942 * Busco Si es Conjunto                                                                        
P1344C*                  Eval      File_mpdhed = LIBLMVX + '/MPDHED00'                              
P1344C                   Eval      File_mpdhed = (%trim(LIBLMVX)) + '/MPDHED00'                     
FQ942C                   OPEN (E)  MPDHED00                                                         
I0184C                   OPEN (E)  AQPEDI00                                                         
I0184C                   OPEN (E)  ZAQITN00                                                         
I0184C                   OPEN (E)  GMTABD01                                                         
I0184C                   OPEN (E)  MITFAC00                                                         
FQ942C                   IF        Not %ERROR                                                       
I0184 *                                                                                             
I0184 *             Ver si estamos en una división Multiplanta                                      
I0184C                   MOVEL(P)  MXCONO        Z1CONO                                             
I0184C                   EVAL      Z1DIVI = MXDIVI                                                  
I0184C     KAQPEDI00     CHAIN     AQPEDI00                                                         
I0184C                   EVAL      ZXMULTIPLA = %FOUND(AQPEDI00)                                    
I0184C                                          AND  Z1L101 = '1'                                   
FQ942C                   MOVEL     MXCONO        H_PHCONO                                           
I0184C**FQ942            MOVEL     CCFACI        H_PHFACI                                           
FQ942C                   MOVEL     ZXARVMX       H_PHPRNO                                           
I0184C                   EVAL      H_PHFACI = GET_FACI(MXDIVI:CCFACI:H_PHPRNO)                      
FQ942C                   MOVEL     'KIT'         H_PHSTRT                                           
FQ942C     KMPDHED00     CHAIN     MPDHED00                                                         
FQ942C                   IF        %FOUND(MPDHED00) And                                             
FQ942C                             H_PHSTAT >= '20' And H_PHSTAT < '90'                             
FQ942C                   EVAL      ZXCJTO_PROD='1'                                                  
FQ942C                   ENDIF                                                                      
FQ942C                   CLOSE(E)  MPDHED00                                                         
I0184C                   CLOSE(E)  AQPEDI00                                                         
I0184C                   CLOSE(E)  ZAQITN00                                                         
I0184C                   CLOSE(E)  GMTABD01                                                         
I0184C                   CLOSE(E)  MITFAC00                                                         
FQ942C                   ENDIF                                                                      
FQ942C                   ENDIF                                                                      
FQ942C                   ENDIF                                                                      
FQ942C                   CLOSE(E)  CMNDIV00                                                         
FQ942C                   ENDIF                                                                      
      *                                                                                             
FQ942 * AS400                                                                                       
FQ942C                   IF        %FOUND(PMLIBL) And PPMVXV <> 'V'                                 
FQ942 * Busco Si es Conjunto                                                                        
FQ942C                   EVAL      FileCojc_erp= 'PURLIBF' + PPCIAS +                               
FQ942C                                          '/MSCOJC'                                           
FQ942C                   OPEN (E)  MSCOJC                                                           
FQ942C                   IF        Not %ERROR                                                       
FQ942C                   EVAL      NDCIAS = ZXCIAD                                                  
FQ942C                   EVAL      NDARTI = ZXARTIX                                                 
FQ942C                   EVAL      NDVARI = ZXVARIX                                                 
FQ942C                   EVAL      NDMODE = ZXMODEX                                                 
FQ942C                   EVAL      NDTCOJ = '4'                                                     
FQ942C     KMSCOJC       CHAIN     MSCOJC                                                           
FQ942C                   IF        %FOUND(MSCOJC) AND NDBAJA<'1'                                    
FQ942C                   EVAL      ZXCJTO_PROD='1'                                                  
FQ942C                   ENDIF                                                                      
FQ942C                   CLOSE(E)  MSCOJC                                                           
FQ942C                   ENDIF                                                                      
FQ942C                   CLOSE(E)  MSCOJC                                                           
FQ942C                   ENDIF                                                                      
                                                                                                    
FQ942                                                                                               
FQ942C                   IF        ZXCJTO_PROD='1'     AND                                          
FQ942C                             ZXTCOJ<>'1'                                                      
FQ942C                   EVAL      @PERRO = '1'                                                     
FQ942C                   EVAL      ZXINCI = '050'                                                   
FQ942C                   EXSR      CS_DESERR                                                        
FQ942C                   ENDIF                                                                      
FQ942C                   ENDIF                                                                      
FQ942C                   ENDSR                                                                      
CR653 **************************************************************                                
CR653 * COMPROBAR SI EL PROVEEDOR ES DE ENTREGAS DIRECTAS          *                                
CR653 *------------------------------------------------------------*                                
CR653C     CS_PRV2       BEGSR                                                                      
CR653C                   CALL      'XBB001'                                                         
CR653C                   PARM      S5CIAS        @XCIAS                                             
CR653C                   PARM      S5ARTI        @XARTI                                             
CR653C                   PARM      S5VARI        @XVARI                                             
CR653C                   PARM      S5MODE        @XMODE                                             
CR653C                   PARM      *BLANKS       @XPRVR                                             
CR653C                   PARM      *BLANKS       @XGRUP                                             
CR653C                   PARM      *BLANKS       @XPEVT                                             
CR653C                   ENDSR                                                                      
C1579 **********************************************************************                        
C1579 * Validación en confirmación de pedidos PoolWeb (procedencia=50)                              
C1579 * No podremos cambiar la clase del pedido (TPE4=2)                                            
C1579 **********************************************************************                        
C1579C     CS_POOLWEB    Begsr                                                                      
C1579                                                                                               
C1579C                   eval      zxpweb='0'                                                       
C1579                                                                                               
C1579C                   eval      s0cias=@pcias                                                    
C1579C                   eval      s0dlga=@pdlga                                                    
C1579C                   eval      s0npco=@pnpco                                                    
C1579C                   eval      s0tped=@ptped                                                    
C1579C                   eval      s0datp=@pdatp                                                    
C1579C                   eval      s0nopl=@pnopl                                                    
C1579C     kcocape       chain     cocape                                                           
C1579 *                                                                                             
C1579 * Para saber si es un proveedor Poolweb,lo buscamos en la tabla                               
C1579 * PWEB con la procedencia del pedido.                                                         
C1579 *                                                                                             
C1579C                   if        %found(cocape)                                                   
C1579C                   eval      pecias=@pcias                                                    
C1579C                   eval      pectab='PWEB'                                                    
C1579C                   eval      peclta=s0pped                                                    
C1579C     kpmtabd       chain     pmtabd                                                           
C1579                                                                                               
C1579C                   if        %found(pmtabd)                                                   
C1579C                   eval      zxpweb='1'                                                       
C1579C                   movel     pedesc        zxprvr                                             
C1579 *                                                                                             
C1579C                   eval      c0cias=s0cias                                                    
C1579C                   eval      c0prvr=zxprvr                                                    
C1579C     kpuprov       chain     puprov                                                           
C1579 *                                                                                             
C1579c                   if        %found(puprov)                                                   
C1570C                   eval      zxprvd=c0des1                                                    
C1579C                   endif                                                                      
C1579                                                                                               
C1579C                   endif                                                                      
C1579C                   endif                                                                      
C1579                                                                                               
C1579C                   endsr                                                                      
Q4132**********************************************************************                        
Q4132*  Excepciones                                                *                               
Q4132**********************************************************************                        
Q4132c     cs_eiexce     begsr                                                                      
Q4132c                   eval      z0file = 'ED0051'                                                
Q4132c                   eval      z0cias = @PCIAS                                                  
Q4132c                   eval      z0cust =M5PRV2                                                   
Q4132c                   eval      z0grp2 = *blanks                                                 
Q4132c                   eval      z0camp = 'M5PRVR     '                                           
Q4132c     keiexce       chain     eiexce                                                           
Q4132c                   if        %found(eiexce)                                                   
Q4132C                   EVAL      ZXPRVR_DOM=M5PRV2                                                
Q4132C                   EVAL      M5PRVR=M5PRV2                                                    
Q4132c                   endif                                                                      
Q4132c                   endsr                                                                      
E7345 ******************************************************************************************    
E7345 * CS_LOG_WHSE: convertim la logística (virtual) en magatzem M3                                
E7345 ******************************************************************************************    
E7345c     CS_LOG_WHSE   begsr                                                                      
E7345c                   eval      pecias=@pcias                                                    
E7345c                   eval      pectab='INO2'                                                    
E7345c                   eval      peclta='MAGA'+s5loge                                             
E7345c     kpmtabd       chain     pmtabd                                                           
E7345c                   if        %found(pmtabd)                                                   
E7345c                   eval      xbwhlo=%trim(pedesc)                                             
E7345c                   else                                                                       
E7345c                   eval      xbwhlo=*blanks                                                   
E7345c                   endif                                                                      
E7345c                   endsr                                                                      
                                                                                                    
      ******************************************************************                            
OL205 *F-2OL *   Recuperar almacén a partir de la logística del pedido venta                        
OL205 *F-2OL **********************************************************************                 
OL205 *F-2OLC     SRrecu        BEGSR                                                               
OL205 *F-2OLC                   eval      @pECIA = s5cias                                           
OL205 *F-2OLC                   eval      @palma = s5loge                                           
OL205 *F-2OLC                   eval      @ptipo = '1'                                              
OL205 *F-2OLC                   eval      @pdlga = s5dlga                                           
OL205 *F-2OL *                                                                                      
OL205 *F-2OLC                   CALL      'MM1411'                                                  
OL205 *F-2OLC                   PARM                    @PECIA                                      
OL205 *F-2OLC                   PARM                    @PALMA                                      
OL205 *F-2OLC                   PARM                    @PTIPO                                      
OL205 *F-2OLC                   PARM                    @PDLGA                                      
OL205 *F-2OLC                   PARM      *blanks       @PRESP                                      
OL205 *F-2OL *                                                                                      
OL205 *F-2OLC                   if        @PRESP <>*blanks                                          
OL205 *F-2OLC                                                                                       
OL205 *           ol_m1maga = @PRESP;                                                               
OL205 *           chain (s5cias:s5arti:s5vari:s5mode:ol_m1maga) msstok01;                           
OL205 *                                                                                             
OL205 *F-2OLC                   IF        %FOUND                                                    
OL205 *F-2OLC                   IF        ol_m1prvr <> *blanks                                      
OL205 *F-2OLC                   movel     ol_M1PRVR     ZXPRVR_DOM                                  
OL205 *2OLC                   ENDIF                                                  ECSTK <= *Z    
OL205 *2OLC                   ENDIF                                                  ECSTK <= *Z    
OL205 *F-2OLC                   endif                                                               
OL205 *F-2OLC                   ENDSR                                                               
OL205 *      ******************************************************************                     
OL205 *F-2OL *   Recuperar almacén a partir de la logística del pedido venta                        
OL205 *F-2OL **********************************************************************                 
OL205 *F-2OLC     SRrecu2       BEGSR                                                               
OL205 *F-2OLC                   eval      @pECIA = s5cias                                           
OL205 *F-2OLC                   eval      @palma = s5loge                                           
OL205 *F-2OLC                   eval      @ptipo = '1'                                              
OL205 *F-2OLC                   eval      @pdlga = s5dlga                                           
OL205 *F-2OL *                                                                                      
OL205 *F-2OLC                   CALL      'MM1411'                                                  
OL205 *F-2OLC                   PARM                    @PECIA                                      
OL205 *F-2OLC                   PARM                    @PALMA                                      
OL205 *F-2OLC                   PARM                    @PTIPO                                      
OL205 *F-2OLC                   PARM                    @PDLGA                                      
OL205 *F-2OLC                   PARM      *blanks       @PRESP                                      
OL205 *F-2OL *                                                                                      
OL205 *F-2OLC                   if        @PRESP <>*blanks                                          
OL205 *F-2OLC                                                                                       
OL205 *           ol_m1maga = @PRESP;                                                               
OL205 *           chain (s5cias:ndcomp:ndvar2:ndmod2:ol_m1maga) msstok01;                           
OL205 *                                                                                             
OL205 *F-2OLC                   IF        %FOUND                                                    
OL205 *F-2OLC                   IF        ol_m1prvr <> *blanks                                      
OL205 *F-2OLC                   movel     ol_M1PRVR     ZXPRVR_DOM                                  
OL205 *2OLC                   ENDIF                                                  ECSTK <= *Z    
OL205 *2OLC                   ENDIF                                                  ECSTK <= *Z    
OL205 *F-2OLC                   endif                                                               
OL205 *F-2OLC                   ENDSR                                                               
OL205 // Add tot el procediment                                                                     
       dcl-proc SRrecu;                                                                             
       dcl-pi *n like(m0prvr);                                                                      
         pArti like (s5arti);                                                                       
         pVari like (s5vari);                                                                       
         pMode like (s5mode);                                                                       
       end-pi;                                                                                      
       //Tool per virtuals i d'altres                                                              
       dcl-pr pMM1411 extpgm('MM1411');                                                             
           @cias  like(s5cias) const;                                                               
           @maga  like(m0maga) const;                                                               
           @tipo  char(1) const;                                                                    
           @dlga  like(s0dlga) const;                                                               
           @resp  like(@presp);                                                                     
       end-pr;                                                                                      
       dcl-s xloge like(m0maga) inz;                                                                
       dcl-s xmaga like(m0maga) inz;                                                                
                                                                                                    
         if g0LOGE <> *blanks;                                                                      
           xloge = g0LOGE;                                                                          
         else;                                                                                      
           xloge = s5loge;                                                                          
         endif;                                                                                     
                                                                                                    
         pMM1411(s5cias:xloge:'1':s5dlga:@presp);                                                   
                                                                                                    
         if @presp <> *blanks;                                                                      
           xmaga = @presp;                                                                          
           chain (s5cias:parti:pvari:pmode:xmaga) msstok01;                                         
           if %found(msstok01);                                                                     
             if ol_m1prvr <> *blanks;                                                               
               return ol_m1prvr;                                                                    
             endif;                                                                                 
           endif;                                                                                   
           chain (s5cias:xmaga) msalma;                                                             
           if %found(msalma);                                                                       
             return m0prvr;                                                                         
           endif;                                                                                   
         endif;                                                                                     
         return *blanks;                                                                            
                                                                                                    
       end-proc;                                                                                    
OL205 // End tot el procediment                                                                     
I0184 ******************************************************************************************    
I0184 * OBTENER PLANTA PARA ACCEDER A DATOS DEL ARTÍCULO                                            
I0184 ******************************************************************************************    
I0184 *                                                                                             
I0184P GET_FACI        B                                                                            
I0184D GET_FACI        PI                  LIKE(MMCIAS)                                             
I0184D   @DIVI                             LIKE(MMPROP) VALUE                                       
I0184D   @FACI                             LIKE(MMCIAS) VALUE                                       
I0184D   @ITNO                             LIKE(MMITNO) VALUE                                       
I0184 *                                                                                             
I0184C                   IF        ZXMULTIPLA                                                       
I0184 *                                                                                             
I0184 * Si existe registro en ZAQITN en el que la división es propietaria, entonces                 
I0184 * se devuelve la planta propietaria del artículo.                                             
I0184 *                                                                                             
I0184C                   MOVEL(P)  MXCONO        MMCONO                                             
I0184C                   EVAL      MMITNO = @ITNO                                                   
I0184C     KZAQITN00     CHAIN     ZAQITN00                                                         
I0184C                   IF        %FOUND  AND  MMPROP = @DIVI  AND                                 
I0184C                             MMCIAS <> *BLANKS                                                
I0184C                   RETURN    MMCIAS                                                           
I0184C                   ENDIF                                                                      
I0184 *                                                                                             
I0184 * Si la división no es la propietaria, se hace bucle sobre la tabla FACP y                    
I0184 * se devuelve la primera para la que exista MITFAC                                            
I0184 *                                                                                             
I0184C                   MOVEL(P)  MXCONO        M9CONO                                             
I0184C                   EVAL      M9ITNO = @ITNO                                                   
I0184 *                                                                                             
I0184C                   EVAL      T1CTAB = 'FACP'                                                  
I0184C                   EVAL      T1DESC = @DIVI                                                   
I0184C     KGMTABD01     SETLL     GMTABD01                                                         
I0184C     KGMTABD01     READE     GMTABD01                                                         
I0184 *                                                                                             
I0184C                   DOW       NOT %EOF                                                         
I0184 *                                                                                             
I0184C                   EVAL      M9FACI = T1CELE                                                  
I0184C     KMITFAC00     SETLL     MITFAC00                                                         
I0184C                   IF        %EQUAL                                                           
I0184C                   RETURN    M9FACI                                                           
I0184C                   ENDIF                                                                      
I0184 *                                                                                             
I0184C     KGMTABD01     READE     GMTABD01                                                         
I0184C                   ENDDO                                                                      
I0184 *                                                                                             
I0184C                   ENDIF                                                                      
I0184 *                                                                                             
I0184 * Si la división no es multiplanta, o la búsqueda anterior no ha dado frutos,                 
I0184 * devolver la planta entrada                                                                  
I0184 *                                                                                             
I0184C                   RETURN    @FACI                                                            
I0184 *                                                                                             
I0184P                 E                                                                            
