      **************************************************************                                
      * APLICACIÓ: MÒDUL COMERCIAL                                 *                                
      **************************************************************                                
      * TITOL: ED0050  © FLUIDRA SERVICES                          *                                
      * DATA CREACIO:  25/01/2010                                  *                                
      * FUNCIO DEL PROGRAMA: Entregas Directas. Algoritmo decisión *                                
      *                                                            *                                
      * DOCUMENTACIÓN PARAMETROS:                                  *                                
      * @PCIAS   CIAS de la Clave de Pedido de la empresa @PCIAS   *                                
      * @PDLGA   DLGA de la Clave de Pedido de la empresa @PCIAS   *                                
      * @PNPCO   NPCO de la Clave de Pedido de la empresa @PCIAS   *                                
      * @PTPED   TPED de la Clave de Pedido de la empresa @PCIAS   *                                
      * @PDATP   DATP de la Clave de Pedido de la empresa @PCIAS   *                                
      * @PNOPL   NOPL de la Clave de Pedido de la empresa @PCIAS   *                                
      **************************************************************                                
FQ618 * DATA DE MODIFICACIÓ: 27/05/2010  MARCA: FQ618              *                                
FQ618 * AUTOR: Josep Aragonès                                      *                                
FQ618 * DOCUMENTACIÓ: Paràmetre Forma de Pagament que no va per ED *                                
FQ618 **************************************************************                                
FQ710 * Modificación: FQ710                                        *                                
FQ710 *        Autor: Josep Aragonès                               *                                
FQ710 * Fecha Inicio: 28/09/2010                                   *                                
FQ710 *  Descripción: Limite por expedición y dias bloqueo prepar. *                                
FQ710 **************************************************************                                
FQ726 * Modificación: FQ726                                        *                                
FQ726 *        Autor: Josep Aragonès                               *                                
FQ726 * Fecha Inicio: 03/11/2010                                   *                                
FQ726 *  Descripción: Parametrización Certikin y Cías Extrangeras  *                                
FQ726 **************************************************************                                
In211 *      Modificació: In211                                    *                                
In211 *            Autor: Josep Aragonès                           *                                
In211 * Data modificació: 20/01/2011                               *                                
In211 *       Descripció: Tener en cuenta parámetro omitir par.Cli.*                                
In211 **************************************************************                                
      * Modificación: FQ798                                        *                                
      *        Autor: JMARTINEZP                                   *                                
      * Fecha Inicio: 03/03/2011                                   *                                
      *  Descripción: Control Bajas                                *                                
      **************************************************************                                
      * Modificación: FQ942                                        *                                
      *        Autor: JMARTINEZP                                   *                                
      * Fecha Inicio: 19/12/2011                                   *                                
      *  Descripción: Control equivalencias cjtos CIALvsPROD       *                                
      **************************************************************                                
      * Modificación: FQ842                                        *                                
      *        Autor: JMARTINEZP                                   *                                
      * Fecha Inicio: 03/03/2011                                   *                                
      *  Descripción: ENTREGA EN DELEGACIÓN                        *                                
      **************************************************************                                
FQ842 * Modificación: FQ842                                        *                                
FQ842 *        Autor: DALONSO                                      *                                
FQ842 * Fecha Inicio: 23/05/2011                                   *                                
FQ842 *  Descripción: Si pedido es Autoservicio y no es Mostrador  *                                
FQ842 *               o si es Entrega en Delegación ==> modificar  *                                
FQ842 *               logística de líneas del pedido (S5LOGE)      *                                
FQ842 **************************************************************                                
09712 * Modificación: 09712   (anulada el 27/09/12) activo (3/10/12*                                
09712 *        Autor: Josep Aragonès                               *                                
09712 * Fecha Inicio: 09/07/2012                                   *                                
09712 *  Descripción: Comanda reparació No han de ser FD           *                                
09712 **************************************************************                                
19D12 * Modificación: 19D12                                        *                                
19D12 *        Autor: Josep Aragonès                               *                                
19D12 * Fecha Inicio: 19/12/2012                                   *                                
19D12 *  Descripción: Bilioteques M3 MOVEX                         *                                
19D12 *  S'ha de compilar el dia del canvi amb biblioteca M3EDBPRD *                                
19D12 **************************************************************                                
FDX01 *      Modificació: FDX01                                                                     
FDX01 *            Autor: Carlos del Valle                                                          
FDX01 * Data modificació: 03/01/2013                                                                
FDX01 *       Descripció: Fluidra Direct: Correcciones y mejoras                                    
FDX01 **************************************************************                                
CR528 *      Modificació: CR528                                                                     
CR528 *            Autor: Carlos del Valle                                                          
CR528 * Data modificació: 26/02/2013                                                                
CR528 *       Descripció: Fluidra Direct: despreciar FD si artículo                                 
CR528 *                   está bloqueado para compra                                                
CR528 ***************************************************************                               
CR554 *                                                             *                               
CR554 * Modificación: CR554                                         *                               
CR554 *        Autor: Carlos Martínez M.                            *                               
CR554 * Fecha Inicio: 11/11/2013                                    *                               
CR554 * Descripción : Adaptaciones Integración B2B en nuevos        *                               
CR554 *               países. Nuevos Criterios Logística de Salidas *                               
CR554 ***************************************************************                               
C1636 *                                                             *                               
C1636 * Modificación: CR1636            Marca: C1636                *                               
C1636 *        Autor: Carlos Martínez M.                            *                               
C1636 * Fecha Inicio: 12/02/2014                                    *                               
C1636 * Descripción : Verificar Stock Artículos "B".                *                               
C1636 *             : Parámetro Autoservicios Mixtos.               *                               
C1636 *                                                             *                               
C1636 ***************************************************************                               
Q0258 * Modificación: Q0258                                         *                               
Q0258 *        Autor: Carlos Martínez M.                            *                               
Q0258 * Fecha Inicio: 17/02/2014                                    *                               
Q0258 * Descripción : Correción posible Bucle en CS_CHGLOGE por     *                               
Q0258 *               ITER mal situado.                             *                               
Q0258 ***************************************************************                               
C1686 * Modificación: CR1686                                        *                               
C1686 *        Autor: JMARTINEZP                                    *                               
C1686 * Fecha Inicio: 17/02/2014                                    *                               
C1686 * Descripción : INCIDENCIA DE PUNTOS DE EXPEDICIÓN            *                               
C1686 ***************************************************************                               
CR533 * Modificación: CR533              Marca: CR533              *                                
CR533 *        Autor: Carlos Martínez M.                           *                                
CR533 * Fecha Inicio: 18/03/2014                                   *                                
CR533 *  Descripción: Nuevo Parámetro: FD para Pedidos sin Cargo.  *                                
CR533 **************************************************************                                
C1579 * Modificación: CR1579                                       *                                
C1579 *        Autor: Javier Arbide                                *                                
C1579 * Fecha Inicio: 24/04/2014                                   *                                
C1579 *  Descripción: Envío automático pedidos recambios a Poolweb *                                
C1579 **************************************************************                                
C1078 * DATA DE MODIFICACIÓ: 19/01/2012  MARCA: C1078              *                                
C1078 * AUTOR: JMARTINEZP                                          *                                
C1078 * DOCUMENTACIÓ: DOM                                          *                                
C1078 **************************************************************                                
C1078 * DATA DE MODIFICACIÓ: 19/01/2012  MARCA: M1078              *                                
C1078 * AUTOR: JMARTINEZP                                          *                                
C1078 * DOCUMENTACIÓ: DOM                                          *                                
C1078 **************************************************************                                
      * DATA DE MODIFICACIÓ: 19/01/2012  MARCA: 24986              *                                
      * AUTOR: JMARTINEZP    HD249865                              *                                
      * DOCUMENTACIÓ: DOM    INCIDENCIA DO0050                     *                                
      **************************************************************                                
      * DATA DE MODIFICACIÓ: 17/11/2014  MARCA: C2238              *                                
      * AUTOR: JMARTINEZP                                          *                                
      * DOCUMENTACIÓ: OMITIR FLUIDRA EXPRESS                       *                                
      **************************************************************                                
C2638 * DATA DE MODIFICACIÓ: 13/04/2015  MARCA: C2638                          *                    
C2638 * AUTOR: Javier Arbide                                                   *                    
C2638 * DOCUMENTACIÓ: FD - No cambiar logística de líneas cerradas             *                    
C2638 **************************************************************************                    
C2510 * DATA DE MODIFICACIÓ: 12/03/2015  MARCA: C2510      CR2510  *                                
C2510 * AUTOR: Javier Arbide                                       *                                
C2510 * DOCUMENTACIÓ: Importes pedido y expedición en ED forzada   *                                
C2510 *               Controlar si se ha llegado a importe mínimo  *                                
C2510 *               del pedido por cliente.                      *                                
C2510 **************************************************************                                
C2510 * DATA DE MODIFICACIÓ: 12/03/2015  MARCA: HD123   HD299880   *                                
C2510 * DOCUMENTACIÓ: INCIDENCIA ITALIA                            *                                
C2510 **************************************************************                                
I0184 * Modificación: ITOM184        MARCA:I0184                   *                                
I0184 *        Autor: Javier Arbide                                *                                
I0184 * Fecha Inicio: 12/11/2020                                   *                                
I0184 *  Descripción: Divisiones Multiplanta                       *                                
I0184 **************************************************************                                
IT228 * DATA DE MODIFICACIÓ: 24/09/2021  MARCA: IT228              *                                
IT228 * AUTOR: DGrau                                               *                                
IT228 * DOCUMENTACIÓ: 2OL- Obrir a més d'un OL                     *                                
IT228 **************************************************************                                
     **************************************************************************                    
IT244* DATA DE MODIFICACIÓ: 16/06/2022     MARCA: IT244 (ITOM244) *                                
IT244* AUTOR:        David Grau                                   *                                
IT244* Si la empresa trabaja con la versión 3, la decisión DOM, será                               
IT244* redirigida a unos nuevos programas                         *                                
     **************************************************************************                    
      * DATA DE MODIFICACIÓ: 15/12/2025  MARCA: OL885                                               
      * AUTOR: JMARTINEZP                                                                           
      * DOCUMENTACIÓ: ARREGLAR INCIDENCIA QUE NO SALGA                                              
      *                                                                                             
      ***********************************************************************************           
     H DATEDIT(*YMD/)                                                                               
     H OPTION(*NODEBUGIO:*SRCSTMT)                                                                  
I0184H DFTACTGRP(*NO) ACTGRP(*CALLER)                                                               
      *                                                                                             
     FED0050W   UF A E           K DISK    USROPN                                                   
     FPMEMPR    IF   E           K DISK                                                             
     FEDPARM    IF   E           K DISK                                                             
C2510FEDPARC    IF   E           K DISK                                                             
     FCOCLIN    IF   E           K DISK    PREFIX(C_)                                               
     FCOCAPE    IF   E           K DISK                                                             
     FCODEPE    UF   E           K DISK                                                             
     FMSLOGI    IF   E           K DISK                                                             
     FMSLOAD    IF   E           K DISK                                                             
     FMSALMA    IF   E           K DISK                                                             
     FMSALMA05  IF   E           K DISK    RENAME(RMSALMA:RMSALMA05)                                
IT228FMSALMA08  IF   E           K DISK    rename(rmsalma:rmsalma08) usropn                         
FQ710F*SDLDL    IF   E           K DISK                                                             
     FMSDLDL05  IF   E           K DISK    RENAME(RMSDLDL:RMSDLDL05)                                
     FMSDLDL03  IF   E           K DISK    RENAME(RMSDLDL:RMSDLDL03)                                
     FMSDIV0    IF   E           K DISK                                                             
     FMSIVAS    IF   E           K DISK                                                             
     FPMUNAL    IF   E           K DISK                                                             
     FPMTABD    IF   E           K DISK                                                             
     FMSSTOK    IF   E           K DISK                                                             
     FMSSTO01   IF   E           K DISK                                                             
     FMSTRTA    IF   E           K DISK                                                             
     FUTCOM0    IF   E           K DISK                                                             
     FPUPROV    IF   E           K DISK                                                             
     FPUPRP0    IF   E           K DISK                                                             
     FGXEQPR    IF   E           K DISK                                                             
     FPMLIBL    IF   E           K DISK                                                             
     FMSARTI00  IF   E           K DISK                                                             
     FMSARTI    IF   E           K Disk    ExtFile(FileArti_erp)                                    
     F                                     RENAME(RMSARTI:RMSARTIXX)                                
     F                                     USROPN PREFIX(A_)                                        
     FMITMAS00  IF   E           K DISK    ExtFile(File_mitmas)                                     
     F                                     USROPN                                                   
     FMSCOJC    IF   E           K Disk    ExtFile(FileCojc_erp)                                    
     F                                     RENAME(RMSCOJC:RMSCOJCXX)                                
     F                                     USROPN                                                   
     FMSCOJD    IF   E           K Disk    ExtFile(FileCojd_erp)                                    
     F                                     RENAME(RMSCOJD:RMSCOJDXX)                                
     F                                     USROPN                                                   
     FMSSTO0909 IF   E           K DISK    RENAME(RMSSTO0:RMSSTO909)                                
     FPMCAOR01  IF   E           K DISK    USROPN                                                   
     FPMCAOR08  IF   E           K DISK    RENAME(RPMCAOR:RPMCAOR08)                                
     F                                     USROPN                                                   
     FPMDEOR05  IF   E           K DISK    USROPN                                                   
     FCMNDIV00  IF   E           K DISK    ExtFile(File_cmndiv)                                     
     F                                     USROPN                                                   
     FMPDHED00  IF   E           K DISK    ExtFile(File_mpdhed)                                     
     F                                     USROPN PREFIX(H_)                                        
     FMPDMAT00  IF   E           K DISK    ExtFile(File_mpdmat)                                     
     F                                     USROPN                                                   
     FGXEQAR    IF   E           K DISK                                                             
FQ842FCOCAIP    IF   E           K DISK                                                             
I0184FAQPEDI00  IF   E           K DISK    ExtFile(File_AQPEDI)                                     
I0184F                                     USROPN                                                   
I0184FZAQITN00  IF   E           K DISK    ExtFile(File_ZAQITN)                                     
I0184F                                     USROPN                                                   
I0184FGMTABD01  IF   E           K DISK    ExtFile(File_GMTABD)                                     
I0184F                                     USROPN RENAME(GMTABD:RGMTABD01)                          
I0184FMITFAC00  IF   E           K DISK    ExtFile(File_MITFAC)                                     
I0184F                                     USROPN                                                   
                                                                                                    
     D* AREA DE DADES DE PROGRAMA I INICIALITZACIO DE VALORS COMUNS                                 
     D                SDS                                                                           
     D  SDSPGM                 1     10                                                             
     D    CCCPGM                     10    OVERLAY(SDSPGM)                                          
     D  SDSJOB               244    253                                                             
     D    CCCJOB                     10    OVERLAY(SDSJOB)                                          
     D  SDSSTS           *STATUS                                                                    
     D  SDSUSR               254    263                                                             
     D  SDSJNBR              264    269                                                             
                                                                                                    
     D* AREA DE DADES LOCAL I INICIALITZACIO DE VALORS COMUNS                                       
     D  DSLDA        E DS                  EXTNAME(PURLDADS)                                        
     D    CCCDEEM                    30    OVERLAY(ZZDEEM)                                          
                                                                                                    
      * PLANTILLA D'INDICADORS DEL PROGRAMA (ELS RESERVATS NO SURTEN)                               
     D  INDICADORS   E DS                  BASED(INDICADORP)                                        
     D                                     EXTNAME(INDDS:RIND0199)                                  
     D  INDICADORP     S               *   INZ(%ADDR(*IN))                                          
                                                                                                    
     D  @PEFILE1       S             10                                                             
     D  @PELOG11       S             10                                                             
     D  @PELOG12       S             10                                                             
     D  @PELOG13       S             10                                                             
     D  @PEFILE2       S             10                                                             
     D  @PELOG21       S             10                                                             
     D  @PELOG22       S             10                                                             
     D  @PELOG23       S             10                                                             
     D  @PEFILE3       S             10                                                             
     D  @PELOG31       S             10                                                             
     D  @PELOG32       S             10                                                             
     D  @PELOG33       S             10                                                             
     D  @PEPROGR       S             10                                                             
     D  @PEPARMS       S            250                                                             
      *                                                                                             
     D  @PCIAS         S                   LIKE(S5CIAS)                                             
     D  @PDLGA         S                   LIKE(S5DLGA)                                             
     D  @PNPCO         S                   LIKE(S5NPCO)                                             
     D  @PTPED         S                   LIKE(S5TPED)                                             
     D  @PDATP         S                   LIKE(S5DATP)                                             
     D  @PNOPL         S                   LIKE(S5NOPL)                                             
     D  @PLINE         S                   LIKE(S5LINE)                                             
FQ284D  @FDARV1        S             25                                                             
FQ284D  @FDCOM2        S             25                                                             
     D  @PCUST         S             10                                                             
     D  @PTDI1         S              2                                                             
     D  @PEDAU         S              3                                                             
     D  @PLOGI         S              1  0                                                          
     D  @PORIG         S              1  0                                                          
     D  @PINTE         S              1  0                                                          
                                                                                                    
     D  @PECIAS        S                   LIKE(M1CIAS) INZ                                         
     D  @PEDLGA        S                   LIKE(ZZDLGA) INZ                                         
     D  @PEARTI        S                   LIKE(M1ARTI) INZ                                         
     D  @PEVARI        S                   LIKE(M1VARI) INZ                                         
     D  @PEMODE        S                   LIKE(M1MODE) INZ                                         
     D  @PEDATD        S                   LIKE(M1DAT8) INZ                                         
     D  @PEDATH        S                   LIKE(M1DAT8) INZ                                         
     D  @PECANT        S                   LIKE(M1SACT) INZ                                         
     D  @PECAN1        S                   LIKE(M1SACT) INZ                                         
     D  @PECAN2        S                   LIKE(M1SACT) INZ                                         
     D  @PECUST        S             10                                                             
     D  @PETCOJ        S              1                                                             
     D  @PERRO         S              1                                                             
     D  @PINCI         S              3                                                             
                                                                                                    
     D  ZXTCOJ         S                   LIKE(NDTCOJ)                                             
     D  ZXPRVR         S                   LIKE(M5PRVR)                                             
     D  ZXSTKA         S             15  5                                                          
     D  ZXCANS0        S             15  5                                                          
     D  ZXCANE0        S             15  5                                                          
     D  ZXDEPO0        S             15  5                                                          
     D  ZXSTDD         S             15  5                                                          
     D  ZXDATD         S               D   DATFMT(*ISO)                                             
     D  ZXDATH         S               D   DATFMT(*ISO)                                             
     D  ZXCIAD         S                   LIKE(S5CIAS)                                             
     D  ZXARTTRAC      S                   LIKE(M5ARTI)                                             
     D  ZXVARTRAC      S                   LIKE(M5VARI)                                             
     D  ZXMODTRAC      S                   LIKE(M5MODE)                                             
     D  ZXARTDLGA      S             15                                                             
     D  ZXVARDLGA      S              3                                                             
     D  ZXMODDLGA      S              3                                                             
     D  ZXARVM         S             25                                                             
     D  ZXARVMPRO      S             25                                                             
     D  ZKARVM         S             25                                                             
     D  ZXARVP         S                   LIKE(C3ARVP)                                             
     D  ZXCANT         S                   LIKE(S5CANT)                                             
     D  Z0CANT         S                   LIKE(S5CANT)                                             
     D  Z1CANT         S                   LIKE(S5CANT)                                             
     D  Z2CANT         S                   LIKE(S5CANT)                                             
     D  ZXLOGE         S                   LIKE(S5LOGE)                                             
     D  XZAUXI1        S             29  9                                                          
     D  ZXCOCAMB       S             15  9                                                          
     D  @PCMCOCO       S             20  9                                                          
     D  @PCMCCCO       S             20  9                                                          
     D  @PDATA         S                   LIKE(S0DATP)                                             
     D  @PHORA         S                   LIKE(S0NOPL)                                             
     D  @PMON1         S                   LIKE(S0MONE)                                             
     D  @PMON2         S                   LIKE(S0MONE)                                             
     D  @PDTOE         S                   LIKE(S5DTO1)                                             
     D  @PEERR         S              1                 INZ                                         
     D  ZXSERV         S                   LIKE(PEBL61)                                             
     D  XZARTI         S                   LIKE(S5ARTI)                                             
     D  XZVARI         S                   LIKE(S5VARI)                                             
     D  XZMODE         S                   LIKE(S5MODE)                                             
     D  XZCIAS         S                   LIKE(S5CIAS)                                             
     D  ZXMONE2        S                   LIKE(S0MONE)                                             
     D  ZXIMPO         S                   LIKE(S5COST)                                             
     D  ZXTIVC         S              1                                                             
     D  ZXINCI         S              3                                                             
     D  ZXTCST         S                   LIKE(M5TCS1)                                             
     DSDE              S              1A   DIM(10)                                                  
ECOP  *Ecotaxe                                                                                     
ECOP D    @PEECOP      S                   LIKE(S5ECOP)                                             
ECOP D    @PEFLCD      S                   LIKE(S5DATP)                                             
ECOP D    @PETAXE      S                   LIKE(S5PRCC)                                             
                                                                                                    
     D  ZXPEDT         S                   LIKE(T2ENTD)                                             
     D  ZXPEDD         S                   LIKE(T2ENTD)                                             
     D  ZXSTPR         S                   LIKE(T2VA05)                                             
     D  ZXSTDL         S                   LIKE(T2VA05)                                             
     D  ZXLG05         S                   LIKE(T2VA05)                                             
     D  ZXVSTK         S                   LIKE(T2VA05)                                             
     D  ZXPEXP         S              3  0                                                          
     D  ZXVA09         S                   LIKE(T2VA09)                                             
     D  ZXVA10         S                   LIKE(T2VA10)                                             
     D  ZXFORZ         S                   LIKE(T2FORZ)                                             
     D  ZW             S              3  0                                                          
     D  X              S              3  0                                                          
     D  FileArti_erp   S             21                                                             
     D  File_mitmas    S             21                                                             
     D  FileCojc_erp   S             21                                                             
     D  FileCojd_erp   S             21                                                             
     D  File_cmndiv    S             21                                                             
     D  File_mpdhed    S             21                                                             
     D  File_mpdmat    S             21                                                             
I0184D  File_AQPEDI    S             21                                                             
I0184D  File_ZAQITN    S             21                                                             
I0184D  File_GMTABD    S             21                                                             
I0184D  File_MITFAC    S             21                                                             
     D  LIBLMVX        S             10                                                             
I0184D  LIBLAQA        S             10                                                             
                                                                                                    
      * Series                                                                                      
     D SARVMCJT        S             25    DIM(100)                                                 
     D SARPRCJT        S             25    DIM(100)                                                 
     D SPRVRCJT        S             10    DIM(100)                                                 
     D SCANTCJT        S             15  5 DIM(100)                                                 
     D SLOGISTI        S              3    DIM(100)                                                 
                                                                                                    
      * Parámetros para GX0150 (Entorno Movex)                                                      
     D  @PECONO        S              3P 0                                                          
     D  @PEDIVI        S              3                                                             
     D  @PEUSER        S             10                                                             
     D  @PEVAL         S            250                                                             
FQ842 * Parámetros MSAUDI                                                                           
FQ842D @PEACCI         S              2                                                             
FQ842D @PEARVM         S             25                                                             
FQ842D @PECAUD         S              4                                                             
FQ842D @PEFILD         S                   LIKE(SDSPGM)                                             
FQ842D @PEFILE         S                   LIKE(SDSPGM)                                             
FQ842D @PEPGMO         S             10                                                             
FQ842D @PEVAL1         S             50                                                             
FQ842D @PEVAL2         S             50                                                             
FQ842D @PELINE         S                   LIKE(S5LINE)                                             
FQ842D @PENPCO         S                   LIKE(S5NPCO) INZ                                         
FQ842D @PECLPR         S                   LIKE(S5CUST) INZ                                         
FQ842D @PENOPL         S                   LIKE(S5NOPL) INZ                                         
FQ842D @PEDATP         S                   LIKE(S5DATP) INZ                                         
FQ842D @PETPED         S                   LIKE(S5TPED) INZ                                         
FQ842 *                                                                                             
     D  ZXVAL          DS                                                                           
     D    MXCONO               1      3                                                             
     D    MXDIVI               4      6                                                             
     D    MXIDIO               7      8                                                             
     D    MXMONE               9     11                                                             
     D    MXRESTO             12    250                                                             
                                                                                                    
     D                 DS                                                                           
     D  ZXARVMX                1     25                                                             
     D    ZXARTIX              1     15                                                             
     D    ZXVARIX             16     18                                                             
     D    ZXMODEX             19     21                                                             
      *                                                                                             
     D                 DS                                                                           
     D  ZXBL65I                1      5                                                             
     D    ZXPABI               1      1                                                             
      *                                                                                             
     D  S5AMPL         DS                                                                           
ECOP D    S5ECOP              24     24                                                             
                                                                                                    
     D  C0AMP2         DS                                                                           
     D    C0PEVT               1      1                                                             
                                                                                                    
     D  C_S0AMP2       DS                                                                           
     D    C_S0CEVT            96     96                                                             
                                                                                                    
     D  M5AMPL         DS                                                                           
     D    M5PROB              49     50                                                             
     D    M5NOED              63     63                                                             
                                                                                                    
     D  PPBL10         DS                                                                           
     D    PPSERV               6      6                                                             
     D    PPCTBP               8      8                                                             
     D    PPMVXV               9      9                                                             
     D    PPMVXE              10     10                                                             
                                                                                                    
     D  S0AMPL         DS                                                                           
     D    S0ETOD              63     63                                                             
C2238D    S0EDME              65     65                                                             
FQ842D    S0MOST              70     70                                                             
FQ842D    S0EDLG             100    100                                                             
FQ618D                 DS                                                                           
FQ618D  ZXBL64                 1     10                                                             
FQ618D    ZXNOED               7      7                                                             
                                                                                                    
FQ842 *                                                                                             
FQ842D P7AMPL          DS                                                                           
FQ842D  P7FILLER1              1     58                                                             
FQ842D  P7AUTS                59     59                                                             
FQ842D  P7FILLER2             60    100                                                             
FQ842 *                                                                                             
FQ842D T3AMPL          DS                                                                           
FQ842D  T3OPL1                 1      3                                                             
C1636***FQ842D  T3RESTO                4    100                                                     
C1636d  T3VFYB                12     12                                                             
C1078d  T3ADOM                14     14                                                             
HD123D     T3LVIR              9     11                                                             
CR533**C1636d  T3RESTO               13    100                                                      
CR533d     T3FDSC             15     15                                                             
C2238d     T3OFEX             19     19                                                             
CR533d     T3RESTO            16    100                                                             
      *                                                                                             
CR554d  s5amp2         ds                                                                           
CR554d   s5lb2b                       1a   overlay(s5amp2:30)                                       
CR554 *                                                                                             
CR554d @PLOGS          s             20a                                                            
CR554d @PORDN          s              4a                                                            
CR554d zxLogS          s              3a   dim(4)                                                   
CR554d zxOrd           s              1a   dim(4)                                                   
CR554d u_l             s              3u 0                                                          
CR554 *                                                                                             
C1636d zycant          s                   like(s5cant)                                             
C1636d zystdd          s             15  5                                                          
C1636d zystka          s             15  5                                                          
C1636d zycans0         s             15  5                                                          
C1636d zycane0         s             15  5                                                          
C1636d zydepo0         s             15  5                                                          
C1636 *                                                                                             
C1579D  ZXPWEB         S              1                                                             
I0184 *                                                                                             
I0184D  ZXMULTIPLA     S               N                                                            
I0184 *                                                                                             
I0184D  GET_FACI       PR                  LIKE(MMCIAS)                                             
I0184D    @DIVI                            LIKE(MMPROP) VALUE                                       
I0184D    @FACI                            LIKE(MMCIAS) VALUE                                       
I0184D    @ITNO                            LIKE(MMITNO) VALUE                                       
IT228D  @PALMA         S                   LIKE(M0MAGA)                                             
IT228D  @PTIPO         S                   LIKE(M0BAJA)                                             
IT228D  @PRESP         S                   LIKE(M0MAGA)                                             
IT228D  ZXALMOL        S                   LIKE(M0MAGA)                                             
IT228d  T_logol        s                   like(m0logs) dim(10) inz                                 
IT228d  i2OL           s              2  0 inz                                                      
IT228D  ZXPRV          S                   LIKE(M5PRVR)                                             
      *                                                                                             
IT244D  P7AMP2         DS                                                                           
IT244D  P7EDV3                11     11                                                             
      **********************************************************************                        
      * Estructura de Programa                                                                      
      **********************************************************************                        
IT244C                   IF        P7EDV3='1'                                                       
IT244C                   CALL      'ED3050'                                                         
IT244c                   PARM                    @PCIAS                                             
IT244c                   PARM                    @PDLGA                                             
IT244c                   PARM                    @PNPCO                                             
IT244c                   PARM                    @PTPED                                             
IT244c                   PARM                    @PDATP                                             
IT244c                   PARM                    @PNOPL                                             
IT244c                                                                                              
IT244C                   ELSE                                                                       
      *                                                                                             
      * Generamos el/los ficheros de trabajo deseados en QTEMP                                      
      *                                                                                             
     C                   CALL      'UTIFQTMPCL'                                                     
     C                   PARM      'ED0050W   '  @PEFILE1                                           
     C                   PARM      *BLANKS       @PELOG11                                           
     C                   PARM      *BLANKS       @PELOG12                                           
     C                   PARM      *BLANKS       @PELOG13                                           
     C                   PARM      *BLANKS       @PEFILE2                                           
     C                   PARM      *BLANKS       @PELOG21                                           
     C                   PARM      *BLANKS       @PELOG22                                           
     C                   PARM      *BLANKS       @PELOG23                                           
     C                   PARM      *BLANKS       @PEFILE3                                           
     C                   PARM      *BLANKS       @PELOG31                                           
     C                   PARM      *BLANKS       @PELOG32                                           
     C                   PARM      *BLANKS       @PELOG33                                           
     C                   PARM      *BLANKS       @PEPROGR                                           
     C                   PARM      *BLANKS       @PEPARMS                                           
      *                                                                                             
      * Abrir Ficheros QTEMP                                                                        
      *                                                                                             
     C                   OPEN      ED0050W                                                          
      *                                                                                             
IT228C                   EXSR      CS_LOGOL                                                         
      * Proceso                                                                                     
     C                   EXSR      CS_PROCESO                                                       
      *                                                                                             
      * Cerrar Ficheros QTEMP                                                                       
      *                                                                                             
     C                   CLOSE     ED0050W                                                          
C1078                                                                                               
26F19C*24986             IF        S0PPED<>'25' AND S0PPED<>'26'                                    
26F19C                   IF        S0PPED<>'26'                                                     
C1078C                                                                                              
C1078C                   EVAL      T3CIAS = @PCIAS                                                  
C1078C                   EVAL      T3DLGA = @PDLGA                                                  
C1078C     KEDPARM       CHAIN     EDPARM                                                           
C1078C                   IF        %FOUND AND T3ADOM='1'                                            
X1078C                             AND S0STCO<'20'                                                  
C2238C                             AND (T3OFEX<>'1' OR                                              
C2238C                             (T3OFEX='1' AND S0EDME<>'5'))                                    
M1078C                   EVAL      N1CIAS = @PCIAS                                                  
M1078C                   EVAL      N1TTTA = S0TTTA                                                  
M1078C     KMSTRTA       CHAIN     MSTRTA                                                           
M1078C                   IF        %FOUND(MSTRTA) And N1NOED='2'                                    
M1078C                   ELSE                                                                       
C1078C                   CALL      'DO0050'                                                         
C1078C                   PARM                    @PCIAS                                             
C1078C                   PARM                    @PDLGA                                             
C1078C                   PARM                    @PNPCO                                             
C1078C                   PARM                    @PTPED                                             
C1078C                   PARM                    @PDATP                                             
C1078C                   PARM                    @PNOPL                                             
C1078C                   PARM                    @PLOGS                                             
C1078C                   PARM                    @PORDN                                             
C1078C                   ENDIF                                                                      
M1078C                   ENDIF                                                                      
24986C                   ENDIF                                                                      
C1078                                                                                               
      *                                                                                             
IT244C                   ENDIF                                                                      
     C                   SETON                                        LR                            
      **************************************************************                                
      * SUBRUTINA INICIAL                                          *                                
      *------------------------------------------------------------*                                
     C     *INZSR        BEGSR                                                                      
                                                                                                    
      * DEFINICIO DE LES KLIST DEL PGM                                                              
     C     KEDPARM       KLIST                                                                      
     C                   KFLD                    T3CIAS                                             
     C                   KFLD                    T3DLGA                                             
                                                                                                    
C2510C     KEDPARC       KLIST                                                                      
C2510C                   KFLD                    T4CIAS                                             
C2510C                   KFLD                    T4CUST                                             
                                                                                                    
     C     KED0050W      KLIST                                                                      
     C                   KFLD                    T2CIAS                                             
     C                   KFLD                    T2DLGA                                             
     C                   KFLD                    T2NPCO                                             
     C                   KFLD                    T2TPED                                             
     C                   KFLD                    T2DATP                                             
     C                   KFLD                    T2NOPL                                             
                                                                                                    
     C     KPMEMPR       KLIST                                                                      
     C                   KFLD                    P7CIAS                                             
     C                   KFLD                    P7DLGA                                             
                                                                                                    
     C     KCOCLIN       KLIST                                                                      
     C                   KFLD                    C_S0CIAS                                           
     C                   KFLD                    C_S0CUST                                           
                                                                                                    
     C     KCODEPE       KLIST                                                                      
     C                   KFLD                    S5CIAS                                             
     C                   KFLD                    S5DLGA                                             
     C                   KFLD                    S5NPCO                                             
     C                   KFLD                    S5TPED                                             
     C                   KFLD                    S5DATP                                             
     C                   KFLD                    S5NOPL                                             
                                                                                                    
     C     KCODEPE0      KLIST                                                                      
     C                   KFLD                    S5CIAS                                             
     C                   KFLD                    S5DLGA                                             
     C                   KFLD                    S5NPCO                                             
     C                   KFLD                    S5TPED                                             
     C                   KFLD                    S5DATP                                             
     C                   KFLD                    S5NOPL                                             
     C                   KFLD                    S5LINE                                             
                                                                                                    
     C     KCOCAPE       KLIST                                                                      
     C                   KFLD                    S0CIAS                                             
     C                   KFLD                    S0DLGA                                             
     C                   KFLD                    S0NPCO                                             
     C                   KFLD                    S0TPED                                             
     C                   KFLD                    S0DATP                                             
     C                   KFLD                    S0NOPL                                             
                                                                                                    
     C     KPMUNAL       KLIST                                                                      
     C                   KFLD                    @pCIAS                                             
     C                   KFLD                    P6ARTI                                             
     C                   KFLD                    P6VARI                                             
     C                   KFLD                    P6MODE                                             
     C                   KFLD                    P6UNIM                                             
                                                                                                    
     C     KPMTABD       KLIST                                                                      
     C                   KFLD                    PECIAS                                             
     C                   KFLD                    PECTAB                                             
     C                   KFLD                    PECLTA                                             
                                                                                                    
     C     KMSDLDL       KLIST                                                                      
     C                   KFLD                    XACIAS                                             
     C                   KFLD                    XADLGA                                             
     C                   KFLD                    XADLG2                                             
                                                                                                    
     C     KMSDLDL05     KLIST                                                                      
     C                   KFLD                    XACIAS                                             
     C                   KFLD                    XADLGA                                             
                                                                                                    
     C     KMSTRTA       KLIST                                                                      
     C                   KFLD                    N1CIAS                                             
     C                   KFLD                    N1TTTA                                             
                                                                                                    
     C     KMSLOAD       KLIST                                                                      
     C                   KFLD                    MICIAS                                             
     C                   KFLD                    MIDLGA                                             
     C                   KFLD                    MILGCA                                             
                                                                                                    
     C     KMSALMA       KLIST                                                                      
     C                   KFLD                    M0CIAS                                             
     C                   KFLD                    M0MAGA                                             
                                                                                                    
     C     KMSALMA05     KLIST                                                                      
     C                   KFLD                    M0CIAS                                             
     C                   KFLD                    M0LOGE                                             
                                                                                                    
     C     KMSSTOK       KLIST                                                                      
     C                   KFLD                    M1CIAS                                             
     C                   KFLD                    M1MAGA                                             
     C                   KFLD                    M1ARTI                                             
     C                   KFLD                    M1VARI                                             
     C                   KFLD                    M1MODE                                             
                                                                                                    
     C     KMSSTO01      KLIST                                                                      
     C                   KFLD                    M1CIAS                                             
     C                   KFLD                    M1ARTI                                             
     C                   KFLD                    M1VARI                                             
     C                   KFLD                    M1MODE                                             
                                                                                                    
     C     KMSSTO010     KLIST                                                                      
     C                   KFLD                    M1CIAS                                             
     C                   KFLD                    M1ARTI                                             
     C                   KFLD                    M1VARI                                             
     C                   KFLD                    M1MODE                                             
     C                   KFLD                    M1MAGA                                             
     C                   KFLD                    M1CALI                                             
                                                                                                    
     C     KMSSTO909     KLIST                                                                      
     C                   KFLD                    M1CIAS                                             
     C                   KFLD                    M1ARTI                                             
     C                   KFLD                    M1VARI                                             
     C                   KFLD                    M1MODE                                             
     C                   KFLD                    M1MAGA                                             
     C                   KFLD                    M1CALI                                             
                                                                                                    
     C     KMSCOJC       KLIST                                                                      
     C                   KFLD                    NDCIAS                                             
     C                   KFLD                    NDARTI                                             
     C                   KFLD                    NDVARI                                             
     C                   KFLD                    NDMODE                                             
     C                   KFLD                    NDTCOJ                                             
                                                                                                    
     C     KMSARTI       KLIST                                                                      
     C                   KFLD                    A_M5ARTI                                           
     C                   KFLD                    A_M5VARI                                           
     C                   KFLD                    A_M5MODE                                           
                                                                                                    
     C     KMSARTI00     KLIST                                                                      
     C                   KFLD                    M5CIAS                                             
     C                   KFLD                    M5ARTI                                             
     C                   KFLD                    M5VARI                                             
     C                   KFLD                    M5MODE                                             
                                                                                                    
     C     KMITMAS00     KLIST                                                                      
     C                   KFLD                    MMCONO                                             
     C                   KFLD                    MMITNO                                             
                                                                                                    
     C     KGXEQAR       KLIST                                                                      
     C                   KFLD                    Q1CIAS                                             
     C                   KFLD                    Q1ARVM                                             
                                                                                                    
     C     KUTCOM0       KLIST                                                                      
     C                   KFLD                    U0CIAS                                             
     C                   KFLD                    U0TENV                                             
     C                   KFLD                    U0CLP0                                             
     C                   KFLD                    U0CLP2                                             
                                                                                                    
     C     KPUPROV       KLIST                                                                      
     C                   KFLD                    C0CIAS                                             
     C                   KFLD                    C0PRVR                                             
                                                                                                    
     C     KPUPRP0       KLIST                                                                      
     C                   KFLD                    C3CIAS                                             
     C                   KFLD                    C3PRVR                                             
     C                   KFLD                    C3ARVM                                             
                                                                                                    
     C     KGXEQPR       KLIST                                                                      
     C                   KFLD                    Q1CIAS                                             
     C                   KFLD                    Q1PRVR                                             
                                                                                                    
     C     KPMLIBL       KLIST                                                                      
     C                   KFLD                    PPCIAS                                             
                                                                                                    
     C     KCMNDIV00     KLIST                                                                      
     C                   KFLD                    CCCONO                                             
     C                   KFLD                    CCDIVI                                             
                                                                                                    
     C     KMSDIV0       KLIST                                                                      
     C                   KFLD                    MBCIAS                                             
     C                   KFLD                    MBMONE                                             
                                                                                                    
     C     KMSIVAS0      KLIST                                                                      
     C                   KFLD                    MVCIAS                                             
     C                   KFLD                    MVTIVA                                             
     C                   KFLD                    MVPABI                                             
                                                                                                    
     C     KMSIVAS       KLIST                                                                      
     C                   KFLD                    MVCIAS                                             
     C                   KFLD                    MVTIVA                                             
     C                   KFLD                    MVPABI                                             
     C                   KFLD                    MVFLCD                                             
                                                                                                    
     C     KMPDHED00     KLIST                                                                      
     C                   KFLD                    H_PHCONO                                           
     C                   KFLD                    H_PHFACI                                           
     C                   KFLD                    H_PHPRNO                                           
     C                   KFLD                    H_PHSTRT                                           
                                                                                                    
     C     KMPDMAT00     KLIST                                                                      
     C                   KFLD                    PMCONO                                             
     C                   KFLD                    PMFACI                                             
     C                   KFLD                    PMPRNO                                             
     C                   KFLD                    PMSTRT                                             
I0184 *                                                                                             
I0184C     KAQPEDI00     KLIST                                                                      
I0184C                   KFLD                    Z1CONO                                             
I0184C                   KFLD                    Z1DIVI                                             
I0184 *                                                                                             
I0184C     KZAQITN00     KLIST                                                                      
I0184C                   KFLD                    MMCONO                                             
I0184C                   KFLD                    MMITNO                                             
I0184 *                                                                                             
I0184C     KGMTABD01     KLIST                                                                      
I0184C                   KFLD                    T1CTAB                                             
I0184C                   KFLD                    T1DESC                                             
I0184 *                                                                                             
I0184C     KMITFAC00     KLIST                                                                      
I0184C                   KFLD                    M9CONO                                             
I0184C                   KFLD                    M9FACI                                             
I0184C                   KFLD                    M9ITNO                                             
FQ842                                                                                               
FQ842C     KCOCAIP       KLIST                                                                      
FQ842C                   KFLD                    RXCIAS                                             
FQ842C                   KFLD                    RXDLGA                                             
FQ842C                   KFLD                    RXNPCO                                             
FQ842C                   KFLD                    RXTPED                                             
FQ842C                   KFLD                    RXDATP                                             
FQ842C                   KFLD                    RXNOPL                                             
                                                                                                    
     C     *DTAARA       DEFINE    PURLDA        DSLDA                                              
     C                   IN        DSLDA                                                            
                                                                                                    
     C                   IF        ZZTCIA='1' OR ZZTCIA='2'                                         
     C                   OPEN      PMCAOR01                                                         
     C                   OPEN      PMCAOR08                                                         
     C                   OPEN      PMDEOR05                                                         
     C                   ENDIF                                                                      
                                                                                                    
      * Entrada de parámetros                                                                       
     C     *ENTRY        PLIST                                                                      
     C                   PARM                    @PCIAS                                             
     C                   PARM                    @PDLGA                                             
     C                   PARM                    @PNPCO                                             
     C                   PARM                    @PTPED                                             
     C                   PARM                    @PDATP                                             
     C                   PARM                    @PNOPL                                             
CR554C                   PARM                    @PLOGS                                             
CR554C                   PARM                    @PORDN                                             
CR554 *                                                                                             
IT244 **********************************************************************                        
IT244 * Access a PMEMPR posició 11 per veure si es versiò 3                                         
IT244 **********************************************************************                        
IT244C                   EVAL      P7CIAS=@PCIAS                                                    
IT244C                   EVAL      P7DLGA=*blanks                                                   
IT244C     KPMEMPR       CHAIN     PMEMPR                                                           
IT244C                   IF        P7EDV3<>'1'                                                      
CR554c                   clear                   zxLogS                                             
CR554c                   if        %addr(@PLOGS) <> *null                                           
CR554c                   movea     @PLOGS        zxLogS                                             
CR554c                   endif                                                                      
CR554c                   clear                   zxOrd                                              
CR554c                   if        %addr(@PORDN) <> *null                                           
CR554c                   movea     @PORDN        zxOrd                                              
CR554c                   endif                                                                      
FQ842 *                                                                                             
FQ842C                   EXSR      CS_CHKLOGE                                                       
FQ842 *                                                                                             
                                                                                                    
IT244c                   ENDIF                                                                      
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Proceso lectura del pedido                                                                  
      **********************************************************************                        
     C     CS_PROCESO    BEGSR                                                                      
                                                                                                    
     C                   EVAL      ZXPEDD = 0                                                       
     C                   EVAL      ZXPEDT = 0                                                       
     C                   EVAL      ZXPEXP = 0                                                       
     C                   EVAL      ZXVA09 = 0                                                       
     C                   EVAL      ZXVA10 = 0                                                       
     C                   EVAL      ZXIMPO = 0                                                       
     C                   EVAL      ZXFORZ = 0                                                       
                                                                                                    
     C                   EVAL      T3CIAS = @PCIAS                                                  
     C                   EVAL      T3DLGA = @PDLGA                                                  
     C     KEDPARM       CHAIN     EDPARM                                                           
FQ798C                   IF        NOT%FOUND OR T3BAJA='1'                                          
FQ798C                   LEAVESR                                                                    
FQ798C                   ENDIF                                                                      
                                                                                                    
     C                   EVAL      S0CIAS = @PCIAS                                                  
     C                   EVAL      S0DLGA = @PDLGA                                                  
     C                   EVAL      S0NPCO = @PNPCO                                                  
     C                   EVAL      S0TPED = @PTPED                                                  
     C                   EVAL      S0DATP = @PDATP                                                  
     C                   EVAL      S0NOPL = @PNOPL                                                  
     C     KCOCAPE       CHAIN     COCAPE                                                           
b01  C                   IF        %FOUND(COCAPE)                                                   
09712C                   IF        S0PPED='90'                                                      
09712C                   LEAVESR                                                                    
09712C                   ENDIF                                                                      
                                                                                                    
C2510C                   EVAL      T4CIAS = @PCIAS                                                  
C2510C                   EVAL      T4CUST = S0CUST                                                  
C2510C     KEDPARC       CHAIN     EDPARC                                                           
C2510C                   IF        %FOUND(EDPARC)                                                   
C2510C**                 IF        T4LIMP<>0                                                        
C2510C                   EVAL      T3LIMP=T4LIMP                                                    
C2510C**                 ENDIF                                                                      
C2510C                   ENDIF                                                                      
C1579                                                                                               
C1579 * Si es pedido procedencia Poolweb, tiene que ser Fluidra Direct.                             
C1579C                   EXSR      CS_POOLWEB                                                       
                                                                                                    
     C                   EVAL      T2CIAS = @PCIAS                                                  
     C                   EVAL      T2DLGA = @PDLGA                                                  
     C                   EVAL      T2NPCO = @PNPCO                                                  
     C                   EVAL      T2TPED = @PTPED                                                  
     C                   EVAL      T2DATP = @PDATP                                                  
     C                   EVAL      T2NOPL = @PNOPL                                                  
                                                                                                    
      * Leo Pedido en CODEPE                                                                        
     C                   EVAL      S5CIAS = @PCIAS                                                  
     C                   EVAL      S5DLGA = @PDLGA                                                  
     C                   EVAL      S5NPCO = @PNPCO                                                  
     C                   EVAL      S5TPED = @PTPED                                                  
     C                   EVAL      S5DATP = @PDATP                                                  
     C                   EVAL      S5NOPL = @PNOPL                                                  
     C     KCODEPE       SETLL     CODEPE                                                           
     C     KCODEPE       READE     CODEPE                                                           
d02  C                   DOW       NOT %EOF(CODEPE)                                                 
                                                                                                    
     C                   EVAL      T2VA00 = 0                                                       
     C                   EVAL      T2VA01 = 0                                                       
     C                   EVAL      T2VA02 = 0                                                       
     C                   EVAL      T2VA03 = 0                                                       
     C                   EVAL      T2VA04 = 0                                                       
FQ618C                   EVAL      T2VA11 = 0                                                       
     C                   EVAL      T2VA05 = 0                                                       
     C                   EVAL      T2VA06 = 0                                                       
     C                   EVAL      T2VA07 = 0                                                       
     C                   EVAL      T2VA08 = 0                                                       
FQ726C                   EVAL      T2VA12 = 0                                                       
FQ726C                   EVAL      T2VA13 = 0                                                       
C1636** Campo para Comprobación de Stock Suficiente en Delegación si Artículo "B".                  
C1636C                   EVAL      T2VA14 = 0                                                       
     C                   EVAL      T2SART = *BLANKS                                                 
     C                   EVAL      T2SDIS = 0                                                       
     C                   EVAL      T2SMAX = 0                                                       
     C                   EVAL      T2SALM = *BLANKS                                                 
     C                   EVAL      T2TART = *BLANKS                                                 
     C                   EVAL      T2TCAN = 0                                                       
     C                   EVAL      T2TDIS = 0                                                       
     C                   EVAL      T2DART = *BLANKS                                                 
     C                   EVAL      T2DCAN = 0                                                       
     C                   EVAL      T2DDIS = 0                                                       
     C                   EVAL      T2DALM = *BLANKS                                                 
     C                   EVAL      T2IMPM = 0                                                       
     C                   EVAL      T2IMED = 0                                                       
     C                   EVAL      T2INCI = *BLANKS                                                 
FQ726C                   EVAL      T2LOGI = S5LOGE                                                  
FQ726C                   EVAL      T2LOGU = *BLANKS                                                 
FQ942C                   EVAL      T2CJTO = 0                                                       
CR554c                   eval      T2FORZ = 0                                                       
                                                                                                    
     C                   EVAL      T2LINE = S5LINE                                                  
CR554 *                                                                                             
CR554c                   if            s5lb2b <> *blanks                                            
CR554c                             and s5tped = '25'                                                
CR554c                   GOTO      TWRITE                                                           
CR554c                   endif                                                                      
CR554 *                                                                                             
C1579 * Si es pedido procedencia Poolweb, tiene que ser Fluidra Direct.                             
C1579c                   if        zxpweb='1'                                                       
C1579C                   EVAL      @PLINE = S5LINE                                                  
C1579C                   EXSR      CS_VALED51                                                       
C1579C                   EVAL      T2FORZ = 1                                                       
C1579C                   EVAL      ZXSERV = *BLANKS                                                 
C1579 * Comprobar si el artículo es de servicio                                                     
C1579C                   EVAL      M5CIAS = S5CIAS                                                  
C1579C                   EVAL      M5ARTI = S5ARTI                                                  
C1579C                   EVAL      M5VARI = S5VARI                                                  
C1579C                   EVAL      M5MODE = S5MODE                                                  
C1579C     KMSARTI00     CHAIN     MSARTI00                                                         
C1579C                   IF        %FOUND(MSARTI00)                                                 
C1579C                   EVAL      PECIAS = S5CIAS                                                  
C1579C                   EVAL      PECTAB = 'TIPG'                                                  
C1579C                   EVAL      PECLTA = *BLANKS                                                 
C1579C                   EVAL      PECLTA = M5TIPG                                                  
C1579C     KPMTABD       CHAIN     PMTABD                                                           
C1579C                   IF        %FOUND(PMTABD)                                                   
C1579C                   EVAL      ZXSERV = PEBL61                                                  
C1579C                   ELSE                                                                       
C1579C                   EVAL      ZXSERV = *BLANKS                                                 
C1579C                   ENDIF                                                                      
C1579C                   ENDIF                                                                      
C1579C                   IF        ZXSERV <> '1'                                                    
C1579C                   GOTO      TFINAL                                                           
C1579C                   ELSE                                                                       
C1579C                   GOTO      TSERVI                                                           
C1579C                   ENDIF                                                                      
C1579c                   endif                                                                      
FQ726                                                                                               
FQ726 * Si parámetro de Solo Forzada, compruebo que sea ED Forzada                                  
FQ726C                   IF        T3EDFO = '1'                                                     
FQ726C                   IF        S5TPE4 = '2' Or S0TPE4 = '2'                                     
FQ726C                   EVAL      T2FORZ = 1                                                       
FQ726C                   ELSE                                                                       
FQ726C                   EVAL      T2VA12 = 1                                                       
FQ726C                   GOTO      TFINAL                                                           
FQ726C                   ENDIF                                                                      
FQ726C                   ENDIF                                                                      
FQ842 * Si ENTREGA EN DELEGACIÓN o procedencia pedido esta activado                                 
FQ842 * no chequearemos  cliente                                                                    
FQ842C                   IF        S0EDLG='1'                                                       
FQ842C*                            OR S0PPED='25'                                                   
FQ842C                   ELSE                                                                       
                                                                                                    
      * Comprobar Parámetro Cliente                                                                 
In211C                   IF        ((S5TPE4 = '2' Or S0TPE4 = '2')                                  
In211C                             And T3NCLF <> '1') Or                                            
In211C                             (S5TPE4 <> '2' And S0TPE4 <> '2')                                
     C                   EXSR      CS_CLIENT                                                        
b03  C                   IF        T2VA00 = 1                                                       
     C                   GOTO      TFINAL                                                           
e03  C                   ENDIF                                                                      
In211C                   ENDIF                                                                      
FQ842C                   ENDIF                                                                      
C1579C     TSERVI        TAG                                                                        
                                                                                                    
      * Comprobar si el artículo es de servicio                                                     
     C                   EVAL      M5CIAS = S5CIAS                                                  
     C                   EVAL      M5ARTI = S5ARTI                                                  
     C                   EVAL      M5VARI = S5VARI                                                  
     C                   EVAL      M5MODE = S5MODE                                                  
     C     KMSARTI00     CHAIN     MSARTI00                                                         
b03  C                   IF        %FOUND(MSARTI00)                                                 
     C                   EVAL      PECIAS = S5CIAS                                                  
     C                   EVAL      PECTAB = 'TIPG'                                                  
     C                   EVAL      PECLTA = *BLANKS                                                 
     C                   EVAL      PECLTA = M5TIPG                                                  
     C     KPMTABD       CHAIN     PMTABD                                                           
b04  C                   IF        %FOUND(PMTABD)                                                   
     C                   EVAL      ZXSERV = PEBL61                                                  
x04  C                   ELSE                                                                       
     C                   EVAL      ZXSERV = *BLANKS                                                 
e04  C                   ENDIF                                                                      
e03  C                   ENDIF                                                                      
                                                                                                    
b03  C                   IF        ZXSERV <> '1'                                                    
      * Comprobar Parámetro Proveedor                                                               
b04  C                   IF        M5SIOL <> '2'                                                    
     C                   EXSR      CS_PROVEED                                                       
b05  C                   IF        T2VA02 = 1 Or T2VA01 = 1                                         
     C                   GOTO      TFINAL                                                           
e05  C                   ENDIF                                                                      
e04  C                   ENDIF                                                                      
                                                                                                    
      * Comprobar Parámetro Artículo                                                                
     C                   EXSR      CS_ARTICUL                                                       
b04  C                   IF        T2VA03 = 1                                                       
     C                   GOTO      TFINAL                                                           
e04  C                   ENDIF                                                                      
                                                                                                    
      * Validaciones para Alta ED (precio compra, artículo, etc...)                                 
     C                   EVAL      @PLINE = S5LINE                                                  
     C                   EXSR      CS_VALED51                                                       
b04  C                   IF        T2VA08 = 1                                                       
FQ942C                             OR T2CJTO = 1                                                    
     C                   GOTO      TFINAL                                                           
e04  C                   ENDIF                                                                      
                                                                                                    
      * Comprobar si ED Forzada                                                                     
b04  C                   IF        S5TPE4 = '2' Or S0TPE4 = '2'                                     
     C                   EVAL      T2FORZ = 1                                                       
     C                   EVAL      ZXFORZ = 1                                                       
     C                   GOTO      TFINAL                                                           
x04  C                   ELSE                                                                       
     C                   EVAL      T2FORZ = 0                                                       
e04  C                   ENDIF                                                                      
                                                                                                    
FQ842C                   IF        S0EDLG<>'1'                                                      
      * Comprobar Parámetro Transportista                                                           
     C                   EXSR      CS_TRANSPO                                                       
b04  C                   IF        T2VA04 = 1                                                       
     C                   GOTO      TFINAL                                                           
e04  C                   ENDIF                                                                      
FQ842C                   ENDIF                                                                      
FQ618                                                                                               
FQ618 * Comprobar Paràmetre Forma de Pagament                                                       
FQ618C                   EXSR      CS_FORPAGO                                                       
FQ618C                   IF        T2VA11 = 1                                                       
FQ618C                   GOTO      TFINAL                                                           
FQ618C                   ENDIF                                                                      
FQ726                                                                                               
FQ842C                   IF        S0EDLG<>'1'                                                      
FQ726 * Comprobar Logísticas                                                                        
FQ726C                   IF        T3LOGI = '1'                                                     
FQ726C                   EXSR      CS_LOGISTI                                                       
FQ726C                   ENDIF                                                                      
FQ726C                   IF        T2VA13 = 1                                                       
FQ726C                   GOTO      TFINAL                                                           
FQ726C                   ENDIF                                                                      
FQ842C                   ENDIF                                                                      
                                                                                                    
      * Comprobar si el artículo es Obsoleto                                                        
b04  C                   IF        T3OBSO = '1'                                                     
     C                   EXSR      CS_ARTOBSO                                                       
e04  C                   ENDIF                                                                      
b04  C                   IF        T2VA05 = 1                                                       
     C                   GOTO      TFINAL                                                           
e04  C                   ENDIF                                                                      
                                                                                                    
      * Comprobar sobreestock del artículo                                                          
FQ726C**                 IF        T3SSTO = '1'                                                     
FQ726C                   IF        T3SSTO >= '1'                                                    
     C                   EXSR      CS_SOBRSTK                                                       
e04  C                   ENDIF                                                                      
b04  C                   IF        T2VA06 = 1                                                       
     C                   GOTO      TFINAL                                                           
e04  C                   ENDIF                                                                      
C1636 *                                                                                             
C1636 * Comprobar Stock Artículos "B" (si Parámetro Verificar Artículos "B" = '1')                  
C1636 * Si Delegación es Autoservicio MIXTO (AUTS in '1' '2' y OPL1 = blanco)                       
C1636 * ó  Delegación Convencional (AUTS = blanco ó '0')                                            
C1636c                   clear                   rpmempr                                            
C1636c                   eval      p7cias = @pcias                                                  
C1636c                   eval      p7dlga = @pdlga                                                  
C1636c     kpmempr       chain     PMEMPR                                                           
C1636C                   IF        T3VFYB = '1'                                 Verif. Art. "B"     
C1636c                             and ( (    (P7AUTS = '1' or P7AUTS = '2')    Autoservicio        
C1636c                                     and T3OPL1 = *blanks                 Mixto               
C1636c                                    )                                                         
C1636c                                   or P7AUTS < '1'                        No Autoserv.        
C1636c                                 )                                                            
C1636C                   EXSR      CS_VFYARTB                                   Check Stock.        
C1636C                   ENDIF                                                                      
C1636C                   IF        T2VA14 = 1                                                       
C1636C                   GOTO      TFINAL                                                           
C1636C                   ENDIF                                                                      
                                                                                                    
      * Comprobar Stock en Trace                                                                    
FQ726C                   IF        T3STCK = '1'                                                     
     C                   EXSR      CS_STCKTRA                                                       
FQ726C                   ENDIF                                                                      
b04  C                   IF        T2VA07 = 1                                                       
     C                   GOTO      TFINAL                                                           
e04  C                   ENDIF                                                                      
                                                                                                    
     C     TFINAL        TAG                                                                        
      * Grabo fichero de Trabajo                                                                    
b04  C                   IF        T2VA00=0 And T2VA01=0 And T2VA02=0 And                           
     C                             T2VA03=0 And T2VA04=0 And T2VA05=0 And                           
FQ618C                             T2VA06=0 And T2VA07=0 And T2VA08=0 And                           
FQ726C                             T2VA11=0 And T2VA12=0 And T2VA13=0                               
FQ942C                             AND T2CJTO=0                                                     
C1636C                             And T2VA14=0                                                     
     C                   EVAL      T2ENTD = 1                                                       
     C                   EVAL      ZXPEDD = 1                                                       
FQ726 * Calculo Importe línea pedido, si no es solo Forzadas                                        
C2510C*FQ726 ***         IF        T3EDFO <> '1'                                                    
C2510c*C1579 ***                   And zxpweb<>'1'                                                  
C2510C                   IF        zxpweb<>'1'                                                      
     C                   EXSR      CS_IMPORTE                                                       
     C                   EVAL      ZXIMPO = ZXIMPO + ZXBIMP                                         
FQ726C                   ENDIF                                                                      
x04  C                   ELSE                                                                       
     C                   EVAL      T2ENTD = 0                                                       
     C                   EVAL      ZXPEDT = 1                                                       
e04  C                   ENDIF                                                                      
CR554c     TWRITE        TAG                                                                        
     C                   WRITE     RED0050W                                                         
      *                                                                                             
e03  C                   ENDIF                                                                      
     C     KCODEPE       READE     CODEPE                                                           
e02  C                   ENDDO                                                                      
                                                                                                    
FQ726 * Comprobar Importe líneas Pedido ED, si no es solo Forzadas                                  
C2510C*FQ726 ***         IF        T3EDFO <> '1'                                                    
C2510c*C1579 ***                   And zxpweb<>'1'                                                  
C2510C                   IF        zxpweb<>'1'                                                      
b02  C                   IF        ZXFORZ = 1 And T3NIMF <> '1'                                     
     C                             Or ZXFORZ = 0                                                    
b03  C                   IF        ZXPEDD = 1                                                       
CR533c                             and (s0tped <> 'SC' or t3fdsc <> '1')                            
     C                   EXSR      CS_IMPLINE                                                       
e03  C                   ENDIF                                                                      
e02  C                   ENDIF                                                                      
FQ726C                   ENDIF                                                                      
                                                                                                    
      * Comprobar Pedido Completo                                                                   
     C                   EXSR      CS_PEDTOTA                                                       
                                                                                                    
      * Actualizar Marca ED en CODEPE TPE4='2'                                                      
     C                   EXSR      CS_MARCAED                                                       
                                                                                                    
FQ726 * Comprobar Puntos de Expedición, si no es solo Forzadas                                      
FQ726C                   IF        T3EDFO <> '1'                                                    
C1579c                             And zxpweb<>'1'                                                  
     C                   EXSR      CS_BUSPEXP                                                       
FQ726C                   ENDIF                                                                      
                                                                                                    
e01  C                   ENDIF                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Comprobar Parámetro Proveedor                                                               
      **********************************************************************                        
     C     CS_PROVEED    BEGSR                                                                      
                                                                                                    
     C                   EVAL      M5CIAS=S5CIAS                                                    
     C                   MOVEL     @PCIAS        PPCIAS                                             
                                                                                                    
      * Miramos si es Conjunto de Venta                                                             
     C                   EVAL      FileCojc_erp= 'PURLIBF' + PPCIAS +                               
     C                                          '/MSCOJC'                                           
     C                   OPEN (E)  MSCOJC                                                           
b01  C                   IF        Not %ERROR                                                       
     C                   EVAL      ZXTCOJ=' '                                                       
     C                   EVAL      NDCIAS=S5CIAS                                                    
     C                   EVAL      NDARTI=S5ARTI                                                    
     C                   EVAL      NDMODE=S5MODE                                                    
     C                   EVAL      NDVARI=S5VARI                                                    
     C                   EVAL      NDTCOJ='4'                                                       
     C     KMSCOJC       CHAIN     MSCOJC                                                           
b02  C                   IF        %FOUND(MSCOJC) AND NDBAJA<'1'                                    
      * Miramos si es Conjunto de Compra                                                            
     C                   EVAL      NDTCOJ='1'                                                       
     C     KMSCOJC       CHAIN     MSCOJC                                                           
b03  C                   IF        %FOUND(MSCOJC) AND NDBAJA<'1'                                    
      * Si es Conjunto de Ventas y de Compra No lo trataremos como Cjto                             
     C                   EVAL      ZXTCOJ=' '                                                       
x03  C                   ELSE                                                                       
      * Si es Conjunto de Ventas y No de Compra Si lo tratamos                                      
     C                   EVAL      ZXTCOJ='4'                                                       
e03  C                   ENDIF                                                                      
x02  C                   ELSE                                                                       
      * Si No es Conjunto de Venta , Pues no es Conjunto y punto                                    
     C                   EVAL      ZXTCOJ=' '                                                       
e02  C                   ENDIF                                                                      
     C                   CLOSE(E)  MSCOJC                                                           
      * Es Conjunto                                                                                 
b02  C                   IF        ZXTCOJ='4'                                                       
     C                   EVAL      FileCojd_erp= 'PURLIBF' + PPCIAS +                               
     C                                          '/MSCOJD'                                           
     C                   OPEN (E)  MSCOJD                                                           
b03  C                   IF        Not %ERROR                                                       
     C                   EVAL      NDCIAS=S5CIAS                                                    
     C                   EVAL      NDARTI=S5ARTI                                                    
     C                   EVAL      NDMODE=S5MODE                                                    
     C                   EVAL      NDVARI=S5VARI                                                    
     C                   EVAL      NDTCOJ = ZXTCOJ                                                  
     C     KMSCOJC       SETLL     MSCOJD                                                           
     C     KMSCOJC       READE     MSCOJD                                                           
d04  C                   DOW       NOT %EOF(MSCOJD)                                                 
b05  C                   IF        NDBAJA <> '1'                                                    
     C                   EVAL      M5ARTI=NDCOMP                                                    
     C                   EVAL      M5VARI=NDVAR2                                                    
     C                   EVAL      M5MODE=NDMOD2                                                    
     C     KMSARTI00     CHAIN     MSARTI00                                                         
      * Valido Proveedor                                                                            
FDX01 * Siempre que el componente no sea artículo propio                                            
FDX01C                   IF        M5SIOL<>'2'                                                      
     C                   EXSR      CS_PROVEE2                                                       
b06  C                   IF        T2VA02 = 1                                                       
     C                   LEAVE                                                                      
e06  C                   ENDIF                                                                      
FDX01C                   ENDIF                                                                      
e05  C                   ENDIF                                                                      
     C     KMSCOJC       READE     MSCOJD                                                           
e04  C                   ENDDO                                                                      
e03  C                   ENDIF                                                                      
     C                   CLOSE(E)  MSCOJD                                                           
x02  C                   ELSE                                                                       
      * NO Es Conjunto                                                                              
     C                   EVAL      M5ARTI=S5ARTI                                                    
     C                   EVAL      M5VARI=S5VARI                                                    
     C                   EVAL      M5MODE=S5MODE                                                    
     C     KMSARTI00     CHAIN     MSARTI00                                                         
      * Valido Proveedor                                                                            
     C                   EXSR      CS_PROVEE2                                                       
e02  C                   ENDIF                                                                      
                                                                                                    
e01  C                   ENDIF                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Comprobar Parámetro Cliente                                                                 
      **********************************************************************                        
     C     CS_CLIENT     BEGSR                                                                      
                                                                                                    
     C                   EVAL      C_S0CIAS=S5CIAS                                                  
     C                   EVAL      C_S0CUST=S5CUST                                                  
     C     KCOCLIN       CHAIN     COCLIN                                                           
b01  C                   IF        %FOUND(COCLIN) And                                               
     C                             (C_S0CEVT = ' ' Or C_S0CEVT = '0')                               
     C                   EVAL      T2VA00 = 1                                                       
e01  C                   ENDIF                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Comprobar Parámetro Proveedor                                                               
      **********************************************************************                        
     C     CS_PROVEE2    BEGSR                                                                      
                                                                                                    
IT228c                   EVAL      ZXPRV = *blanks                                                  
IT228c                   EVAL      @PRESP= *blanks                                                  
IT228C                   if        (%lookup(S5LOGE:T_logol)>0)                                      
IT228C                   EVAL      M0CIAS=S5CIAS                                                    
IT228C                   EVAL      M0LOGE=S5LOGE                                                    
IT228C     KMSALMA05     CHAIN     MSALMA05                                                         
IT228C                   IF        %FOUND AND M0BAJA<>'1'                                           
IT228C                   EVAL      @PRESP=M0MAGA                                                    
IT228C                   exsr      SRrecu                                                           
IT228C                   ENDIF                                                                      
IT228C                   ELSE                                                                       
IT228C                   EXSR      LOG_VIRTUAL                                                      
IT228C                   exsr      SRrecu                                                           
IT228C                   ENDIF                                                                      
     C                   EVAL      C0CIAS=S5CIAS                                                    
IT228C                   if        ZXPRV = *blanks                                                  
     C                   EVAL      C0PRVR=M5PRVR                                                    
IT228C                   ELSE                                                                       
IT228C                   EVAL      C0PRVR=ZXPRV                                                     
IT228C                   ENDIF                                                                      
     C     KPUPROV       CHAIN     PUPROV                                                           
b01  C                   IF        %FOUND(PUPROV) And                                               
     C                             (C0PEVT = ' ' Or C0PEVT = '0')                                   
FQ666 * Comprobar que el artículo no sea independiente del proveedor                                
FQ666 * M5NOED='2'                                                                                  
FQ666C                   EVAL      M5CIAS=S5CIAS                                                    
FQ666C                   EVAL      M5ARTI=S5ARTI                                                    
FQ666C                   EVAL      M5VARI=S5VARI                                                    
FQ666C                   EVAL      M5MODE=S5MODE                                                    
FQ666C     KMSARTI00     CHAIN     MSARTI00                                                         
FQ666C                   IF        %FOUND(MSARTI00) and M5NOED<>'2'                                 
     C                   EVAL      T2VA02 = 1                                                       
FQ666C                   ENDIF                                                                      
x01  C                   ELSE                                                                       
                                                                                                    
      * Comprobar si el Proveedor es externo                                                        
     C                   EVAL      Q1CIAS=C0CIAS                                                    
     C                   EVAL      Q1PRVR=C0PRVR                                                    
     C     KGXEQPR       CHAIN     GXEQPR                                                           
     C                   IF        %FOUND(GXEQPR) And Q1PGRP = '1'                                  
     C                   EVAL      T2VA01 = 0                                                       
     C                   ELSE                                                                       
     C                   EVAL      T2VA01 = 1                                                       
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Comprobar Parámetro Artículo                                                                
      **********************************************************************                        
     C     CS_ARTICUL    BEGSR                                                                      
                                                                                                    
     C                   EVAL      M5CIAS=S5CIAS                                                    
     C                   EVAL      M5ARTI=S5ARTI                                                    
     C                   EVAL      M5VARI=S5VARI                                                    
     C                   EVAL      M5MODE=S5MODE                                                    
     C     KMSARTI00     CHAIN     MSARTI00                                                         
b01  C                   IF        %FOUND(MSARTI00) And M5NOED = '1'                                
     C                   EVAL      T2VA03 = 1                                                       
e01  C                   ENDIF                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Comprobar Parámetro Transportista                                                           
      **********************************************************************                        
     C     CS_TRANSPO    BEGSR                                                                      
                                                                                                    
     C                   EVAL      N1CIAS = S0CIAS                                                  
     C                   EVAL      N1TTTA = S0TTTA                                                  
     C     KMSTRTA       CHAIN     MSTRTA                                                           
b01  C                   IF        %FOUND(MSTRTA) And N1NOED ='1'                                   
     C                   EVAL      T2VA04 = 1                                                       
e01  C                   ENDIF                                                                      
M1078C                   IF        %FOUND(MSTRTA) And N1NOED ='2'                                   
M1078C                   EVAL      T2VA04 = 1                                                       
M1078C                   ENDIF                                                                      
                                                                                                    
     C                   ENDSR                                                                      
FQ618 **********************************************************************                        
FQ618 * Comprobar Paràmetre Forma de Pagament                                                       
FQ618 **********************************************************************                        
FQ618C     CS_FORPAGO    BEGSR                                                                      
FQ618                                                                                               
FQ618C                   EVAL      PECIAS = S0CIAS                                                  
FQ618C                   EVAL      PECTAB = 'FPAG'                                                  
FQ618C                   EVAL      PECLTA = *BLANKS                                                 
FQ618C                   EVAL      PECLTA = S0FPAG                                                  
FQ618C     KPMTABD       CHAIN     PMTABD                                                           
FQ618C                   IF        %FOUND(PMTABD)                                                   
FQ618C                   EVAL      ZXBL64 = PEBL64                                                  
FQ618C                   ELSE                                                                       
FQ618C                   EVAL      ZXBL64 = *BLANKS                                                 
FQ618C                   ENDIF                                                                      
FQ618C                   IF        ZXNOED ='1'                                                      
FQ618C                   EVAL      T2VA11 = 1                                                       
FQ618C                   ENDIF                                                                      
FQ842C                                                                                              
FQ842C                   IF        T2VA11=1                                                         
FQ842C                   EVAL      RXCIAS=S0CIAS                                                    
FQ842C                   EVAL      RXDLGA=S0DLGA                                                    
FQ842C                   EVAL      RXNPCO=S0NPCO                                                    
FQ842C                   EVAL      RXTPED=S0TPED                                                    
FQ842C                   EVAL      RXDATP=S0DATP                                                    
FQ842C                   EVAL      RXNOPL=S0NOPL                                                    
FQ842C     KCOCAIP       CHAIN     COCAIP                                                           
FQ842C                   IF        %FOUND                                                           
FQ842C                   EVAL      T2VA11=0                                                         
FQ842C                   ENDIF                                                                      
FQ842C                   ENDIF                                                                      
FQ618                                                                                               
FQ618C                   ENDSR                                                                      
FQ726 **********************************************************************                        
FQ726 * Comprobar logísticas                                                                        
FQ726 **********************************************************************                        
FQ726C     CS_LOGISTI    BEGSR                                                                      
FQ726                                                                                               
FQ726 * De momento la linea será ED hasta que diga lo contrario                                     
FQ726C                   EVAL      T2VA13 = 0                                                       
FQ726                                                                                               
FQ726 * Miro la logística de la linea del pedido                                                    
FQ726C                   EVAL      MICIAS=S5CIAS                                                    
FQ726C                   EVAL      MIDLGA=S5DLGA                                                    
FQ726C                   EVAL      MILGCA=S5LOGE                                                    
FQ726C     KMSLOAD       CHAIN     MSLOGI                                                           
FQ726 * Si no tiene el parámetro de Entregas Directas No puede ser ED                               
FQ726C                   IF        %FOUND(MSLOGI) And MIMI01<>'1'                                   
FQ726C                             Or Not %FOUND(MSLOGI)                                            
FQ726C                   EVAL      T2VA13 = 1                                                       
FQ726C                   ENDIF                                                                      
FQ726                                                                                               
FQ726C                   ENDSR                                                                      
      **********************************************************************                        
      * Comprobar si el artículo es Obsoleto                                                        
      **********************************************************************                        
     C     CS_ARTOBSO    BEGSR                                                                      
                                                                                                    
     C                   EVAL      M5CIAS=S5CIAS                                                    
     C                   EVAL      M5ARTI=S5ARTI                                                    
     C                   EVAL      M5VARI=S5VARI                                                    
     C                   EVAL      M5MODE=S5MODE                                                    
     C     KMSARTI00     CHAIN     MSARTI00                                                         
b01  C                   IF        %FOUND(MSARTI00) And M5PROB = 'OB'                               
     C                   EVAL      ZXARTIX = M5ARTI                                                 
     C                   EVAL      ZXVARIX = M5VARI                                                 
     C                   EVAL      ZXMODEX = M5MODE                                                 
     C                   EVAL      Z1CANT = S5CANT - S5CANR - S5CANS                                
     C                   EVAL      ZXVSTK = 1                                                       
     C                   EXSR      CS_STCKPRO                                                       
b02  C                   IF        ZXSTPR = 0                                                       
     C                   EVAL      ZXLG05 = 0                                                       
     C                   EVAL      ZXVSTK = 1                                                       
     C                   EXSR      CS_STCKDEL                                                       
b03  C                   IF        ZXSTDL = 1                                                       
     C                   EVAL      T2VA05 = 1                                                       
FQ726C                   EVAL      T2LOGU = P7LOGS                                                  
     C                   EVAL      S5LOGE = P7LOGS                                                  
CR554c                   exsr      CS_set_s5lb2b                                                    
     C                   UPDATE    RCODEPE                                                          
e03  C                   ENDIF                                                                      
x02  C                   ELSE                                                                       
     C                   EVAL      T2VA05 = 1                                                       
e02  C                   ENDIF                                                                      
e01  C                   ENDIF                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Comprobar sobreestock del artículo                                                          
      **********************************************************************                        
     C     CS_SOBRSTK    BEGSR                                                                      
                                                                                                    
     C                   EVAL      ZXCANT = 1                                                       
     C                   EVAL      M5CIAS=S5CIAS                                                    
     C                   MOVEL     @PCIAS        PPCIAS                                             
                                                                                                    
      * Miramos si es Conjunto de Venta                                                             
     C                   EVAL      FileCojc_erp= 'PURLIBF' + PPCIAS +                               
     C                                          '/MSCOJC'                                           
     C                   OPEN (E)  MSCOJC                                                           
b01  C                   IF        Not %ERROR                                                       
     C                   EVAL      ZXTCOJ=' '                                                       
     C                   EVAL      NDCIAS=S5CIAS                                                    
     C                   EVAL      NDARTI=S5ARTI                                                    
     C                   EVAL      NDMODE=S5MODE                                                    
     C                   EVAL      NDVARI=S5VARI                                                    
     C                   EVAL      NDTCOJ='4'                                                       
     C     KMSCOJC       CHAIN     MSCOJC                                                           
b02  C                   IF        %FOUND(MSCOJC) AND NDBAJA<'1'                                    
      * Miramos si es Conjunto de Compra                                                            
     C                   EVAL      NDTCOJ='1'                                                       
     C     KMSCOJC       CHAIN     MSCOJC                                                           
b03  C                   IF        %FOUND(MSCOJC) AND NDBAJA<'1'                                    
      * Si es Conjunto de Ventas y de Compra No lo trataremos como Cjto                             
     C                   EVAL      ZXTCOJ=' '                                                       
x03  C                   ELSE                                                                       
      * Si es Conjunto de Ventas y No de Compra Si lo tratamos                                      
     C                   EVAL      ZXTCOJ='4'                                                       
e03  C                   ENDIF                                                                      
x02  C                   ELSE                                                                       
      * Si No es Conjunto de Venta , Pues no es Conjunto y punto                                    
     C                   EVAL      ZXTCOJ=' '                                                       
e02  C                   ENDIF                                                                      
     C                   CLOSE(E)  MSCOJC                                                           
      * Es Conjunto                                                                                 
b02  C                   IF        ZXTCOJ='4'                                                       
     C                   EVAL      FileCojd_erp= 'PURLIBF' + PPCIAS +                               
     C                                          '/MSCOJD'                                           
     C                   OPEN (E)  MSCOJD                                                           
b03  C                   IF        Not %ERROR                                                       
     C                   EVAL      NDCIAS=S5CIAS                                                    
     C                   EVAL      NDARTI=S5ARTI                                                    
     C                   EVAL      NDMODE=S5MODE                                                    
     C                   EVAL      NDVARI=S5VARI                                                    
     C                   EVAL      NDTCOJ = ZXTCOJ                                                  
     C     KMSCOJC       SETLL     MSCOJD                                                           
     C     KMSCOJC       READE     MSCOJD                                                           
d04  C                   DOW       NOT %EOF(MSCOJD)                                                 
b05  C                   IF        NDBAJA <> '1'                                                    
     C                   EVAL      M5ARTI=NDCOMP                                                    
     C                   EVAL      M5VARI=NDVAR2                                                    
     C                   EVAL      M5MODE=NDMOD2                                                    
     C     KMSARTI00     CHAIN     MSARTI00                                                         
      * Valido Sobrestock                                                                           
     C                   EVAL      ZXCANT = NDCANT                                                  
     C                   EXSR      CS_SOBRST2                                                       
b06  C                   IF        T2VA06 = 1                                                       
     C                   LEAVE                                                                      
e06  C                   ENDIF                                                                      
e05  C                   ENDIF                                                                      
     C     KMSCOJC       READE     MSCOJD                                                           
e04  C                   ENDDO                                                                      
e03  C                   ENDIF                                                                      
     C                   CLOSE(E)  MSCOJD                                                           
x02  C                   ELSE                                                                       
      * NO Es Conjunto                                                                              
     C                   EVAL      M5ARTI=S5ARTI                                                    
     C                   EVAL      M5VARI=S5VARI                                                    
     C                   EVAL      M5MODE=S5MODE                                                    
     C     KMSARTI00     CHAIN     MSARTI00                                                         
      * Valido Sobrestock                                                                           
     C                   EXSR      CS_SOBRST2                                                       
e02  C                   ENDIF                                                                      
                                                                                                    
e01  C                   ENDIF                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Comprobar sobreestock del artículo                                                          
      **********************************************************************                        
     C     CS_SOBRST2    BEGSR                                                                      
                                                                                                    
02110C**                 EVAL      M5CIAS=S5CIAS                                                    
02110C**                 EVAL      M5ARTI=S5ARTI                                                    
02110C**                 EVAL      M5VARI=S5VARI                                                    
02110C**                 EVAL      M5MODE=S5MODE                                                    
02110C**   KMSARTI00     CHAIN     MSARTI00                                                         
02110C**                 IF        %FOUND(MSARTI00)                                                 
     C                   EVAL      ZXARTIX = M5ARTI                                                 
     C                   EVAL      ZXVARIX = M5VARI                                                 
     C                   EVAL      ZXMODEX = M5MODE                                                 
     C                   EVAL      Z1CANT = S5CANT - S5CANR - S5CANS                                
FQ726C                   SELECT                                                                     
FQ726C                   WHEN      T3SSTO = '1'                                                     
     C                   EVAL      ZXVSTK = 0                                                       
FQ726C                   WHEN      T3SSTO = '2'                                                     
FQ726C                   EVAL      ZXVSTK = 1                                                       
FQ726C                   ENDSL                                                                      
     C                   EXSR      CS_STCKPRO                                                       
b02  C                   IF        ZXSTPR = 0                                                       
     C                   EVAL      ZXLG05 = 0                                                       
     C                   EVAL      ZXVSTK = 0                                                       
     C                   EXSR      CS_STCKDEL                                                       
b03  C                   IF        ZXSTDL = 1                                                       
     C                   EVAL      T2VA06 = 1                                                       
FQ726C                   EVAL      T2LOGU = P7LOGS                                                  
     C                   EVAL      S5LOGE = P7LOGS                                                  
CR554c                   exsr      CS_set_s5lb2b                                                    
     C                   UPDATE    RCODEPE                                                          
e03  C                   ENDIF                                                                      
x02  C                   ELSE                                                                       
     C                   EVAL      T2VA06 = 1                                                       
e02  C                   ENDIF                                                                      
02110C**                 ENDIF                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **********************************************************************                        
      *  Busqueda cantidades de stock pdte servir,fabricar,deposito...                              
      **********************************************************************                        
     C     CS_CANSTOK    BEGSR                                                                      
                                                                                                    
     C                   EVAL      @PEDATD=*DATE                                                    
     C                   EVAL      @PEDATH=*DATE                                                    
     C                   MOVE      @PEDATD       ZXDATD                                             
     C                   MOVE      @PEDATH       ZXDATH                                             
     C                   SUBDUR    1000  :*D     ZXDATD                                             
     C                   ADDDUR    1000  :*D     ZXDATH                                             
     C                   MOVE      ZXDATD        @PEDATD                                            
     C                   MOVE      ZXDATH        @PEDATH                                            
                                                                                                    
     C                   EVAL      @PECIAS=M1CIAS                                                   
     C                   EVAL      @PEARTI=M1ARTI                                                   
     C                   EVAL      @PEVARI=M1VARI                                                   
     C                   EVAL      @PEMODE=M1MODE                                                   
                                                                                                    
     C                   EVAL      M5CIAS=M1CIAS                                                    
     C                   EVAL      M5ARTI=M1ARTI                                                    
     C                   EVAL      M5VARI=M1VARI                                                    
     C                   EVAL      M5MODE=M1MODE                                                    
     C     KMSARTI00     CHAIN     MSARTI00                           81                            
                                                                                                    
      * Pendiente de servir                                                                         
     C                   EVAL      @PETISE=' '                                                      
     C                   CALL      'MM2600'                                                         
     C                   PARM                    @PECIAS                                            
     C                   PARM      ZZDLGA        @PEDLGA                                            
     C                   PARM                    @PEARTI                                            
     C                   PARM                    @PEVARI                                            
     C                   PARM                    @PEMODE                                            
     C                   PARM                    @PETCOJ                                            
     C                   PARM                    @PEDATD                                            
     C                   PARM                    @PEDATH                                            
     C                   PARM                    @PECUST                                            
     C                   PARM      0             @PECANT                                            
     C                   PARM      0             @PECAN1                                            
     C                   PARM                    M1MAGA                                             
     C                   PARM                    @PETISE           4                                
     C                   PARM      '1'           @PERRO            1                                
     C                   EVAL      ZXCANS0 = @PECANT * ZXCANT                                       
                                                                                                    
      * Pendiente de traspasos depositos                                                            
     C                   EVAL      @PETISE=' '                                                      
     C                   CALL      'MM2604'                                                         
     C                   PARM                    @PECIAS                                            
     C                   PARM      ZZDLGA        @PEDLGA                                            
     C                   PARM                    @PEARTI                                            
     C                   PARM                    @PEVARI                                            
     C                   PARM                    @PEMODE                                            
     C                   PARM                    @PETCOJ                                            
     C                   PARM                    @PEDATD                                            
     C                   PARM                    @PEDATH                                            
     C                   PARM      0             @PECANT                                            
     C                   PARM      0             @PECAN1                                            
     C                   PARM                    M1MAGA                                             
     C                   PARM                    @PETISE           4                                
     C                   PARM      *BLANKS       @PERRO            1                                
     C                   EVAL      ZXDEPO0 = @PECANT * ZXCANT                                       
                                                                                                    
      * Esto solo para empresas que utilizan nuestra produccion                                     
     C                   EVAL      @PECAN1=0                                                        
     C                   EVAL      @PECAN2=0                                                        
b01  C                   IF        ZZTCIA='1' OR ZZTCIA='2'                                         
     C                   EVAL      @PEDATD=*DATE                                                    
     C                   EVAL      @PEDATH=*DATE                                                    
     C                   MOVE      @PEDATD       ZXDATD                                             
     C                   MOVE      @PEDATH       ZXDATH                                             
     C                   SUBDUR    1000  :*D     ZXDATD                                             
     C                   ADDDUR    1000  :*D     ZXDATH                                             
     C                   MOVE      ZXDATD        @PEDATD                                            
     C                   MOVE      ZXDATH        @PEDATH                                            
      * Solo realizaré la búsqued en artículos susceptibles de ser utilizados en                    
      * es decir, que sean estructuras o componentes.                                               
     C     KMSARTI00     CHAIN     PMCAOR01                           81                            
b02  C                   IF        CHAIN=*ON                                                        
     C     KMSARTI00     CHAIN     PMCAOR08                           81                            
e02  C                   ENDIF                                                                      
                                                                                                    
      * Búsqueda de las necesidades a tener en cuenta en OF's                                       
     C                   EVAL      @PECAN1=0                                                        
     C                   EVAL      @PECAN2=0                                                        
     C     KMSARTI00     CHAIN     PMDEOR05                           81                            
b02  C                   IF        CHAIN=*OFF                                                       
      * Si MÑSNCC>='1', entonces (DOLL) se desea que se presente el                                 
      * material asignado                                                                           
     C                   EVAL      @PERRO=*BLANKS                                                   
b03  C**                 IF        MÑSNCC>='1'                                                      
     C**                 EVAL      @PERRO='A'                                                       
e03  C**                 ENDIF                                                                      
                                                                                                    
     C                   CALL      'MM2602'                                                         
     C                   PARM                    @PECIAS                                            
     C                   PARM                    @PEARTI                                            
     C                   PARM                    @PEVARI                                            
     C                   PARM                    @PEMODE                                            
     C                   PARM                    @PEDATD                                            
     C                   PARM                    @PEDATH                                            
     C                   PARM      0             @PECAN1                                            
     C                   PARM      0             @PECAN2                                            
     C                   PARM                    M1MAGA                                             
     C                   PARM                    M5MAGD                                             
     C                   PARM                    @PERRO                                             
e02  C                   ENDIF                                                                      
e01  C                   ENDIF                                                                      
     C                   EVAL      ZXCANE0 = @PECAN2 * ZXCANT                                       
                                                                                                    
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Comprobar Stock en Trace                                                                    
      **********************************************************************                        
     C     CS_STCKTRA    BEGSR                                                                      
                                                                                                    
     C                   MOVEL     @PCIAS        PPCIAS                                             
     C                   EVAL      Z0CANT = S5CANT - S5CANR - S5CANS                                
     C                   EVAL      Z1CANT = S5CANT - S5CANR - S5CANS                                
     C                   EVAL      ZXARTDLGA = S5ARTI                                               
     C                   EVAL      ZXVARDLGA = S5VARI                                               
     C                   EVAL      ZXMODDLGA = S5MODE                                               
      * Si es artículo propio directamente Trace sin pasar por Productiva                           
     C                   EVAL      M5CIAS = S5CIAS                                                  
     C                   EVAL      M5ARTI = S5ARTI                                                  
     C                   EVAL      M5VARI = S5VARI                                                  
     C                   EVAL      M5MODE = S5MODE                                                  
     C     KMSARTI00     CHAIN     MSARTI00                                                         
b01  C                   IF        M5SIOL = '2'                                                     
     C                   EVAL      ZXARTTRAC = M5ARTI                                               
     C                   EVAL      ZXVARTRAC = M5VARI                                               
     C                   EVAL      ZXMODTRAC = M5MODE                                               
     C                   EVAL      Z2CANT = Z1CANT                                                  
     C                   EXSR      CS_STCK909                                                       
13070                                                                                               
13070 * si no hay stock en Trace busco en Delegaciones.                                             
13070C                   IF        T2VA07 = 1                                                       
13070C                   EVAL      ZXARTIX = S5ARTI                                                 
13070C                   EVAL      ZXVARIX = S5VARI                                                 
13070C                   EVAL      ZXMODEX = S5MODE                                                 
13070 * Delegación Propia                                                                           
02110C                   EVAL      ZXVSTK = 1                                                       
13070C                   EXSR      CS_STCKPRO                                                       
13070C                   IF        ZXSTPR = 1                                                       
13070C                   EVAL      T2VA07 = 1                                                       
13070C                   ELSE                                                                       
13070 * Delegaciones cercanas                                                                       
13070C                   EVAL      ZXLG05 = 1                                                       
13070C                   EVAL      ZXVSTK = 1                                                       
13070C                   EXSR      CS_STCKDEL                                                       
13070C                   IF        ZXSTDL = 1                                                       
13070C                   EVAL      T2VA07 = 1                                                       
13070C                   ENDIF                                                                      
13070C                   ENDIF                                                                      
13070C                   ENDIF                                                                      
13070                                                                                               
                                                                                                    
x01  C                   ELSE                                                                       
     C                   MOVEA     *BLANKS       SARVMCJT                                           
     C                   MOVEA     *BLANKS       SARPRCJT                                           
     C                   MOVEA     *BLANKS       SPRVRCJT                                           
     C                   MOVEA     *ZEROS        SCANTCJT                                           
      * Miramos si es Conjunto de Venta                                                             
     C                   EVAL      FileCojc_erp= 'PURLIBF' + PPCIAS +                               
     C                                          '/MSCOJC'                                           
     C                   OPEN (E)  MSCOJC                                                           
b02  C                   IF        Not %ERROR                                                       
     C                   EVAL      ZXTCOJ=' '                                                       
     C                   EVAL      NDCIAS=S5CIAS                                                    
     C                   EVAL      NDARTI=S5ARTI                                                    
     C                   EVAL      NDMODE=S5MODE                                                    
     C                   EVAL      NDVARI=S5VARI                                                    
     C                   EVAL      NDTCOJ='4'                                                       
     C     KMSCOJC       CHAIN     MSCOJC                                                           
b03  C                   IF        %FOUND(MSCOJC) AND NDBAJA<'1'                                    
      * Miramos si es Conjunto de Compra                                                            
     C                   EVAL      NDTCOJ='1'                                                       
     C     KMSCOJC       CHAIN     MSCOJC                                                           
b04  C                   IF        %FOUND(MSCOJC) AND NDBAJA<'1'                                    
      * Si es Conjunto de Ventas y de Compra No lo trataremos como Cjto                             
     C                   EVAL      ZXTCOJ=' '                                                       
x04  C                   ELSE                                                                       
      * Si es Conjunto de Ventas y No de Compra Si lo tratamos                                      
     C                   EVAL      ZXTCOJ='4'                                                       
e04  C                   ENDIF                                                                      
x03  C                   ELSE                                                                       
      * Si No es Conjunto de Venta , Pues no es Conjunto y punto                                    
     C                   EVAL      ZXTCOJ=' '                                                       
e03  C                   ENDIF                                                                      
     C                   CLOSE(E)  MSCOJC                                                           
      * Es Conjunto en Comercial                                                                    
b03  C                   IF        ZXTCOJ='4'                                                       
     C                   EVAL      FileCojd_erp= 'PURLIBF' + PPCIAS +                               
     C                                          '/MSCOJD'                                           
     C                   OPEN (E)  MSCOJD                                                           
b04  C                   IF        Not %ERROR                                                       
     C                   EVAL      NDCIAS=S5CIAS                                                    
     C                   EVAL      NDARTI=S5ARTI                                                    
     C                   EVAL      NDMODE=S5MODE                                                    
     C                   EVAL      NDVARI=S5VARI                                                    
     C                   EVAL      NDTCOJ = ZXTCOJ                                                  
     C     KMSCOJC       SETLL     MSCOJD                                                           
     C     KMSCOJC       READE     MSCOJD                                                           
d05  C                   DOW       NOT %EOF(MSCOJD)                                                 
b06  C                   IF        NDBAJA <> '1'                                                    
     C                   EVAL      M5ARTI=NDCOMP                                                    
     C                   EVAL      M5VARI=NDVAR2                                                    
     C                   EVAL      M5MODE=NDMOD2                                                    
     C     KMSARTI00     CHAIN     MSARTI00                                                         
b07  C                   IF        %FOUND(MSARTI00)                                                 
     C                   EVAL      ZXARTIX=M5ARTI                                                   
     C                   EVAL      ZXVARIX=M5VARI                                                   
     C                   EVAL      ZXMODEX=M5MODE                                                   
     C                   EVAL      ZKARVM=ZXARVMX                                                   
     C                   EXSR      CS_ARTEXIS                                                       
     C                   EVAL      ZXARVM=ZXARVMPRO                                                 
     C                   EVAL      ZXPRVR=M5PRVR                                                    
     C                   EVAL      Z1CANT = Z0CANT * NDCANT                                         
      * Guardo el Componente en la serie para tratarlo después                                      
      *   y asi poder cerrar el fichero MSCOJD usado tambíen después                                
     C                   EVAL      ZW=1                                                             
     C     *BLANKS       LOOKUP    SARVMCJT(ZW)                           81                        
     C                   MOVEL     ZKARVM        SARVMCJT(ZW)                                       
     C                   MOVEL     ZXARVMPRO     SARPRCJT(ZW)                                       
     C                   MOVEL     ZXPRVR        SPRVRCJT(ZW)                                       
     C                   Z-ADD     Z1CANT        SCANTCJT(ZW)                                       
e07  C                   ENDIF                                                                      
e06  C                   ENDIF                                                                      
     C     KMSCOJC       READE     MSCOJD                                                           
e05  C                   ENDDO                                                                      
e04  C                   ENDIF                                                                      
     C                   CLOSE(E)  MSCOJD                                                           
     C                   EXSR      CS_SERCONJ                                                       
x03  C                   ELSE                                                                       
      * NO Es Conjunto en Comercial                                                                 
     C                   EVAL      M5ARTI=S5ARTI                                                    
     C                   EVAL      M5VARI=S5VARI                                                    
     C                   EVAL      M5MODE=S5MODE                                                    
     C     KMSARTI00     CHAIN     MSARTI00                                                         
b04  C                   IF        %FOUND(MSARTI00)                                                 
     C                   EVAL      ZXARTIX=M5ARTI                                                   
     C                   EVAL      ZXVARIX=M5VARI                                                   
     C                   EVAL      ZXMODEX=M5MODE                                                   
     C                   EXSR      CS_ARTEXIS                                                       
     C                   EVAL      ZXARVM=ZXARVMPRO                                                 
     C                   EVAL      ZXPRVR=M5PRVR                                                    
      * Conjunto productiva                                                                         
     C                   EXSR      CS_CONJPRO                                                       
13070                                                                                               
13070 * si no hay stock en Trace busco en Delegaciones.                                             
13070C                   IF        T2VA07 = 1                                                       
13070C                   EVAL      ZXARTIX = S5ARTI                                                 
13070C                   EVAL      ZXVARIX = S5VARI                                                 
13070C                   EVAL      ZXMODEX = S5MODE                                                 
13070 * Delegación Propia                                                                           
02110C                   EVAL      ZXVSTK = 1                                                       
13070C                   EXSR      CS_STCKPRO                                                       
13070C                   IF        ZXSTPR = 1                                                       
13070C                   EVAL      T2VA07 = 1                                                       
13070C                   ELSE                                                                       
13070 * Delegaciones cercanas                                                                       
13070C                   EVAL      ZXLG05 = 1                                                       
13070C                   EVAL      ZXVSTK = 1                                                       
13070C                   EXSR      CS_STCKDEL                                                       
13070C                   IF        ZXSTDL = 1                                                       
13070C                   EVAL      T2VA07 = 1                                                       
13070C                   ENDIF                                                                      
13070C                   ENDIF                                                                      
13070C                   ENDIF                                                                      
13070                                                                                               
e04  C                   ENDIF                                                                      
                                                                                                    
e03  C                   ENDIF                                                                      
e02  C                   ENDIF                                                                      
e01  C                   ENDIF                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Leer Serie Conjunto Comercial Compras                                                       
      **********************************************************************                        
     C     CS_SERCONJ    BEGSR                                                                      
                                                                                                    
     C                   EVAL      ZW=1                                                             
     C     *BLANKS       LOOKUP    SARVMCJT(ZW)                           81                        
                                                                                                    
b01  C                   IF        ZW>1                                                             
     C                   EVAL      ZW=ZW-1                                                          
      * Leo Componentes Conjunto                                                                    
f02  C                   FOR       X=1 to ZW                                                        
     C                   MOVEL     SARVMCJT(X)   ZXARVMX                                            
     C                   MOVEL     SARPRCJT(X)   ZXARVMPRO                                          
     C                   MOVEL     SPRVRCJT(X)   ZXPRVR                                             
     C                   Z-ADD     SCANTCJT(X)   Z1CANT                                             
     C                   EVAL      ZXARTDLGA = ZXARTIX                                              
     C                   EVAL      ZXVARDLGA = ZXVARIX                                              
     C                   EVAL      ZXMODDLGA = ZXMODEX                                              
     C                   EXSR      CS_CONJPRO                                                       
13070C***                IF        T2VA07 = 0                                                       
13070C                   IF        T2VA07 = 1                                                       
     C                   LEAVE                                                                      
e03  C                   ENDIF                                                                      
e02  C                   ENDFOR                                                                     
13070                                                                                               
13070 * si no hay stock en Trace busco en Delegaciones.                                             
13070C                   IF        T2VA07 = 1                                                       
13070C                   FOR       X=1 to ZW                                                        
13070C                   MOVEL     SARVMCJT(X)   ZXARVMX                                            
13070 * Delegación Propia                                                                           
02110C                   EVAL      ZXVSTK = 1                                                       
13070C                   EXSR      CS_STCKPRO                                                       
13070C                   IF        ZXSTPR = 1                                                       
13070C                   EVAL      T2VA07 = 1                                                       
13070C                   ELSE                                                                       
13070 * Delegaciones cercanas                                                                       
13070C                   EVAL      ZXLG05 = 1                                                       
13070C                   EVAL      ZXVSTK = 1                                                       
13070C                   EXSR      CS_STCKDEL                                                       
13070C                   IF        ZXSTDL = 1                                                       
13070C                   EVAL      T2VA07 = 1                                                       
13070C                   ENDIF                                                                      
13070C                   ENDIF                                                                      
13070 * Si no hay stock del componente en Delg Propia ni cercanas                                   
13070 *       No miro mas componentes del Conjunto                                                  
13070C                   IF        ZXSTPR = 0 And ZXSTDL = 0                                        
13070C                   LEAVE                                                                      
13070C                   ENDIF                                                                      
13070C                   ENDFOR                                                                     
13070C                   ENDIF                                                                      
13070                                                                                               
e01  C                   ENDIF                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Comprobar si es Conjunto en Productiva                                                      
      **********************************************************************                        
     C     CS_CONJPRO    BEGSR                                                                      
                                                                                                    
     C                   EVAL      Z2CANT = Z1CANT                                                  
     C                   EVAL      ZXARVMX = ZXARVMPRO                                              
                                                                                                    
      * Busco Empresa Prodcutiva                                                                    
     C                   EVAL      U0CIAS = @PCIAS                                                  
     C                   EVAL      U0TENV = '5'                                                     
     C                   EVAL      U0CLP0 = ZXPRVR                                                  
     C                   EVAL      U0CLP2 = *BLANKS                                                 
     C     KUTCOM0       CHAIN     UTCOM0                                                           
b01  C                   IF        %FOUND(UTCOM0)                                                   
     C                   MOVEL     U0CIA1        ZXCIAD                                             
                                                                                                    
     C                   MOVEL     ZXCIAD        PPCIAS                                             
     C     KPMLIBL       CHAIN     PMLIBL                                                           
      * MOVEX                                                                                       
b02  C                   IF        %FOUND(PMLIBL) And PPMVXV = 'V'                                  
      * Buscar Compañía MOVEX                                                                       
     C                   EXSR      CS_CIASMVX                                                       
     C                   EXSR      CS_MVXLIBL                                                       
      * Busco Planta por defecto en la División                                                     
     C                   Eval      File_cmndiv = LIBLMVX + '/CMNDIV00'                              
     C                   OPEN (E)  CMNDIV00                                                         
b03  C                   IF        Not %ERROR                                                       
     C                   MOVEL     MXCONO        CCCONO                                             
     C                   MOVEL     MXDIVI        CCDIVI                                             
     C     KCMNDIV00     CHAIN     CMNDIV00                                                         
b04  C                   IF        %FOUND(CMNDIV00)                                                 
      * Busco Si es Conjunto                                                                        
     C                   Eval      File_mpdhed = LIBLMVX + '/MPDHED00'                              
     C                   OPEN (E)  MPDHED00                                                         
I0184C                   Eval      File_AQPEDI = LIBLAQA + '/AQPEDI00'                              
I0184C                   OPEN (E)  AQPEDI00                                                         
I0184C                   Eval      File_ZAQITN = LIBLAQA + '/ZAQITN00'                              
I0184C                   OPEN (E)  ZAQITN00                                                         
I0184C                   Eval      File_GMTABD = LIBLAQA + '/GMTABD01'                              
I0184C                   OPEN (E)  GMTABD01                                                         
I0184C                   Eval      File_MITFAC = LIBLMVX + '/MITFAC00'                              
I0184C                   OPEN (E)  MITFAC00                                                         
b05  C                   IF        Not %ERROR                                                       
I0184 *                                                                                             
I0184 *            Ver si estamos en una división Multiplanta                                       
I0184C                   MOVEL(P)  MXCONO        Z1CONO                                             
I0184C                   EVAL      Z1DIVI = MXDIVI                                                  
I0184C     KAQPEDI00     CHAIN     AQPEDI00                                                         
I0184C                   EVAL      ZXMULTIPLA = %FOUND(AQPEDI00)                                    
I0184C                                          AND  Z1L101 = '1'                                   
     C                   MOVEL     MXCONO        H_PHCONO                                           
I0184C**                 MOVEL     CCFACI        H_PHFACI                                           
     C                   MOVEL     ZXARVMPRO     H_PHPRNO                                           
I0184C                   EVAL      H_PHFACI = GET_FACI(MXDIVI:CCFACI:H_PHPRNO)                      
     C                   MOVEL     'KIT'         H_PHSTRT                                           
     C     KMPDHED00     CHAIN     MPDHED00                                                         
b06  C                   IF        %FOUND(MPDHED00) And                                             
     C                             H_PHSTAT >= '20' And H_PHSTAT < '90'                             
      * Si es Conjunto leo los Componentes                                                          
     C                   Eval      File_mpdmat = LIBLMVX + '/MPDMAT00'                              
     C                   OPEN (E)  MPDMAT00                                                         
b07  C                   IF        Not %ERROR                                                       
     C                   MOVEL     MXCONO        PMCONO                                             
I0184C**                 MOVEL     CCFACI        PMFACI                                             
     C                   MOVEL     ZXARVMPRO     PMPRNO                                             
I0184C                   EVAL      PMFACI = GET_FACI(MXDIVI:CCFACI:PMPRNO)                          
     C                   MOVEL     'KIT'         PMSTRT                                             
     C     KMPDMAT00     SETLL     MPDMAT00                                                         
     C     KMPDMAT00     READE     MPDMAT00                                                         
d08  C                   DOW       NOT %EOF(MPDMAT00)                                               
      * Para cada Componente miro si existe stock en Trace                                          
     C                   MOVEL     PMMTNO        ZXARTTRAC                                          
     C                   MOVEL     *BLANKS       ZXVARTRAC                                          
     C                   MOVEL     *BLANKS       ZXMODTRAC                                          
     C                   EVAL      Z2CANT = Z1CANT * PMCNQT                                         
     C                   EXSR      CS_STCK909                                                       
b09  C                   IF        T2VA07 = 1                                                       
     C                   LEAVE                                                                      
e09  C                   ENDIF                                                                      
     C     KMPDMAT00     READE     MPDMAT00                                                         
e08  C                   ENDDO                                                                      
e07  C                   ENDIF                                                                      
     C                   CLOSE(E)  MPDMAT00                                                         
x06  C                   ELSE                                                                       
      * Si No es Conjunto miro si existe stock en Trace                                             
     C                   EVAL      ZXARTTRAC = ZXARTIX                                              
     C                   EVAL      ZXVARTRAC = ZXVARIX                                              
     C                   EVAL      ZXMODTRAC = ZXMODEX                                              
     C                   EXSR      CS_STCK909                                                       
e06  C                   ENDIF                                                                      
e05  C                   ENDIF                                                                      
     C                   CLOSE(E)  MPDHED00                                                         
I0184C                   CLOSE(E)  AQPEDI00                                                         
I0184C                   CLOSE(E)  ZAQITN00                                                         
I0184C                   CLOSE(E)  GMTABD01                                                         
I0184C                   CLOSE(E)  MITFAC00                                                         
e04  C                   ENDIF                                                                      
e03  C                   ENDIF                                                                      
     C                   CLOSE(E)  CMNDIV00                                                         
x02  C                   ELSE                                                                       
      * AS400                                                                                       
      * Busco Si es Conjunto                                                                        
     C                   EVAL      FileCojc_erp= 'PURLIBF' + PPCIAS +                               
     C                                          '/MSCOJC'                                           
     C                   OPEN (E)  MSCOJC                                                           
b03  C                   IF        Not %ERROR                                                       
     C                   EVAL      NDCIAS = ZXCIAD                                                  
     C                   EVAL      NDARTI = ZXARTIX                                                 
     C                   EVAL      NDVARI = ZXVARIX                                                 
     C                   EVAL      NDMODE = ZXMODEX                                                 
     C                   EVAL      NDTCOJ = '4'                                                     
     C     KMSCOJC       CHAIN     MSCOJC                                                           
b04  C                   IF        %FOUND(MSCOJC) AND NDBAJA<'1'                                    
      * Si es Conjunto leo los Componentes                                                          
     C                   EVAL      FileCojd_erp= 'PURLIBF' + PPCIAS +                               
     C                                          '/MSCOJD'                                           
     C                   OPEN (E)  MSCOJD                                                           
b05  C                   IF        Not %ERROR                                                       
     C     KMSCOJC       SETLL     MSCOJD                                                           
     C     KMSCOJC       READE     MSCOJD                                                           
d06  C                   DOW       NOT %EOF(MSCOJD)                                                 
b07  C                   IF        NDBAJA <> '1'                                                    
      * Para cada Componente miro si existe stock en Trace                                          
     C                   EVAL      ZXARTTRAC = NDCOMP                                               
     C                   EVAL      ZXVARTRAC = NDVAR2                                               
     C                   EVAL      ZXMODTRAC = NDMOD2                                               
     C                   EVAL      Z2CANT = Z1CANT * NDCANT                                         
     C                   EXSR      CS_STCK909                                                       
b08  C                   IF        T2VA07 = 1                                                       
     C                   LEAVE                                                                      
e08  C                   ENDIF                                                                      
e07  C                   ENDIF                                                                      
     C     KMSCOJC       READE     MSCOJD                                                           
e06  C                   ENDDO                                                                      
e05  C                   ENDIF                                                                      
     C                   CLOSE(E)  MSCOJD                                                           
     C                   CLOSE(E)  MSCOJC                                                           
                                                                                                    
x04  C                   ELSE                                                                       
     C                   CLOSE(E)  MSCOJC                                                           
      * Si No es Conjunto miro si existe stock en Trace                                             
     C                   EVAL      ZXARTTRAC = ZXARTIX                                              
     C                   EVAL      ZXVARTRAC = ZXVARIX                                              
     C                   EVAL      ZXMODTRAC = ZXMODEX                                              
     C                   EXSR      CS_STCK909                                                       
e04  C                   ENDIF                                                                      
e03  C                   ENDIF                                                                      
e02  C                   ENDIF                                                                      
                                                                                                    
x01  C                   ELSE                                                                       
      * Si No encuentro equivalencia del Proveedor miro directamente Trace                          
     C                   EVAL      ZXARTTRAC = ZXARTIX                                              
     C                   EVAL      ZXVARTRAC = ZXVARIX                                              
     C                   EVAL      ZXMODTRAC = ZXMODEX                                              
     C                   EXSR      CS_STCK909                                                       
e01  C                   ENDIF                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Comprobar si el artículo existe en la productiva                                            
      **********************************************************************                        
     C     CS_ARTEXIS    BEGSR                                                                      
                                                                                                    
     C                   EVAL      ZXARTIX=M5ARTI                                                   
     C                   EVAL      ZXVARIX=M5VARI                                                   
     C                   EVAL      ZXMODEX=M5MODE                                                   
     C                   EVAL      ZXARVM=ZXARVMX                                                   
     C                   EVAL      ZXTCST=M5TCS1                                                    
     C                   EVAL      ZXARVP=*BLANKS                                                   
                                                                                                    
     C                   EVAL      C0CIAS=S5CIAS                                                    
     C                   EVAL      C0PRVR=M5PRVR                                                    
     C     KPUPROV       CHAIN     PUPROV                                                           
b01  C                   IF        %FOUND(PUPROV)                                                   
                                                                                                    
     C                   EVAL      C3CIAS=S5CIAS                                                    
     C                   EVAL      C3PRVR=M5PRVR                                                    
     C                   EVAL      C3ARVM=ZXARVM                                                    
     C     KPUPRP0       CHAIN     PUPRP0                                                           
b02  C                   IF        %FOUND(PUPRP0)                                                   
     C                   EVAL      ZXARVP=C3ARVP                                                    
     C                   EVAL      ZXTCST=C3TCST                                                    
b03  C                   IF        ZXTCST=*BLANKS                                                   
     C                   EVAL      ZXTCST=M5TCS1                                                    
e03  C                   ENDIF                                                                      
e02  C                   ENDIF                                                                      
                                                                                                    
b02  C                   IF        ZXARVP <> *BLANKS                                                
     C                   EVAL      ZXARVMPRO=ZXARVP                                                 
     C                   EXSR      CS_ARTEXI2                                                       
b03  C                   IF        ZXINCI = '005'                                                   
     C                   EVAL      ZXARVMPRO=ZXARVM                                                 
     C                   EXSR      CS_ARTEXI2                                                       
e03  C                   ENDIF                                                                      
x02  C                   ELSE                                                                       
     C                   EVAL      ZXARVMPRO=ZXARVM                                                 
     C                   EXSR      CS_ARTEXI2                                                       
e02  C                   ENDIF                                                                      
x01  C                   ELSE                                                                       
e01  C                   ENDIF                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Comprobar si el artículo existe en la productiva                                            
      **********************************************************************                        
     C     CS_ARTEXI2    BEGSR                                                                      
                                                                                                    
      * Busco Empresa Prodcutiva                                                                    
     C                   EVAL      U0CIAS = @PCIAS                                                  
     C                   EVAL      U0TENV = '5'                                                     
     C                   EVAL      U0CLP0 = M5PRVR                                                  
     C                   EVAL      U0CLP2 = *BLANKS                                                 
     C     KUTCOM0       CHAIN     UTCOM0                                                           
b01  C                   IF        %FOUND(UTCOM0)                                                   
     C                   MOVEL     U0CIA1        ZXCIAD                                             
                                                                                                    
     C                   EVAL      ZXINCI = '   '                                                   
     C                   EVAL      Q1CIAS = ZXCIAD                                                  
FQ942C                   EVAL      Q1ARVM = ZXARVMPRO                                               
FQ942C*    KGXEQAR       CHAIN     GXEQAR                                                           
      * Si el artículo no existe en GXEQAR buscamos en MSARTI Productiva                            
FQ942C*                  IF        Not %FOUND(GXEQAR)                                               
                                                                                                    
     C                   MOVEL     ZXCIAD        PPCIAS                                             
     C     KPMLIBL       CHAIN     PMLIBL                                                           
      * MOVEX                                                                                       
b03  C                   IF        %FOUND(PMLIBL) And PPMVXV = 'V'                                  
      * Buscar Compañía MOVEX                                                                       
     C                   EXSR      CS_CIASMVX                                                       
     C                   EXSR      CS_MVXLIBL                                                       
      * Abrir Ficheros MOVEX                                                                        
     C                   Eval      File_mitmas = LIBLMVX + '/MITMAS00'                              
     C                   OPEN (E)  MITMAS00                                                         
b04  C                   IF        Not %ERROR                                                       
     C                   MOVEL     MXCONO        MMCONO                                             
     C                   EVAL      MMITNO = M5ARTI                                                  
     C                   MOVEL     ZXARVMPRO     MMITNO                                             
     C     KMITMAS00     CHAIN     MITMAS00                                                         
b05  C                   IF        Not %FOUND(MITMAS00)                                             
FQ942C                             OR MMSTAT<>'20'                                                  
     C                   EVAL      ZXINCI = '005'                                                   
e05  C                   ENDIF                                                                      
e04  C                   ENDIF                                                                      
     C                   CLOSE(E)  MITMAS00                                                         
                                                                                                    
x03  C                   ELSE                                                                       
      * AS400                                                                                       
     C                   EVAL      Filearti_erp= 'PURLIBF' + PPCIAS +                               
     C                                          '/MSARTI'                                           
     C                   OPEN (E)  MSARTI                                                           
b04  C                   IF        Not %ERROR                                                       
     C                   EVAL      ZXARVMX = ZXARVMPRO                                              
     C                   EVAL      A_M5ARTI = ZXARTIX                                               
     C                   EVAL      A_M5VARI = ZXVARIX                                               
     C                   EVAL      A_M5MODE = ZXMODEX                                               
     C     KMSARTI       CHAIN     MSARTI                                                           
b05  C                   IF        Not %FOUND(MSARTI)                                               
FQ942C                             OR M5BAJA='1'                                                    
     C                   EVAL      ZXINCI = '005'                                                   
e05  C                   ENDIF                                                                      
e04  C                   ENDIF                                                                      
                                                                                                    
     C                   CLOSE(E)  MSARTI                                                           
                                                                                                    
e03  C                   ENDIF                                                                      
e02  C                   ENDIF                                                                      
FQ942C*                  ENDIF                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Comprobar Stock en Trace                                                                    
      **********************************************************************                        
     C     CS_STCK909    BEGSR                                                                      
                                                                                                    
IT228 * Busco Stock en OL                                                                           
IT228C                   if        (%lookup(S5LOGE:T_logol)>0)                                      
IT228C                   EVAL      M0CIAS=S5CIAS                                                    
IT228C                   EVAL      M0LOGE=S5LOGE                                                    
IT228C     KMSALMA05     CHAIN     MSALMA05                                                         
IT228C                   IF        %FOUND AND M0BAJA<>'1'                                           
IT228C                   EVAL      @qmaga = M0MAGA                                                  
IT228C                   call      'MM1412'                                                         
IT228C                   PARM      S5cias        @qCIAS            3 0                              
IT228C                   PARM      ZXARTTRAC     @qARTI           15                                
IT228C                   PARM      ZXVARTRAC     @qVARI            3                                
IT228C                   PARM      ZXMODTRAC     @qMODE            3                                
IT228C                   PARM      0             @qSTOK           15 5                              
IT228C                   PARM      ' '           @qSERV            2                                
IT228C                   PARM                    @qmaga            5                                
IT228C                   EVAL      T2TDIS = @qSTOK                                                  
IT228C                   IF        Z2CANT <=@qSTOK                                                  
IT228C                   EVAL      T2VA07 = 0                                                       
IT228C                   ELSE                                                                       
IT228C                   EVAL      T2VA07 = 1                                                       
IT228C                   ENDIF                                                                      
IT228C                   ENDIF                                                                      
IT228 * Busco Stock en Trace                                                                        
IT228C*                  EVAL      M1CIAS = 909                                                     
IT228C*                  EVAL      M1ARTI = ZXARTTRAC                                               
IT228C*                  EVAL      M1VARI = ZXVARTRAC                                               
IT228C*                  EVAL      M1MODE = ZXMODTRAC                                               
IT228C*                  EVAL      M1MAGA = '01'                                                    
IT228C*                  EVAL      M1CALI = 'A'                                                     
IT228C*    KMSSTO909     CHAIN     MSSTO0909                                                        
IT228C*                  EVAL      ZXARTIX = ZXARTTRAC                                              
IT228C*                  EVAL      ZXVARIX = ZXVARTRAC                                              
IT228C*                  EVAL      ZXMODEX = ZXMODTRAC                                              
IT228C*                  EVAL      T2TART = ZXARVMX                                                 
IT228C*                  EVAL      T2TCAN = Z2CANT                                                  
IT228C*                  EVAL      T2TDIS = (M1SACT-M1SKRE-M1SKRP-M1SKR1-M1SKR2)                    
IT228C*                  IF        %FOUND(MSSTO0909) AND                                            
IT228C*                            Z2CANT <= (M1SACT-M1SKRE-M1SKRP                                  
IT228C*                                       -M1SKR1-M1SKR2)                                       
IT228C*                  EVAL      T2VA07 = 0                                                       
IT228C*                  ELSE                                                                       
IT228C*                  EVAL      T2VA07 = 1                                                       
      * si no hay stock en Trace busco en Delegaciones.                                             
13070C**                 EVAL      ZXARTIX=ZXARTDLGA                                                
13070C**                 EVAL      ZXVARIX=ZXVARDLGA                                                
13070C**                 EVAL      ZXMODEX=ZXMODDLGA                                                
13070C**                 EVAL      ZXVSTK = 1                                                       
      * Delegación Propia                                                                           
13070C**                 EXSR      CS_STCKPRO                                                       
13070C**                 IF        ZXSTPR = 1                                                       
13070C**                 EVAL      T2VA07 = 1                                                       
13070C**                 ENDIF                                                                      
13070C**                 IF        T2VA07 = 0                                                       
13070C**                 EVAL      ZXLG05 = 1                                                       
13070C**                 EVAL      ZXVSTK = 1                                                       
      * Delegaciones cercanas                                                                       
13070C**                 EXSR      CS_STCKDEL                                                       
13070C**                 IF        ZXSTDL = 1                                                       
13070C**                 EVAL      T2VA07 = 1                                                       
13070C**                 ENDIF                                                                      
13070C**                 ENDIF                                                                      
                                                                                                    
e01  C                   ENDIF                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Comprobar si hay stock suficiente en Delegación Propia                                      
      **********************************************************************                        
     C     CS_STCKPRO    BEGSR                                                                      
                                                                                                    
     C                   EVAL      ZXSTPR = 0                                                       
     C                   EVAL      ZXCANT = 1                                                       
      * De momento la linea será ED hasta que no encontremos stock                                  
     C                   EVAL      T2VA07 = 0                                                       
                                                                                                    
      * Logística asociada a la delegación                                                          
     C                   EVAL      P7CIAS=@PCIAS                                                    
     C                   EVAL      P7DLGA=@PDLGA                                                    
     C     KPMEMPR       CHAIN     PMEMPR                                                           
b03  C                   IF        %FOUND(PMEMPR)                                                   
FQ844C                             AND (P7AUTS=*BLANKS OR                                           
FQ844C                             T3OPL1=*BLANKS)                                                  
     C                   EVAL      MICIAS=P7CIAS                                                    
     C                   EVAL      MIDLGA=@PDLGA                                                    
     C                   EVAL      MILGCA=P7LOGS                                                    
     C     KMSLOAD       CHAIN     MSLOAD                                                           
     C     KMSLOAD       CHAIN     MSLOGI                                                           
b04  C                   IF        %FOUND(MSLOAD) AND %FOUND(MSLOGI)                                
     C                   EVAL      M0CIAS=S0CIAS                                                    
     C                   EVAL      M0LOGE=P7LOGS                                                    
     C     KMSALMA05     CHAIN     MSALMA05                                                         
b05  C                   IF        %FOUND(MSALMA05)                                                 
                                                                                                    
      * Busco Stock en el Almacén de la logística                                                   
     C                   EVAL      M1CIAS = S5CIAS                                                  
     C                   EVAL      M1ARTI = ZXARTIX                                                 
     C                   EVAL      M1VARI = ZXVARIX                                                 
     C                   EVAL      M1MODE = ZXMODEX                                                 
     C                   EVAL      M1MAGA = M0MAGA                                                  
     C                   EVAL      M1CALI = 'A'                                                     
     C     KMSSTO010     CHAIN     MSSTO01                                                          
b06  C                   IF        %FOUND(MSSTO01)                                                  
                                                                                                    
     C                   EVAL      ZXSTDD = 0                                                       
     C                   EVAL      ZXSTKA = 0                                                       
     C                   EVAL      ZXCANS0 = 0                                                      
     C                   EVAL      ZXCANE0 = 0                                                      
     C                   EVAL      ZXDEPO0 = 0                                                      
                                                                                                    
      * Solo tratamos si el almacén tiene stock                                                     
b07  C                   IF        M1SACT > 0                                                       
     C                   EVAL      ZXSTKA=M1SACT                                                    
                                                                                                    
      * Busqueda cantidades de stock pdte servir,fabricar,deposito...                               
     C                   EXSR      CS_CANSTOK                                                       
                                                                                                    
     C     KMSSTOK       CHAIN     MSSTOK                                                           
b08  C                   IF        %FOUND(MSSTOK)                                                   
      * Stock disponible                                                                            
     C                   EVAL      ZXSTDD=ZXSTKA-ZXCANS0-ZXCANE0                                    
b09  C                   IF        ZXDEPO0>0                                                        
     C                   EVAL      ZXSTDD=ZXSTDD-ZXDEPO0                                            
e09  C                   ENDIF                                                                      
      * Si stock disponible es mayor o igual a cantidad pedido No ED                                
     C                   EVAL      T2DART = ZXARVMX                                                 
     C                   EVAL      T2DCAN = Z1CANT                                                  
     C                   EVAL      T2DDIS = ZXSTDD                                                  
     C                   EVAL      T2DALM = M1MAGA                                                  
02110C**                 IF        Z1CANT <= ZXSTDD                                                 
02110C**                 EVAL      ZXSTPR = 1                                                       
02110C**                 ENDIF                                                                      
02110C                   IF        Z1CANT <= ZXSTDD And ZXVSTK = 1                                  
02110C                   EVAL      ZXSTPR = 1                                                       
02110C                   ENDIF                                                                      
02110C                   IF        M1SMAX<ZXSTDD And ZXVSTK = 0                                     
02110C                   IF        Z1CANT <= ZXSTDD                                                 
02110C                   EVAL      ZXSTPR = 1                                                       
02110C                   ENDIF                                                                      
02110C                   ENDIF                                                                      
e08  C                   ENDIF                                                                      
e07  C                   ENDIF                                                                      
e06  C                   ENDIF                                                                      
e05  C                   ENDIF                                                                      
e04  C                   ENDIF                                                                      
e03  C                   ENDIF                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Comprobar si hay stock suficiente en alguna Delegación Cercana                              
      **********************************************************************                        
     C     CS_STCKDEL    BEGSR                                                                      
                                                                                                    
     C                   EVAL      ZXSTDL = 0                                                       
     C                   EVAL      ZXCANT = 1                                                       
      * De momento la linea será ED hasta que no encontremos stock                                  
     C                   EVAL      T2VA07 = 0                                                       
                                                                                                    
      * Busco en parámetros de Interdelegaciones,delegaciones cercanas                              
     C                   EVAL      XACIAS = S0CIAS                                                  
     C                   EVAL      XADLGA = S0DLGA                                                  
b01  C                   IF        ZXLG05 = 1                                                       
     C     KMSDLDL05     SETLL     MSDLDL05                                                         
     C     KMSDLDL05     READE     MSDLDL05                               82                        
x01  C                   ELSE                                                                       
     C     KMSDLDL05     SETLL     MSDLDL03                                                         
     C     KMSDLDL05     READE     MSDLDL03                               82                        
e01  C                   ENDIF                                                                      
d01  C                   DOW       EOF=*OFF                                                         
b02  C                   IF        (XAPRI2>'0' And ZXLG05 = 1)                                      
     C                             Or (XAPRIS>'0' And ZXLG05 = 0)                                   
                                                                                                    
      * Logística asociada a la delegación                                                          
     C                   EVAL      P7CIAS=S0CIAS                                                    
     C                   EVAL      P7DLGA=XADLG2                                                    
     C     KPMEMPR       CHAIN     PMEMPR                                                           
b03  C                   IF        %FOUND(PMEMPR)                                                   
     C                   EVAL      MICIAS=P7CIAS                                                    
     C                   EVAL      MIDLGA=XADLGA                                                    
     C                   EVAL      MILGCA=P7LOGS                                                    
     C     KMSLOAD       CHAIN     MSLOAD                                                           
     C     KMSLOAD       CHAIN     MSLOGI                                                           
b04  C                   IF        %FOUND(MSLOAD) AND %FOUND(MSLOGI)                                
     C                   EVAL      M0CIAS=S0CIAS                                                    
     C                   EVAL      M0LOGE=P7LOGS                                                    
     C     KMSALMA05     CHAIN     MSALMA05                                                         
b05  C                   IF        %FOUND(MSALMA05)                                                 
                                                                                                    
      * Busco Stock en el Almacén de la logística                                                   
     C                   EVAL      M1CIAS = S5CIAS                                                  
     C                   EVAL      M1ARTI = ZXARTIX                                                 
     C                   EVAL      M1VARI = ZXVARIX                                                 
     C                   EVAL      M1MODE = ZXMODEX                                                 
     C                   EVAL      M1MAGA = M0MAGA                                                  
     C                   EVAL      M1CALI = 'A'                                                     
     C     KMSSTO010     CHAIN     MSSTO01                                                          
b06  C                   IF        %FOUND(MSSTO01)                                                  
                                                                                                    
     C                   EVAL      ZXSTDD = 0                                                       
     C                   EVAL      ZXSTKA = 0                                                       
     C                   EVAL      ZXCANS0 = 0                                                      
     C                   EVAL      ZXCANE0 = 0                                                      
     C                   EVAL      ZXDEPO0 = 0                                                      
                                                                                                    
      * Solo tratamos si el almacén tiene stock                                                     
b07  C                   IF        M1SACT > 0                                                       
     C                   EVAL      ZXSTKA=M1SACT                                                    
                                                                                                    
      * Busqueda cantidades de stock pdte servir,fabricar,deposito...                               
     C                   EXSR      CS_CANSTOK                                                       
                                                                                                    
     C     KMSSTOK       CHAIN     MSSTOK                                                           
b08  C                   IF        %FOUND(MSSTOK)                                                   
      * Stock disponible                                                                            
     C                   EVAL      ZXSTDD=ZXSTKA-ZXCANS0-ZXCANE0                                    
b09  C                   IF        ZXDEPO0>0                                                        
     C                   EVAL      ZXSTDD=ZXSTDD-ZXDEPO0                                            
e09  C                   ENDIF                                                                      
      * Si stock disponible es mayor o igual a cantidad pedido No ED                                
     C                   EVAL      T2DART = ZXARVMX                                                 
     C                   EVAL      T2DCAN = Z1CANT                                                  
     C                   EVAL      T2DDIS = ZXSTDD                                                  
     C                   EVAL      T2DALM = M1MAGA                                                  
b09  C                   IF        Z1CANT <= ZXSTDD And ZXVSTK = 1                                  
     C                   EVAL      ZXSTDL = 1                                                       
     C                   LEAVE                                                                      
e09  C                   ENDIF                                                                      
b09  C                   IF        M1SMAX<ZXSTDD And ZXVSTK = 0                                     
b10  C                   IF        Z1CANT <= ZXSTDD                                                 
     C                   EVAL      ZXSTDL = 1                                                       
     C                   LEAVE                                                                      
e10  C                   ENDIF                                                                      
e09  C                   ENDIF                                                                      
e08  C                   ENDIF                                                                      
e07  C                   ENDIF                                                                      
e06  C                   ENDIF                                                                      
e05  C                   ENDIF                                                                      
e04  C                   ENDIF                                                                      
e03  C                   ENDIF                                                                      
e02  C                   ENDIF                                                                      
                                                                                                    
b02  C                   IF        ZXLG05 = 1                                                       
     C     KMSDLDL05     READE     MSDLDL05                               82                        
x02  C                   ELSE                                                                       
     C     KMSDLDL05     READE     MSDLDL03                               82                        
e02  C                   ENDIF                                                                      
e01  C                   ENDDO                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Validaciones para Alta ED (precio compra, artículo, etc...)                                 
      **********************************************************************                        
     C     CS_VALED51    BEGSR                                                                      
                                                                                                    
     C                   CALL      'ED0051'                                                         
     C                   PARM                    @PCIAS                                             
     C                   PARM                    @PDLGA                                             
     C                   PARM                    @PNPCO                                             
     C                   PARM                    @PTPED                                             
     C                   PARM                    @PDATP                                             
     C                   PARM                    @PNOPL                                             
     C                   PARM                    @PLINE                                             
FQ284C                   PARM      *BLANKS       @FDARV1                                            
FQ284C                   PARM      *BLANKS       @FDCOM2                                            
     C                   PARM      S5CUST        @PCUST                                             
     C                   PARM      S5TDI1        @PTDI1                                             
     C                   PARM      '403'         @PEDAU                                             
     C                   PARM      0             @PLOGI                                             
     C                   PARM      0             @PORIG                                             
     C                   PARM      1             @PINTE                                             
OL885C*                  PARM      ' '           @PERRO                                             
OL885C                   PARM      'D'           @PERRO                                             
     C                   PARM      *BLANKS       @PINCI                                             
                                                                                                    
b01  C                   IF        @PERRO <> ' '                                                    
     C*******            EVAL      T2VA08 = 1                                                       
     C                   EVAL      T2INCI = @PINCI                                                  
e01  C                   ENDIF                                                                      
b01  C                   IF        @PINCI = '003' OR                                                
     C                             @PINCI = '005'                                                   
CR528C                             OR @PINCI = '019'                                                
     C                   EVAL      T2VA08 = 1                                                       
e01  C                   ENDIF                                                                      
FQ942                                                                                               
FQ942C                   IF        @PINCI = '050'                                                   
FQ942C                   EVAL      T2CJTO = 1                                                       
FQ942C                   ENDIF                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **************************************************************                                
      * Calculo Importe línea pedido                               *                                
      *------------------------------------------------------------*                                
     C     CS_IMPORTE    BEGSR                                                                      
                                                                                                    
     C                   EVAL      ZXMONE2 = S5MONE                                                 
      * Tipo de IVA                                                                                 
     C                   EVAL      PECIAS=S5CIAS                                                    
     C                   EVAL      PECTAB='TIV2'                                                    
     C                   EVAL      PECLTA=*BLANKS                                                   
     C                   EVAL      PECLTA=S0TIV3                                                    
     C     KPMTABD       CHAIN     PMTABD                                                           
b01  C                   IF        %FOUND(PMTABD)                                                   
     C                   EVAL      ZXTIVC=PEBL61                                                    
     C                   EVAL      ZXBL65I=PEBL65                                                   
x01  C                   ELSE                                                                       
     C                   EVAL      ZXPABI=*BLANKS                                                   
e01  C                   ENDIF                                                                      
                                                                                                    
     C                   EVAL      XZAUXI=*ZEROS                                                    
     C                   EVAL      XZAUXI1=*ZEROS                                                   
     C                   EVAL      MBCIAS=S5CIAS                                                    
     C                   EVAL      MBMONE=ZXMONE2                                                   
ECOP * Ecotaxe                                                                                     
ECOP C                   EVAL      XZTAXE=0                                                         
ECOP C                   IF        S5ECOP<>*BLANKS                                                  
ECOP C                   CALL      'MN0398'                                                         
ECOP C                   PARM                    @PCIAS                                             
ECOP C                   PARM      S5ECOP        @PEECOP                                            
ECOP C                   PARM      S5DATP        @PEFLCD                                            
ECOP C                   PARM      0             @PETAXE                                            
ECOP C                   EVAL      XZTAXE=@PETAXE                                                   
ECOP C                   ENDIF                                                                      
      * Buscamos en Ajuste decimal                                                                  
                                                                                                    
     C     KMSDIV0       CHAIN     MSDIV0                                                           
b01  C                   IF        %FOUND(MSDIV0)                                                   
     C                   EVAL      XZDECI=MBDECI                                                    
     C                   EVAL      XZAJUD=MBAJUD                                                    
e01  C                   ENDIF                                                                      
                                                                                                    
      * Buscamos en PMUNAL UNIDADES ALTERNATIVAS                                                    
                                                                                                    
     C                   EVAL      XZCOFU=1                                                         
b01  C                   IF        S5UNIM<>S5UNDP                                                   
     C                   EVAL      XZCIAS=@PCIAS                                                    
     C                   EVAL      XZARTI=S5ARTI                                                    
     C                   EVAL      XZVARI=S5VARI                                                    
     C                   EVAL      XZMODE=S5MODE                                                    
     C                   EVAL      ZXCA10=S5CANT                                                    
     C                   EVAL      ZXCA11=S5CANT                                                    
     C                   EVAL      ZXUN10=S5UNIM                                                    
     C                   EVAL      ZXUN11=S5UNDP                                                    
     C* CAMBIO de unidades                                                                          
     C/COPY *LIBL/QSRDSRC,SRD021                                                                    
e01  C                   ENDIF                                                                      
                                                                                                    
      * Buscamos en CAMBIO MONEDA CABECERA DEL PEDIDO                                               
                                                                                                    
b01  C                   IF        ZXMONE2<>S5MONE                                                  
     C                   CALL      'MM2555'                                                         
     C                   PARM      S5CIAS        @PCIAS                                             
     C                   PARM      S5MONE        @PMON1                                             
     C                   PARM      ZXMONE2       @PMON2                                             
     C                   PARM      S5DATP        @PDATA                                             
     C                   PARM      S5NOPL        @PHORA                                             
     C                   PARM      0             @PCMCOCO                                           
     C                   PARM      0             @PCMCCCO                                           
     C                   PARM      *BLANKS       @PEERR                                             
     C                   EVAL      ZXCOCAMB=@PCMCCCO                                                
x01  C                   ELSE                                                                       
     C                   EVAL      ZXCOCAMB=1                                                       
e01  C                   ENDIF                                                                      
                                                                                                    
      * Buscamos en % de IVA                                                                        
     C                   EVAL      MVCIAS=S5CIAS                                                    
     C                   EVAL      MVTIVA=S5TIVA                                                    
     C                   EVAL      MVPABI=ZXPABI                                                    
     C                   EVAL      MVFLCD=@PDATP                                                    
     C     KMSIVAS       SETGT     MSIVAS                                                           
     C     KMSIVAS0      READPE    MSIVAS                                 83                        
s01  C                   SELECT                                                                     
     C                   WHEN      ZXTIVC=' '                                                       
     C                   EVAL      MVPIV2=*ZEROS                                                    
     C                   WHEN      ZXTIVC='0'                                                       
     C                   EVAL      MVPIV1=*ZEROS                                                    
     C                   EVAL      MVPIV2=*ZEROS                                                    
e01  C                   ENDSL                                                                      
                                                                                                    
      * Calculamos el precio de nueva linea o modificada                                            
     C                   EVAL      XZCANT=S5CANT                                                    
     C                   EVAL      XZPREC=S5PREC                                                    
     C                   EVAL      XZCADP=S5CADP                                                    
     C                   EVAL      XZDTO1=S5DTO1                                                    
     C                   EVAL      XZDTO2=S5DTO2                                                    
     C                   EVAL      XZDTO3=S5DTO3                                                    
     C                   EVAL      XZDTO4=S5DTO4                                                    
b01  C                   IF        XZDTO4=*ZEROS                                                    
     C                   EVAL      XZDTO4=@PDTOE                                                    
e01  C                   ENDIF                                                                      
ECOP C/COPY *LIBL/QSRDSRC,SRD022ECO                                                                 
ECOP C* AJUSTE Y DECIMALES                                                                          
ECOP C/COPY *LIBL/QSRDSRC,SRD001                                                                    
ECOP C                   Z-ADD     XZAUXI        ZXBIMPECO                                          
     C/COPY *LIBL/QSRDSRC,SRD022                                                                    
                                                                                                    
     C* AJUSTE Y DECIMALES                                                                          
     C/COPY *LIBL/QSRDSRC,SRD001                                                                    
     C                   Z-ADD     XZAUXI        ZXBIMP                                             
ECOP C                   ADD       ZXBIMPECO     ZXBIMP                                             
      * Calculamos el IVA                                                                           
     C                   EVAL      XZAUXI=ZXBIMP*MVPIV1                                             
     C     XZAUXI        DIV(H)    100           XZAUXI                                             
     C* AJUSTE Y DECIMALES                                                                          
     C/COPY *LIBL/QSRDSRC,SRD001                                                                    
     C                   Z-ADD     XZAUXI        ZXIIV1                                             
      * Calculamos el Recargo de equivalencia                                                       
     C                   EVAL      XZAUXI=ZXBIMP*MVPIV2                                             
     C     XZAUXI        DIV(H)    100           XZAUXI                                             
     C* AJUSTE Y DECIMALES                                                                          
     C/COPY *LIBL/QSRDSRC,SRD001                                                                    
     C                   Z-ADD     XZAUXI        ZXIIV2                                             
                                                                                                    
      * Omitimos BASE o IVA segun tipo de IVA                                                       
                                                                                                    
b01  C                   IF        MVOMTB>='1'                                                      
     C                   EVAL      ZXBIMP=ZXBIMP-ZXBIMP                                             
e01  C                   ENDIF                                                                      
b01  C                   IF        MVOMTI>='1'                                                      
     C                   EVAL      ZXIIV1=ZXIIV1-ZXIIV1                                             
     C                   EVAL      ZXIIV2=ZXIIV2-ZXIIV2                                             
e01  C                   ENDIF                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Validaciones Importe lineas ED                                     *                        
      **********************************************************************                        
     C     CS_IMPLINE    BEGSR                                                                      
                                                                                                    
FQ710C*                  EVAL      XACIAS = @PCIAS                                                  
FQ710C*                  EVAL      XADLGA = @PDLGA                                                  
FQ710C*                  EVAL      XADLG2 = 'TRACE'                                                 
FQ710C*    KMSDLDL       CHAIN     MSDLDL                                                           
FQ710C*                  IF        %FOUND(MSDLDL)                                                   
FQ710C*                  EVAL      T2IMPM = XALII2                                                  
FQ710C                   EVAL      T2IMPM = T3LIMP                                                  
     C                   EVAL      T2IMED = ZXIMPO                                                  
FQ710C*                  IF        ZXIMPO < XALII2                                                  
FQ710C                   IF        ZXIMPO < T3LIMP                                                  
      * Actualizo fichero temporal                                                                  
     C                   EVAL      ZXVA09 = 1                                                       
     C                   EXSR      CS_FICTEMP                                                       
e02  C                   ENDIF                                                                      
FQ710C*                  ENDIF                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Comprobar Pedido Completo                                          *                        
      **********************************************************************                        
     C     CS_PEDTOTA    BEGSR                                                                      
                                                                                                    
b01  C                   IF        ZXPEDT = 1 And S0ETOD = '1'                                      
      * Actualizo fichero temporal                                                                  
     C                   EVAL      ZXVA10 = 1                                                       
     C                   EXSR      CS_FICTEMP                                                       
e01  C                   ENDIF                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Actualizar fichero temporal                                                                 
      **********************************************************************                        
     C     CS_FICTEMP    BEGSR                                                                      
                                                                                                    
      * Leo Pedido en CODEPE                                                                        
     C     KED0050W      SETLL     ED0050W                                                          
     C     KED0050W      READE     ED0050W                                                          
d01  C                   DOW       NOT %EOF(ED0050W)                                                
     C                   EVAL      T2VA09 = ZXVA09                                                  
     C                   EVAL      T2VA10 = ZXVA10                                                  
C2510C                   IF        T2VA10 = 1                                                       
     C                   EVAL      T2ENTD = 0                                                       
C2510C                   ENDIF                                                                      
     C                   UPDATE    RED0050W                                                         
     C     KED0050W      READE     ED0050W                                                          
e01  C                   ENDDO                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Actualizar Marca ED en CODEPE TPE4='2'                                                      
      **********************************************************************                        
     C     CS_MARCAED    BEGSR                                                                      
                                                                                                    
      * Leo Pedido en CODEPE                                                                        
     C     KED0050W      SETLL     ED0050W                                                          
     C     KED0050W      READE     ED0050W                                                          
d01  C                   DOW       NOT %EOF(ED0050W)                                                
b02  C                   IF        T2ENTD = 1 And T2FORZ = 0                                        
     C                   EVAL      S5CIAS = T2CIAS                                                  
     C                   EVAL      S5DLGA = T2DLGA                                                  
     C                   EVAL      S5NPCO = T2NPCO                                                  
     C                   EVAL      S5TPED = T2TPED                                                  
     C                   EVAL      S5DATP = T2DATP                                                  
     C                   EVAL      S5NOPL = T2NOPL                                                  
     C                   EVAL      S5LINE = T2LINE                                                  
     C     KCODEPE0      CHAIN     CODEPE                                                           
b03  C                   IF        %FOUND(CODEPE)                                                   
CR554c                   if        not (s5lb2b <> *blank and s5tped ='25')                          
C2638C                   IF        S5STUL<>'5' AND S5CAPP=0                                         
     C                   EVAL      S5TPE4 = '2 '                                                    
C2638c                   ENDIF                                                                      
     C                   UPDATE    RCODEPE                                                          
CR554c                   endif                                                                      
e03  C                   ENDIF                                                                      
e02  C                   ENDIF                                                                      
     C     KED0050W      READE     ED0050W                                                          
e01  C                   ENDDO                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Buscar Puntos de Expedición                                                                 
      **********************************************************************                        
     C     CS_BUSPEXP    BEGSR                                                                      
                                                                                                    
      * Leo Pedido en CODEPE                                                                        
     C                   MOVEA     *BLANKS       SLOGISTI                                           
     C                   EVAL      S5CIAS = @PCIAS                                                  
     C                   EVAL      S5DLGA = @PDLGA                                                  
     C                   EVAL      S5NPCO = @PNPCO                                                  
     C                   EVAL      S5TPED = @PTPED                                                  
     C                   EVAL      S5DATP = @PDATP                                                  
     C                   EVAL      S5NOPL = @PNOPL                                                  
     C     KCODEPE       SETLL     CODEPE                                                           
     C     KCODEPE       READE(N)  CODEPE                                                           
d01  C                   DOW       NOT %EOF(CODEPE)                                                 
b02  C                   IF        S5TPE4 = '2'                                                     
     C                   EVAL      ZXLOGE = 'TRA'                                                   
e02  C                   ELSE                                                                       
     C                   EVAL      ZXLOGE = S5LOGE                                                  
e02  C                   ENDIF                                                                      
      * Busco la logística en la serie                                                              
     C                   EVAL      ZW=1                                                             
     C     ZXLOGE        LOOKUP    SLOGISTI(ZW)                           81                        
      * Si no existe grabo logística en la serie                                                    
b02  C                   IF        CHAIN=*OFF                                                       
     C                   EVAL      ZW=1                                                             
     C     *BLANKS       LOOKUP    SLOGISTI(ZW)                           81                        
     C                   MOVEL     ZXLOGE        SLOGISTI(ZW)                                       
e02  C                   ENDIF                                                                      
                                                                                                    
     C     KCODEPE       READE(N)  CODEPE                                                           
e01  C                   ENDDO                                                                      
                                                                                                    
      * Puntos de expedición                                                                        
     C                   EVAL      ZW=1                                                             
     C     *BLANKS       LOOKUP    SLOGISTI(ZW)                           81                        
b01  C                   IF        ZW>1                                                             
     C                   EVAL      ZW=ZW-1                                                          
e01  C                   ENDIF                                                                      
                                                                                                    
      * Si los Puntos de Expedición superan la parametrización                                      
      *  cambio todo lo que no sea Entrega Directa a Delegación Propia                              
b01  C                   IF        ZW > T3PEXP                                                      
      * Logística asociada a la delegación                                                          
     C                   EVAL      P7CIAS=@PCIAS                                                    
     C                   EVAL      P7DLGA=@PDLGA                                                    
     C     KPMEMPR       CHAIN     PMEMPR                                                           
b02  C                   IF        %FOUND(PMEMPR)                                                   
C1686 * Se define un solo punto de expedición tal como se define                                    
C1686 * en el CR1686. Se define un punto de expedición y                                            
C1686 * si no lo cumple el material se quedará en la logística                                      
C1686 * de la delegación (o en su defecto en la forzada).                                           
C1686C                                                                                              
      * Leo Pedido en CODEPE                                                                        
     C                   EVAL      S5CIAS = @PCIAS                                                  
     C                   EVAL      S5DLGA = @PDLGA                                                  
     C                   EVAL      S5NPCO = @PNPCO                                                  
     C                   EVAL      S5TPED = @PTPED                                                  
     C                   EVAL      S5DATP = @PDATP                                                  
     C                   EVAL      S5NOPL = @PNOPL                                                  
     C     KCODEPE       SETLL     CODEPE                                                           
     C     KCODEPE       READE     CODEPE                                                           
     C                   DOW       NOT %EOF(CODEPE)                                                 
C1686C                   SELECT                                                                     
C1686 * + 1 PUNTO EXPEDICIÓN                                                                        
C1686C                   WHEN      T3PEXP>1                                                         
b04  C                   IF        S5TPE4 <> '2' And S5LOGE <> P7LOGS                               
FQ726C                   IF        T2LOGI = P7LOGS                                                  
FQ726C                   EVAL      T2LOGU = *BLANKS                                                 
FQ726C                   ELSE                                                                       
FQ726C                   EVAL      T2LOGU = P7LOGS                                                  
FQ726C                   ENDIF                                                                      
     C                   EVAL      S5LOGE = P7LOGS                                                  
C1686C                   IF        T3OPL1<>*BLANKS                                                  
C1686C                   EVAL      S5LOGE=T3OPL1                                                    
C1686C                   ELSE                                                                       
C1686C                   EVAL      S5LOGE=P7LOGS                                                    
C1686C                   ENDIF                                                                      
CR554c                   exsr      CS_set_s5lb2b                                                    
     C                   UPDATE    RCODEPE                                                          
e04  C                   ENDIF                                                                      
C1686 *   1 PUNTO EXPEDICIÓN                                                                        
C1686C                   WHEN      T3PEXP=1                                                         
C1686C                   IF        T3OPL1<>*BLANKS                                                  
C1686C                   EVAL      S5LOGE=T3OPL1                                                    
C1686C                   ELSE                                                                       
C1686C                   EVAL      S5LOGE=P7LOGS                                                    
C1686C                   ENDIF                                                                      
C1686C     KCODEPE0      CHAIN     ED0050W                                                          
C1686C                   EVAL      T2LOGU = S5LOGE                                                  
C1686C                   EVAL      T2ENTD= 0                                                        
C1686C                   EVAL      T2FORZ= 0                                                        
C1686C                   UPDATE    RED0050W                                                         
C1686C                   EVAL      S5TPE4= ' '                                                      
C1686c                   exsr      CS_set_s5lb2b                                                    
C1686C                   UPDATE    RCODEPE                                                          
C1686C                   ENDSL                                                                      
     C     KCODEPE       READE     CODEPE                                                           
e03  C                   ENDDO                                                                      
e02  C                   ENDIF                                                                      
e01  C                   ENDIF                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Recuperar Compañía de MOVEX                                                                 
      **********************************************************************                        
     C     CS_CIASMVX    BEGSR                                                                      
                                                                                                    
      *          Establecer Entorno de Trabajo Movex                                                
     C                   MOVEL     ZXCIAD        @PEDIVI                                            
     C                   CALL      'GX0150'                                                         
     C                   PARM                    @PEDIVI                                            
     C                   PARM      SDSUSR        @PEUSER                                            
     C                   PARM      *BLANKS       @PEVAL                                             
     C                   EVAL      ZXVAL=@PEVAL                                                     
                                                                                                    
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Recuperar Biblioteca de Movex                                                               
      **********************************************************************                        
     C     CS_MVXLIBL    BEGSR                                                                      
                                                                                                    
     C                   EVAL      LIBLMVX = *BLANKS                                                
                                                                                                    
s01  C                   SELECT                                                                     
     C                   WHEN      %SUBST(PPBIBL:1:7) = 'MVXJDTA'                                   
19D12C                             Or %SUBST(PPBIBL:1:5) = 'M3EDB'                                  
     C                   EVAL      LIBLMVX = PPBIBL                                                 
     C                   WHEN      %SUBST(PPBIB1:1:7) = 'MVXJDTA'                                   
19D12C                             Or %SUBST(PPBIB1:1:5) = 'M3EDB'                                  
     C                   EVAL      LIBLMVX = PPBIB1                                                 
     C                   WHEN      %SUBST(PPBIB2:1:7) = 'MVXJDTA'                                   
19D12C                             Or %SUBST(PPBIB2:1:5) = 'M3EDB'                                  
     C                   EVAL      LIBLMVX = PPBIB2                                                 
     C                   WHEN      %SUBST(PPBIB3:1:7) = 'MVXJDTA'                                   
19D12C                             Or %SUBST(PPBIB3:1:5) = 'M3EDB'                                  
     C                   EVAL      LIBLMVX = PPBIB3                                                 
     C                   WHEN      %SUBST(PPBIB4:1:7) = 'MVXJDTA'                                   
19D12C                             Or %SUBST(PPBIB4:1:5) = 'M3EDB'                                  
     C                   EVAL      LIBLMVX = PPBIB4                                                 
     C                   WHEN      %SUBST(PPBIB5:1:7) = 'MVXJDTA'                                   
19D12C                             Or %SUBST(PPBIB5:1:5) = 'M3EDB'                                  
     C                   EVAL      LIBLMVX = PPBIB5                                                 
     C                   WHEN      %SUBST(PPBIB6:1:7) = 'MVXJDTA'                                   
19D12C                             Or %SUBST(PPBIB6:1:5) = 'M3EDB'                                  
     C                   EVAL      LIBLMVX = PPBIB6                                                 
     C                   WHEN      %SUBST(PPBIB7:1:7) = 'MVXJDTA'                                   
19D12C                             Or %SUBST(PPBIB7:1:5) = 'M3EDB'                                  
     C                   EVAL      LIBLMVX = PPBIB7                                                 
     C                   WHEN      %SUBST(PPBIB8:1:7) = 'MVXJDTA'                                   
19D12C                             Or %SUBST(PPBIB8:1:5) = 'M3EDB'                                  
     C                   EVAL      LIBLMVX = PPBIB8                                                 
     C                   WHEN      %SUBST(PPBIB9:1:7) = 'MVXJDTA'                                   
19D12C                             Or %SUBST(PPBIB9:1:5) = 'M3EDB'                                  
     C                   EVAL      LIBLMVX = PPBIB9                                                 
     C                   WHEN      %SUBST(PPBI10:1:7) = 'MVXJDTA'                                   
19D12C                             Or %SUBST(PPBI10:1:5) = 'M3EDB'                                  
     C                   EVAL      LIBLMVX = PPBI10                                                 
     C                   WHEN      %SUBST(PPBI11:1:7) = 'MVXJDTA'                                   
19D12C                             Or %SUBST(PPBI11:1:5) = 'M3EDB'                                  
     C                   EVAL      LIBLMVX = PPBI11                                                 
     C                   WHEN      %SUBST(PPBI12:1:7) = 'MVXJDTA'                                   
19D12C                             Or %SUBST(PPBI12:1:5) = 'M3EDB'                                  
     C                   EVAL      LIBLMVX = PPBI12                                                 
     C                   WHEN      %SUBST(PPBI13:1:7) = 'MVXJDTA'                                   
19D12C                             Or %SUBST(PPBI13:1:5) = 'M3EDB'                                  
     C                   EVAL      LIBLMVX = PPBI13                                                 
     C                   WHEN      %SUBST(PPBI14:1:7) = 'MVXJDTA'                                   
19D12C                             Or %SUBST(PPBI14:1:5) = 'M3EDB'                                  
     C                   EVAL      LIBLMVX = PPBI14                                                 
     C                   WHEN      %SUBST(PPBI15:1:7) = 'MVXJDTA'                                   
19D12C                             Or %SUBST(PPBI15:1:5) = 'M3EDB'                                  
     C                   EVAL      LIBLMVX = PPBI15                                                 
     C                   WHEN      %SUBST(PPBI16:1:7) = 'MVXJDTA'                                   
19D12C                             Or %SUBST(PPBI16:1:5) = 'M3EDB'                                  
     C                   EVAL      LIBLMVX = PPBI16                                                 
     C                   WHEN      %SUBST(PPBI17:1:7) = 'MVXJDTA'                                   
19D12C                             Or %SUBST(PPBI17:1:5) = 'M3EDB'                                  
     C                   EVAL      LIBLMVX = PPBI17                                                 
     C                   WHEN      %SUBST(PPBI18:1:7) = 'MVXJDTA'                                   
19D12C                             Or %SUBST(PPBI18:1:5) = 'M3EDB'                                  
     C                   EVAL      LIBLMVX = PPBI18                                                 
     C                   WHEN      %SUBST(PPBI19:1:7) = 'MVXJDTA'                                   
19D12C                             Or %SUBST(PPBI19:1:5) = 'M3EDB'                                  
     C                   EVAL      LIBLMVX = PPBI19                                                 
     C                   WHEN      %SUBST(PPBI20:1:7) = 'MVXJDTA'                                   
19D12C                             Or %SUBST(PPBI20:1:5) = 'M3EDB'                                  
     C                   EVAL      LIBLMVX = PPBI20                                                 
     C                   WHEN      %SUBST(PPBI21:1:7) = 'MVXJDTA'                                   
19D12C                             Or %SUBST(PPBI21:1:5) = 'M3EDB'                                  
     C                   EVAL      LIBLMVX = PPBI21                                                 
     C                   WHEN      %SUBST(PPBI22:1:7) = 'MVXJDTA'                                   
19D12C                             Or %SUBST(PPBI22:1:5) = 'M3EDB'                                  
     C                   EVAL      LIBLMVX = PPBI22                                                 
     C                   WHEN      %SUBST(PPBI23:1:7) = 'MVXJDTA'                                   
19D12C                             Or %SUBST(PPBI23:1:5) = 'M3EDB'                                  
     C                   EVAL      LIBLMVX = PPBI23                                                 
     C                   WHEN      %SUBST(PPBI24:1:7) = 'MVXJDTA'                                   
19D12C                             Or %SUBST(PPBI24:1:5) = 'M3EDB'                                  
     C                   EVAL      LIBLMVX = PPBI24                                                 
     C                   WHEN      %SUBST(PPBI25:1:7) = 'MVXJDTA'                                   
19D12C                             Or %SUBST(PPBI25:1:5) = 'M3EDB'                                  
     C                   EVAL      LIBLMVX = PPBI25                                                 
     C                   OTHER                                                                      
     C                   EVAL      LIBLMVX = 'MVXJDTA'                                              
e01  C                   ENDSL                                                                      
                                                                                                    
I0184C                   EVAL      LIBLAQA = *BLANKS                                                
I0184                                                                                               
I0184C                   SELECT                                                                     
I0184C                   WHEN      %SUBST(PPBIBL:1:5) = 'M3AQA'                                     
I0184C                   EVAL      LIBLAQA = PPBIBL                                                 
I0184C                   WHEN      %SUBST(PPBIB1:1:5) = 'M3AQA'                                     
I0184C                   EVAL      LIBLAQA = PPBIB1                                                 
I0184C                   WHEN      %SUBST(PPBIB2:1:5) = 'M3AQA'                                     
I0184C                   EVAL      LIBLAQA = PPBIB2                                                 
I0184C                   WHEN      %SUBST(PPBIB3:1:5) = 'M3AQA'                                     
I0184C                   EVAL      LIBLAQA = PPBIB3                                                 
I0184C                   WHEN      %SUBST(PPBIB4:1:5) = 'M3AQA'                                     
I0184C                   EVAL      LIBLAQA = PPBIB4                                                 
I0184C                   WHEN      %SUBST(PPBIB5:1:5) = 'M3AQA'                                     
I0184C                   EVAL      LIBLAQA = PPBIB5                                                 
I0184C                   WHEN      %SUBST(PPBIB6:1:5) = 'M3AQA'                                     
I0184C                   EVAL      LIBLAQA = PPBIB6                                                 
I0184C                   WHEN      %SUBST(PPBIB7:1:5) = 'M3AQA'                                     
I0184C                   EVAL      LIBLAQA = PPBIB7                                                 
I0184C                   WHEN      %SUBST(PPBIB8:1:5) = 'M3AQA'                                     
I0184C                   EVAL      LIBLAQA = PPBIB8                                                 
I0184C                   WHEN      %SUBST(PPBIB9:1:5) = 'M3AQA'                                     
I0184C                   EVAL      LIBLAQA = PPBIB9                                                 
I0184C                   WHEN      %SUBST(PPBI10:1:5) = 'M3AQA'                                     
I0184C                   EVAL      LIBLAQA = PPBI10                                                 
I0184C                   WHEN      %SUBST(PPBI11:1:5) = 'M3AQA'                                     
I0184C                   EVAL      LIBLAQA = PPBI11                                                 
I0184C                   WHEN      %SUBST(PPBI12:1:5) = 'M3AQA'                                     
I0184C                   EVAL      LIBLAQA = PPBI12                                                 
I0184C                   WHEN      %SUBST(PPBI13:1:5) = 'M3AQA'                                     
I0184C                   EVAL      LIBLAQA = PPBI13                                                 
I0184C                   WHEN      %SUBST(PPBI14:1:5) = 'M3AQA'                                     
I0184C                   EVAL      LIBLAQA = PPBI14                                                 
I0184C                   WHEN      %SUBST(PPBI15:1:5) = 'M3AQA'                                     
I0184C                   EVAL      LIBLAQA = PPBI15                                                 
I0184C                   WHEN      %SUBST(PPBI16:1:5) = 'M3AQA'                                     
I0184C                   EVAL      LIBLAQA = PPBI16                                                 
I0184C                   WHEN      %SUBST(PPBI17:1:5) = 'M3AQA'                                     
I0184C                   EVAL      LIBLAQA = PPBI17                                                 
I0184C                   WHEN      %SUBST(PPBI18:1:5) = 'M3AQA'                                     
I0184C                   EVAL      LIBLAQA = PPBI18                                                 
I0184C                   WHEN      %SUBST(PPBI19:1:5) = 'M3AQA'                                     
I0184C                   EVAL      LIBLAQA = PPBI19                                                 
I0184C                   WHEN      %SUBST(PPBI20:1:5) = 'M3AQA'                                     
I0184C                   EVAL      LIBLAQA = PPBI20                                                 
I0184C                   WHEN      %SUBST(PPBI21:1:5) = 'M3AQA'                                     
I0184C                   EVAL      LIBLAQA = PPBI21                                                 
I0184C                   WHEN      %SUBST(PPBI22:1:5) = 'M3AQA'                                     
I0184C                   EVAL      LIBLAQA = PPBI22                                                 
I0184C                   WHEN      %SUBST(PPBI23:1:5) = 'M3AQA'                                     
I0184C                   EVAL      LIBLAQA = PPBI23                                                 
I0184C                   WHEN      %SUBST(PPBI24:1:5) = 'M3AQA'                                     
I0184C                   EVAL      LIBLAQA = PPBI24                                                 
I0184C                   WHEN      %SUBST(PPBI25:1:5) = 'M3AQA'                                     
I0184C                   EVAL      LIBLAQA = PPBI25                                                 
I0184C                   OTHER                                                                      
I0184C                   EVAL      LIBLAQA = 'MVXJDTA'                                              
I0184C                   ENDSL                                                                      
I0184 *                                                                                             
     C                   ENDSR                                                                      
FQ842                                                                                               
FQ842 **************************************************************************                    
FQ842 * SUBRUTINA COMPROBAR SI HAY QUE CAMBIAR LOGÍSTICA DE ENTREGA            *                    
FQ842 *------------------------------------------------------------------------*                    
FQ842C     CS_CHKLOGE    BEGSR                                                                      
FQ842C                   EVAL      S0CIAS = @PCIAS                                                  
FQ842C                   EVAL      S0DLGA = @PDLGA                                                  
FQ842C                   EVAL      S0NPCO = @PNPCO                                                  
FQ842C                   EVAL      S0TPED = @PTPED                                                  
FQ842C                   EVAL      S0DATP = @PDATP                                                  
FQ842C                   EVAL      S0NOPL = @PNOPL                                                  
FQ842C     KCOCAPE       CHAIN     COCAPE                                                           
b0142C                   IF        %FOUND(COCAPE)                                                   
FQ842C                   IF        S0EDLG='1'                                                       
FQ842C                   EXSR      CS_CHGLOGE                                                       
FQ842C                   ELSE                                                                       
FQ842C                   IF        S0MOST<>'1'                                                      
FQ842C                   EVAL      P7CIAS=S0CIAS                                                    
FQ842C                   EVAL      P7DLGA=S0DLGA                                                    
FQ842C     KPMEMPR       CHAIN     PMEMPR                                                           
FQ842C                   IF        %FOUND(PMEMPR) AND P7AUTS<>*BLANKS                               
FQ842C*                  IF        %FOUND(PMEMPR)                                                   
FQ842C                   EXSR      CS_CHGLOGE                                                       
FQ842C                   ENDIF                                                                      
FQ842C                   ENDIF                                                                      
FQ842C                   ENDIF                                                                      
FQ842C                   ENDIF                                                                      
FQ842C                   ENDSR                                                                      
FQ842 **************************************************************************                    
FQ842 * SUBRUTINA CAMBIAR LOGÍSTICA DE ENTREGA                                 *                    
FQ842 *------------------------------------------------------------------------*                    
FQ842C     CS_CHGLOGE    BEGSR                                                                      
FQ842C                   EVAL      S5CIAS=S0CIAS                                                    
FQ842C                   EVAL      S5DLGA=S0DLGA                                                    
FQ842C                   EVAL      S5NPCO=S0NPCO                                                    
FQ842C                   EVAL      S5TPED=S0TPED                                                    
FQ842C                   EVAL      S5DATP=S0DATP                                                    
FQ842C                   EVAL      S5NOPL=S0NOPL                                                    
FQ842C     KCODEPE       SETLL     CODEPE                                                           
FQ842C     KCODEPE       READE     CODEPE                                                           
FQ842C                   DOW       NOT %EOF(CODEPE)                                                 
      *                                                                                             
Q0258**CR554c                   if            s5lb2b <> *blanks                                     
Q0258**CR554c                             and s5tped = '25'                                         
Q0258**CR554c                   ITER                                                                
Q0258**CR554c                   endif                                                               
Q0258 *                                                                                             
Q0258c                   if            s5lb2b = *blanks                                             
Q0258c                              or s5tped <> '25'                                               
      *                                                                                             
FQ842C                   EVAL      M0CIAS=S5CIAS                                                    
FQ842C                   EVAL      M0LOGE=S5LOGE                                                    
FQ842C     KMSALMA05     CHAIN     MSALMA05                                                         
FQ842C                   IF        %FOUND(MSALMA05)                                                 
HD123C                             AND (M0TAL1<>'7' OR M0TAL1<>'8')                                 
FQ842C                   EVAL      T3CIAS=M0CIAS                                                    
FQ842C                   EVAL      T3DLGA=M0DLGA                                                    
FQ842C     KEDPARM       CHAIN     EDPARM                                                           
FQ842C                   IF        %FOUND(EDPARM) AND T3OPL1<>*BLANKS AND                           
FQ844C                             T3OPL1<>S5LOGE                                                   
HD123C                             AND S5LOGE<>T3LVIR                                               
FQ842C                   EXSR      CS_UT2725                                                        
FQ842C                   EVAL      S5LOGE=T3OPL1                                                    
CR554c                   exsr      CS_set_s5lb2b                                                    
FQ842C                   UPDATE    RCODEPE                                                          
FQ842C                   ENDIF                                                                      
FQ842C                   ENDIF                                                                      
Q0258 *                                                                                             
Q0258c                   endif                                                                      
Q0258 *                                                                                             
FQ842C     KCODEPE       READE     CODEPE                                                           
FQ842C                   ENDDO                                                                      
FQ842C                   ENDSR                                                                      
FQ842 **************************************************************                                
FQ842 * FICHERO AUDITORIA                                          *                                
FQ842 *------------------------------------------------------------*                                
FQ842C     CS_UT2725     BEGSR                                                                      
FQ842 *                                                                                             
FQ842C                   EVAL      @PECIAS=S5CIAS                                                   
FQ842C                   EVAL      @PEDLGA=S5DLGA                                                   
FQ842C                   EVAL      @PENPCO=S5NPCO                                                   
FQ842C                   EVAL      @PETPED=S5TPED                                                   
FQ842C                   EVAL      @PEDATP=S5DATP                                                   
FQ842C                   EVAL      @PENOPL=S5NOPL                                                   
FQ842C                   EVAL      @PELINE=S5LINE                                                   
FQ842C                   EVAL      @PEFILD='S5LOGE'                                                 
FQ842C                   EVAL      @PECAUD='CO51'                                                   
FQ842C                   EVAL      @PEVAL1=S5LOGE                                                   
FQ842C                   EVAL      @PEVAL2=T3OPL1                                                   
FQ842C                   EVAL      @PECLPR=S5CUST                                                   
FQ842C                   EVAL      @PEFILE='CODEPE'                                                 
FQ842 *                                                                                             
FQ842C                   CALL      'UT2725'                             55                          
FQ842C                   PARM                    @PECIAS                                            
FQ842C                   PARM                    @PEDLGA                                            
FQ842C                   PARM                    @PENPCO                                            
FQ842C                   PARM                    @PETPED                                            
FQ842C                   PARM                    @PEDATP                                            
FQ842C                   PARM                    @PENOPL                                            
FQ842C                   PARM                    @PELINE                                            
FQ842C                   PARM                    @PECLPR                                            
FQ842C                   PARM                    @PEFILE                                            
FQ842C                   PARM                    @PEFILD                                            
FQ842C                   PARM                    @PECAUD                                            
FQ842C                   PARM                    @PEVAL1                                            
FQ842C                   PARM                    @PEVAL2                                            
FQ842C                   PARM      *BLANKS       @PEACCI                                            
FQ842C                   PARM      *BLANKS       @PEERR                                             
FQ842C                   PARM      SDSPGM        @PEPGMO                                            
FQ842C                   PARM      *BLANKS       @PEARVM                                            
FQ842 *                                                                                             
FQ842C                   ENDSR                                                                      
CR554 *····························································*                                
CR554 * Actualizar campo S5LB2B                                    *                                
CR554 *····························································*                                
CR554 *                                                                                             
CR542C     CS_set_s5lb2b BEGSR                                                                      
CR554 *                                                                                             
CR554c                   eval      u_l = %lookup(s5loge:zxLogS)                                     
CR554c                   if        u_l <> *zero and u_l <> 4                                        
CR554c                   if        s5lb2b = *blank                              ????????????????    
CR554c                   move      zxOrd(u_l)    s5lb2b                                             
CR554c                   endif                                                                      
CR554c                   endif                                                                      
CR554 *                                                                                             
CR554c                   endsr                                                                      
CR554 *                                                                                             
C1636 **********************************************************************                        
C1636 * Comprobar Stock Artículos "B"                                                               
C1636 **********************************************************************                        
C1636C     CS_VFYARTB    BEGSR                                                                      
C1636 *                                                                                             
C1636c                   eval      zycant = 1                                                       
C1636c                   eval      m5cias = s5cias                                                  
C1636c                   movel     @pcias        ppcias                                             
C1636 *                                                                                             
C1636 * Miramos si es Conjunto de Venta                                                             
C1636c                   eval      FileCojc_erp= 'PURLIBF' + ppcias +                               
C1636c                                          '/MSCOJC'                                           
C1636c                   open(e)   MSCOJC                                                           
C1636c                   if        not %error                                                       
C1636c                   eval      ndcias = s5cias                                                  
C1636c                   eval      ndarti = s5arti                                                  
C1636c                   eval      ndvari = s5vari                                                  
C1636c                   eval      ndmode = s5mode                                                  
C1636c                   eval      ndtcoj = '4'                                                     
C1636c     kmscojc       chain     MSCOJC                                                           
C1636c                   if        %found and ndbaja < '1'                                          
C1636c                   close(e)  MSCOJC                                                           
C1636c                   LEAVESR                                                                    
C1636c                   endif                                                                      
C1636c                   close(e)  MSCOJC                                                           
C1636 *                                                                                             
C1636 * Logística asociada a la delegación                                                          
C1636c                   eval      micias = p7cias                                                  
C1636c                   eval      midlga = p7dlga                                                  
C1636c                   eval      milgca = p7logs                                                  
C1636c     kmsload       chain     MSLOAD                                                           
C1636c     kmsload       chain     MSLOGI                                                           
C1636c                   if        %found(MSLOAD) and %found(MSLOGI)                                
C1636c                   eval      m0cias = s0cias                                                  
C1636c                   eval      m0loge = p7logs                                                  
C1636c     kmsalma05     chain     MSALMA05                                                         
C1636c                   if        %found                                                           
C1636 * Busco su Categoría de Rotación                                                              
C1636c                   eval      m1cias = s5cias                                                  
C1636c                   eval      m1arti = s5arti                                                  
C1636c                   eval      m1vari = s5vari                                                  
C1636c                   eval      m1mode = s5mode                                                  
C1636c                   eval      m1maga = m0maga                                                  
C1636c     kmsstok       chain     MSSTOK                                                           
C1636c                   if        %found and m1crot = 'B'                                          
C1636 * Busco Stock en el Almacén de la logística                                                   
C1636c                   eval      m1cias = s5cias                                                  
C1636c                   eval      m1arti = s5arti                                                  
C1636c                   eval      m1vari = s5vari                                                  
C1636c                   eval      m1mode = s5mode                                                  
C1636c                   eval      m1maga = m0maga                                                  
C1636c                   eval      m1cali = 'A'                                                     
C1636c     kmssto010     chain     MSSTO01                                                          
C1636c                   if        %found                                                           
C1636                                                                                               
C1636c                   eval      zystdd  = *zero                                                  
C1636c                   eval      zystka  = *zero                                                  
C1636c                   eval      zycans0 = *zero                                                  
C1636c                   eval      zycane0 = *zero                                                  
C1636c                   eval      zydepo0 = *zero                                                  
C1636c                   eval      z1cant = s5cant - s5canr - s5cans                                
C1636                                                                                               
C1636 * Solo tratamos si el almacén tiene stock                                                     
C1636c                   if        m1sact > *zero                                                   
C1636c                   eval      zystka = m1sact                                                  
C1636 * Busqueda cantidades de stock pdte servir,fabricar,deposito...                               
C1636c                   exsr      cs_Rtv_Stk                                                       
C1636 * Stock disponible                                                                            
C1636c                   eval      zystdd = zystka - zycans0 - zycane0                              
C1636c                   if        zydepo0 > *zero                                                  
C1636c                   eval      zystdd = zystdd - zydepo0                                        
C1636c                   endif                                                                      
C1636c                   eval      t2dart = s5arti + s5vari + s5mode                                
C1636c                   eval      t2dcan = z1cant                                                  
C1636c                   eval      t2ddis = zystdd                                                  
C1636c                   eval      t2dalm = m1maga                                                  
C1636 * Si stock disponible es mayor o igual a cantidad pedido                                      
C1636c                   if        zystdd >= z1cant                                                 
C1636c                   eval      t2va14 = 1                                                       
C1636c                   endif                                                                      
C1636c                   endif                                                                      
C1636c                   endif                                                                      
C1636c                   endif                                                                      
C1636c                   endif                                                                      
C1636c                   endif                                                                      
C1636c                   endif                                                                      
C1636 *                                                                                             
C1636c                   ENDSR                                                                      
C1636 **********************************************************************                        
C1636 *  Busqueda cantidades de stock pdte servir,fabricar,deposito...                              
C1636 **********************************************************************                        
C1636C     cs_Rtv_Stk    BEGSR                                                                      
C1636                                                                                               
C1636C                   EVAL      @PEDATD=*DATE                                                    
C1636C                   EVAL      @PEDATH=*DATE                                                    
C1636C                   MOVE      @PEDATD       ZXDATD                                             
C1636C                   MOVE      @PEDATH       ZXDATH                                             
C1636C                   SUBDUR    1000  :*D     ZXDATD                                             
C1636C                   ADDDUR    1000  :*D     ZXDATH                                             
C1636C                   MOVE      ZXDATD        @PEDATD                                            
C1636C                   MOVE      ZXDATH        @PEDATH                                            
C1636                                                                                               
C1636C                   EVAL      @PECIAS=M1CIAS                                                   
C1636C                   EVAL      @PEARTI=M1ARTI                                                   
C1636C                   EVAL      @PEVARI=M1VARI                                                   
C1636C                   EVAL      @PEMODE=M1MODE                                                   
C1636                                                                                               
C1636C                   EVAL      M5CIAS=M1CIAS                                                    
C1636C                   EVAL      M5ARTI=M1ARTI                                                    
C1636C                   EVAL      M5VARI=M1VARI                                                    
C1636C                   EVAL      M5MODE=M1MODE                                                    
C1636C     KMSARTI00     CHAIN     MSARTI00                           81                            
C1636                                                                                               
C1636 * Pendiente de servir                                                                         
C1636C                   EVAL      @PETISE=' '                                                      
C1636C                   CALL      'MM2600'                                                         
C1636C                   PARM                    @PECIAS                                            
C1636C                   PARM      ZZDLGA        @PEDLGA                                            
C1636C                   PARM                    @PEARTI                                            
C1636C                   PARM                    @PEVARI                                            
C1636C                   PARM                    @PEMODE                                            
C1636C                   PARM                    @PETCOJ                                            
C1636C                   PARM                    @PEDATD                                            
C1636C                   PARM                    @PEDATH                                            
C1636C                   PARM                    @PECUST                                            
C1636C                   PARM      0             @PECANT                                            
C1636C                   PARM      0             @PECAN1                                            
C1636C                   PARM                    M1MAGA                                             
C1636C                   PARM                    @PETISE           4                                
C1636C                   PARM      '1'           @PERRO            1                                
C1636C                   EVAL      zycans0 = @PECANT * zycant                                       
C1636                                                                                               
C1636 * Pendiente de traspasos depositos                                                            
C1636C                   EVAL      @PETISE=' '                                                      
C1636C                   CALL      'MM2604'                                                         
C1636C                   PARM                    @PECIAS                                            
C1636C                   PARM      ZZDLGA        @PEDLGA                                            
C1636C                   PARM                    @PEARTI                                            
C1636C                   PARM                    @PEVARI                                            
C1636C                   PARM                    @PEMODE                                            
C1636C                   PARM                    @PETCOJ                                            
C1636C                   PARM                    @PEDATD                                            
C1636C                   PARM                    @PEDATH                                            
C1636C                   PARM      0             @PECANT                                            
C1636C                   PARM      0             @PECAN1                                            
C1636C                   PARM                    M1MAGA                                             
C1636C                   PARM                    @PETISE           4                                
C1636C                   PARM      *BLANKS       @PERRO            1                                
C1636C                   EVAL      zydepo0 = @PECANT * zycant                                       
C1636                                                                                               
C1636 * Esto solo para empresas que utilizan nuestra produccion                                     
C1636c                   eval      @PECAN1=0                                                        
C1636c                   eval      @PECAN2=0                                                        
C1636c                   IF        ZZTCIA='1' OR ZZTCIA='2'                                         
C1636c                   EVAL      @PEDATD=*DATE                                                    
C1636c                   EVAL      @PEDATH=*DATE                                                    
C1636c                   MOVE      @PEDATD       ZXDATD                                             
C1636c                   MOVE      @PEDATH       ZXDATH                                             
C1636c                   SUBDUR    1000  :*D     ZXDATD                                             
C1636c                   ADDDUR    1000  :*D     ZXDATH                                             
C1636c                   MOVE      ZXDATD        @PEDATD                                            
C1636c                   MOVE      ZXDATH        @PEDATH                                            
C1636 * Solo realizaré la búsqueda en artículos susceptibles de ser utilizados en                   
C1636 * es decir, que sean estructuras o componentes.                                               
C1636c     KMSARTI00     CHAIN     PMCAOR01                           81                            
C1636c                   IF        CHAIN=*ON                                                        
C1636c     KMSARTI00     CHAIN     PMCAOR08                           81                            
C1636c                   ENDIF                                                                      
C1636                                                                                               
C1636 * Búsqueda de las necesidades a tener en cuenta en OF's                                       
C1636C                   EVAL      @PECAN1=0                                                        
C1636C                   EVAL      @PECAN2=0                                                        
C1636C     KMSARTI00     CHAIN     PMDEOR05                           81                            
C1636C                   IF        CHAIN=*OFF                                                       
C1636 * Si MÑSNCC>='1', entonces (DOLL) se desea que se presente el                                 
C1636 * material asignado                                                                           
C1636C                   EVAL      @PERRO=*BLANKS                                                   
C1636C                   CALL      'MM2602'                                                         
C1636C                   PARM                    @PECIAS                                            
C1636C                   PARM                    @PEARTI                                            
C1636C                   PARM                    @PEVARI                                            
C1636C                   PARM                    @PEMODE                                            
C1636C                   PARM                    @PEDATD                                            
C1636C                   PARM                    @PEDATH                                            
C1636C                   PARM      0             @PECAN1                                            
C1636C                   PARM      0             @PECAN2                                            
C1636C                   PARM                    M1MAGA                                             
C1636C                   PARM                    M5MAGD                                             
C1636C                   PARM                    @PERRO                                             
C1636C                   ENDIF                                                                      
C1636C                   ENDIF                                                                      
C1636C                   EVAL      zycane0 = @PECAN2 * zycant                                       
C1636                                                                                               
C1636C                   ENDSR                                                                      
C1636 *                                                                                             
C1636 *                                                                                             
C1636 *                                                                                             
C1636 *                                                                                             
C1579 ******************************************************************                            
C1579 * MIRAMOS SI EL PEDIDO ES POOLWEB Y RECUPERAMOS EL PROVEEDOR                                  
C1579 **********************************************************************                        
C1579C     CS_POOLWEB    BEGSR                                                                      
C1579 *                                                                                             
C1579C                   eval      zxpweb='0'                                                       
C1579 *                                                                                             
C1579 * Para saber si es un proveedor Poolweb,lo buscamos en la tabla                               
C1579 * PWEB con la procedencia del pedido.                                                         
C1579C                   eval      pecias=@pcias                                                    
C1579C                   eval      pectab='PWEB'                                                    
C1579C                   eval      peclta=s0pped                                                    
C1579C     kpmtabd       chain     pmtabd                                                           
C1579                                                                                               
C1579C                   if        %found(pmtabd)                                                   
C1579C                   eval      zxpweb='1'                                                       
C1579C                   endif                                                                      
C1579                                                                                               
C1579C                   ENDSR                                                                      
IT228 **************************************************************                                
IT228 * GUARDA LOGISTICA DEL OL                                    *                                
IT228 *------------------------------------------------------------*                                
IT228C     CS_LOGOL      BEGSR                                                                      
IT228 * Add-begin                                                                                   
                  i2ol = *zero;                                                                     
                  open msalma08;                                                                    
                  setll (@PCIAS:'8') msalma08;                                                      
                  reade (@PCIAS:'8') msalma08;                                                      
                  dow not %eof(msalma08);                                                           
                    if m0tal1 = '8' and m0baja <> '1' and                                           
                        i2OL < %elem(T_logol) ;                                                     
                      i2OL += 1;                                                                    
                      T_logol(i2OL) = m0logs;                                                       
                    endif;                                                                          
                    reade (@PCIAS:'8') msalma08;                                                    
                  enddo;                                                                            
                  close msalma08;                                                                   
IT228 * Add-end                                                                                     
IT228C                   ENDSR                                                                      
IT228 **************************************************************                                
IT228 * RECALCULAR LOGISTICA VIRTUAL                               *                                
IT228 *------------------------------------------------------------*                                
IT228 *                                                                                             
IT228C     LOG_VIRTUAL   BEGSR                                                                      
IT228 *                                                                                             
IT228 * Obtener logística virtual                                                                   
IT228 *                                                                                             
IT228C                   CALL      'MM1411'                                                         
IT228C                   PARM                    s5CIAS                                             
IT228C                   PARM      S5LOGE        @PALMA                                             
IT228C                   PARM      '1'           @PTIPO                                             
IT228C                   PARM                    s5DLGA                                             
IT228C                   PARM      *blanks       @PRESP                                             
IT228 *                                                                                             
IT228C                   IF        @PRESP <> *BLANKS                                                
IT228C                   EVAL      M0MAGA = @PRESP                                                  
IT228C                   ENDIF                                                                      
IT228C                   ENDSR                                                                      
IT228 *                                                                                             
IT228 ******************************************************************                            
IT228 *   Recuperar almacén a partir de la logística del pedido venta                               
IT228 **********************************************************************                        
IT228C     SRrecu        BEGSR                                                                      
IT228C                                                                                              
IT228C                   EVAL      M5CIAS = S5CIAS                                                  
IT228C                   EVAL      M1MAGA = @PRESP                                                  
IT228C                   EVAL      M1ARTI = S5ARTI                                                  
IT228C                   EVAL      M1VARI = S5VARI                                                  
IT228C                   EVAL      M1MODE = S5MODE                                                  
IT228 *                                                                                             
IT228c     KMSSTOK       CHAIN     MSSTOK                             90                            
IT228C                   IF        %FOUND                                                           
IT228C                   IF        m1prvr <> *blanks                                                
IT228C                   movel     M1PRVR        ZXPRV                                              
IT228C                   ENDIF                                                  ECSTK <= *ZEROS     
IT228C                   ENDIF                                                  ECSTK <= *ZEROS     
IT228 *                                                                                             
IT228C                   ENDSR                                                                      
I0184 ******************************************************************************************    
I0184 * OBTENER PLANTA PARA ACCEDER A DATOS DEL ARTÍCULO                                            
I0184 ******************************************************************************************    
I0184 *                                                                                             
I0184P GET_FACI        B                                                                            
I0184D GET_FACI        PI                  LIKE(MMCIAS)                                             
I0184D   @DIVI                             LIKE(MMPROP) VALUE                                       
I0184D   @FACI                             LIKE(MMCIAS) VALUE                                       
I0184D   @ITNO                             LIKE(MMITNO) VALUE                                       
I0184 *                                                                                             
I0184C                   IF        ZXMULTIPLA                                                       
I0184 *                                                                                             
I0184 * Si existe registro en ZAQITN en el que la división es propietaria, entonces                 
I0184 * se devuelve la planta propietaria del artículo.                                             
I0184 *                                                                                             
I0184C                   EVAL      MMITNO = @ITNO                                                   
I0184C     KZAQITN00     CHAIN     ZAQITN00                                                         
I0184C                   IF        %FOUND  AND  MMPROP = @DIVI  AND                                 
I0184C                             MMCIAS <> *BLANKS                                                
I0184C                   RETURN    MMCIAS                                                           
I0184C                   ENDIF                                                                      
I0184 *                                                                                             
I0184 * Si la división no es la propietaria, se hace bucle sobre la tabla FACP y                    
I0184 * se devuelve la primera para la que exista MITFAC                                            
I0184 *                                                                                             
I0184C                   MOVEL(P)  MXCONO        M9CONO                                             
I0184C                   EVAL      M9ITNO = @ITNO                                                   
I0184 *                                                                                             
I0184C                   EVAL      T1CTAB = 'FACP'                                                  
I0184C                   EVAL      T1DESC = @DIVI                                                   
I0184C     KGMTABD01     SETLL     GMTABD01                                                         
I0184C     KGMTABD01     READE     GMTABD01                                                         
I0184 *                                                                                             
I0184C                   DOW       NOT %EOF                                                         
I0184 *                                                                                             
I0184C                   EVAL      M9FACI = T1CELE                                                  
I0184C     KMITFAC00     SETLL     MITFAC00                                                         
I0184C                   IF        %EQUAL                                                           
I0184C                   RETURN    M9FACI                                                           
I0184C                   ENDIF                                                                      
I0184 *                                                                                             
I0184C     KGMTABD01     READE     GMTABD01                                                         
I0184C                   ENDDO                                                                      
I0184 *                                                                                             
I0184C                   ENDIF                                                                      
I0184 *                                                                                             
I0184 * Si la división no es multiplanta, o la búsqueda anterior no ha dado frutos,                 
I0184 * devolver la planta entrada                                                                  
I0184 *                                                                                             
I0184C                   RETURN    @FACI                                                            
I0184 *                                                                                             
I0184P                 E                                                                            
