      **************************************************************                                
      * APLICACIÓ: MÒDUL COMERCIAL                                 *                                
      **************************************************************                                
      * TITOL: ED0100  © FLUIDRA SERVICES                          *                                
      * DATA CREACIO:  25/01/2010                                  *                                
      * FUNCIO DEL PROGRAMA: Entregas Directas.                    *                                
      *                      Trazabilidad y auditoría.             *                                
      * Este programa mantiene los archivos EDTRLP y EDTRAU.       *                                
      *                                                            *                                
      * DOCUMENTACIÓN PARAMETROS:                                  *                                
      * @PCIAS   CIAS DE CLAVE PEDIDO                              *                                
      * @PDLGA   DLGA DE CLAVE PEDIDO                              *                                
      * @PNPCO   NPCO DE CLAVE PEDIDO                              *                                
      * @PTPED   TPED DE CLAVE PEDIDO                              *                                
      * @PDATP   DATP DE CLAVE PEDIDO                              *                                
      * @PNOPL   NOPL DE CLAVE PEDIDO                              *                                
      * @PLINE   LINE DE CLAVE PEDIDO                              *                                
      * @PCIA2   CIAS DE CLAVE PEDIDO PRODUCTIVA O TRACE           *                                
      * @PDLG2   DLGA DE CLAVE PEDIDO PRODUCTIVA O TRACE           *                                
      * @PNPC2   NPCO DE CLAVE PEDIDO PRODUCTIVA O TRACE           *                                
      * @PTPE2   TPED DE CLAVE PEDIDO PRODUCTIVA O TRACE           *                                
      * @PDAT2   DATP DE CLAVE PEDIDO PRODUCTIVA O TRACE           *                                
      * @PNOP2   NOPL DE CLAVE PEDIDO PRODUCTIVA O TRACE           *                                
      * @PLIN2   LINE DE CLAVE PEDIDO PRODUCTIVA O TRACE           *                                
      * @PLOGI   LF CLAVE PRINCIPAL(0=CIAL-VTA,1=CIAL-COMP,2=PROD,3=OL)*                            
      * @PORIG   ORIGEN ENTORNO CALL (1=COMERCIAL,2=PROD,3=TRACE)  *                                
      * @PEDAU   CÓDIGO DE AUDITORÍA                               *                                
      * @PERAV   CÓDIGO DE AVISO O ERROR                           *                                
      * @PTEXT   TEXTO LIBRE                                       *                                
      * @PDATO   PARAMETROS PARA LLAMAR A PROGRAMA SECUNDARIO      *                                
      * @PWAUD   GRABAR AUDITORIA EN EDTRAU (0=NO,1=SÍ)            *                                
      * @PCANT   CANTIDAD                                          *                                
      *                                                            *                                
      **************************************************************                                
FQ604 * Modificación: FQ604                                        *                                
FQ604 *        Autor: Josep Aragonès                               *                                
FQ604 * Fecha Inicio: 12/05/2010                                   *                                
FQ604 *  Descripción: Fluidra direct. Gestión Observaciones.       *                                
FQ604 *                               Método entrega.              *                                
FQ604 **************************************************************                                
02070 *      Modificació: 02070                                    *                                
02070 *            Autor: Josep Aragonès                           *                                
02070 * Data modificació: 02/07/2010                               *                                
02070 *       Descripció: FDR Direct. Decimales Conjuntos y X-doc  *                                
24080 **************************************************************                                
24080 *      Modificació: 24080                                    *                                
24080 *            Autor: Lluis Campo & Josep Aragonès             *                                
24080 * Data modificació: 24/08/2010                               *                                
24080 *       Descripció: Nous Camps EDTRLP. Auditoria 227         *                                
FQ607 **************************************************************                                
FQ607 *      Modificació: FQ607                                    *                                
FQ607 *            Autor: Josep Aragonès                           *                                
FQ607 * Data modificació: 27/08/2010                               *                                
FQ607 *       Descripció: Circuit de Incidéncies. Auditoria 028    *                                
FQ607 **************************************************************                                
In185 *      Modificació: In185                                    *                                
In185 *            Autor: Josep Aragonès                           *                                
In185 * Data modificació: 14/09/2010                               *                                
In185 *       Descripció: Incidencia 185. T0CANP no restaba        *                                
In185 **************************************************************                                
In192 *      Modificació: In192                                    *                                
In192 *            Autor: Josep Aragonès                           *                                
In192 * Data modificació: 17/09/2010                               *                                
In192 *       Descripció: TPE4=' ' a COCAPE si totes lineas son EN *                                
In192 **************************************************************                                
In193 *      Modificació: In193                                    *                                
In193 *            Autor: Josep Aragonès                           *                                
In193 * Data modificació: 20/09/2010                               *                                
In193 *       Descripció: Actualitzar T0CANS segons conver.Unitats *                                
In193 **************************************************************                                
FQ710 *      Modificació: FQ710                                    *                                
FQ710 *            Autor: Josep Aragonès                           *                                
FQ710 * Data modificació: 27/09/2010  &  07/10/2010                *                                
FQ710 *       Descripció: Importe mínimo por expedición            *                                
FQ710 **************************************************************                                
20100 *      Modificació: 20100                                    *                                
20100 *            Autor: Josep Aragonès                           *                                
20100 * Data modificació: 20/10/2010                               *                                
20100 *       Descripció: Nuevos eventos reserva/desreserva Cial   *                                
20100 *                   y cargo Portes                           *                                
20100 **************************************************************                                
FQ726 * Modificación: FQ726                                        *                                
FQ726 *        Autor: Josep Aragonès                               *                                
FQ726 * Fecha Inicio: 04/11/2010                                   *                                
FQ726 *  Descripción: Parametrización Certikin y Cías Extrangeras  *                                
FQ726 **************************************************************                                
In214 *      Modificació: In214                                    *                                
In214 *            Autor: Josep Aragonès                           *                                
In214 * Data modificació: 26/01/2010                               *                                
In214 *       Descripció: Auditar Event 22                         *                                
In214 **************************************************************                                
12041 *      Modificació: 12041                                    *                                
12041 *            Autor: Josep Aragonès                           *                                
12041 * Data modificació: 12/04/2011                               *                                
12041 *       Descripció: Evitar que es cridi @PNPCO=*BLANKS       *                                
12041 **************************************************************                                
10051 *      Modificació: 10051                                    *                                
10051 *            Autor: Josep Aragonès                           *                                
10051 * Data modificació: 10/05/2011                               *                                
10051 *       Descripció: Desdoblar EDTRLP en conjunts SIOL='2'    *                                
10051 **************************************************************                                
14N12 *      Modificació: 14N12                                    *                                
14N12 *            Autor: Josep Aragonès                           *                                
14N12 * Data modificació: 14/11/2012                               *                                
14N12 *       Descripció: Traçabilitat GIC                         *                                
14N12 **************************************************************                                
14N12 *      Modificació: 14N12  correcció 28N12                   *                                
14N12 *            Autor: Josep Aragonès                           *                                
14N12 * Data modificació: 14/11/2012                               *                                
14N12 *       Descripció: Traçabilitat GIC                         *                                
14N12 **************************************************************                                
FDX01 *      Modificació: FDX01                                                                     
FDX01 *            Autor: Carlos del Valle                                                          
FDX01 * Data modificació: 03/01/2013                                                                
FDX01 *       Descripció: Fluidra Direct: Correcciones y mejoras                                    
FDX01 **************************************************************                                
C1328 * DATA DE MODIFICACIÓ: 16/10/2013  MARCA: C1328  CR: 1328    *                                
C1328 * DOCUMENTACIÓ: Entrega Directa Desde Productiva             *                                
C1328 **************************************************************                                
C1350 *      Modificació: CR1350                                                                    
C1350 *            Autor: JORDI GONZALEZ                                                            
C1350 * Data modificació: 02/12/2013                                                                
C1350 *       Descripció: Fluidra Direct: BLOQUEO ALBARANES                                         
C1350 **************************************************************                                
C1328 * DATA DE MODIFICACIÓ: 31/03/2014  MARCA: H4034              *                                
C1328 * Helpdesk 224034                                            *                                
C1328 * DOCUMENTACIÓ: Entrega Directa Desde Productiva fallaba cuando*                              
C1328 * convertimos EN en ED                                       *                                
C1328 **************************************************************                                
C1579 * Modificación: CR1579                                       *                                
C1579 *        Autor: Javier Arbide                                *                                
C1579 * Fecha Inicio: 29/04/2014                                   *                                
C1579 *  Descripción: Envío automático pedidos recambios a Poolweb *                                
C1579 *               Generación albaranes de Compra-Venta Poolweb *                                
C1579 **************************************************************                                
20514 * DATA DE MODIFICACIÓ: 20/05/2014  MARCA: 20514              *                                
20514 * Helpdesk 230047                                            *                                
20514 * DOCUMENTACIÓ: No llegan envía e_mail si tenemos evento     *                                
20514 *               traducido en idioma.                         *                                
20514 **************************************************************                                
C1544 * DATA DE MODIFICACIÓ: 12/05/2014  MARCA: C1544              *                                
C1544 *               Autor: JLMARTIN                                                               
C1544 * DOCUMENTACIÓ: LAST CALL                                    *                                
C1544 **************************************************************                                
C2185 **************************************************************                                
C2185 * DATA DE MODIFICACIÓ: 22/01/2015  MARCA: C2185              *                                
C2185 * AUTOR: Javier Arbide                                       *                                
C2185 * DOCUMENTACIÓ: 042-Eroski Orders                            *                                
C2185 *               Actualización del fichero de trazabilidad    *                                
C2185 *               EDITRC con los datos del pedido TRACE        *                                
C2185 **************************************************************                                
C2501 * DATA DE MODIFICACIÓ: 18/02/2015  MARCA: C2501              *                                
C2501 * AUTOR: Javier Arbide                                       *                                
C2501 * DOCUMENTACIÓ: 042-Indicar qué clientes llevan etiquetado   *                                
C2501 *               especial                                     *                                
C2501 *               Se grabará en EDITRC si no existe el pedido  *                                
C2501 *               Es un pedido manual que no ha entrado por EDI*                                
C2501 **************************************************************                                
C2185 **************************************************************                                
C2185 * DATA DE MODIFICACIÓ: 22/01/2015  MARCA: R2185              *                                
C2185 * AUTOR: JMARTINEZP                                          *                                
C2185 * DOCUMENTACIÓ: INCIDENCIA                                   *                                
C2185 **************************************************************                                
C2616 * DATA DE MODIFICACIÓ: 08/04/2015  MARCA: C2616              *                                
C2616 * AUTOR: Josep Aragonès                                      *                                
C2616 * DOCUMENTACIÓ: Càlcul status EDTRLP en la desreserva        *                                
C2616 **************************************************************                                
C2559 * DATA DE MODIFICACIÓ: 18/03/2015  MARCA: C2559      CR2559  *                                
C2559 * AUTOR: Javier Arbide                                       *                                
C2559 * DOCUMENTACIÓ: Anulación artículos tipo B en pedidos        *                                
C2559 *               Incluir cierre autómatico líneas (EDAU=051)  *                                
C2559 **************************************************************                                
C2684 * DATA DE MODIFICACIÓ: 15/05/2015  MARCA: C2684                                               
C2684 * AUTOR: Celia Gerber                                                                         
C2684 * DOCUMENTACIÓ: Permitir cambiar la dirección de un pedido,      IAL                          
C2684 *               si la productiva retrocede el xdoc               IAL                          
C2684 **************************************************************************                    
C2673 * Modificación: CR2673                                       *                                
C2673 *        Autor: Javier Arbide                                *                                
C2673 * Fecha Inicio: 08/06/2015                                   *                                
C2673 *  Descripción: Control de pedidos Poolweb                   *                                
C2673 *               Control de eventos Prod_ext. como Poolweb    *                                
C2673 *               '501' - Prod_ext: Alta linea pedido          *                                
C2673 *               '515' - Prod_ext: Conf.linea pedido          *                                
C2673 **************************************************************                                
C2280 * Modificación: C2280                                        *                                
C2280 *        Autor: Josep Aragonès                               *                                
C2280 * Fecha Inicio: 07/03/2016                                   *                                
C2280 *  Descripción: Modis EDIS para Invictus                     *                                
C2280 **************************************************************                                
C3167 * DATA DE MODIFICACIÓ: 08/02/2016  MARCA: C3167                                               
C3167 * AUTOR: Manuel Alonso                                                                        
C3167 * DOCUMENTACIÓ: Añadir eventos 255 y 256  257 258                                             
C3167 *****************************************************************                             
C3477**************************************************************                                
C3477* Data de Modificació: 28/07/2016  Marca: C3477              *                                
C3477* Autor: Cecilio Ruiz                                        *                                
C3477* Documentació: 002 - Fmt 33 y C-6-20s                       *                                
C3477* ************************************************************                                
67007* DATA DE MODIFICACIÓ: 29/09/2021  MARCA: 67007              *                                
67007* AUTOR:        Lluís Albert Grau                            *                                
67007* DOCUMENTACIÓ: Cálculo del riesgo en pedidos programa       *                                
67007*               FSD-67007                                    *                                
67007**************************************************************                                
IT227* Fecha Inicio: 15/11/2021            MARCA: IT227 (ITOM227) *                                
IT227*       Autor : Manuel Alonso                                *                                
IT227* Descripción : Anular tratamiento EDTRLP.T0INFD como        *                                
IT227*               incidencia web Trace.                        *                                
IT227**************************************************************                                
IT228* Fecha Inicio: 17/01/2022            MARCA: IT228 (ITOM228) *                                
IT228*       Autor : Julián Campillo                              *                                
IT228* Descripción : Excepciones M3 en EDTRLP.T0INFD              *                                
IT228**************************************************************                                
NAP45* DATA DE MODIFICACIÓ: 21/06/2022  MARCA: NAP45              *                                
NAP45* AUTOR:        Raul Fernández                               *                                
NAP45* DOCUMENTACIÓ: Coenvío 3 graba número coenvío a blanco      *                                
NAP45**************************************************************                                
PG615* DATA DE MODIFICACIÓ: 22/02/2023  MARCA: PG615                                               
PG615* AUTOR:        David Grau                                                                    
PG615* DOCUMENTACIÓ: Retener pedidos cliente x bloqueo albaran                                     
PG615******************************************************************************************    
E7394* DATA DE MODIFICACIÓ: 22/02/2023  MARCA: E7394                                               
E7394* AUTOR:        MMontana                                                                      
E7394* DOCUMENTACIÓ: petades en italia, correcció                                                  
E7394******************************************************************************************    
     H DATEDIT(*YMD/)                                                                               
     H OPTION(*NODEBUGIO:*SRCSTMT)                                                                  
      *                                                                                             
     FEDTRLP00  UF A E           K DISK    RENAME(EDTRLP:REDTRLP00)                                 
     FEDTRLP10  UF A E           K DISK    RENAME(EDTRLP:REDTRLP10)                                 
     FEDTRLP20  UF A E           K DISK    RENAME(EDTRLP:REDTRLP20)                                 
     FEDTRLP30  UF A E           K DISK    RENAME(EDTRLP:REDTRLP30)                                 
C1350FEDTRLP40  UF A E           K DISK    RENAME(EDTRLP:REDTRLP40)                                 
21050FEDTRLD    IF A E           K DISK    RENAME(EDTRLP:REDTRLD)                                   
     FEDTRAU00  UF A E           K DISK    RENAME(EDTRAU:REDTRAU00)                                 
     FEDTRLX00  O  A E             DISK    RENAME(EDTRLX:REDTRLX00)                                 
     FEDTRAX00  O  A E             DISK    RENAME(EDTRAX:REDTRAX00)                                 
C2185FEDITRC    UF A E           K DISK                                                             
     FPMTAB2    IF   E           K DISK                                                             
      *                                                                                             
     FCOCAPE    UF   E           K DISK                                                             
     FCODEPE    UF   E           K DISK                                                             
     FCODEP2    IF   E           K DISK    PREFIX(C_)                                               
     FPUCAPE    UF   E           K DISK                                                             
     FPUDEPE    UF   E           K DISK                                                             
     FMSCOJD    IF   E           K DISK                                                             
     FCOXDOC    IF   E           K DISK                                                             
     FCOAPRP01  IF   E           K DISK                                                             
     FCOAPR101  IF   E           K DISK                                                             
24080FPMUNAL    IF   E           K DISK                                                             
24080FCOALBD10  IF   E           K DISK                                                             
24080FCOHALD10  IF   E           K DISK                                                             
FQ607FEDINCI30  IF   E           K DISK                                                             
FQ710FPMTABD    IF   E           K DISK    PREFIX(P_)                                               
FQ710FMSDIV0    IF   E           K DISK                                                             
FQ710FMSIVAS    IF   E           K DISK                                                             
FQ726FMSLOGI    IF   E           K DISK                                                             
FQ726FEDPARM    IF   E           K DISK                                                             
FQ726FPMEMPR    IF   E           K DISK                                                             
FQ726FMSTRG1    IF   E           K DISK                                                             
14N12FPVDEVI05  IF   E           K DISK                                                             
14N12FPVDEVD10  UF   E           K DISK                                                             
FDX01FMSARTI00  IF   E           K DISK                                                             
C1328FPUPROV    IF   E           K DISK    prefix(U_)                                               
C2501F*C1350*COCLIN    IF   E           K DISK    prefix(L_)                                        
C2501FMSCOJC    IF   E           K DISK                                                             
C2501FCODIPR    IF   E           K DISK    ExtFile(FileCodipr)                                      
C2501F                                     USROPN                                                   
C2501FCOCLIN    IF   E           K DISK    ExtFile(FileCoclin)                                      
C2501F                                     USROPN                                                   
C2501F                                     prefix(L_)                                               
C2501FCODEPE26  IF   E           K DISK    ExtFile(FileCodepe26)                                    
C2501F                                     USROPN                                                   
C2501F                                     prefix(DP_)                                              
C2501F                                     RENAME(RCODEPE:RCODEPE26)                                
C2501FCOCEDI    IF   E           K DISK    ExtFile(FileCocedi)                                      
C2501F                                     USROPN                                                   
C2501F                                     prefix(ED_)                                              
IT228FPUPRP0    IF   E           K DISK                                                             
      *                                                                                             
     D* AREA DE DADES DE PROGRAMA I INICIALITZACIO DE VALORS COMUNS                                 
     D                SDS                                                                           
     D  SDSPGM                 1     10                                                             
     D  SDSJOB               244    253                                                             
     D  SDSUSR               254    263                                                             
     D  SDSJNBR              264    269                                                             
FQ710                                                                                               
FQ710 * PLANTILLA D'INDICADORS DEL PROGRAMA (ELS RESERVATS NO SURTEN)                               
FQ710D  INDICADORS   E DS                  BASED(INDICADORP)                                        
FQ710D                                     EXTNAME(INDDS:RIND0199)                                  
FQ710D  INDICADORP     S               *   INZ(%ADDR(*IN))                                          
C2501D* AREA DE DADES DE PROGRAMA I INICIALITZACIO DE VALORS COMUNS                                 
C2501D**DSLDA        E DS                  EXTNAME(PURLDADS)                                        
C2501D**  CCCDEEM                    30    OVERLAY(ZZDEEM)                                          
                                                                                                    
      * PARAMETROS DE ENTRADA                                                                       
     D  @PCIAS         S                   LIKE(T0CIAS)                                             
     D  @PDLGA         S              5                                                             
     D  @PNPCO         S             10                                                             
     D  @PTPED         S              2                                                             
     D  @PDATP         S                   LIKE(T0DATP)                                             
     D  @PNOPL         S                   LIKE(T0NOPL)                                             
     D  @PLINE         S                   LIKE(T0LINE)                                             
     D  @PCIA2         S                   LIKE(T0CIAS)                                             
     D  @PDLG2         S              5                                                             
     D  @PNPC2         S             10                                                             
     D  @PTPE2         S              2                                                             
     D  @PDAT2         S                   LIKE(T0DATP)                                             
     D  @PNOP2         S                   LIKE(T0NOPL)                                             
     D  @PLIN2         S                   LIKE(T0LINE)                                             
     D  @PLOGI         S              1  0                                                          
     D  @PORIG         S              1  0                                                          
     D  @PEDAU         S              3                                                             
     D  @PERAV         S              3                                                             
     D  @PTEXT         S             50                                                             
     D  @PDATO         S            300                                                             
     D  @PWAUD         S              1  0                                                          
     D  @PCANT         S                   LIKE(T0CAN1)                                             
                                                                                                    
      *Variables para TIMESTAMP Movex                                                               
     D  ZXTIM1         S               Z                                                            
     D  ZXTIMESTAMP    S             26                                                             
      *                                                                                             
     D  ZXGRAU         S              1  0                                                          
     D  ZXARVM         S             25                                                             
     D  ZXEDST         S                   LIKE(T0EDST)                                             
C2501D  ZXEDITRC       S              1a   INZ('0')                                                 
C2501D  ZXCIAS         S              3a                                                            
C2501D  FileCoclin     S             21                                                             
C2501D  FileCodipr     S             21                                                             
C2501D  FileCodepe26   S             21                                                             
C2501D  FileCocedi     S             21                                                             
      *                                                                                             
      * Parámetros para E-Mail                                                                      
      *                                                                                             
     D  @EMJOBN        S             18                                                             
     D  @EMPGRE        S             10                                                             
     D  @EMEVEN        S              5                                                             
     D  @EMTENV        S              1                                                             
     D  @EMCIAA        S              3                                                             
     D  @EMDLGA        S              5                                                             
     D  @EMCODE        S             25                                                             
     D  @EMNDOC        S             25                                                             
     D  @EMFDOC        S              8                                                             
     D  @EMLDOC        S              3                                                             
     D  @EMEEMA        S            100                                                             
     D  @EMREMA        S            100                                                             
      *                                                                                             
      * Variables para SBMJOB                                                                       
      *                                                                                             
     D  ZXQCMG         S            500                                                             
     D  ZXLOGG         S             15  5 INZ(500)                                                 
     D  C              S              1A   DIM(1) CTDATA PERRCD(1)                                  
      *                                                                                             
      * Estructuras de datos para CODEP2                                                            
      *                                                                                             
     D                 DS                                                                           
     D  DSCODEP2               1     50                                                             
     D  ZDCOMP                 1     15                                                             
     D  ZDVAR2                16     18                                                             
     D  ZDMOD2                19     21                                                             
     D  ZDLIN3                22     24                                                             
      *                                                                                             
     D  ZGARVM         S                   LIKE(T0ARVM)                                             
     D  ZGCANT         S                   LIKE(T0CANT)                                             
     D  ZGCUST         S                   LIKE(T0CUST)                                             
     D  ZGTDI1         S                   LIKE(T0TDI1)                                             
     D  ZGDWR0         S                   LIKE(T0DWR0)                                             
     D  ZGHWR0         S                   LIKE(T0HWR0)                                             
     D  ZGUWR0         S                   LIKE(T0UWR0)                                             
     D  ZXCANT         S                   LIKE(T0CAN3)                                             
FQ710D  ZXUNIM         S                   LIKE(T0UNI3)                                             
02070D  ZYCANT         S             20S10                                                          
     D  ZXCANR         S                   LIKE(T0CAN3)                                             
     D  ZXCANS         S                   LIKE(T0CAN3)                                             
     D  ZXCOM1         S                   LIKE(T0CAN3)                                             
     D  ZXCOM2         S                   LIKE(T0CAN3)                                             
     D  ZXNP03         S                   LIKE(TKNP03)                                             
     D  ZXLI03         S                   LIKE(TKLI03)                                             
In192D  ZXLIED         S              1  0                                                          
FQ710D  ZXMONE2        S                   LIKE(S0MONE)                                             
FQ710D  ZXTIVC         S              1                                                             
FQ710D  XZAUXI1        S             29  9                                                          
FQ710D  ZXCOCAMB       S             15  9                                                          
FQ710D  @PCMCOCO       S             20  9                                                          
FQ710D  @PCMCCCO       S             20  9                                                          
FQ710D  @PDATA         S                   LIKE(S0DATP)                                             
FQ710D  @PHORA         S                   LIKE(S0NOPL)                                             
FQ710D  @PMON1         S                   LIKE(S0MONE)                                             
FQ710D  @PMON2         S                   LIKE(S0MONE)                                             
FQ710D  @PDTOE         S                   LIKE(S5DTO1)                                             
FQ710D  @PEERR         S              1                 INZ                                         
FQ710D  XZARTI         S                   LIKE(S5ARTI)                                             
FQ710D  XZVARI         S                   LIKE(S5VARI)                                             
FQ710D  XZMODE         S                   LIKE(S5MODE)                                             
FQ710D  XZCIAS         S                   LIKE(S5CIAS)                                             
FQ710DSDE              S              1A   DIM(10)                                                  
FQ710 *Ecotaxe                                                                                     
FQ710D    @PEECOP      S                   LIKE(S5ECOP)                                             
FQ710D    @PEFLCD      S                   LIKE(S5DATP)                                             
FQ710D    @PETAXE      S                   LIKE(S5PRCC)                                             
20100D  ZXART_PORTES   S                   LIKE(P_PEDESC)                                           
FQ726D  ZXDESCAUD      S                   LIKE(PEDESC)                                             
14N12D  ZXPEFD         S              1                                                             
                                                                                                    
FQ710D                 DS                                                                           
FQ710D  ZXBL65I                1      5                                                             
FQ710D    ZXPABI               1      1                                                             
FQ710                                                                                               
     D                 DS                                                                           
     D  DSTEXT                 1     50                                                             
     D  ZDNPRP                 1     10                                                             
     D  ZDEMBQ                12     21                                                             
     D  ZDXSGA                23     32                                                             
     D  ZDLSGA                34     36                                                             
14N12                                                                                               
14N12D                 DS                                                                           
14N12D  DSTRZD3                1     50                                                             
14N12D    DS3TIPO              1      1                                                             
14N12D    DS3CIAS              2      4                                                             
14N12D    DS3DLGA              5      9                                                             
14N12D    DS3NPCO             10     19                                                             
14N12D    DS3TPED             20     21                                                             
14N12D    DS3DATP             22     29                                                             
14N12D    DS3NOPL             30     35                                                             
14N12D    DS3LINE             36     38                                                             
14N12D    DS3BLAN             39     50                                                             
14N12                                                                                               
14N12D                 DS                                                                           
14N12D    X1AMPL               1    100                                                             
14N12D    V1PEFD              14     14                                                             
FQ607                                                                                               
FQ607D  S0AMPL         DS                                                                           
NAP45D    S0COEN               1      1                                                             
FQ607D    S0INFD              84     93                                                             
FQ607                                                                                               
24080D  S5AMPL         DS                                                                           
24080D    S5NCOE               1      2                                                             
24080D    S5NCOI              19     20                                                             
24080D    S5NCOF              21     22                                                             
FQ710D    S5ECOP              24     24                                                             
FQ607D    S5LINI              91     93                                                             
      *                                                                                             
C1328 * Entrega Directa Desde Productiva                                                            
C1328D  U_C0AMP2       DS                                                                           
C1328D    U_C0EDDP            65     65                                                             
C1328 *                                                                                             
C2501 *                                                                                             
C2501D  L_S0AMP3       DS                                                                           
C2501D    L_S0ETES            91     91                                                             
C2501 *                                                                                             
C2501D  S2AMP1         DS                                                                           
C2501D    S2ETES               1      1                                                             
IT228D  @PEARVP        S                   LIKE(T0ARVM)                                             
IT228D  @PEALM1        S                   LIKE(T0DLGA)                                             
IT228D  @PEALM2        S                   LIKE(T0DLGA)                                             
IT228D  @PEINFO        S              1                                                             
IT228D  @PEALMA        S                   LIKE(SAMAGA)                                             
IT228D  @PETIPO        S              1a                                                            
IT228D  @PERESP        S                   LIKE(SAMAGA)                                             
IT228 *                                                                                             
IT228D                 DS                                                                           
IT228D  P7AMP2                 1    100                                                             
IT228D    P7EDOM              10     10                                                             
IT228 *                                                                                             
PG615 * Array per guardar les comandes ja 'alineades'                                               
PG615d  T_npc2         s                   like(t0npc2) dim(999) inz                                
PG615 * Darrera posició utilitzada de T_npc2                                                        
PG615d  iLnpc2         s                   like(s5line) inz                                         
PG615 * Var auxiliar                                                                                
PG615d  iCnt           s                   like(s5line) inz                                         
PG615 * Estructura per cridar al MM1413                                                             
PG615d  pPointer       s               *                                                            
PG615d  dsMM1413       ds                                                                           
PG615d   bkcias                            like(s0cias)                                             
PG615d   bkdlga                            like(s0dlga)                                             
PG615d   bknpco                            like(s0npco)                                             
PG615d   bktped                            like(s0tped)                                             
PG615d   bkdatp                            like(s0datp)                                             
PG615d   bknopl                            like(s0nopl)                                             
PG615d   Tlin                              like(s5line) dim(999) inz(0)                             
      **********************************************************************                        
      * Estructura de Programa                                                                      
      **********************************************************************                        
     C                                                                                              
      * Entrada de parámetros                                                                       
     C     *ENTRY        PLIST                                                                      
     C                   PARM                    @PCIAS                                             
     C                   PARM                    @PDLGA                                             
     C                   PARM                    @PNPCO                                             
     C                   PARM                    @PTPED                                             
     C                   PARM                    @PDATP                                             
     C                   PARM                    @PNOPL                                             
     C                   PARM                    @PLINE                                             
     C                   PARM                    @PCIA2                                             
     C                   PARM                    @PDLG2                                             
     C                   PARM                    @PNPC2                                             
     C                   PARM                    @PTPE2                                             
     C                   PARM                    @PDAT2                                             
     C                   PARM                    @PNOP2                                             
     C                   PARM                    @PLIN2                                             
     C                   PARM                    @PLOGI                                             
     C                   PARM                    @PORIG                                             
     C                   PARM                    @PEDAU                                             
     C                   PARM                    @PERAV                                             
     C                   PARM                    @PTEXT                                             
     C                   PARM                    @PDATO                                             
     C                   PARM                    @PWAUD                                             
     C                   PARM                    @PCANT                                             
C2501 * Se elimina la LDA porque da error al llamarse el ED0100 x batch                             
C2501C**   *DTAARA       DEFINE    PURLDA        DSLDA                                              
C2501C**                 IN        DSLDA                                                            
      *                                                                                             
      * Montar KLIST                                                                                
      *                                                                                             
     C     KEDTRLP00     KLIST                                                                      
     C                   KFLD                    T0CIAS                                             
     C                   KFLD                    T0DLGA                                             
     C                   KFLD                    T0NPCO                                             
     C                   KFLD                    T0TPED                                             
     C                   KFLD                    T0DATP                                             
     C                   KFLD                    T0NOPL                                             
     C                   KFLD                    T0LINE                                             
      *                                                                                             
     C     KEDTRLP00X    KLIST                                                                      
     C                   KFLD                    T0CIAS                                             
     C                   KFLD                    T0DLGA                                             
     C                   KFLD                    T0NPCO                                             
     C                   KFLD                    T0TPED                                             
     C                   KFLD                    T0DATP                                             
     C                   KFLD                    T0NOPL                                             
     C                   KFLD                    T0LINE                                             
     C                   KFLD                    T0ARV1                                             
     C                   KFLD                    T0COM2                                             
10051 *                                                                                             
10051C     KEDTRLP00Z    KLIST                                                                      
10051C                   KFLD                    T0CIAS                                             
10051C                   KFLD                    T0DLGA                                             
10051C                   KFLD                    T0NPCO                                             
10051C                   KFLD                    T0TPED                                             
10051C                   KFLD                    T0DATP                                             
10051C                   KFLD                    T0NOPL                                             
10051C                   KFLD                    T0LINE                                             
10051C                   KFLD                    T0ARV1                                             
      *                                                                                             
     C     KEDTRLP10     KLIST                                                                      
     C                   KFLD                    T0CIA1                                             
     C                   KFLD                    T0DLG1                                             
     C                   KFLD                    T0NPC1                                             
     C                   KFLD                    T0TPE1                                             
     C                   KFLD                    T0DAT1                                             
     C                   KFLD                    T0NOP1                                             
     C                   KFLD                    T0LIN1                                             
      *                                                                                             
     C     KEDTRLP20     KLIST                                                                      
     C                   KFLD                    T0CIA2                                             
     C                   KFLD                    T0DLG2                                             
     C                   KFLD                    T0NPC2                                             
     C                   KFLD                    T0TPE2                                             
     C                   KFLD                    T0DAT2                                             
     C                   KFLD                    T0NOP2                                             
     C                   KFLD                    T0LIN2                                             
      *                                                                                             
     C     KEDTRLP20X    KLIST                                                                      
     C                   KFLD                    T0CIA2                                             
     C                   KFLD                    T0DLG2                                             
     C                   KFLD                    T0NPC2                                             
     C                   KFLD                    T0TPE2                                             
     C                   KFLD                    T0DAT2                                             
     C                   KFLD                    T0NOP2                                             
     C                   KFLD                    T0LIN2                                             
     C                   KFLD                    T0COM2                                             
      *                                                                                             
     C     KEDTRLP20F    KLIST                                                                      
     C                   KFLD                    T0CIA2                                             
     C                   KFLD                    T0DLG2                                             
     C                   KFLD                    T0NPC2                                             
     C                   KFLD                    T0TPE2                                             
     C                   KFLD                    T0DAT2                                             
     C                   KFLD                    T0NOP2                                             
     C                   KFLD                    T0LIN2                                             
     C                   KFLD                    T0COM2                                             
     C                   KFLD                    T0CIAS                                             
     C                   KFLD                    T0DLGA                                             
     C                   KFLD                    T0NPCO                                             
     C                   KFLD                    T0TPED                                             
     C                   KFLD                    T0DATP                                             
     C                   KFLD                    T0NOPL                                             
     C                   KFLD                    T0LINE                                             
     C                   KFLD                    T0ARV1                                             
     C                   KFLD                    T0NPC3                                             
     C                   KFLD                    T0LIN3                                             
      *                                                                                             
     C     KEDTRLP30     KLIST                                                                      
     C                   KFLD                    T0CIA3                                             
     C                   KFLD                    T0DLG3                                             
     C                   KFLD                    T0NPC3                                             
     C                   KFLD                    T0TPE3                                             
     C                   KFLD                    T0DAT3                                             
     C                   KFLD                    T0NOP3                                             
     C                   KFLD                    T0LIN3                                             
C1350 *                                                                                             
C1350C     KEDTRLP40     KLIST                                                                      
C1350C                   KFLD                    T0CIAS                                             
C1350C                   KFLD                    T0CUST                                             
      *                                                                                             
     C     KEDTRAU00     KLIST                                                                      
     C                   KFLD                    T1CIAS                                             
     C                   KFLD                    T1DLGA                                             
     C                   KFLD                    T1NPCO                                             
     C                   KFLD                    T1TPED                                             
     C                   KFLD                    T1DATP                                             
     C                   KFLD                    T1NOPL                                             
     C                   KFLD                    T1LINE                                             
     C                   KFLD                    T1ARV1                                             
     C                   KFLD                    T1COM2                                             
     C                   KFLD                    T1EDAU                                             
     C                   KFLD                    T1DATR                                             
     C                   KFLD                    T1HORR                                             
     C                   KFLD                    T1TMST                                             
      *                                                                                             
     C     KEDTRAU00X    KLIST                                                                      
     C                   KFLD                    T1CIAS                                             
     C                   KFLD                    T1DLGA                                             
     C                   KFLD                    T1NPCO                                             
     C                   KFLD                    T1TPED                                             
     C                   KFLD                    T1DATP                                             
     C                   KFLD                    T1NOPL                                             
     C                   KFLD                    T1LINE                                             
C2185 *                                                                                             
C2185C     KEDITRC       KLIST                                                                      
C2185C                   KFLD                    T5CIAS                                             
C2185C                   KFLD                    T5DLGA                                             
C2185C                   KFLD                    T5NPCO                                             
C2185C                   KFLD                    T5TPED                                             
C2185C                   KFLD                    T5DATP                                             
C2185C                   KFLD                    T5NOPL                                             
C2185C                   KFLD                    T5LINE                                             
      *                                                                                             
     C     KPMTAB2       KLIST                                                                      
     C                   KFLD                    PECTAB                                             
     C                   KFLD                    PECLTA                                             
      *                                                                                             
     C     KCOCAPE       KLIST                                                                      
     C                   KFLD                    S0CIAS                                             
     C                   KFLD                    S0DLGA                                             
     C                   KFLD                    S0NPCO                                             
     C                   KFLD                    S0TPED                                             
     C                   KFLD                    S0DATP                                             
     C                   KFLD                    S0NOPL                                             
      *                                                                                             
     C     KCODEPE       KLIST                                                                      
     C                   KFLD                    S5CIAS                                             
     C                   KFLD                    S5DLGA                                             
     C                   KFLD                    S5NPCO                                             
     C                   KFLD                    S5TPED                                             
     C                   KFLD                    S5DATP                                             
     C                   KFLD                    S5NOPL                                             
     C                   KFLD                    S5LINE                                             
C2501 *                                                                                             
C2501C     KCODEPE26     KLIST                                                                      
C2501C                   KFLD                    DP_S5CIAS                                          
C2501C                   KFLD                    DP_S5DLGA                                          
C2501C                   KFLD                    DP_S5NPCO                                          
C2501C                   KFLD                    DP_S5TPED                                          
C2501C                   KFLD                    DP_S5DATP                                          
C2501C                   KFLD                    DP_S5NOPL                                          
C2501 *                                                                                             
C2501C     KCOCEDI       KLIST                                                                      
C2501C                   KFLD                    ED_S0CIAS                                          
C2501C                   KFLD                    ED_S0CUST                                          
      *                                                                                             
     C     KCODEP2       KLIST                                                                      
     C                   KFLD                    C_S5CIAS                                           
     C                   KFLD                    C_S5DLGA                                           
     C                   KFLD                    C_S5NPCO                                           
     C                   KFLD                    C_S5TPED                                           
     C                   KFLD                    C_S5DATP                                           
     C                   KFLD                    C_S5NOPL                                           
     C                   KFLD                    C_S5LINE                                           
     C                   KFLD                    C_S5LIN3                                           
10051 *                                                                                             
10051C     KCODEP20      KLIST                                                                      
10051C                   KFLD                    C_S5CIAS                                           
10051C                   KFLD                    C_S5DLGA                                           
10051C                   KFLD                    C_S5NPCO                                           
10051C                   KFLD                    C_S5TPED                                           
10051C                   KFLD                    C_S5DATP                                           
10051C                   KFLD                    C_S5NOPL                                           
10051C                   KFLD                    C_S5LINE                                           
      *                                                                                             
     C     KPUCAPE       KLIST                                                                      
     C                   KFLD                    C0CIAS                                             
     C                   KFLD                    C0DLGA                                             
     C                   KFLD                    C0NPCO                                             
     C                   KFLD                    C0TPED                                             
     C                   KFLD                    C0DATP                                             
     C                   KFLD                    C0NOPL                                             
      *                                                                                             
     C     KPUDEPE       KLIST                                                                      
     C                   KFLD                    C5CIAS                                             
     C                   KFLD                    C5DLGA                                             
     C                   KFLD                    C5NPCO                                             
     C                   KFLD                    C5TPED                                             
     C                   KFLD                    C5DATP                                             
     C                   KFLD                    C5NOPL                                             
     C                   KFLD                    C5LINE                                             
C2501 *                                                                                             
C2501C     KMSCOJC       KLIST                                                                      
C2501C                   KFLD                    NDCIAS                                             
C2501C                   KFLD                    NDARTI                                             
C2501C                   KFLD                    NDVARI                                             
C2501C                   KFLD                    NDMODE                                             
C2501C                   KFLD                    NDTCOJ                                             
      *                                                                                             
     C     KMSCOJD       KLIST                                                                      
     C                   KFLD                    NDCIAS                                             
     C                   KFLD                    NDARTI                                             
     C                   KFLD                    NDVARI                                             
     C                   KFLD                    NDMODE                                             
     C                   KFLD                    NDTCOJ                                             
     C                   KFLD                    NDCOMP                                             
     C                   KFLD                    NDVAR2                                             
     C                   KFLD                    NDMOD2                                             
     C                   KFLD                    NDTCO2                                             
                                                                                                    
C2501C     KMSCOJD0      KLIST                                                                      
C2501C                   KFLD                    NDCIAS                                             
C2501C                   KFLD                    NDARTI                                             
C2501C                   KFLD                    NDVARI                                             
C2501C                   KFLD                    NDMODE                                             
                                                                                                    
     C     KCOXDOC       KLIST                                                                      
     C                   KFLD                    TKCIAS                                             
     C                   KFLD                    TKDLGA                                             
     C                   KFLD                    TKNPCO                                             
     C                   KFLD                    TKTPED                                             
     C                   KFLD                    TKDATP                                             
     C                   KFLD                    TKNOPL                                             
     C                   KFLD                    TKLINE                                             
                                                                                                    
     C     KCOAPRP01     KLIST                                                                      
     C                   KFLD                    SACIAS                                             
     C                   KFLD                    SATNPE                                             
     C                   KFLD                    SADLGA                                             
     C                   KFLD                    SANPCO                                             
     C                   KFLD                    SATPED                                             
     C                   KFLD                    SADATP                                             
     C                   KFLD                    SANOPL                                             
     C                   KFLD                    SALINE                                             
     C                   KFLD                    SANPRP                                             
24080                                                                                               
24080C     KPMUNAL       KLIST                                                                      
24080C                   KFLD                    P6CIAS                                             
24080C                   KFLD                    P6ARTI                                             
24080C                   KFLD                    P6VARI                                             
24080C                   KFLD                    P6MODE                                             
24080                                                                                               
24080C     KCOALBD10     KLIST                                                                      
24080C                   KFLD                    CECIAS                                             
24080C                   KFLD                    CECUST                                             
24080C                   KFLD                    CENPCO                                             
24080C                   KFLD                    CETPED                                             
24080C                   KFLD                    CEDATP                                             
24080C                   KFLD                    CENOPL                                             
24080C                   KFLD                    CELINE                                             
FQ607 *                                                                                             
FQ607C     KEDINCI30     KLIST                                                                      
FQ607C                   KFLD                    T4CIAS                                             
FQ607C                   KFLD                    T4DLGA                                             
FQ607C                   KFLD                    T4NPCO                                             
FQ607C                   KFLD                    T4TPED                                             
FQ607C                   KFLD                    T4DATP                                             
FQ607C                   KFLD                    T4NOPL                                             
FQ607C                   KFLD                    T4LINE                                             
FQ710                                                                                               
FQ710C     KPMTABD       KLIST                                                                      
FQ710C                   KFLD                    P_PECIAS                                           
FQ710C                   KFLD                    P_PECTAB                                           
FQ710C                   KFLD                    P_PECLTA                                           
FQ710                                                                                               
FQ710C     KMSDIV0       KLIST                                                                      
FQ710C                   KFLD                    MBCIAS                                             
FQ710C                   KFLD                    MBMONE                                             
FQ710                                                                                               
FQ710C     KMSIVAS0      KLIST                                                                      
FQ710C                   KFLD                    MVCIAS                                             
FQ710C                   KFLD                    MVTIVA                                             
FQ710C                   KFLD                    MVPABI                                             
FQ710                                                                                               
FQ710C     KMSIVAS       KLIST                                                                      
FQ710C                   KFLD                    MVCIAS                                             
FQ710C                   KFLD                    MVTIVA                                             
FQ710C                   KFLD                    MVPABI                                             
FQ710C                   KFLD                    MVFLCD                                             
FQ726                                                                                               
FQ726C     KMSLOGI       KLIST                                                                      
FQ726C                   KFLD                    MICIAS                                             
FQ726C                   KFLD                    MIDLGA                                             
FQ726C                   KFLD                    MILGCA                                             
FQ726                                                                                               
FQ726C     KEDPARM       KLIST                                                                      
FQ726C                   KFLD                    T3CIAS                                             
FQ726C                   KFLD                    T3DLGA                                             
FQ726                                                                                               
FQ726C     KPMEMPR       KLIST                                                                      
FQ726C                   KFLD                    P7CIAS                                             
FQ726C                   KFLD                    P7DLGA                                             
FQ726                                                                                               
FQ726C     KMSTRG1       KLIST                                                                      
FQ726C                   KFLD                    NZCTAB                                             
FQ726C                   KFLD                    NZCLTA                                             
FQ726C                   KFLD                    NZIDIO                                             
14N12                                                                                               
14N12C     KPVDEVD10     KLIST                                                                      
14N12C                   KFLD                    V1NDE2                                             
14N12C                   KFLD                    V1LIN2                                             
14N12                                                                                               
14N12C     KPVDEVI05     KLIST                                                                      
14N12C                   KFLD                    V7CIAS                                             
14N12C                   KFLD                    V7TRZD                                             
FDX01 *                                                                                             
FDX01C     KMSARTI00     KLIST                                                                      
FDX01C                   KFLD                    M5CIAS                                             
FDX01C                   KFLD                    M5ARTI                                             
FDX01C                   KFLD                    M5VARI                                             
FDX01C                   KFLD                    M5MODE                                             
C1350 *                                                                                             
C1350C     KCOCLIN       KLIST                                                                      
C1350C                   KFLD                    S0CIAS                                             
C1350C                   KFLD                    S0CUST                                             
C1328 *                                                                                             
C1328C     KPUPROV       KLIST                                                                      
C1328C                   KFLD                    U_C0CIAS                                           
C1328C                   KFLD                    U_C0PRVR                                           
C2501 *                                                                                             
C2501C     KCODIPR       KLIST                                                                      
C2501C                   KFLD                    S2CIAS                                             
C2501C                   KFLD                    S2CUST                                             
C2501C                   KFLD                    S2TDIR                                             
IT228C     KPUPRP0       KLIST                                                                      
IT228C                   KFLD                    C3CIAS                                             
IT228C                   KFLD                    C3PRVR                                             
IT228C                   KFLD                    C3ARVM                                             
FQ726                                                                                               
FQ726 * Busco empresa donde me encuentro                                                            
FQ726C                   EVAL      P7CIAS=@PCIAS                                                    
FQ726C                   EVAL      P7DLGA=@PDLGA                                                    
FQ726C     KPMEMPR       CHAIN     PMEMPR                                                           
                                                                                                    
12041 * Si viene el pedido a blancos salgo del programa                                             
12041C                   IF        @PCIAS=0 Or @PNPCO=*BLANKS                                       
12041C                   GOTO      FINPROG                                                          
12041C                   ENDIF                                                                      
      * Buscar código auditoría en PMTAB2                                                           
      *                                                                                             
FQ726 * Busco descripción error y lleno las series                                                  
FQ726C                   EVAL      NZCTAB='EDAU'                                                    
FQ726C                   EVAL      NZCLTA=@PEDAU                                                    
FQ726C                   EVAL      NZIDIO=P7IDIO                                                    
FQ726C     KMSTRG1       CHAIN     MSTRG1                                                           
FQ726C                   IF        %FOUND(MSTRG1)                                                   
FQ726C                   MOVEL(P)  NZDESC        ZXDESCAUD                                          
20514C                   EVAL      PECTAB='EDAU'                                                    
20514C                   EVAL      PECLTA=@PEDAU                                                    
20514C     KPMTAB2       CHAIN(N)  PMTAB2                             81                            
FQ726C                   ELSE                                                                       
     C                   EVAL      PECTAB='EDAU'                                                    
     C                   EVAL      PECLTA=@PEDAU                                                    
     C     KPMTAB2       CHAIN(N)  PMTAB2                             81                            
FQ726C                   IF        %FOUND(PMTAB2)                                                   
FQ726C                   MOVEL(P)  PEDESC        ZXDESCAUD                                          
FQ726C                   ELSE                                                                       
FQ726C                   MOVEL     *BLANKS       ZXDESCAUD                                          
FQ726C                   ENDIF                                                                      
FQ726C                   ENDIF                                                                      
      *                                                                                             
      *  Si @PTEXT es blanks se recupera el PEDESC de PMTAB2                                        
      *                                                                                             
     C                   IF        @PTEXT=*BLANKS                                                   
FQ726C**                 EVAL      @PTEXT=PEDESC                                                    
FQ726C                   EVAL      @PTEXT=ZXDESCAUD                                                 
     C                   ENDIF                                                                      
      *                                                                                             
      *  Guardo código de E-Mail asociado                                                           
      *                                                                                             
     C                   MOVEL(P)  PEBL65        @EMEVEN                                            
FQ726 * busco parámetros de la comercial                                                            
FQ726C                   EVAL      T3CIAS = @PCIAS                                                  
FQ726C                   EVAL      T3DLGA = @PDLGA                                                  
FQ726C     KEDPARM       CHAIN     EDPARM                                                           
      *                                                                                             
      *  Según valor @PEDAU (código de auditoría) XXX llamar CS_CODEXXX                             
      *                                                                                             
     C                   Select                                                                     
      *                                                                                             
      * Eventos de Comercial                                                                        
      *                                                                                             
     C                   When      @PEDAU ='001'                                                    
     C                   EXSR      CS_COD001                                                        
                                                                                                    
     C                   When      @PEDAU ='002'                                                    
     C                   EXSR      CS_COD002                                                        
                                                                                                    
     C*                  When      @PEDAU ='003'                                                    
     C*                  EXSR      CS_COD003                                                        
                                                                                                    
     C*                  When      @PEDAU ='004'                                                    
     C*                  EXSR      CS_COD004                                                        
                                                                                                    
     C                   When      @PEDAU ='005'                                                    
     C                   EXSR      CS_COD005                                                        
                                                                                                    
     C                   When      @PEDAU ='006'                                                    
     C                   EXSR      CS_COD006                                                        
                                                                                                    
     C                   When      @PEDAU ='007'                                                    
     C                   EXSR      CS_COD007                                                        
                                                                                                    
     C                   When      @PEDAU ='008'                                                    
     C                   EXSR      CS_COD008                                                        
                                                                                                    
     C                   When      @PEDAU ='009'                                                    
     C                   EXSR      CS_COD009                                                        
                                                                                                    
     C                   When      @PEDAU ='010'                                                    
     C                   EXSR      CS_COD010                                                        
                                                                                                    
     C                   When      @PEDAU ='011'                                                    
     C                   EXSR      CS_COD011                                                        
                                                                                                    
     C                   When      @PEDAU ='012'                                                    
     C                   EXSR      CS_COD012                                                        
                                                                                                    
     C                   When      @PEDAU ='013'                                                    
     C                   EXSR      CS_COD013                                                        
                                                                                                    
     C                   When      @PEDAU ='014'                                                    
     C                   EXSR      CS_COD014                                                        
                                                                                                    
     C                   When      @PEDAU ='015'                                                    
     C                   EXSR      CS_COD015                                                        
                                                                                                    
     C                   When      @PEDAU ='016'                                                    
     C                   EXSR      CS_COD016                                                        
                                                                                                    
     C                   When      @PEDAU ='017'                                                    
     C                   EXSR      CS_COD017                                                        
                                                                                                    
     C                   When      @PEDAU ='018'                                                    
C2559C                             OR @PEDAU ='051'                                                 
     C                   EXSR      CS_COD018                                                        
                                                                                                    
     C                   When      @PEDAU ='019'                                                    
     C                   EXSR      CS_COD019                                                        
                                                                                                    
     C                   When      @PEDAU ='020'                                                    
     C                   EXSR      CS_COD020                                                        
                                                                                                    
     C                   When      @PEDAU ='021'                                                    
     C                   EXSR      CS_COD021                                                        
                                                                                                    
     C                   When      @PEDAU ='022'                                                    
     C                   EXSR      CS_COD022                                                        
                                                                                                    
     C                   When      @PEDAU ='023'                                                    
     C                   EXSR      CS_COD023                                                        
                                                                                                    
     C                   When      @PEDAU ='024'                                                    
     C                   EXSR      CS_COD024                                                        
13040                                                                                               
13040C                   When      @PEDAU ='025'                                                    
13040C                   EXSR      CS_COD025                                                        
FQ604                                                                                               
FQ604C                   When      @PEDAU ='026'                                                    
FQ604C                   EXSR      CS_COD026                                                        
19050                                                                                               
19050C                   When      @PEDAU ='027'                                                    
19050C                   EXSR      CS_COD027                                                        
FQ607                                                                                               
FQ607C                   When      @PEDAU ='028'                                                    
FQ607C                   EXSR      CS_COD028                                                        
FQ710                                                                                               
FQ710C                   When      @PEDAU ='029' Or @PEDAU ='030'                                   
FQ710C                   EXSR      CS_COD029                                                        
20100                                                                                               
20100C                   When      @PEDAU ='031' Or @PEDAU ='032'                                   
20100C                   EXSR      CS_COD031                                                        
C1350C                                                                                              
C1350C                   When      @PEDAU ='033'                                                    
C1350C                   EXSR      CS_COD033                                                        
C1350                                                                                               
C1350C                   When      @PEDAU ='034'                                                    
C1350C                   EXSR      CS_COD034                                                        
67007c*                                                                                             
67007C                   When      @PEDAU ='053'                                                    
67007C                   EXSR      CS_COD053                                                        
C1579                                                                                               
C2684C                   When      @PEDAU ='232'                                                    
C2684C                   EXSR      CS_COD232                                                        
C2684                                                                                               
C1579C                   When      @PEDAU ='500'                                                    
C1579C                   EXSR      CS_COD500                                                        
      *                                                                                             
      * Eventos de Compras                                                                          
      *                                                                                             
     C                   When      @PEDAU ='100'                                                    
     C                   EXSR      CS_COD100                                                        
                                                                                                    
     C                   When      @PEDAU ='105'                                                    
     C                   EXSR      CS_COD105                                                        
                                                                                                    
     C                   When      @PEDAU ='106'                                                    
     C                   EXSR      CS_COD106                                                        
                                                                                                    
     C                   When      @PEDAU ='107'                                                    
     C                   EXSR      CS_COD107                                                        
                                                                                                    
     C                   When      @PEDAU ='108'                                                    
     C                   EXSR      CS_COD108                                                        
                                                                                                    
     C                   When      @PEDAU ='109'                                                    
     C                   EXSR      CS_COD109                                                        
                                                                                                    
     C                   When      @PEDAU ='110'                                                    
     C                   EXSR      CS_COD110                                                        
                                                                                                    
     C                   When      @PEDAU ='111'                                                    
     C                   EXSR      CS_COD111                                                        
                                                                                                    
     C                   When      @PEDAU ='112'                                                    
     C                   EXSR      CS_COD112                                                        
                                                                                                    
     C                   When      @PEDAU ='113'                                                    
     C                   EXSR      CS_COD113                                                        
                                                                                                    
     C                   When      @PEDAU ='114'                                                    
     C                   EXSR      CS_COD114                                                        
                                                                                                    
     C                   When      @PEDAU ='115'                                                    
     C                   EXSR      CS_COD115                                                        
                                                                                                    
     C                   When      @PEDAU ='118'                                                    
C2559C                             OR @PEDAU ='151'                                                 
     C                   EXSR      CS_COD118                                                        
                                                                                                    
     C                   When      @PEDAU ='119'                                                    
     C                   EXSR      CS_COD119                                                        
                                                                                                    
     C                   When      @PEDAU ='120'                                                    
     C                   EXSR      CS_COD120                                                        
19050                                                                                               
19050C                   When      @PEDAU ='121'                                                    
19050C                   EXSR      CS_COD121                                                        
      *                                                                                             
      * Eventos de Productiva                                                                       
      *                                                                                             
     C                   When      @PEDAU ='201'                                                    
C2673C                             OR @PEDAU ='501'                                                 
     C                   EXSR      CS_COD201                                                        
                                                                                                    
     C                   When      @PEDAU ='202'                                                    
     C                   EXSR      CS_COD202                                                        
                                                                                                    
     C                   When      @PEDAU ='205'                                                    
     C                   EXSR      CS_COD205                                                        
                                                                                                    
     C                   When      @PEDAU ='206'                                                    
     C                   EXSR      CS_COD206                                                        
                                                                                                    
     C                   When      @PEDAU ='210'                                                    
     C                   EXSR      CS_COD210                                                        
                                                                                                    
     C                   When      @PEDAU ='211'                                                    
     C                   EXSR      CS_COD211                                                        
                                                                                                    
     C                   When      @PEDAU ='215'                                                    
C2673C                             OR @PEDAU ='515'                                                 
     C                   EXSR      CS_COD215                                                        
                                                                                                    
     C                   When      @PEDAU ='220'                                                    
     C                   EXSR      CS_COD220                                                        
                                                                                                    
     C                   When      @PEDAU ='221'                                                    
     C                   EXSR      CS_COD221                                                        
                                                                                                    
     C                   When      @PEDAU ='222'                                                    
     C                   EXSR      CS_COD222                                                        
                                                                                                    
     C                   When      @PEDAU ='223'                                                    
     C                   EXSR      CS_COD223                                                        
                                                                                                    
     C                   When      @PEDAU ='224'                                                    
C3167C                             OR @PEDAU = '255'  OR @PEDAU = '256'                             
C3167C                             OR @PEDAU = '257'  OR @PEDAU = '258'                             
     C                   EXSR      CS_COD224                                                        
                                                                                                    
24080C                   When      @PEDAU ='227'                                                    
24080C                   EXSR      CS_COD227                                                        
                                                                                                    
     C                   When      @PEDAU ='230'                                                    
     C                   EXSR      CS_COD230                                                        
                                                                                                    
     C                   When      @PEDAU ='231'                                                    
     C                   EXSR      CS_COD231                                                        
                                                                                                    
     C                   When      @PEDAU ='251'                                                    
     C                   EXSR      CS_COD251                                                        
                                                                                                    
     C                   When      @PEDAU ='260'                                                    
     C                   EXSR      CS_COD260                                                        
      *                                                                                             
      * Eventos de Trace                                                                            
      *                                                                                             
     C                   When      @PEDAU ='301' Or @PEDAU ='302'                                   
     C                   EXSR      CS_COD301                                                        
                                                                                                    
     C                   When      @PEDAU ='303' Or @PEDAU ='304'                                   
     C                   EXSR      CS_COD303                                                        
                                                                                                    
     C                   When      @PEDAU ='305' Or @PEDAU ='306'                                   
     C                   EXSR      CS_COD305                                                        
                                                                                                    
     C                   When      @PEDAU ='307'                                                    
     C                   EXSR      CS_COD307                                                        
                                                                                                    
     C                   When      @PEDAU ='308'                                                    
     C                   EXSR      CS_COD308                                                        
                                                                                                    
C1544C                   When      @PEDAU ='309'                                                    
C1544C                   EXSR      CS_COD309                                                        
                                                                                                    
     C                   Endsl                                                                      
      *                                                                                             
      * Cualquier evento comercial que modifique comprueba la marca de riesgo                       
      * Siempre que no sea un alta inicial o una baja                                               
      *                                                                                             
13040C**                 if        @PEDAU>='001'                                                    
13040C**                           AND @PEDAU<='099'                                                
13040C**                           AND @PEDAU<>'001'                                                
13040C**                           AND @PEDAU<>'002'                                                
13040C**                           AND @PEDAU<>'005'                                                
13040C**                           AND @PEDAU<>'009'                                                
13040C**                 EXSR      CS_COD015                                                        
13040C**                 ENDIF                                                                      
      *                                                                                             
      * Llamar a programa encadenado si existe                                                      
      *                                                                                             
     C                   IF        PEBL62<>*BLANKS                                                  
     C                   CALL      PEBL62                                                           
     C                   PARM                    @PDATO                                             
     C                   ENDIF                                                                      
      *                                                                                             
      * Llamar a programa para envio de mail si debe hacerlo                                        
      * (Sólo funcionará en 192.168.0.200 con Telecon Access400 6.1 instalado)                      
      *                                                                                             
     C                   IF        @EMEVEN>*BLANKS                                                  
     C                   EXSR      CS_EMAIL                                                         
     C                   ENDIF                                                                      
      *                                                                                             
      * Fin programa                                                                                
      *                                                                                             
12041C     FINPROG       TAG                                                                        
     C                   SETON                                        LR                            
      **********************************************************************                        
      * Proceso auditoría 001  Alta línea pedido comercial ED calculada    *                        
      **********************************************************************                        
     C     CS_COD001     BEGSR                                                                      
      *                                                                                             
      * Evento principal: graba el registro básico de una línea ED                                  
      *                                                                                             
      * Recupero datos para completar campos del registro                                           
      *                                                                                             
     C                   EVAL      S0CIAS=@PCIAS                                                    
     C                   EVAL      S0DLGA=@PDLGA                                                    
     C                   EVAL      S0NPCO=@PNPCO                                                    
     C                   EVAL      S0TPED=@PTPED                                                    
     C                   EVAL      S0DATP=@PDATP                                                    
     C                   EVAL      S0NOPL=@PNOPL                                                    
     C     KCOCAPE       CHAIN     COCAPE                                                           
     C                   IF        %FOUND(COCAPE)                                                   
     C                   EVAL      S5CIAS=@PCIAS                                                    
     C                   EVAL      S5DLGA=@PDLGA                                                    
     C                   EVAL      S5NPCO=@PNPCO                                                    
     C                   EVAL      S5TPED=@PTPED                                                    
     C                   EVAL      S5DATP=@PDATP                                                    
     C                   EVAL      S5NOPL=@PNOPL                                                    
     C                   EVAL      S5LINE=@PLINE                                                    
     C     KCODEPE       CHAIN     CODEPE                                                           
     C                   IF        %FOUND(CODEPE)                                                   
      *                                                                                             
     C                   CLEAR                   REDTRLP00                                          
     C                   EVAL      T0EDSN=1                                                         
     C                   MOVEL     'C'           T0EDFC                                             
     C                   EVAL      T0CIAS=@PCIAS                                                    
     C                   MOVEL(P)  @PDLGA        T0DLGA                                             
     C                   MOVEL(P)  @PNPCO        T0NPCO                                             
     C                   MOVEL(P)  @PTPED        T0TPED                                             
     C                   EVAL      T0DATP=@PDATP                                                    
     C                   EVAL      T0NOPL=@PNOPL                                                    
     C                   EVAL      T0LINE=@PLINE                                                    
     C                   EVAL      T0DWR0=*DATE                                                     
     C                   TIME                    T0HWR0                                             
     C                   MOVEL(P)  SDSUSR        T0UWR0                                             
     C                   EVAL      T0DWRF=T0DWR0                                                    
     C                   EVAL      T0HWRF=T0HWR0                                                    
     C                   MOVEL(P)  '10'          T0EDST                                             
      *                                                                                             
     C                   EVAL      T0ARVM=S5ARTI+S5VARI+S5MODE                                      
     C                   EVAL      T0CANT=S5CANT                                                    
FQ710C                   EXSR      CS_IMPORTE                                                       
FQ710C                   EVAL(H)   T0IMPO=ZXBIMP                                                    
FQ710C                   EVAL      T0MONE=S5MONE                                                    
     C                   EVAL      T0CUST=S0CUST                                                    
     C                   EVAL      T0TDI1=S0TDI1                                                    
      * Grabar                                                                                      
     C                   EVAL      T0TREG=0                                                         
13040 * Si ya viene con riesgo excedido lo marco                                                    
13040C                   IF        S0REXC>='1' And S0RAUT<'1'                                       
13040C                   EVAL      T0RISK=1                                                         
13040C                   ELSE                                                                       
13040C                   EVAL      T0RISK=0                                                         
13040C                   ENDIF                                                                      
C1350C                   EXSR      CS_BLQALB                                                        
19050 * Si ya viene retenido lo marco                                                               
19050C                   IF        S5PHLD>='1'                                                      
19050C                   EVAL      T0PHLD=1                                                         
19050C                   ENDIF                                                                      
24080 * Fecha lanzamiento                                                                           
24080C                   EVAL      T0FLAN=S0FLAN                                                    
24080 * Se da el caso que el evento se dispara antes de upd a COCAPE al                             
24080 * hacer la opción 25.                                                                         
24080C                   IF        T0FLAN=0                                                         
24080C                   EVAL      T0FLAN=*DATE                                                     
24080C                   ENDIF                                                                      
24080 * Fecha solicitada cliente                                                                    
24080C                   EVAL      T0FREP=S5FREP                                                    
24080 * Datos coenvio                                                                               
NAP45* Si coenvio tipo 3, grabamos coenvío en blanco                                               
NAP45C                   IF        S0COEN='3'                                                       
NAP45C                   EVAL      S5NCOE=''                                                        
NAP45C                   EVAL      S5NCOI=''                                                        
NAP45C                   EVAL      S5NCOF=''                                                        
NAP45C                   ENDIF                                                                      
24080C                   EVAL      T0NCOE=S5NCOE                                                    
24080C                   EVAL      T0NCOI=S5NCOI                                                    
24080C                   EVAL      T0NCOF=S5NCOF                                                    
24080 * Descripción artículo                                                                        
24080C                   IF        S5DEAP <> ' '                                                    
24080C                   EVAL      T0DES1=S5DEAP                                                    
24080C                   ELSE                                                                       
24080C                   EVAL      T0DES1=S5DES1                                                    
24080C                   ENDIF                                                                      
24080 * Unidad medida y factores de conversión                                                      
24080C                   EVAL      T0UNIM=S5UNIM                                                    
24080C                   EXSR      CS_UNITS                                                         
24080 * Cantidad servida desde Delegación                                                           
24080C                   EXSR      CS_CANDLGA                                                       
FQ607 * Nº Incidencia web Trace                                                                     
FQ607C                   IF        S0INFD <> *BLANKS                                                
IT227C*FQ607             MOVEL     S0INFD        T0INFD                                             
FQ607C                   MOVEL     S5LINI        T0LINI                                             
FQ607C                   ENDIF                                                                      
14N12 * Reclamació GIC                                                                              
14N12C                   EVAL      ZXPEFD='1'                                                       
14N12C                   EXSR      CS_TRZGIC                                                        
20100 * Cargo Portes                                                                                
20100C                   EXSR      CS_CARGPORT                                                      
FQ726 * Miro si tiene parámetro logística si es para servir desde Productiva                        
FQ726C                   IF        T3LOGI='1'                                                       
FQ726C                   EXSR      CS_LOGISTI                                                       
FQ726C                   ENDIF                                                                      
      *Si el registro ya existe evitaré crealo de nuevo para evitar                                 
      *duplicados entre los códigos 001 y 002.                                                      
     C     KEDTRLP00     CHAIN     EDTRLP00                                                         
     C                   IF        NOT %FOUND(EDTRLP00)                                             
21050C                   WRITE     REDTRLP00                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
     C                   ENDIF                                                                      
      *                                                                                             
      * Actualizo datos del pedido                                                                  
      *                                                                                             
     C                   EVAL      S0TPE4='2'                                                       
     C                   UPDATE    RCOCAPE                                                          
     C                   EVAL      S5TPE4='2'                                                       
     C                   UPDATE    RCODEPE                                                          
      *                                                                                             
      * Auditoría                                                                                   
      *                                                                                             
     C                   EXSR      CS_UPD_EDTRAU                                                    
      *                                                                                             
      * Posible E-Mail con datos del pedido de venta                                                
      *                                                                                             
     C                   MOVEL(P)  T0CIAS        @EMCIAA                                            
     C                   MOVEL(P)  T0DLGA        @EMDLGA                                            
     C                   MOVEL(P)  T0CUST        @EMCODE                                            
     C                   MOVEL(P)  T0NPCO        @EMNDOC                                            
     C                   MOVE      T0DATP        @EMFDOC                                            
     C                   MOVE      T0LINE        @EMLDOC                                            
      *                                                                                             
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
      *                                                                                             
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Proceso auditoría 002  Alta línea pedido comercial ED forzada      *                        
      **********************************************************************                        
     C     CS_COD002     BEGSR                                                                      
      *                                                                                             
      * Evento principal: graba el registro básico de una línea ED                                  
      * No se graba auditoría                                                                       
      *                                                                                             
      * Recupero datos para completar campos del registro                                           
      *                                                                                             
     C                   EVAL      S0CIAS=@PCIAS                                                    
     C                   EVAL      S0DLGA=@PDLGA                                                    
     C                   EVAL      S0NPCO=@PNPCO                                                    
     C                   EVAL      S0TPED=@PTPED                                                    
     C                   EVAL      S0DATP=@PDATP                                                    
     C                   EVAL      S0NOPL=@PNOPL                                                    
     C     KCOCAPE       CHAIN     COCAPE                                                           
     C                   IF        %FOUND(COCAPE)                                                   
     C                   EVAL      S5CIAS=@PCIAS                                                    
     C                   EVAL      S5DLGA=@PDLGA                                                    
     C                   EVAL      S5NPCO=@PNPCO                                                    
     C                   EVAL      S5TPED=@PTPED                                                    
     C                   EVAL      S5DATP=@PDATP                                                    
     C                   EVAL      S5NOPL=@PNOPL                                                    
     C                   EVAL      S5LINE=@PLINE                                                    
     C     KCODEPE       CHAIN     CODEPE                                                           
     C                   IF        %FOUND(CODEPE)                                                   
      *                                                                                             
     C                   CLEAR                   REDTRLP00                                          
     C                   EVAL      T0EDSN=1                                                         
     C                   MOVEL     'F'           T0EDFC                                             
     C                   EVAL      T0CIAS=@PCIAS                                                    
     C                   MOVEL(P)  @PDLGA        T0DLGA                                             
     C                   MOVEL(P)  @PNPCO        T0NPCO                                             
     C                   MOVEL(P)  @PTPED        T0TPED                                             
     C                   EVAL      T0DATP=@PDATP                                                    
     C                   EVAL      T0NOPL=@PNOPL                                                    
     C                   EVAL      T0LINE=@PLINE                                                    
     C                   EVAL      T0DWR0=*DATE                                                     
     C                   TIME                    T0HWR0                                             
     C                   MOVEL(P)  SDSUSR        T0UWR0                                             
     C                   EVAL      T0DWRF=T0DWR0                                                    
     C                   EVAL      T0HWRF=T0HWR0                                                    
     C                   MOVEL(P)  '10'          T0EDST                                             
      *                                                                                             
     C                   EVAL      T0ARVM=S5ARTI+S5VARI+S5MODE                                      
     C                   EVAL      T0CANT=S5CANT                                                    
FQ710C                   EXSR      CS_IMPORTE                                                       
FQ710C                   EVAL(H)   T0IMPO=ZXBIMP                                                    
FQ710C                   EVAL      T0MONE=S5MONE                                                    
     C                   EVAL      T0CUST=S0CUST                                                    
     C                   EVAL      T0TDI1=S0TDI1                                                    
13040 * Si ya viene con riesgo excedido lo marco                                                    
13040C                   IF        S0REXC>='1' And S0RAUT<'1'                                       
13040C                   EVAL      T0RISK=1                                                         
13040C                   ELSE                                                                       
13040C                   EVAL      T0RISK=0                                                         
13040C                   ENDIF                                                                      
C1350C                   EXSR      CS_BLQALB                                                        
19050 * Si ya viene retenido lo marco                                                               
19050C                   IF        S5PHLD>='1'                                                      
19050C                   EVAL      T0PHLD=1                                                         
19050C                   ENDIF                                                                      
24080 * Fecha lanzamiento                                                                           
24080C                   EVAL      T0FLAN=S0FLAN                                                    
24080 * Se da el caso que el evento se dispara antes de upd a COCAPE al                             
24080 * hacer la opción 25.                                                                         
24080C                   IF        T0FLAN=0                                                         
24080C                   EVAL      T0FLAN=*DATE                                                     
24080C                   ENDIF                                                                      
24080 * Fecha solicitada cliente                                                                    
24080C                   EVAL      T0FREP=S5FREP                                                    
24080 * Datos coenvio                                                                               
NAP45* Si coenvio tipo 3, grabamos coenvío en blanco                                               
NAP45C                   IF        S0COEN='3'                                                       
NAP45C                   EVAL      S5NCOE=''                                                        
NAP45C                   EVAL      S5NCOI=''                                                        
NAP45C                   EVAL      S5NCOF=''                                                        
NAP45C                   ENDIF                                                                      
24080C                   EVAL      T0NCOE=S5NCOE                                                    
24080C                   EVAL      T0NCOI=S5NCOI                                                    
24080C                   EVAL      T0NCOF=S5NCOF                                                    
24080 * Descripción artículo                                                                        
24080C                   IF        S5DEAP <> ' '                                                    
24080C                   EVAL      T0DES1=S5DEAP                                                    
24080C                   ELSE                                                                       
24080C                   EVAL      T0DES1=S5DES1                                                    
24080C                   ENDIF                                                                      
24080 * Unidad medida y factores de conversión                                                      
24080C                   EVAL      T0UNIM=S5UNIM                                                    
24080C                   EXSR      CS_UNITS                                                         
24080 * Cantidad servida desde Delegación                                                           
24080C                   EXSR      CS_CANDLGA                                                       
FQ607 * Nº Incidencia web Trace                                                                     
FQ607C                   IF        S0INFD <> *BLANKS                                                
IT227C*FQ607             MOVEL     S0INFD        T0INFD                                             
FQ607C                   MOVEL     S5LINI        T0LINI                                             
FQ607C                   ENDIF                                                                      
14N12 * Reclamació GIC                                                                              
14N12C                   EVAL      ZXPEFD='1'                                                       
14N12C                   EXSR      CS_TRZGIC                                                        
20100 * Cargo Portes                                                                                
20100C                   EXSR      CS_CARGPORT                                                      
FQ726 * Miro si tiene parámetro logística si es para servir desde Productiva                        
FQ726C                   IF        T3LOGI='1'                                                       
FQ726C                   EXSR      CS_LOGISTI                                                       
FQ726C                   ENDIF                                                                      
      * Grabar                                                                                      
     C                   EVAL      T0TREG=0                                                         
      *Si el registro ya existe evitaré crealo de nuevo para evitar                                 
      *duplicados entre los códigos 001 y 002.                                                      
     C     KEDTRLP00     CHAIN     EDTRLP00                                                         
     C                   IF        NOT %FOUND(EDTRLP00)                                             
21050C                   WRITE     REDTRLP00                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
     C                   ENDIF                                                                      
      *                                                                                             
      * Actualizo datos del pedido (Ya deberían estar así)                                          
      *                                                                                             
     C                   EVAL      S0TPE4='2'                                                       
     C                   UPDATE    RCOCAPE                                                          
     C                   EVAL      S5TPE4='2'                                                       
     C                   UPDATE    RCODEPE                                                          
      *                                                                                             
      * Auditoría                                                                                   
      *                                                                                             
     C                   EXSR      CS_UPD_EDTRAU                                                    
      *                                                                                             
      * Posible E-Mail con datos del pedido de venta                                                
      *                                                                                             
     C                   MOVEL(P)  T0CIAS        @EMCIAA                                            
     C                   MOVEL(P)  T0DLGA        @EMDLGA                                            
     C                   MOVEL(P)  T0CUST        @EMCODE                                            
     C                   MOVEL(P)  T0NPCO        @EMNDOC                                            
     C                   MOVE      T0DATP        @EMFDOC                                            
     C                   MOVE      T0LINE        @EMLDOC                                            
      *                                                                                             
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
      *                                                                                             
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Anular línea en pedido comercial                                   *                        
      **********************************************************************                        
     C     CS_COD005     BEGSR                                                                      
      *                                                                                             
      * Recupero la clave del pedido comercial y elimino todo                                       
      *                                                                                             
     C                   EVAL      ZXGRAU=0                                                         
     C                   EVAL      T0CIAS=@PCIAS                                                    
     C                   EVAL      T0DLGA=@PDLGA                                                    
     C                   EVAL      T0NPCO=@PNPCO                                                    
     C                   EVAL      T0TPED=@PTPED                                                    
     C                   EVAL      T0DATP=@PDATP                                                    
     C                   EVAL      T0NOPL=@PNOPL                                                    
     C                   EVAL      T0LINE=@PLINE                                                    
     C                   EVAL      T0ARV1=*BLANKS                                                   
     C                   EVAL      T0COM2=*BLANKS                                                   
      *                                                                                             
     C     KEDTRLP00X    SETLL     EDTRLP00                                                         
     C     KEDTRLP00     READE     EDTRLP00                                                         
     C                   DOW       NOT %EOF(EDTRLP00)                                               
      *                                                                                             
     C                   IF        T0ARV1=*BLANKS                                                   
15060C                             AND T0CANS=0                                                     
02060C                   WRITE     REDTRLX00                            80                          
11060C                   DOW       *IN80=*ON                                                        
02060C                   EVAL      T0HWR0 = T0HWR0+1                                                
02060C                   WRITE     REDTRLX00                            80                          
02060C                   ENDDO                                                                      
     C                   DELETE    REDTRLP00                                                        
     C                   ENDIF                                                                      
      *                                                                                             
      * Auditoría                                                                                   
      *                                                                                             
     C                   IF        ZXGRAU=0                                                         
     C                   EXSR      CS_UPD_EDTRAU                                                    
     C                   EVAL      ZXGRAU=1                                                         
     C                   ENDIF                                                                      
      *                                                                                             
     C     KEDTRLP00     READE     EDTRLP00                                                         
     C                   ENDDO                                                                      
      *                                                                                             
      * En este caso cierro todas las auditorias relacionadas                                       
      *                                                                                             
     C                   CLEAR                   T1ARV1                                             
     C                   CLEAR                   T1COM2                                             
     C                   CLEAR                   T1EDAU                                             
     C                   CLEAR                   T1DATR                                             
     C                   CLEAR                   T1HORR                                             
     C                   CLEAR                   T1TMST                                             
     C     KEDTRAU00     SETLL     EDTRAU00                                                         
     C     KEDTRAU00X    READE     EDTRAU00                                                         
     C                   DOW       NOT %EOF(EDTRAU00)                                               
      *                                                                                             
     C                   IF        T1ARV1=*BLANKS                                                   
02060C                   DOU       *IN80=*OFF                                                       
02060C                   EVAL      ZXTIM1 = %TIMESTAMP()                                            
02060C                   MOVEL     ZXTIM1        ZXTIMESTAMP                                        
02060C                   MOVEL     ZXTIMESTAMP   T1TMST                                             
02060C                   WRITE     REDTRAX00                            80                          
02060C                   ENDDO                                                                      
     C                   DELETE    REDTRAU00                                                        
     C                   ENDIF                                                                      
      *                                                                                             
     C     KEDTRAU00X    READE     EDTRAU00                                                         
     C                   ENDDO                                                                      
28N12 * Reclamació GIC                                                                              
28N12C                   EVAL      S5CIAS=@PCIAS                                                    
28N12C                   EVAL      S5DLGA=@PDLGA                                                    
28N12C                   EVAL      S5NPCO=@PNPCO                                                    
28N12C                   EVAL      S5TPED=@PTPED                                                    
28N12C                   EVAL      S5DATP=@PDATP                                                    
28N12C                   EVAL      S5NOPL=@PNOPL                                                    
28N12C                   EVAL      S5LINE=@PLINE                                                    
28N12C     KCODEPE       CHAIN(N)  CODEPE                                                           
28N12C                   IF        %FOUND(CODEPE)                                                   
28N12C                   EVAL      ZXPEFD=' '                                                       
28N12C                   EXSR      CS_TRZGIC                                                        
28N12C                   ENDIF                                                                      
      *                                                                                             
      * Posible E-Mail con datos del pedido de ventas                                               
      *                                                                                             
     C                   MOVEL(P)  T0CIAS        @EMCIAA                                            
     C                   MOVEL(P)  T0DLGA        @EMDLGA                                            
     C                   MOVEL(P)  T0CUST        @EMCODE                                            
     C                   MOVEL(P)  T0NPCO        @EMNDOC                                            
     C                   MOVE      T0DATP        @EMFDOC                                            
     C                   MOVE      T0LINE        @EMLDOC                                            
      *                                                                                             
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Modificar cantidad (+) en pedido comercial                         *                        
      **********************************************************************                        
     C     CS_COD006     BEGSR                                                                      
      *                                                                                             
      * Actualizo campos en registro de trazabilidad                                                
      *                                                                                             
     C                   EVAL      S5CIAS=@PCIAS                                                    
     C                   EVAL      S5DLGA=@PDLGA                                                    
     C                   EVAL      S5NPCO=@PNPCO                                                    
     C                   EVAL      S5TPED=@PTPED                                                    
     C                   EVAL      S5DATP=@PDATP                                                    
     C                   EVAL      S5NOPL=@PNOPL                                                    
     C                   EVAL      S5LINE=@PLINE                                                    
     C     KCODEPE       CHAIN(N)  CODEPE                                                           
     C                   IF        %FOUND(CODEPE)                                                   
      *                                                                                             
      * Recupero la clave del pedido comercial y actualizo                                          
      *                                                                                             
     C                   EVAL      ZXGRAU=0                                                         
     C                   EVAL      T0CIAS=@PCIAS                                                    
     C                   EVAL      T0DLGA=@PDLGA                                                    
     C                   EVAL      T0NPCO=@PNPCO                                                    
     C                   EVAL      T0TPED=@PTPED                                                    
     C                   EVAL      T0DATP=@PDATP                                                    
     C                   EVAL      T0NOPL=@PNOPL                                                    
     C                   EVAL      T0LINE=@PLINE                                                    
     C                   EVAL      T0ARV1=*BLANKS                                                   
     C                   EVAL      T0COM2=*BLANKS                                                   
     C     KEDTRLP00X    SETLL     EDTRLP00                                                         
     C     KEDTRLP00     READE     EDTRLP00                                                         
     C                   DOW       NOT %EOF(EDTRLP00)                                               
      *                                                                                             
     C                   EVAL      T0DWRF=*DATE                                                     
24080C                   TIME                    T0HWRF                                             
     C                   EVAL      T0CANT=S5CANT                                                    
     C                   EVAL      T0MODI=1                                                         
     C                   UPDATE    REDTRLP00                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
      *                                                                                             
      * Auditoría sólo para la 1ª línea                                                             
      *                                                                                             
     C                   IF        ZXGRAU=0                                                         
     C                   EXSR      CS_UPD_EDTRAU                                                    
     C                   EVAL      ZXGRAU=1                                                         
     C                   ENDIF                                                                      
      *                                                                                             
     C     KEDTRLP00     READE     EDTRLP00                                                         
     C                   ENDDO                                                                      
      *                                                                                             
      * Posible E-Mail con datos del pedido de ventas                                               
      *                                                                                             
     C                   MOVEL(P)  T0CIAS        @EMCIAA                                            
     C                   MOVEL(P)  T0DLGA        @EMDLGA                                            
     C                   MOVEL(P)  T0CUST        @EMCODE                                            
     C                   MOVEL(P)  T0NPCO        @EMNDOC                                            
     C                   MOVE      T0DATP        @EMFDOC                                            
     C                   MOVE      T0LINE        @EMLDOC                                            
      *                                                                                             
     C                   ENDIF                                                                      
      *                                                                                             
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Modificar cantidad (-) en pedido comercial                         *                        
      **********************************************************************                        
     C     CS_COD007     BEGSR                                                                      
      *                                                                                             
      * Actualizo campos en registro de trazabilidad                                                
      *                                                                                             
     C                   EVAL      S5CIAS=@PCIAS                                                    
     C                   EVAL      S5DLGA=@PDLGA                                                    
     C                   EVAL      S5NPCO=@PNPCO                                                    
     C                   EVAL      S5TPED=@PTPED                                                    
     C                   EVAL      S5DATP=@PDATP                                                    
     C                   EVAL      S5NOPL=@PNOPL                                                    
     C                   EVAL      S5LINE=@PLINE                                                    
     C     KCODEPE       CHAIN(N)  CODEPE                                                           
     C                   IF        %FOUND(CODEPE)                                                   
      *                                                                                             
      * Recupero la clave del pedido comercial y actualizo                                          
      *                                                                                             
     C                   EVAL      ZXGRAU=0                                                         
     C                   EVAL      T0CIAS=@PCIAS                                                    
     C                   EVAL      T0DLGA=@PDLGA                                                    
     C                   EVAL      T0NPCO=@PNPCO                                                    
     C                   EVAL      T0TPED=@PTPED                                                    
     C                   EVAL      T0DATP=@PDATP                                                    
     C                   EVAL      T0NOPL=@PNOPL                                                    
     C                   EVAL      T0LINE=@PLINE                                                    
     C                   EVAL      T0ARV1=*BLANKS                                                   
     C                   EVAL      T0COM2=*BLANKS                                                   
     C     KEDTRLP00X    SETLL     EDTRLP00                                                         
     C     KEDTRLP00     READE     EDTRLP00                                                         
     C                   DOW       NOT %EOF(EDTRLP00)                                               
      *                                                                                             
     C                   EVAL      T0DWRF=*DATE                                                     
24080C                   TIME                    T0HWRF                                             
     C                   EVAL      T0CANT=S5CANT                                                    
     C                   EVAL      T0MODI=1                                                         
     C                   UPDATE    REDTRLP00                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
      *                                                                                             
      * Auditoría sólo para la 1ª línea                                                             
      *                                                                                             
     C                   IF        ZXGRAU=0                                                         
     C                   EXSR      CS_UPD_EDTRAU                                                    
     C                   EVAL      ZXGRAU=1                                                         
     C                   ENDIF                                                                      
      *                                                                                             
     C     KEDTRLP00     READE     EDTRLP00                                                         
     C                   ENDDO                                                                      
      *                                                                                             
      * Posible E-Mail con datos del pedido de ventas                                               
      *                                                                                             
     C                   MOVEL(P)  T0CIAS        @EMCIAA                                            
     C                   MOVEL(P)  T0DLGA        @EMDLGA                                            
     C                   MOVEL(P)  T0CUST        @EMCODE                                            
     C                   MOVEL(P)  T0NPCO        @EMNDOC                                            
     C                   MOVE      T0DATP        @EMFDOC                                            
     C                   MOVE      T0LINE        @EMLDOC                                            
      *                                                                                             
     C                   ENDIF                                                                      
      *                                                                                             
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Retener línea pedido comercial                                     *                        
      **********************************************************************                        
     C     CS_COD008     BEGSR                                                                      
      *                                                                                             
      * Actualizo campos en registro de trazabilidad                                                
      *                                                                                             
     C                   EVAL      S5CIAS=@PCIAS                                                    
     C                   EVAL      S5DLGA=@PDLGA                                                    
     C                   EVAL      S5NPCO=@PNPCO                                                    
     C                   EVAL      S5TPED=@PTPED                                                    
     C                   EVAL      S5DATP=@PDATP                                                    
     C                   EVAL      S5NOPL=@PNOPL                                                    
     C                   EVAL      S5LINE=@PLINE                                                    
     C     KCODEPE       CHAIN(N)  CODEPE                                                           
     C                   IF        %FOUND(CODEPE)                                                   
      *                                                                                             
      * Recupero la clave del pedido comercial y actualizo                                          
      *                                                                                             
     C                   EVAL      ZXGRAU=0                                                         
     C                   EVAL      T0CIAS=@PCIAS                                                    
     C                   EVAL      T0DLGA=@PDLGA                                                    
     C                   EVAL      T0NPCO=@PNPCO                                                    
     C                   EVAL      T0TPED=@PTPED                                                    
     C                   EVAL      T0DATP=@PDATP                                                    
     C                   EVAL      T0NOPL=@PNOPL                                                    
     C                   EVAL      T0LINE=@PLINE                                                    
     C                   EVAL      T0ARV1=*BLANKS                                                   
     C                   EVAL      T0COM2=*BLANKS                                                   
     C     KEDTRLP00X    SETLL     EDTRLP00                                                         
     C     KEDTRLP00     READE     EDTRLP00                                                         
     C                   DOW       NOT %EOF(EDTRLP00)                                               
      *                                                                                             
     C                   EVAL      T0DWRF=*DATE                                                     
24080C                   TIME                    T0HWRF                                             
     C                   EVAL      T0PHLD=1                                                         
     C                   EVAL      T0MODI=1                                                         
     C                   UPDATE    REDTRLP00                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
      *                                                                                             
      * Auditoría sólo para la 1ª línea                                                             
      *                                                                                             
     C                   IF        ZXGRAU=0                                                         
     C                   EXSR      CS_UPD_EDTRAU                                                    
     C                   EVAL      ZXGRAU=1                                                         
     C                   ENDIF                                                                      
      *                                                                                             
     C     KEDTRLP00     READE     EDTRLP00                                                         
     C                   ENDDO                                                                      
      *                                                                                             
      * Posible E-Mail con datos del pedido de ventas                                               
      *                                                                                             
     C                   MOVEL(P)  T0CIAS        @EMCIAA                                            
     C                   MOVEL(P)  T0DLGA        @EMDLGA                                            
     C                   MOVEL(P)  T0CUST        @EMCODE                                            
     C                   MOVEL(P)  T0NPCO        @EMNDOC                                            
     C                   MOVE      T0DATP        @EMFDOC                                            
     C                   MOVE      T0LINE        @EMLDOC                                            
      *                                                                                             
     C                   ENDIF                                                                      
      *                                                                                             
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Cambiar línea en comercial ED -> EN                                *                        
      **********************************************************************                        
     C     CS_COD009     BEGSR                                                                      
      *                                                                                             
      * Es como una anulación de línea                                                              
      * Recupero la clave del pedido comercial y elimino                                            
      *                                                                                             
     C                   EVAL      ZXGRAU=0                                                         
     C                   EVAL      T0CIAS=@PCIAS                                                    
     C                   EVAL      T0DLGA=@PDLGA                                                    
     C                   EVAL      T0NPCO=@PNPCO                                                    
     C                   EVAL      T0TPED=@PTPED                                                    
     C                   EVAL      T0DATP=@PDATP                                                    
     C                   EVAL      T0NOPL=@PNOPL                                                    
     C                   EVAL      T0LINE=@PLINE                                                    
     C                   EVAL      T0ARV1=*BLANKS                                                   
     C                   EVAL      T0COM2=*BLANKS                                                   
     C     KEDTRLP00X    SETLL     EDTRLP00                                                         
     C     KEDTRLP00     READE     EDTRLP00                                                         
     C                   DOW       NOT %EOF(EDTRLP00)                                               
      *                                                                                             
      * Si tiene compra asociada, dejo que sea el evento de                                         
      * compras el que haga la eliminación                                                          
      *                                                                                             
     C                   IF        T0ARV1=*BLANKS                                                   
15060C                             AND T0CANS=0                                                     
02060C                   WRITE     REDTRLX00                            80                          
11060C                   DOW       *IN80=*ON                                                        
02060C                   EVAL      T0HWR0 = T0HWR0+1                                                
02060C                   WRITE     REDTRLX00                            80                          
02060C                   ENDDO                                                                      
     C                   DELETE    REDTRLP00                                                        
     C                   ENDIF                                                                      
      *                                                                                             
      * Auditoría                                                                                   
      *                                                                                             
     C                   IF        ZXGRAU=0                                                         
     C                   EXSR      CS_UPD_EDTRAU                                                    
     C                   EVAL      ZXGRAU=1                                                         
     C                   ENDIF                                                                      
      *                                                                                             
     C     KEDTRLP00     READE     EDTRLP00                                                         
     C                   ENDDO                                                                      
      *                                                                                             
      * En este caso cierro todas las auditorias relacionadas                                       
      *                                                                                             
     C                   CLEAR                   T1ARV1                                             
     C                   CLEAR                   T1COM2                                             
     C                   CLEAR                   T1EDAU                                             
     C                   CLEAR                   T1DATR                                             
     C                   CLEAR                   T1HORR                                             
     C                   CLEAR                   T1TMST                                             
     C     KEDTRAU00     SETLL     EDTRAU00                                                         
     C     KEDTRAU00X    READE     EDTRAU00                                                         
     C                   DOW       NOT %EOF(EDTRAU00)                                               
      *                                                                                             
     C                   IF        T1ARV1=*BLANKS                                                   
02060C                   DOU       *IN80=*OFF                                                       
02060C                   EVAL      ZXTIM1 = %TIMESTAMP()                                            
02060C                   MOVEL     ZXTIM1        ZXTIMESTAMP                                        
02060C                   MOVEL     ZXTIMESTAMP   T1TMST                                             
02060C                   WRITE     REDTRAX00                            80                          
02060C                   ENDDO                                                                      
     C                   DELETE    REDTRAU00                                                        
     C                   ENDIF                                                                      
      *                                                                                             
     C     KEDTRAU00X    READE     EDTRAU00                                                         
     C                   ENDDO                                                                      
In192                                                                                               
In192C                   EVAL      ZXLIED=0                                                         
In192C                   EVAL      S0CIAS=@PCIAS                                                    
In192C                   EVAL      S0DLGA=@PDLGA                                                    
In192C                   EVAL      S0NPCO=@PNPCO                                                    
In192C                   EVAL      S0TPED=@PTPED                                                    
In192C                   EVAL      S0DATP=@PDATP                                                    
In192C                   EVAL      S0NOPL=@PNOPL                                                    
In192C     KCOCAPE       SETLL     CODEPE                                                           
In192C     KCOCAPE       READE(N)  CODEPE                                                           
In192C                   DOW       NOT %EOF(CODEPE)                                                 
In192C                   IF        S5TPE4='2'                                                       
In192C                   EVAL      ZXLIED=1                                                         
In192C                   ENDIF                                                                      
In192C     KCOCAPE       READE(N)  CODEPE                                                           
In192C                   ENDDO                                                                      
In192 * Si totes les línies son de EN actualitzem capçalera                                         
In192C                   IF        ZXLIED=0                                                         
In192C                   EVAL      S0CIAS=@PCIAS                                                    
In192C                   EVAL      S0DLGA=@PDLGA                                                    
In192C                   EVAL      S0NPCO=@PNPCO                                                    
In192C                   EVAL      S0TPED=@PTPED                                                    
In192C                   EVAL      S0DATP=@PDATP                                                    
In192C                   EVAL      S0NOPL=@PNOPL                                                    
In192C     KCOCAPE       CHAIN     COCAPE                                                           
In192C                   IF        %FOUND(COCAPE)                                                   
In192C                   EVAL      S0TPE4=' '                                                       
In192C                   UPDATE    RCOCAPE                                                          
In192C                   ENDIF                                                                      
In192C                   ENDIF                                                                      
14N12 * Reclamació GIC                                                                              
14N12C                   EVAL      S5CIAS=@PCIAS                                                    
14N12C                   EVAL      S5DLGA=@PDLGA                                                    
14N12C                   EVAL      S5NPCO=@PNPCO                                                    
14N12C                   EVAL      S5TPED=@PTPED                                                    
14N12C                   EVAL      S5DATP=@PDATP                                                    
14N12C                   EVAL      S5NOPL=@PNOPL                                                    
14N12C                   EVAL      S5LINE=@PLINE                                                    
14N12C     KCODEPE       CHAIN(N)  CODEPE                                                           
14N12C                   IF        %FOUND(CODEPE)                                                   
14N12C                   EVAL      ZXPEFD=' '                                                       
14N12C                   EXSR      CS_TRZGIC                                                        
14N12C                   ENDIF                                                                      
      *                                                                                             
      * Posible E-Mail con datos del pedido de ventas                                               
      *                                                                                             
     C                   MOVEL(P)  T0CIAS        @EMCIAA                                            
     C                   MOVEL(P)  T0DLGA        @EMDLGA                                            
     C                   MOVEL(P)  T0CUST        @EMCODE                                            
     C                   MOVEL(P)  T0NPCO        @EMNDOC                                            
     C                   MOVE      T0DATP        @EMFDOC                                            
     C                   MOVE      T0LINE        @EMLDOC                                            
      *                                                                                             
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Cambiar línea en comercial EN -> ED                                *                        
      **********************************************************************                        
     C     CS_COD010     BEGSR                                                                      
      *                                                                                             
      * Es como un alta de ED forzada                                                               
      * No se graba auditoría                                                                       
      *                                                                                             
      * Recupero datos para completar campos del registro                                           
      *                                                                                             
     C                   EVAL      S0CIAS=@PCIAS                                                    
     C                   EVAL      S0DLGA=@PDLGA                                                    
     C                   EVAL      S0NPCO=@PNPCO                                                    
     C                   EVAL      S0TPED=@PTPED                                                    
     C                   EVAL      S0DATP=@PDATP                                                    
     C                   EVAL      S0NOPL=@PNOPL                                                    
     C     KCOCAPE       CHAIN     COCAPE                                                           
     C                   IF        %FOUND(COCAPE)                                                   
     C                   EVAL      S5CIAS=@PCIAS                                                    
     C                   EVAL      S5DLGA=@PDLGA                                                    
     C                   EVAL      S5NPCO=@PNPCO                                                    
     C                   EVAL      S5TPED=@PTPED                                                    
     C                   EVAL      S5DATP=@PDATP                                                    
     C                   EVAL      S5NOPL=@PNOPL                                                    
     C                   EVAL      S5LINE=@PLINE                                                    
     C     KCODEPE       CHAIN     CODEPE                                                           
     C                   IF        %FOUND(CODEPE)                                                   
      *                                                                                             
     C                   CLEAR                   REDTRLP00                                          
     C                   EVAL      T0EDSN=1                                                         
     C                   MOVEL     'F'           T0EDFC                                             
     C                   EVAL      T0CIAS=@PCIAS                                                    
     C                   MOVEL(P)  @PDLGA        T0DLGA                                             
     C                   MOVEL(P)  @PNPCO        T0NPCO                                             
     C                   MOVEL(P)  @PTPED        T0TPED                                             
     C                   EVAL      T0DATP=@PDATP                                                    
     C                   EVAL      T0NOPL=@PNOPL                                                    
     C                   EVAL      T0LINE=@PLINE                                                    
     C                   EVAL      T0DWR0=*DATE                                                     
     C                   TIME                    T0HWR0                                             
     C                   MOVEL(P)  SDSUSR        T0UWR0                                             
     C                   EVAL      T0DWRF=T0DWR0                                                    
     C                   EVAL      T0HWRF=T0HWR0                                                    
     C                   MOVEL(P)  '10'          T0EDST                                             
      *                                                                                             
     C                   EVAL      T0ARVM=S5ARTI+S5VARI+S5MODE                                      
     C                   EVAL      T0CANT=S5CANT                                                    
FQ710C                   EXSR      CS_IMPORTE                                                       
FQ710C                   EVAL(H)   T0IMPO=ZXBIMP                                                    
FQ710C                   EVAL      T0MONE=S5MONE                                                    
     C                   EVAL      T0CUST=S0CUST                                                    
     C                   EVAL      T0TDI1=S0TDI1                                                    
24080 * Si ya viene con riesgo excedido lo marco                                                    
24080C                   IF        S0REXC>='1' And S0RAUT<'1'                                       
24080C                   EVAL      T0RISK=1                                                         
24080C                   ELSE                                                                       
24080C                   EVAL      T0RISK=0                                                         
24080C                   ENDIF                                                                      
C1350C                   EXSR      CS_BLQALB                                                        
24080 * Si ya viene retenido lo marco                                                               
24080C                   IF        S5PHLD>='1'                                                      
24080C                   EVAL      T0PHLD=1                                                         
24080C                   ENDIF                                                                      
24080 * Fecha lanzamiento                                                                           
24080C                   EVAL      T0FLAN=S0FLAN                                                    
24080 * Se da el caso que el evento se dispara antes de upd a COCAPE al                             
24080 * hacer la opción 25.                                                                         
24080C                   IF        T0FLAN=0                                                         
24080C                   EVAL      T0FLAN=*DATE                                                     
24080C                   ENDIF                                                                      
24080 * Fecha solicitada cliente                                                                    
24080C                   EVAL      T0FREP=S5FREP                                                    
24080 * Datos coenvio                                                                               
NAP45* Si coenvio tipo 3, grabamos coenvío en blanco                                               
NAP45C                   IF        S0COEN='3'                                                       
NAP45C                   EVAL      S5NCOE=''                                                        
NAP45C                   EVAL      S5NCOI=''                                                        
NAP45C                   EVAL      S5NCOF=''                                                        
NAP45C                   ENDIF                                                                      
24080C                   EVAL      T0NCOE=S5NCOE                                                    
24080C                   EVAL      T0NCOI=S5NCOI                                                    
24080C                   EVAL      T0NCOF=S5NCOF                                                    
24080 * Descripción artículo                                                                        
24080C                   IF        S5DEAP <> ' '                                                    
24080C                   EVAL      T0DES1=S5DEAP                                                    
24080C                   ELSE                                                                       
24080C                   EVAL      T0DES1=S5DES1                                                    
24080C                   ENDIF                                                                      
24080 * Unidad medida y factores de conversión                                                      
24080C                   EVAL      T0UNIM=S5UNIM                                                    
24080C                   EXSR      CS_UNITS                                                         
24080 * Cantidad servida desde Delegación                                                           
24080C                   EXSR      CS_CANDLGA                                                       
FQ607 * Nº Incidencia web Trace                                                                     
FQ607C                   IF        S0INFD <> *BLANKS                                                
IT227C*FQ607             MOVEL     S0INFD        T0INFD                                             
FQ607C                   MOVEL     S5LINI        T0LINI                                             
FQ607C                   ENDIF                                                                      
14N12 * Reclamació GIC                                                                              
14N12C                   EVAL      ZXPEFD='1'                                                       
14N12C                   EXSR      CS_TRZGIC                                                        
20100 * Cargo Portes                                                                                
20100C                   EXSR      CS_CARGPORT                                                      
FQ726 * Miro si tiene parámetro logística si es para servir desde Productiva                        
FQ726C                   IF        T3LOGI='1'                                                       
FQ726C                   EXSR      CS_LOGISTI                                                       
FQ726C                   ENDIF                                                                      
      * Grabar                                                                                      
     C                   EVAL      T0TREG=0                                                         
21050C                   WRITE     REDTRLP00                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
      *                                                                                             
      * Auditoría                                                                                   
      *                                                                                             
     C                   EXSR      CS_UPD_EDTRAU                                                    
      *                                                                                             
      * Actualizo datos del pedido (Ya deberían estar así)                                          
      *                                                                                             
     C                   EVAL      S0TPE4='2'                                                       
     C                   UPDATE    RCOCAPE                                                          
     C                   EVAL      S5TPE4='2'                                                       
     C                   UPDATE    RCODEPE                                                          
      *                                                                                             
      * Posible E-Mail con datos del pedido de venta                                                
      *                                                                                             
     C                   MOVEL(P)  T0CIAS        @EMCIAA                                            
     C                   MOVEL(P)  T0DLGA        @EMDLGA                                            
     C                   MOVEL(P)  T0CUST        @EMCODE                                            
     C                   MOVEL(P)  T0NPCO        @EMNDOC                                            
     C                   MOVE      T0DATP        @EMFDOC                                            
     C                   MOVE      T0LINE        @EMLDOC                                            
      *                                                                                             
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
      *                                                                                             
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Cambiar logística en pedido comercial                              *                        
      **********************************************************************                        
     C     CS_COD011     BEGSR                                                                      
      *                                                                                             
      * Actualizo campos en registro de trazabilidad                                                
      *                                                                                             
     C                   EVAL      S5CIAS=@PCIAS                                                    
     C                   EVAL      S5DLGA=@PDLGA                                                    
     C                   EVAL      S5NPCO=@PNPCO                                                    
     C                   EVAL      S5TPED=@PTPED                                                    
     C                   EVAL      S5DATP=@PDATP                                                    
     C                   EVAL      S5NOPL=@PNOPL                                                    
     C                   EVAL      S5LINE=@PLINE                                                    
     C     KCODEPE       CHAIN(N)  CODEPE                                                           
     C                   IF        %FOUND(CODEPE)                                                   
      *                                                                                             
      * Recupero la clave del pedido comercial y actualizo                                          
      *                                                                                             
     C                   EVAL      ZXGRAU=0                                                         
     C                   EVAL      T0CIAS=@PCIAS                                                    
     C                   EVAL      T0DLGA=@PDLGA                                                    
     C                   EVAL      T0NPCO=@PNPCO                                                    
     C                   EVAL      T0TPED=@PTPED                                                    
     C                   EVAL      T0DATP=@PDATP                                                    
     C                   EVAL      T0NOPL=@PNOPL                                                    
     C                   EVAL      T0LINE=@PLINE                                                    
     C                   EVAL      T0ARV1=*BLANKS                                                   
     C                   EVAL      T0COM2=*BLANKS                                                   
     C     KEDTRLP00X    SETLL     EDTRLP00                                                         
     C     KEDTRLP00     READE     EDTRLP00                                                         
     C                   DOW       NOT %EOF(EDTRLP00)                                               
      *                                                                                             
     C                   EVAL      T0DWRF=*DATE                                                     
24080C                   TIME                    T0HWRF                                             
     C                   EVAL      T0MODI=1                                                         
     C                   UPDATE    REDTRLP00                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
      *                                                                                             
      * Auditoría sólo para la 1ª línea                                                             
      *                                                                                             
     C                   IF        ZXGRAU=0                                                         
     C                   EXSR      CS_UPD_EDTRAU                                                    
     C                   EVAL      ZXGRAU=1                                                         
     C                   ENDIF                                                                      
      *                                                                                             
     C     KEDTRLP00     READE     EDTRLP00                                                         
     C                   ENDDO                                                                      
      *                                                                                             
      * Posible E-Mail con datos del pedido de ventas                                               
      *                                                                                             
     C                   MOVEL(P)  T0CIAS        @EMCIAA                                            
     C                   MOVEL(P)  T0DLGA        @EMDLGA                                            
     C                   MOVEL(P)  T0CUST        @EMCODE                                            
     C                   MOVEL(P)  T0NPCO        @EMNDOC                                            
     C                   MOVE      T0DATP        @EMFDOC                                            
     C                   MOVE      T0LINE        @EMLDOC                                            
      *                                                                                             
     C                   ENDIF                                                                      
      *                                                                                             
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Cambiar dirección de entrega                                       *                        
      **********************************************************************                        
     C     CS_COD012     BEGSR                                                                      
      *                                                                                             
      * Actualizo campos en registro de trazabilidad                                                
      *                                                                                             
     C                   EVAL      S5CIAS=@PCIAS                                                    
     C                   EVAL      S5DLGA=@PDLGA                                                    
     C                   EVAL      S5NPCO=@PNPCO                                                    
     C                   EVAL      S5TPED=@PTPED                                                    
     C                   EVAL      S5DATP=@PDATP                                                    
     C                   EVAL      S5NOPL=@PNOPL                                                    
     C                   EVAL      S5LINE=@PLINE                                                    
     C     KCODEPE       CHAIN(N)  CODEPE                                                           
     C                   IF        %FOUND(CODEPE)                                                   
     C                   EVAL      S0CIAS=@PCIAS                                                    
     C                   EVAL      S0DLGA=@PDLGA                                                    
     C                   EVAL      S0NPCO=@PNPCO                                                    
     C                   EVAL      S0TPED=@PTPED                                                    
     C                   EVAL      S0DATP=@PDATP                                                    
     C                   EVAL      S0NOPL=@PNOPL                                                    
     C     KCOCAPE       CHAIN(N)  COCAPE                                                           
     C                   IF        %FOUND(COCAPE)                                                   
      *                                                                                             
      * Recupero la clave del pedido comercial y actualizo                                          
      *                                                                                             
     C                   EVAL      ZXGRAU=0                                                         
     C                   EVAL      T0CIAS=@PCIAS                                                    
     C                   EVAL      T0DLGA=@PDLGA                                                    
     C                   EVAL      T0NPCO=@PNPCO                                                    
     C                   EVAL      T0TPED=@PTPED                                                    
     C                   EVAL      T0DATP=@PDATP                                                    
     C                   EVAL      T0NOPL=@PNOPL                                                    
     C                   EVAL      T0LINE=@PLINE                                                    
     C                   EVAL      T0ARV1=*BLANKS                                                   
     C                   EVAL      T0COM2=*BLANKS                                                   
     C     KEDTRLP00X    SETLL     EDTRLP00                                                         
     C     KEDTRLP00     READE     EDTRLP00                                                         
     C                   DOW       NOT %EOF(EDTRLP00)                                               
      *                                                                                             
     C                   EVAL      T0TDI1=S0TDI1                                                    
     C                   EVAL      T0DWRF=*DATE                                                     
24080C                   TIME                    T0HWRF                                             
     C                   EVAL      T0MODI=1                                                         
     C                   UPDATE    REDTRLP00                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
      *                                                                                             
      * Auditoría sólo para la 1ª línea                                                             
      *                                                                                             
     C                   IF        ZXGRAU=0                                                         
     C                   EXSR      CS_UPD_EDTRAU                                                    
     C                   EVAL      ZXGRAU=1                                                         
     C                   ENDIF                                                                      
      *                                                                                             
     C     KEDTRLP00     READE     EDTRLP00                                                         
     C                   ENDDO                                                                      
      *                                                                                             
      * Posible E-Mail con datos del pedido de ventas                                               
      *                                                                                             
     C                   MOVEL(P)  T0CIAS        @EMCIAA                                            
     C                   MOVEL(P)  T0DLGA        @EMDLGA                                            
     C                   MOVEL(P)  T0CUST        @EMCODE                                            
     C                   MOVEL(P)  T0NPCO        @EMNDOC                                            
     C                   MOVE      T0DATP        @EMFDOC                                            
     C                   MOVE      T0LINE        @EMLDOC                                            
      *                                                                                             
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
      *                                                                                             
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Cambiar condición de coenvío                                       *                        
      **********************************************************************                        
     C     CS_COD013     BEGSR                                                                      
      *                                                                                             
      * Actualizo campos en registro de trazabilidad                                                
      *                                                                                             
     C                   EVAL      S5CIAS=@PCIAS                                                    
     C                   EVAL      S5DLGA=@PDLGA                                                    
     C                   EVAL      S5NPCO=@PNPCO                                                    
     C                   EVAL      S5TPED=@PTPED                                                    
     C                   EVAL      S5DATP=@PDATP                                                    
     C                   EVAL      S5NOPL=@PNOPL                                                    
     C                   EVAL      S5LINE=@PLINE                                                    
     C     KCODEPE       CHAIN(N)  CODEPE                                                           
     C                   IF        %FOUND(CODEPE)                                                   
NAP45C                   EVAL      S0CIAS=@PCIAS                                                    
NAP45C                   EVAL      S0DLGA=@PDLGA                                                    
NAP45C                   EVAL      S0NPCO=@PNPCO                                                    
NAP45C                   EVAL      S0TPED=@PTPED                                                    
NAP45C                   EVAL      S0DATP=@PDATP                                                    
NAP45C                   EVAL      S0NOPL=@PNOPL                                                    
NAP45C     KCOCAPE       CHAIN(N)  COCAPE                                                           
      *                                                                                             
      * Recupero la clave del pedido comercial y actualizo                                          
      *                                                                                             
     C                   EVAL      ZXGRAU=0                                                         
     C                   EVAL      T0CIAS=@PCIAS                                                    
     C                   EVAL      T0DLGA=@PDLGA                                                    
     C                   EVAL      T0NPCO=@PNPCO                                                    
     C                   EVAL      T0TPED=@PTPED                                                    
     C                   EVAL      T0DATP=@PDATP                                                    
     C                   EVAL      T0NOPL=@PNOPL                                                    
     C                   EVAL      T0LINE=@PLINE                                                    
     C                   EVAL      T0ARV1=*BLANKS                                                   
     C                   EVAL      T0COM2=*BLANKS                                                   
     C     KEDTRLP00X    SETLL     EDTRLP00                                                         
     C     KEDTRLP00     READE     EDTRLP00                                                         
     C                   DOW       NOT %EOF(EDTRLP00)                                               
      *                                                                                             
     C                   EVAL      T0DWRF=*DATE                                                     
24080C                   TIME                    T0HWRF                                             
     C                   EVAL      T0MODI=1                                                         
24080 * Datos coenvio                                                                               
NAP45* Si coenvio tipo 3, grabamos coenvío en blanco                                               
NAP45C                   IF        S0COEN='3'                                                       
NAP45C                   EVAL      S5NCOE=''                                                        
NAP45C                   EVAL      S5NCOI=''                                                        
NAP45C                   EVAL      S5NCOF=''                                                        
NAP45C                   ENDIF                                                                      
24080C                   EVAL      T0NCOE=S5NCOE                                                    
24080C                   EVAL      T0NCOI=S5NCOI                                                    
24080C                   EVAL      T0NCOF=S5NCOF                                                    
     C                   UPDATE    REDTRLP00                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
      *                                                                                             
      * Auditoría sólo para la 1ª línea                                                             
      *                                                                                             
     C                   IF        ZXGRAU=0                                                         
     C                   EXSR      CS_UPD_EDTRAU                                                    
     C                   EVAL      ZXGRAU=1                                                         
     C                   ENDIF                                                                      
      *                                                                                             
     C     KEDTRLP00     READE     EDTRLP00                                                         
     C                   ENDDO                                                                      
      *                                                                                             
      * Posible E-Mail con datos del pedido de ventas                                               
      *                                                                                             
     C                   MOVEL(P)  T0CIAS        @EMCIAA                                            
     C                   MOVEL(P)  T0DLGA        @EMDLGA                                            
     C                   MOVEL(P)  T0CUST        @EMCODE                                            
     C                   MOVEL(P)  T0NPCO        @EMNDOC                                            
     C                   MOVE      T0DATP        @EMFDOC                                            
     C                   MOVE      T0LINE        @EMLDOC                                            
      *                                                                                             
     C                   ENDIF                                                                      
      *                                                                                             
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Cambiar fecha solicitada en pedido comercial                       *                        
      **********************************************************************                        
     C     CS_COD014     BEGSR                                                                      
      *                                                                                             
      * Actualizo campos en registro de trazabilidad                                                
      *                                                                                             
     C                   EVAL      S5CIAS=@PCIAS                                                    
     C                   EVAL      S5DLGA=@PDLGA                                                    
     C                   EVAL      S5NPCO=@PNPCO                                                    
     C                   EVAL      S5TPED=@PTPED                                                    
     C                   EVAL      S5DATP=@PDATP                                                    
     C                   EVAL      S5NOPL=@PNOPL                                                    
     C                   EVAL      S5LINE=@PLINE                                                    
     C     KCODEPE       CHAIN(N)  CODEPE                                                           
     C                   IF        %FOUND(CODEPE)                                                   
      *                                                                                             
      * Recupero la clave del pedido comercial y actualizo                                          
      *                                                                                             
     C                   EVAL      ZXGRAU=0                                                         
     C                   EVAL      T0CIAS=@PCIAS                                                    
     C                   EVAL      T0DLGA=@PDLGA                                                    
     C                   EVAL      T0NPCO=@PNPCO                                                    
     C                   EVAL      T0TPED=@PTPED                                                    
     C                   EVAL      T0DATP=@PDATP                                                    
     C                   EVAL      T0NOPL=@PNOPL                                                    
     C                   EVAL      T0LINE=@PLINE                                                    
     C                   EVAL      T0ARV1=*BLANKS                                                   
     C                   EVAL      T0COM2=*BLANKS                                                   
     C     KEDTRLP00X    SETLL     EDTRLP00                                                         
     C     KEDTRLP00     READE     EDTRLP00                                                         
     C                   DOW       NOT %EOF(EDTRLP00)                                               
      *                                                                                             
     C                   EVAL      T0DWRF=*DATE                                                     
24080C                   TIME                    T0HWRF                                             
     C                   EVAL      T0MODI=1                                                         
24080 * Fecha solicitada cliente                                                                    
24080C                   EVAL      T0FREP=S5FREP                                                    
     C                   UPDATE    REDTRLP00                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
      *                                                                                             
      * Auditoría sólo para la 1ª línea                                                             
      *                                                                                             
     C                   IF        ZXGRAU=0                                                         
     C                   EXSR      CS_UPD_EDTRAU                                                    
     C                   EVAL      ZXGRAU=1                                                         
     C                   ENDIF                                                                      
      *                                                                                             
     C     KEDTRLP00     READE     EDTRLP00                                                         
     C                   ENDDO                                                                      
      *                                                                                             
      * Posible E-Mail con datos del pedido de ventas                                               
      *                                                                                             
     C                   MOVEL(P)  T0CIAS        @EMCIAA                                            
     C                   MOVEL(P)  T0DLGA        @EMDLGA                                            
     C                   MOVEL(P)  T0CUST        @EMCODE                                            
     C                   MOVEL(P)  T0NPCO        @EMNDOC                                            
     C                   MOVE      T0DATP        @EMFDOC                                            
     C                   MOVE      T0LINE        @EMLDOC                                            
      *                                                                                             
     C                   ENDIF                                                                      
      *                                                                                             
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Retener línea x riesgo en pedido comercial                         *                        
      **********************************************************************                        
     C     CS_COD015     BEGSR                                                                      
      *                                                                                             
      * Actualizo campos en registro de trazabilidad                                                
      *                                                                                             
13040C**                 EVAL      S5CIAS=@PCIAS                                                    
13040C**                 EVAL      S5DLGA=@PDLGA                                                    
13040C**                 EVAL      S5NPCO=@PNPCO                                                    
13040C**                 EVAL      S5TPED=@PTPED                                                    
13040C**                 EVAL      S5DATP=@PDATP                                                    
13040C**                 EVAL      S5NOPL=@PNOPL                                                    
13040C**                 EVAL      S5LINE=@PLINE                                                    
13040C**   KCODEPE       CHAIN(N)  CODEPE                                                           
13040C**                 IF        %FOUND(CODEPE)                                                   
13040C                   EVAL      S0CIAS=@PCIAS                                                    
13040C                   EVAL      S0DLGA=@PDLGA                                                    
13040C                   EVAL      S0NPCO=@PNPCO                                                    
13040C                   EVAL      S0TPED=@PTPED                                                    
13040C                   EVAL      S0DATP=@PDATP                                                    
13040C                   EVAL      S0NOPL=@PNOPL                                                    
13040C     KCOCAPE       SETLL     CODEPE                                                           
13040C     KCOCAPE       READE(N)  CODEPE                                                           
13040C                   DOW       NOT %EOF(CODEPE)                                                 
      *                                                                                             
      * Recupero la clave del pedido comercial y actualizo                                          
      *                                                                                             
     C                   EVAL      ZXGRAU=0                                                         
13040C**                 EVAL      T0CIAS=@PCIAS                                                    
13040C**                 EVAL      T0DLGA=@PDLGA                                                    
13040C**                 EVAL      T0NPCO=@PNPCO                                                    
13040C**                 EVAL      T0TPED=@PTPED                                                    
13040C**                 EVAL      T0DATP=@PDATP                                                    
13040C**                 EVAL      T0NOPL=@PNOPL                                                    
13040C**                 EVAL      T0LINE=@PLINE                                                    
13040C                   EVAL      T0CIAS=S5CIAS                                                    
13040C                   EVAL      T0DLGA=S5DLGA                                                    
13040C                   EVAL      T0NPCO=S5NPCO                                                    
13040C                   EVAL      T0TPED=S5TPED                                                    
13040C                   EVAL      T0DATP=S5DATP                                                    
13040C                   EVAL      T0NOPL=S5NOPL                                                    
13040C                   EVAL      T0LINE=S5LINE                                                    
     C                   EVAL      T0ARV1=*BLANKS                                                   
     C                   EVAL      T0COM2=*BLANKS                                                   
     C     KEDTRLP00X    SETLL     EDTRLP00                                                         
     C     KEDTRLP00     READE     EDTRLP00                                                         
     C                   DOW       NOT %EOF(EDTRLP00)                                               
      *                                                                                             
      * Sólo actúo si no tenía riesgo y ahora si lo tiene                                           
      *                                                                                             
C1350C*                  IF        T0RISK=0                                                         
C1350C                   IF        T0RISK=0 OR T0RISK=2                                             
     C                   EVAL      S0CIAS=@PCIAS                                                    
     C                   EVAL      S0DLGA=@PDLGA                                                    
     C                   EVAL      S0NPCO=@PNPCO                                                    
     C                   EVAL      S0TPED=@PTPED                                                    
     C                   EVAL      S0DATP=@PDATP                                                    
     C                   EVAL      S0NOPL=@PNOPL                                                    
     C     KCOCAPE       CHAIN(N)  COCAPE                                                           
     C                   IF        %FOUND(COCAPE)                                                   
     C                             AND S0REXC>='1'                                                  
13040C                             And S0RAUT<'1'                                                   
      *                                                                                             
     C                   EVAL      T0DWRF=*DATE                                                     
24080C                   TIME                    T0HWRF                                             
     C                   EVAL      T0RISK=1                                                         
13040C**                 EVAL      T0MODI=1                                                         
     C                   UPDATE    REDTRLP00                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
      *                                                                                             
      * Auditoría sólo para la 1ª línea                                                             
      *                                                                                             
     C                   IF        ZXGRAU=0                                                         
     C                   EXSR      CS_UPD_EDTRAU                                                    
     C                   EVAL      ZXGRAU=1                                                         
     C                   ENDIF                                                                      
      *                                                                                             
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
      *                                                                                             
     C     KEDTRLP00     READE     EDTRLP00                                                         
     C                   ENDDO                                                                      
      *                                                                                             
      * Posible E-Mail con datos del pedido de ventas                                               
      *                                                                                             
     C                   MOVEL(P)  T0CIAS        @EMCIAA                                            
     C                   MOVEL(P)  T0DLGA        @EMDLGA                                            
     C                   MOVEL(P)  T0CUST        @EMCODE                                            
     C                   MOVEL(P)  T0NPCO        @EMNDOC                                            
     C                   MOVE      T0DATP        @EMFDOC                                            
     C                   MOVE      T0LINE        @EMLDOC                                            
      *                                                                                             
13040C**                 ENDIF                                                                      
13040C     KCOCAPE       READE(N)  CODEPE                                                           
13040C                   ENDDO                                                                      
      *                                                                                             
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Autorizar ED productiva                                            *                        
      **********************************************************************                        
     C     CS_COD016     BEGSR                                                                      
      *                                                                                             
      * Actualizo campos en registro de trazabilidad                                                
      *                                                                                             
     C                   EVAL      S5CIAS=@PCIAS                                                    
     C                   EVAL      S5DLGA=@PDLGA                                                    
     C                   EVAL      S5NPCO=@PNPCO                                                    
     C                   EVAL      S5TPED=@PTPED                                                    
     C                   EVAL      S5DATP=@PDATP                                                    
     C                   EVAL      S5NOPL=@PNOPL                                                    
     C                   EVAL      S5LINE=@PLINE                                                    
     C     KCODEPE       CHAIN(N)  CODEPE                                                           
     C                   IF        %FOUND(CODEPE)                                                   
      *                                                                                             
      * Recupero la clave del pedido comercial y actualizo                                          
      *                                                                                             
     C                   EVAL      ZXGRAU=0                                                         
     C                   EVAL      T0CIAS=@PCIAS                                                    
     C                   EVAL      T0DLGA=@PDLGA                                                    
     C                   EVAL      T0NPCO=@PNPCO                                                    
     C                   EVAL      T0TPED=@PTPED                                                    
     C                   EVAL      T0DATP=@PDATP                                                    
     C                   EVAL      T0NOPL=@PNOPL                                                    
     C                   EVAL      T0LINE=@PLINE                                                    
     C                   EVAL      T0ARV1=*BLANKS                                                   
     C                   EVAL      T0COM2=*BLANKS                                                   
     C     KEDTRLP00X    SETLL     EDTRLP00                                                         
     C     KEDTRLP00     READE     EDTRLP00                                                         
     C                   DOW       NOT %EOF(EDTRLP00)                                               
      *                                                                                             
     C                   EVAL      T0DWRF=*DATE                                                     
24080C                   TIME                    T0HWRF                                             
     C                   EVAL      T0EDDP=1                                                         
     C                   UPDATE    REDTRLP00                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
      *                                                                                             
      * Auditoría sólo para la 1ª línea                                                             
      *                                                                                             
     C                   IF        ZXGRAU=0                                                         
     C                   EXSR      CS_UPD_EDTRAU                                                    
     C                   EVAL      ZXGRAU=1                                                         
     C                   ENDIF                                                                      
      *                                                                                             
     C     KEDTRLP00     READE     EDTRLP00                                                         
     C                   ENDDO                                                                      
      *                                                                                             
      * Posible E-Mail con datos del pedido de ventas                                               
      *                                                                                             
     C                   MOVEL(P)  T0CIAS        @EMCIAA                                            
     C                   MOVEL(P)  T0DLGA        @EMDLGA                                            
     C                   MOVEL(P)  T0CUST        @EMCODE                                            
     C                   MOVEL(P)  T0NPCO        @EMNDOC                                            
     C                   MOVE      T0DATP        @EMFDOC                                            
     C                   MOVE      T0LINE        @EMLDOC                                            
      *                                                                                             
     C                   ENDIF                                                                      
      *                                                                                             
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Entrega de Proveedor 3º a cliente realizada                        *                        
      **********************************************************************                        
     C     CS_COD017     BEGSR                                                                      
      *                                                                                             
      * Actualizo campos en registro de trazabilidad                                                
      *                                                                                             
     C                   EVAL      S5CIAS=@PCIAS                                                    
     C                   EVAL      S5DLGA=@PDLGA                                                    
     C                   EVAL      S5NPCO=@PNPCO                                                    
     C                   EVAL      S5TPED=@PTPED                                                    
     C                   EVAL      S5DATP=@PDATP                                                    
     C                   EVAL      S5NOPL=@PNOPL                                                    
     C                   EVAL      S5LINE=@PLINE                                                    
     C     KCODEPE       CHAIN(N)  CODEPE                                                           
     C                   IF        %FOUND(CODEPE)                                                   
      *                                                                                             
      * Recupero la clave del pedido comercial y actualizo                                          
      *                                                                                             
     C                   EVAL      ZXGRAU=0                                                         
     C                   EVAL      T0CIAS=@PCIAS                                                    
     C                   EVAL      T0DLGA=@PDLGA                                                    
     C                   EVAL      T0NPCO=@PNPCO                                                    
     C                   EVAL      T0TPED=@PTPED                                                    
     C                   EVAL      T0DATP=@PDATP                                                    
     C                   EVAL      T0NOPL=@PNOPL                                                    
     C                   EVAL      T0LINE=@PLINE                                                    
     C                   EVAL      T0ARV1=*BLANKS                                                   
     C                   EVAL      T0COM2=*BLANKS                                                   
     C     KEDTRLP00X    SETLL     EDTRLP00                                                         
     C     KEDTRLP00     READE     EDTRLP00                                                         
     C                   DOW       NOT %EOF(EDTRLP00)                                               
      *                                                                                             
     C                   EVAL      T0DWRF=*DATE                                                     
24080C                   TIME                    T0HWRF                                             
     C                   EVAL      T0ED3R=1                                                         
     C                   UPDATE    REDTRLP00                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
      *                                                                                             
      * Auditoría sólo para la 1ª línea                                                             
      *                                                                                             
     C                   IF        ZXGRAU=0                                                         
     C                   EXSR      CS_UPD_EDTRAU                                                    
     C                   EVAL      ZXGRAU=1                                                         
     C                   ENDIF                                                                      
      *                                                                                             
     C     KEDTRLP00     READE     EDTRLP00                                                         
     C                   ENDDO                                                                      
      *                                                                                             
      * Posible E-Mail con datos del pedido de ventas                                               
      *                                                                                             
     C                   MOVEL(P)  T0CIAS        @EMCIAA                                            
     C                   MOVEL(P)  T0DLGA        @EMDLGA                                            
     C                   MOVEL(P)  T0CUST        @EMCODE                                            
     C                   MOVEL(P)  T0NPCO        @EMNDOC                                            
     C                   MOVE      T0DATP        @EMFDOC                                            
     C                   MOVE      T0LINE        @EMLDOC                                            
      *                                                                                             
     C                   ENDIF                                                                      
      *                                                                                             
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Cerrar línea en pedido comercial                                   *                        
      **********************************************************************                        
     C     CS_COD018     BEGSR                                                                      
      *                                                                                             
      * Recupero la clave del pedido comercial y elimino todo                                       
      *                                                                                             
     C                   EVAL      ZXGRAU=0                                                         
     C                   EVAL      T0CIAS=@PCIAS                                                    
     C                   EVAL      T0DLGA=@PDLGA                                                    
     C                   EVAL      T0NPCO=@PNPCO                                                    
     C                   EVAL      T0TPED=@PTPED                                                    
     C                   EVAL      T0DATP=@PDATP                                                    
     C                   EVAL      T0NOPL=@PNOPL                                                    
     C                   EVAL      T0LINE=@PLINE                                                    
     C                   EVAL      T0ARV1=*BLANKS                                                   
     C                   EVAL      T0COM2=*BLANKS                                                   
      *                                                                                             
     C     KEDTRLP00X    SETLL     EDTRLP00                                                         
     C     KEDTRLP00     READE     EDTRLP00                                                         
     C                   DOW       NOT %EOF(EDTRLP00)                                               
      *                                                                                             
      * Si tiene compra asociada, dejo que sea el evento de                                         
      * compras el que haga la eliminación                                                          
      *                                                                                             
     C                   IF        T0ARV1=*BLANKS                                                   
     C                   EVAL      T0EDST='95'                                                      
     C                   EVAL      T0MODI=1                                                         
     C                   UPDATE    REDTRLP00                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
     C                   ENDIF                                                                      
      *                                                                                             
      * Auditoría                                                                                   
      *                                                                                             
     C                   IF        ZXGRAU=0                                                         
     C                   EXSR      CS_UPD_EDTRAU                                                    
     C                   EVAL      ZXGRAU=1                                                         
     C                   ENDIF                                                                      
      *                                                                                             
     C     KEDTRLP00     READE     EDTRLP00                                                         
     C                   ENDDO                                                                      
      *                                                                                             
      * En este caso cierro todas las auditorias relacionadas                                       
      *                                                                                             
     C                   CLEAR                   T1ARV1                                             
     C                   CLEAR                   T1COM2                                             
     C                   CLEAR                   T1EDAU                                             
     C                   CLEAR                   T1DATR                                             
     C                   CLEAR                   T1HORR                                             
     C                   CLEAR                   T1TMST                                             
     C     KEDTRAU00     SETLL     EDTRAU00                                                         
     C     KEDTRAU00X    READE     EDTRAU00                                                         
     C                   DOW       NOT %EOF(EDTRAU00)                                               
      *                                                                                             
      * Si tiene compra asociada, dejo que sea el evento de                                         
      * compras el que cierre                                                                       
      *                                                                                             
     C                   IF        T1ARV1=*BLANKS                                                   
     C                   EVAL      T1STUL='5'                                                       
     C                   UPDATE    REDTRAU00                                                        
     C                   ENDIF                                                                      
      *                                                                                             
     C     KEDTRAU00X    READE     EDTRAU00                                                         
     C                   ENDDO                                                                      
      *                                                                                             
      * Posible E-Mail con datos del pedido de ventas                                               
      *                                                                                             
     C                   MOVEL(P)  T0CIAS        @EMCIAA                                            
     C                   MOVEL(P)  T0DLGA        @EMDLGA                                            
     C                   MOVEL(P)  T0CUST        @EMCODE                                            
     C                   MOVEL(P)  T0NPCO        @EMNDOC                                            
     C                   MOVE      T0DATP        @EMFDOC                                            
     C                   MOVE      T0LINE        @EMLDOC                                            
      *                                                                                             
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Reabrir línea comercial                                                                     
      **********************************************************************                        
     C     CS_COD019     BEGSR                                                                      
      *                                                                                             
      * Reabrimos la línea simplemente cambiando el estado                                          
      *                                                                                             
     C                   EVAL      ZXGRAU=0                                                         
     C                   EVAL      T0CIAS=@PCIAS                                                    
     C                   EVAL      T0DLGA=@PDLGA                                                    
     C                   EVAL      T0NPCO=@PNPCO                                                    
     C                   EVAL      T0TPED=@PTPED                                                    
     C                   EVAL      T0DATP=@PDATP                                                    
     C                   EVAL      T0NOPL=@PNOPL                                                    
     C                   EVAL      T0LINE=@PLINE                                                    
     C                   EVAL      T0ARV1=*BLANKS                                                   
     C                   EVAL      T0COM2=*BLANKS                                                   
      *                                                                                             
     C     KEDTRLP00X    SETLL     EDTRLP00                                                         
     C     KEDTRLP00     READE     EDTRLP00                                                         
     C                   DOW       NOT %EOF(EDTRLP00)                                               
      *                                                                                             
     C                   EVAL      T0DWRF=T0DWR0                                                    
     C                   EVAL      T0HWRF=T0HWR0                                                    
     C                   EVAL      T0EDST='20'                                                      
     C                   EVAL      T0MODI=1                                                         
     C                   UPDATE    REDTRLP00                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
      *                                                                                             
      * Auditoría                                                                                   
      *                                                                                             
     C                   IF        ZXGRAU=0                                                         
     C                   EXSR      CS_UPD_EDTRAU                                                    
     C                   EVAL      ZXGRAU=1                                                         
     C                   ENDIF                                                                      
      *                                                                                             
     C     KEDTRLP00     READE     EDTRLP00                                                         
     C                   ENDDO                                                                      
      *                                                                                             
      * Posible E-Mail con datos del pedido de venta                                                
      *                                                                                             
     C                   MOVEL(P)  T0CIAS        @EMCIAA                                            
     C                   MOVEL(P)  T0DLGA        @EMDLGA                                            
     C                   MOVEL(P)  T0CUST        @EMCODE                                            
     C                   MOVEL(P)  T0NPCO        @EMNDOC                                            
     C                   MOVE      T0DATP        @EMFDOC                                            
     C                   MOVE      T0LINE        @EMLDOC                                            
      *                                                                                             
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Desautorizar ED productiva                                         *                        
      **********************************************************************                        
     C     CS_COD020     BEGSR                                                                      
      *                                                                                             
      * Actualizo campos en registro de trazabilidad                                                
      *                                                                                             
     C                   EVAL      S5CIAS=@PCIAS                                                    
     C                   EVAL      S5DLGA=@PDLGA                                                    
     C                   EVAL      S5NPCO=@PNPCO                                                    
     C                   EVAL      S5TPED=@PTPED                                                    
     C                   EVAL      S5DATP=@PDATP                                                    
     C                   EVAL      S5NOPL=@PNOPL                                                    
     C                   EVAL      S5LINE=@PLINE                                                    
     C     KCODEPE       CHAIN(N)  CODEPE                                                           
     C                   IF        %FOUND(CODEPE)                                                   
      *                                                                                             
      * Recupero la clave del pedido comercial y actualizo                                          
      *                                                                                             
     C                   EVAL      ZXGRAU=0                                                         
     C                   EVAL      T0CIAS=@PCIAS                                                    
     C                   EVAL      T0DLGA=@PDLGA                                                    
     C                   EVAL      T0NPCO=@PNPCO                                                    
     C                   EVAL      T0TPED=@PTPED                                                    
     C                   EVAL      T0DATP=@PDATP                                                    
     C                   EVAL      T0NOPL=@PNOPL                                                    
     C                   EVAL      T0LINE=@PLINE                                                    
     C                   EVAL      T0ARV1=*BLANKS                                                   
     C                   EVAL      T0COM2=*BLANKS                                                   
     C     KEDTRLP00X    SETLL     EDTRLP00                                                         
     C     KEDTRLP00     READE     EDTRLP00                                                         
     C                   DOW       NOT %EOF(EDTRLP00)                                               
      *                                                                                             
     C                   EVAL      T0DWRF=*DATE                                                     
24080C                   TIME                    T0HWRF                                             
     C                   EVAL      T0EDDP=0                                                         
     C                   UPDATE    REDTRLP00                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
      *                                                                                             
      * Auditoría sólo para la 1ª línea                                                             
      *                                                                                             
     C                   IF        ZXGRAU=0                                                         
     C                   EXSR      CS_UPD_EDTRAU                                                    
     C                   EVAL      ZXGRAU=1                                                         
     C                   ENDIF                                                                      
      *                                                                                             
     C     KEDTRLP00     READE     EDTRLP00                                                         
     C                   ENDDO                                                                      
      *                                                                                             
      * Posible E-Mail con datos del pedido de ventas                                               
      *                                                                                             
     C                   MOVEL(P)  T0CIAS        @EMCIAA                                            
     C                   MOVEL(P)  T0DLGA        @EMDLGA                                            
     C                   MOVEL(P)  T0CUST        @EMCODE                                            
     C                   MOVEL(P)  T0NPCO        @EMNDOC                                            
     C                   MOVE      T0DATP        @EMFDOC                                            
     C                   MOVE      T0LINE        @EMLDOC                                            
      *                                                                                             
     C                   ENDIF                                                                      
      *                                                                                             
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Cancelar confirmación de pedido comercial                          *                        
      **********************************************************************                        
     C     CS_COD021     BEGSR                                                                      
      *                                                                                             
      * Sólo puedo enviar E-Mail ya que no hay trazabilidad                                         
      *                                                                                             
     C                   MOVEL(P)  T0CIAS        @EMCIAA                                            
     C                   MOVEL(P)  T0DLGA        @EMDLGA                                            
     C                   MOVEL(P)  T0CUST        @EMCODE                                            
     C                   MOVEL(P)  T0NPCO        @EMNDOC                                            
     C                   MOVE      T0DATP        @EMFDOC                                            
     C                   MOVE      T0LINE        @EMLDOC                                            
      *                                                                                             
     C                   ENDSR                                                                      
      **********************************************************************                        
      * ED no creada porque falta precio de compra                         *                        
      **********************************************************************                        
     C     CS_COD022     BEGSR                                                                      
In214 *                                                                                             
In214 * Recupero la clave del pedido comercial y actualizo                                          
In214C                   EVAL      ZXGRAU=0                                                         
In214C                   EVAL      T0CIAS=@PCIAS                                                    
In214C                   EVAL      T0DLGA=@PDLGA                                                    
In214C                   EVAL      T0NPCO=@PNPCO                                                    
In214C                   EVAL      T0TPED=@PTPED                                                    
In214C                   EVAL      T0DATP=@PDATP                                                    
In214C                   EVAL      T0NOPL=@PNOPL                                                    
In214C                   EVAL      T0LINE=@PLINE                                                    
In214C                   EVAL      T0ARV1=*BLANKS                                                   
In214C                   EVAL      T0COM2=*BLANKS                                                   
In214C     KEDTRLP00X    SETLL     EDTRLP00                                                         
In214C     KEDTRLP00     READE(N)  EDTRLP00                                                         
In214C                   DOW       NOT %EOF(EDTRLP00)                                               
In214 *                                                                                             
In214 * Auditoría sólo para la 1ª línea                                                             
In214C                   IF        ZXGRAU=0                                                         
In214C                   EXSR      CS_UPD_EDTRAU                                                    
In214C                   EVAL      ZXGRAU=1                                                         
In214C                   ENDIF                                                                      
In214 *                                                                                             
In214C     KEDTRLP00     READE(N)  EDTRLP00                                                         
In214C                   ENDDO                                                                      
      *                                                                                             
      * Posible E-Mail con datos del pedido de ventas                                               
      *                                                                                             
In214C*                  MOVEL(P)  T0CIAS        @EMCIAA                                            
In214C*                  MOVEL(P)  T0DLGA        @EMDLGA                                            
In214C*                  MOVEL(P)  T0CUST        @EMCODE                                            
In214C*                  MOVEL(P)  T0NPCO        @EMNDOC                                            
In214C*                  MOVE      T0DATP        @EMFDOC                                            
In214C*                  MOVE      T0LINE        @EMLDOC                                            
In214C                   MOVEL(P)  T0CIA1        @EMCIAA                                            
In214C                   MOVEL(P)  T0DLG1        @EMDLGA                                            
In214C                   MOVEL(P)  T0PRVR        @EMCODE                                            
In214C                   MOVEL(P)  T0NPC1        @EMNDOC                                            
In214C                   MOVE      T0DAT1        @EMFDOC                                            
In214C                   MOVE      T0LIN1        @EMLDOC                                            
      *                                                                                             
     C                   ENDSR                                                                      
      **********************************************************************                        
      * ED no creada porque falta artículo en productiva                   *                        
      **********************************************************************                        
     C     CS_COD023     BEGSR                                                                      
      *                                                                                             
      * Sólo puedo enviar E-Mail ya que no hay trazabilidad                                         
      *                                                                                             
     C                   MOVEL(P)  T0CIAS        @EMCIAA                                            
     C                   MOVEL(P)  T0DLGA        @EMDLGA                                            
     C                   MOVEL(P)  T0CUST        @EMCODE                                            
     C                   MOVEL(P)  T0NPCO        @EMNDOC                                            
     C                   MOVE      T0DATP        @EMFDOC                                            
     C                   MOVE      T0LINE        @EMLDOC                                            
      *                                                                                             
     C                   ENDSR                                                                      
      **********************************************************************                        
      * ED no creada porque falta artículo en Trace                        *                        
      **********************************************************************                        
     C     CS_COD024     BEGSR                                                                      
      *                                                                                             
      * Sólo puedo enviar E-Mail ya que no hay trazabilidad                                         
      *                                                                                             
     C                   MOVEL(P)  T0CIAS        @EMCIAA                                            
     C                   MOVEL(P)  T0DLGA        @EMDLGA                                            
     C                   MOVEL(P)  T0CUST        @EMCODE                                            
     C                   MOVEL(P)  T0NPCO        @EMNDOC                                            
     C                   MOVE      T0DATP        @EMFDOC                                            
     C                   MOVE      T0LINE        @EMLDOC                                            
      *                                                                                             
     C                   ENDSR                                                                      
13040 **********************************************************************                        
13040 * Autorizar pedido excedido de riesgo en comercial                   *                        
13040 **********************************************************************                        
13040C     CS_COD025     BEGSR                                                                      
13040 *                                                                                             
13040 * Actualizo campos en registro de trazabilidad                                                
13040 *                                                                                             
13040C                   EVAL      S0CIAS=@PCIAS                                                    
13040C                   EVAL      S0DLGA=@PDLGA                                                    
13040C                   EVAL      S0NPCO=@PNPCO                                                    
13040C                   EVAL      S0TPED=@PTPED                                                    
13040C                   EVAL      S0DATP=@PDATP                                                    
13040C                   EVAL      S0NOPL=@PNOPL                                                    
13040C     KCOCAPE       SETLL     CODEPE                                                           
13040C     KCOCAPE       READE(N)  CODEPE                                                           
13040C                   DOW       NOT %EOF(CODEPE)                                                 
13040 *                                                                                             
13040 * Recupero la clave del pedido comercial y actualizo                                          
13040 *                                                                                             
13040C                   EVAL      ZXGRAU=0                                                         
13040C                   EVAL      T0CIAS=S5CIAS                                                    
13040C                   EVAL      T0DLGA=S5DLGA                                                    
13040C                   EVAL      T0NPCO=S5NPCO                                                    
13040C                   EVAL      T0TPED=S5TPED                                                    
13040C                   EVAL      T0DATP=S5DATP                                                    
13040C                   EVAL      T0NOPL=S5NOPL                                                    
13040C                   EVAL      T0LINE=S5LINE                                                    
13040C                   EVAL      T0ARV1=*BLANKS                                                   
13040C                   EVAL      T0COM2=*BLANKS                                                   
13040C     KEDTRLP00X    SETLL     EDTRLP00                                                         
13040C     KEDTRLP00     READE     EDTRLP00                                                         
13040C                   DOW       NOT %EOF(EDTRLP00)                                               
13040 *                                                                                             
13040 * Sólo actúo si tenía riesgo y ahora no lo tiene                                              
13040 *                                                                                             
13040C                   IF        T0RISK=1                                                         
13040C                   EVAL      S0CIAS=@PCIAS                                                    
13040C                   EVAL      S0DLGA=@PDLGA                                                    
13040C                   EVAL      S0NPCO=@PNPCO                                                    
13040C                   EVAL      S0TPED=@PTPED                                                    
13040C                   EVAL      S0DATP=@PDATP                                                    
13040C                   EVAL      S0NOPL=@PNOPL                                                    
13040C     KCOCAPE       CHAIN(N)  COCAPE                                                           
13040C                   IF        %FOUND(COCAPE)                                                   
13040C                             And (S0REXC<'1' Or S0RAUT='1')                                   
13040 *                                                                                             
13040C                   EVAL      T0DWRF=*DATE                                                     
24080C                   TIME                    T0HWRF                                             
C1350C                   EXSR      CS_DESBLQALB                                                     
C1350C*                  EVAL      T0RISK=0                                                         
13040C                   UPDATE    REDTRLP00                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
13040 *                                                                                             
13040 * Auditoría sólo para la 1ª línea                                                             
13040 *                                                                                             
13040C                   IF        ZXGRAU=0                                                         
13040C                   EXSR      CS_UPD_EDTRAU                                                    
13040C                   EVAL      ZXGRAU=1                                                         
13040C                   ENDIF                                                                      
13040 *                                                                                             
13040C                   ENDIF                                                                      
13040C                   ENDIF                                                                      
13040 *                                                                                             
13040C     KEDTRLP00     READE     EDTRLP00                                                         
13040C                   ENDDO                                                                      
13040 *                                                                                             
13040 * Posible E-Mail con datos del pedido de ventas                                               
13040 *                                                                                             
13040C                   MOVEL(P)  T0CIAS        @EMCIAA                                            
13040C                   MOVEL(P)  T0DLGA        @EMDLGA                                            
13040C                   MOVEL(P)  T0CUST        @EMCODE                                            
13040C                   MOVEL(P)  T0NPCO        @EMNDOC                                            
13040C                   MOVE      T0DATP        @EMFDOC                                            
13040C                   MOVE      T0LINE        @EMLDOC                                            
13040 *                                                                                             
13040C     KCOCAPE       READE(N)  CODEPE                                                           
13040C                   ENDDO                                                                      
13040 *                                                                                             
13040C                   ENDSR                                                                      
FQ604 **********************************************************************                        
FQ604 * Cambiar observaciones                                              *                        
FQ604 **********************************************************************                        
FQ604C     CS_COD026     BEGSR                                                                      
FQ604 *                                                                                             
FQ604 * Actualizo campos en registro de trazabilidad                                                
FQ604 *                                                                                             
FQ604C                   EVAL      S5CIAS=@PCIAS                                                    
FQ604C                   EVAL      S5DLGA=@PDLGA                                                    
FQ604C                   EVAL      S5NPCO=@PNPCO                                                    
FQ604C                   EVAL      S5TPED=@PTPED                                                    
FQ604C                   EVAL      S5DATP=@PDATP                                                    
FQ604C                   EVAL      S5NOPL=@PNOPL                                                    
FQ604C                   EVAL      S5LINE=@PLINE                                                    
FQ604C     KCODEPE       CHAIN(N)  CODEPE                                                           
FQ604C                   IF        %FOUND(CODEPE)                                                   
FQ604C                   EVAL      S0CIAS=@PCIAS                                                    
FQ604C                   EVAL      S0DLGA=@PDLGA                                                    
FQ604C                   EVAL      S0NPCO=@PNPCO                                                    
FQ604C                   EVAL      S0TPED=@PTPED                                                    
FQ604C                   EVAL      S0DATP=@PDATP                                                    
FQ604C                   EVAL      S0NOPL=@PNOPL                                                    
FQ604C     KCOCAPE       CHAIN(N)  COCAPE                                                           
FQ604C                   IF        %FOUND(COCAPE)                                                   
FQ604 *                                                                                             
FQ604 * Recupero la clave del pedido comercial y actualizo                                          
FQ604 *                                                                                             
FQ604C                   EVAL      ZXGRAU=0                                                         
FQ604C                   EVAL      T0CIAS=@PCIAS                                                    
FQ604C                   EVAL      T0DLGA=@PDLGA                                                    
FQ604C                   EVAL      T0NPCO=@PNPCO                                                    
FQ604C                   EVAL      T0TPED=@PTPED                                                    
FQ604C                   EVAL      T0DATP=@PDATP                                                    
FQ604C                   EVAL      T0NOPL=@PNOPL                                                    
FQ604C                   EVAL      T0LINE=@PLINE                                                    
FQ604C                   EVAL      T0ARV1=*BLANKS                                                   
FQ604C                   EVAL      T0COM2=*BLANKS                                                   
FQ604C     KEDTRLP00X    SETLL     EDTRLP00                                                         
FQ604C     KEDTRLP00     READE     EDTRLP00                                                         
FQ604C                   DOW       NOT %EOF(EDTRLP00)                                               
FQ604 *                                                                                             
FQ604C                   EVAL      T0TDI1=S0TDI1                                                    
FQ604C                   EVAL      T0DWRF=*DATE                                                     
24080C                   TIME                    T0HWRF                                             
FQ604C                   EVAL      T0MODI=1                                                         
FQ604C                   UPDATE    REDTRLP00                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
FQ604 *                                                                                             
FQ604 * Auditoría sólo para la 1ª línea                                                             
FQ604 *                                                                                             
FQ604C                   IF        ZXGRAU=0                                                         
FQ604C                   EXSR      CS_UPD_EDTRAU                                                    
FQ604C                   EVAL      ZXGRAU=1                                                         
FQ604C                   ENDIF                                                                      
FQ604 *                                                                                             
FQ604C     KEDTRLP00     READE     EDTRLP00                                                         
FQ604C                   ENDDO                                                                      
FQ604 *                                                                                             
FQ604 * Posible E-Mail con datos del pedido de ventas                                               
FQ604 *                                                                                             
FQ604C                   MOVEL(P)  T0CIAS        @EMCIAA                                            
FQ604C                   MOVEL(P)  T0DLGA        @EMDLGA                                            
FQ604C                   MOVEL(P)  T0CUST        @EMCODE                                            
FQ604C                   MOVEL(P)  T0NPCO        @EMNDOC                                            
FQ604C                   MOVE      T0DATP        @EMFDOC                                            
FQ604C                   MOVE      T0LINE        @EMLDOC                                            
FQ604 *                                                                                             
FQ604C                   ENDIF                                                                      
FQ604C                   ENDIF                                                                      
FQ604 *                                                                                             
FQ604C                   ENDSR                                                                      
19050 **********************************************************************                        
19050 * DesRetener línea pedido comercial                                  *                        
19050 **********************************************************************                        
19050C     CS_COD027     BEGSR                                                                      
19050 *                                                                                             
19050 * Actualizo campos en registro de trazabilidad                                                
19050 *                                                                                             
19050C                   EVAL      S5CIAS=@PCIAS                                                    
19050C                   EVAL      S5DLGA=@PDLGA                                                    
19050C                   EVAL      S5NPCO=@PNPCO                                                    
19050C                   EVAL      S5TPED=@PTPED                                                    
19050C                   EVAL      S5DATP=@PDATP                                                    
19050C                   EVAL      S5NOPL=@PNOPL                                                    
19050C                   EVAL      S5LINE=@PLINE                                                    
19050C     KCODEPE       CHAIN(N)  CODEPE                                                           
19050C                   IF        %FOUND(CODEPE)                                                   
19050 *                                                                                             
19050 * Recupero la clave del pedido comercial y actualizo                                          
19050 *                                                                                             
19050C                   EVAL      ZXGRAU=0                                                         
19050C                   EVAL      T0CIAS=@PCIAS                                                    
19050C                   EVAL      T0DLGA=@PDLGA                                                    
19050C                   EVAL      T0NPCO=@PNPCO                                                    
19050C                   EVAL      T0TPED=@PTPED                                                    
19050C                   EVAL      T0DATP=@PDATP                                                    
19050C                   EVAL      T0NOPL=@PNOPL                                                    
19050C                   EVAL      T0LINE=@PLINE                                                    
19050C                   EVAL      T0ARV1=*BLANKS                                                   
19050C                   EVAL      T0COM2=*BLANKS                                                   
19050C     KEDTRLP00X    SETLL     EDTRLP00                                                         
19050C     KEDTRLP00     READE     EDTRLP00                                                         
19050C                   DOW       NOT %EOF(EDTRLP00)                                               
19050 *                                                                                             
19050C                   EVAL      T0DWRF=*DATE                                                     
24080C                   TIME                    T0HWRF                                             
19050C                   EVAL      T0PHLD=0                                                         
19050C                   EVAL      T0MODI=1                                                         
19050C                   UPDATE    REDTRLP00                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
19050 *                                                                                             
19050 * Auditoría sólo para la 1ª línea                                                             
19050 *                                                                                             
19050C                   IF        ZXGRAU=0                                                         
19050C                   EXSR      CS_UPD_EDTRAU                                                    
19050C                   EVAL      ZXGRAU=1                                                         
19050C                   ENDIF                                                                      
19050 *                                                                                             
19050C     KEDTRLP00     READE     EDTRLP00                                                         
19050C                   ENDDO                                                                      
19050 *                                                                                             
19050 * Posible E-Mail con datos del pedido de ventas                                               
19050 *                                                                                             
19050C                   MOVEL(P)  T0CIAS        @EMCIAA                                            
19050C                   MOVEL(P)  T0DLGA        @EMDLGA                                            
19050C                   MOVEL(P)  T0CUST        @EMCODE                                            
19050C                   MOVEL(P)  T0NPCO        @EMNDOC                                            
19050C                   MOVE      T0DATP        @EMFDOC                                            
19050C                   MOVE      T0LINE        @EMLDOC                                            
19050 *                                                                                             
19050C                   ENDIF                                                                      
19050 *                                                                                             
19050C                   ENDSR                                                                      
FQ607 **********************************************************************                        
FQ607 * Alta reclamación incidencia web                                    *                        
FQ607 **********************************************************************                        
FQ607C     CS_COD028     BEGSR                                                                      
FQ607 *                                                                                             
FQ607 * Actualizo campos en registro de trazabilidad                                                
FQ607 *                                                                                             
FQ607C                   EVAL      T4CIAS=@PCIAS                                                    
FQ607C                   EVAL      T4DLGA=@PDLGA                                                    
FQ607C                   EVAL      T4NPCO=@PNPCO                                                    
FQ607C                   EVAL      T4TPED=@PTPED                                                    
FQ607C                   EVAL      T4DATP=@PDATP                                                    
FQ607C                   EVAL      T4NOPL=@PNOPL                                                    
FQ607C                   EVAL      T4LINE=@PLINE                                                    
FQ607C     KEDINCI30     CHAIN     EDINCI30                                                         
FQ607C                   IF        %FOUND(EDINCI30)                                                 
FQ607 *                                                                                             
FQ607 * Recupero la clave del pedido comercial y actualizo                                          
FQ607 *                                                                                             
FQ607C                   EVAL      ZXGRAU=0                                                         
FQ607C                   EVAL      T0CIAS=@PCIAS                                                    
FQ607C                   EVAL      T0DLGA=@PDLGA                                                    
FQ607C                   EVAL      T0NPCO=@PNPCO                                                    
FQ607C                   EVAL      T0TPED=@PTPED                                                    
FQ607C                   EVAL      T0DATP=@PDATP                                                    
FQ607C                   EVAL      T0NOPL=@PNOPL                                                    
FQ607C                   EVAL      T0LINE=@PLINE                                                    
FQ607C                   EVAL      T0ARV1=*BLANKS                                                   
FQ607C                   EVAL      T0COM2=*BLANKS                                                   
FQ607C     KEDTRLP00X    SETLL     EDTRLP00                                                         
FQ607C     KEDTRLP00     READE     EDTRLP00                                                         
FQ607C                   DOW       NOT %EOF(EDTRLP00)                                               
FQ607                                                                                               
FQ607C                   EVAL      T0DWRF=*DATE                                                     
FQ607C                   TIME                    T0HWRF                                             
FQ607C                   MOVEL     T4NDE2        T0NDE2                                             
FQ607C                   EVAL      T0LIR2=T4LIR2                                                    
FQ607C                   UPDATE    REDTRLP00                            83                          
FQ607C   83              EXSR      CS_EDTRLD                                                        
FQ607 *                                                                                             
FQ607 * Auditoría sólo para la 1ª línea                                                             
FQ607 *                                                                                             
FQ607C                   IF        ZXGRAU=0                                                         
FQ607C                   EXSR      CS_UPD_EDTRAU                                                    
FQ607C                   EVAL      ZXGRAU=1                                                         
FQ607C                   ENDIF                                                                      
FQ607 *                                                                                             
FQ607C     KEDTRLP00     READE     EDTRLP00                                                         
FQ607C                   ENDDO                                                                      
FQ607 *                                                                                             
FQ607 * Posible E-Mail con datos del pedido de ventas                                               
FQ607 *                                                                                             
FQ607C                   MOVEL(P)  T0CIAS        @EMCIAA                                            
FQ607C                   MOVEL(P)  T0DLGA        @EMDLGA                                            
FQ607C                   MOVEL(P)  T0CUST        @EMCODE                                            
FQ607C                   MOVEL(P)  T0NPCO        @EMNDOC                                            
FQ607C                   MOVE      T0DATP        @EMFDOC                                            
FQ607C                   MOVE      T0LINE        @EMLDOC                                            
FQ607 *                                                                                             
FQ607C                   ENDIF                                                                      
FQ607 *                                                                                             
FQ607C                   ENDSR                                                                      
FQ710 **********************************************************************                        
FQ710 * Forzar Preparación aunque no llegue al mínimo por expedición       *                        
FQ710 **********************************************************************                        
FQ710C     CS_COD029     BEGSR                                                                      
FQ710 *                                                                                             
FQ710 * Recupero la clave del pedido comercial y actualizo                                          
FQ710 *                                                                                             
FQ710C                   EVAL      ZXGRAU=0                                                         
FQ710C                   EVAL      T0CIAS=@PCIAS                                                    
FQ710C                   EVAL      T0DLGA=@PDLGA                                                    
FQ710C                   EVAL      T0NPCO=@PNPCO                                                    
FQ710C                   EVAL      T0TPED=@PTPED                                                    
FQ710C                   EVAL      T0DATP=@PDATP                                                    
FQ710C                   EVAL      T0NOPL=@PNOPL                                                    
FQ710C                   EVAL      T0LINE=@PLINE                                                    
FQ710C                   EVAL      T0ARV1=*BLANKS                                                   
FQ710C                   EVAL      T0COM2=*BLANKS                                                   
FQ710C     KEDTRLP00X    SETLL     EDTRLP00                                                         
FQ710C     KEDTRLP00     READE     EDTRLP00                                                         
FQ710C                   DOW       NOT %EOF(EDTRLP00)                                               
FQ710 *                                                                                             
FQ710C                   EVAL      T0DWRF=*DATE                                                     
FQ710C                   TIME                    T0HWRF                                             
FQ710C                   SELECT                                                                     
FQ710C                   WHEN      @PEDAU ='029'                                                    
FQ710C                   EVAL      T0FOPR=1                                                         
FQ710C                   WHEN      @PEDAU ='030'                                                    
FQ710C                   EVAL      T0FOPR=0                                                         
FQ710C                   ENDSL                                                                      
FQ710C                   UPDATE    REDTRLP00                                                        
FQ710 *                                                                                             
FQ710 * Auditoría sólo para la 1ª línea                                                             
FQ710 *                                                                                             
FQ710C                   IF        ZXGRAU=0                                                         
FQ710C                   EXSR      CS_UPD_EDTRAU                                                    
FQ710C                   EVAL      ZXGRAU=1                                                         
FQ710C                   ENDIF                                                                      
FQ710 *                                                                                             
FQ710C     KEDTRLP00     READE     EDTRLP00                                                         
FQ710C                   ENDDO                                                                      
FQ710 *                                                                                             
FQ710 * Posible E-Mail con datos del pedido de ventas                                               
FQ710 *                                                                                             
FQ710C                   MOVEL(P)  T0CIAS        @EMCIAA                                            
FQ710C                   MOVEL(P)  T0DLGA        @EMDLGA                                            
FQ710C                   MOVEL(P)  T0CUST        @EMCODE                                            
FQ710C                   MOVEL(P)  T0NPCO        @EMNDOC                                            
FQ710C                   MOVE      T0DATP        @EMFDOC                                            
FQ710C                   MOVE      T0LINE        @EMLDOC                                            
FQ710 *                                                                                             
FQ710C                   ENDSR                                                                      
20100 **********************************************************************                        
20100 * Reserva/Desreserva Cial Material Propio                            *                        
20100 **********************************************************************                        
20100C     CS_COD031     BEGSR                                                                      
20100 *                                                                                             
20100 * Recupero la clave del pedido comercial y actualizo                                          
20100 *                                                                                             
20100C                   EVAL      ZXGRAU=0                                                         
20100C                   EVAL      T0CIAS=@PCIAS                                                    
20100C                   EVAL      T0DLGA=@PDLGA                                                    
20100C                   EVAL      T0NPCO=@PNPCO                                                    
20100C                   EVAL      T0TPED=@PTPED                                                    
20100C                   EVAL      T0DATP=@PDATP                                                    
20100C                   EVAL      T0NOPL=@PNOPL                                                    
20100C                   EVAL      T0LINE=@PLINE                                                    
20100C                   EVAL      T0ARV1=*BLANKS                                                   
20100C                   EVAL      T0COM2=*BLANKS                                                   
20100C     KEDTRLP00X    SETLL     EDTRLP00                                                         
20100C     KEDTRLP00     READE     EDTRLP00                                                         
20100C                   DOW       NOT %EOF(EDTRLP00)                                               
FDX01 *                                                                                             
FDX01 * Ahora se permiten conjuntos combinados (SIOL=2 y SIOL<>2) por lo                            
FDX01 * que hay que comprobar que sean SIOL=2 para tratar                                           
FDX01 *                                                                                             
FDX01C                   EVAL      M5CIAS=T0CIAS                                                    
FDX01C                   EVAL      M5ARTI=%SUBST(T0ARV1:1:15)                                       
FDX01C                   EVAL      M5VARI=%SUBST(T0ARV1:16:3)                                       
FDX01C                   EVAL      M5MODE=%SUBST(T0ARV1:19:3)                                       
FDX01C     KMSARTI00     CHAIN     MSARTI00                                                         
FDX01C                   IF        %FOUND(MSARTI00) AND M5SIOL='2'                                  
20100 *                                                                                             
20100C                   EVAL      T0DWRF=*DATE                                                     
20100C                   TIME                    T0HWRF                                             
20100C                   IF        @PEDAU ='031'                                                    
20100C                   EVAL      T0FURE=*DATE                                                     
20100C                   ENDIF                                                                      
10051C*                  EVAL      T0EDST='50'                                                      
20100C                   UPDATE    REDTRLP00                                                        
20100 *                                                                                             
20100 * Auditoría sólo para la 1ª línea                                                             
20100 *                                                                                             
20100C                   IF        ZXGRAU=0                                                         
20100C                   EXSR      CS_UPD_EDTRAU                                                    
20100C                   EVAL      ZXGRAU=1                                                         
20100C                   ENDIF                                                                      
FDX01 *                                                                                             
FDX01C                   ENDIF                                                                      
20100 *                                                                                             
20100C     KEDTRLP00     READE     EDTRLP00                                                         
20100C                   ENDDO                                                                      
20100 *                                                                                             
20100 * Posible E-Mail con datos del pedido de ventas                                               
20100 *                                                                                             
20100C                   MOVEL(P)  T0CIAS        @EMCIAA                                            
20100C                   MOVEL(P)  T0DLGA        @EMDLGA                                            
20100C                   MOVEL(P)  T0CUST        @EMCODE                                            
20100C                   MOVEL(P)  T0NPCO        @EMNDOC                                            
20100C                   MOVE      T0DATP        @EMFDOC                                            
20100C                   MOVE      T0LINE        @EMLDOC                                            
20100 *                                                                                             
10051 *                                                                                             
10051 * Si es conjunto de venta y soy propietario SIOL='2' creo un nuevo                            
10051 * registro por cada componente del conjunto. Leo CODEP2                                       
10051 *                                                                                             
10051C                   EVAL      C_S5CIAS=@PCIAS                                                  
10051C                   EVAL      C_S5DLGA=@PDLGA                                                  
10051C                   EVAL      C_S5NPCO=@PNPCO                                                  
10051C                   EVAL      C_S5TPED=@PTPED                                                  
10051C                   EVAL      C_S5DATP=@PDATP                                                  
10051C                   EVAL      C_S5NOPL=@PNOPL                                                  
10051C                   EVAL      C_S5LINE=@PLINE                                                  
10051C     KCODEP20      SETLL     CODEP2                                                           
10051C     KCODEP20      READE     CODEP2                                                           
10051C                   DOW       NOT %EOF(CODEP2)                                                 
FDX01 *                                                                                             
FDX01 * Ahora se permiten conjuntos combinados (SIOL=2 y SIOL<>2) por lo                            
FDX01 * que hay que comprobar que sean SIOL=2 para tratar                                           
FDX01 *                                                                                             
FDX01C                   EVAL      M5CIAS=C_S5CIAS                                                  
FDX01C                   EVAL      M5ARTI=C_S5COMP                                                  
FDX01C                   EVAL      M5VARI=C_S5VAR2                                                  
FDX01C                   EVAL      M5MODE=C_S5MOD2                                                  
FDX01C     KMSARTI00     CHAIN     MSARTI00                                                         
FDX01C                   IF        %FOUND(MSARTI00) AND M5SIOL='2'                                  
FDX01 *                                                                                             
10051                                                                                               
10051C                   EVAL      T0ARV1=C_S5COMP+C_S5VAR2+C_S5MOD2                                
10051C     KEDTRLP00Z    CHAIN     EDTRLP00                                                         
10051C                   IF        %FOUND(EDTRLP00)                                                 
10051C                   Z-ADD     C_S5CA04      T0CFC1                                             
10051C                   UPDATE    REDTRLP00                            83                          
10051C                   ELSE                                                                       
10051C                   EVAL      T0ARV1=*BLANKS                                                   
10051C     KEDTRLP00Z    CHAIN     EDTRLP00                                                         
10051C                   IF        %FOUND(EDTRLP00)                                                 
10051C                   EVAL      T0ARV1=C_S5COMP+C_S5VAR2+C_S5MOD2                                
10051C                   Z-ADD     C_S5CA04      T0CFC1                                             
10051C                   UPDATE    REDTRLP00                            83                          
10051C                   ELSE                                                                       
10051C                   EVAL      T0ARV1=C_S5COMP+C_S5VAR2+C_S5MOD2                                
10051C                   EVAL      T0TREG=1                                                         
10051C                   Z-ADD     C_S5CA04      T0CFC1                                             
10051C                   EVAL      T0EDST='50'                                                      
FDX01 *                                                                                             
FDX01C                   EVAL      T0PRVR=*BLANKS                                                   
FDX01C                   EVAL      T0CIA1=0                                                         
FDX01C                   EVAL      T0DLG1=*BLANKS                                                   
FDX01C                   EVAL      T0NPC1=*BLANKS                                                   
FDX01C                   EVAL      T0TPE1=*BLANKS                                                   
FDX01C                   EVAL      T0DAT1=0                                                         
FDX01C                   EVAL      T0NOP1=0                                                         
FDX01C                   EVAL      T0LIN1=0                                                         
FDX01C                   EVAL      T0CAN1=0                                                         
FDX01C                   EVAL      T0UNI1=*BLANKS                                                   
FDX01C                   EVAL      T0CIA2=0                                                         
FDX01C                   EVAL      T0DLG2=*BLANKS                                                   
FDX01C                   EVAL      T0NPC2=*BLANKS                                                   
FDX01C                   EVAL      T0TPE2=*BLANKS                                                   
FDX01C                   EVAL      T0DAT2=0                                                         
FDX01C                   EVAL      T0NOP2=0                                                         
FDX01C                   EVAL      T0LIN2=0                                                         
FDX01C                   EVAL      T0ARV2=*BLANKS                                                   
FDX01C                   EVAL      T0COM2=*BLANKS                                                   
FDX01C                   EVAL      T0CAN2=0                                                         
FDX01C                   EVAL      T0UNI2=*BLANKS                                                   
FDX01C                   EVAL      T0CFC2=0                                                         
FDX01C                   EVAL      T0CUS2=*BLANKS                                                   
FDX01C                   EVAL      T0DWR2=0                                                         
FDX01C                   EVAL      T0HWR2=0                                                         
FDX01C                   EVAL      T0CIA3=0                                                         
FDX01C                   EVAL      T0DLG3=*BLANKS                                                   
FDX01C                   EVAL      T0NPC3=*BLANKS                                                   
FDX01C                   EVAL      T0TPE3=*BLANKS                                                   
FDX01C                   EVAL      T0DAT3=0                                                         
FDX01C                   EVAL      T0NOP3=0                                                         
FDX01C                   EVAL      T0LIN3=0                                                         
FDX01C                   EVAL      T0CAN3=0                                                         
FDX01C                   EVAL      T0UNI3=*BLANKS                                                   
FDX01C                   EVAL      T0DWR3=0                                                         
FDX01C                   EVAL      T0HWR3=0                                                         
FDX01 *                                                                                             
10051C                   WRITE     REDTRLP00                            83                          
10051C   83              EXSR      CS_EDTRLD                                                        
FDX01 *                                                                                             
FDX01 * Auditoría sólo para la 1ª línea                                                             
FDX01 *                                                                                             
FDX01C                   IF        ZXGRAU=0 AND NOT *IN83                                           
FDX01C                   EXSR      CS_UPD_EDTRAU                                                    
FDX01C                   EVAL      ZXGRAU=1                                                         
FDX01C                   ENDIF                                                                      
FDX01 *                                                                                             
10051C                   ENDIF                                                                      
10051C                   ENDIF                                                                      
10051                                                                                               
FDX01C                   ENDIF                                                                      
FDX01 *                                                                                             
10051C     KCODEP20      READE     CODEP2                                                           
10051C                   ENDDO                                                                      
10051 *                                                                                             
20100C                   ENDSR                                                                      
C1350 **********************************************************************                        
C1350 * Proceso auditoría 033  Bloqueo de albaranes FD desde comercial     *                        
C1350 **********************************************************************                        
C1350C     CS_COD033     BEGSR                                                                      
C1350 *                                                                                             
C1350C                   EVAL      T0CIAS=@PCIAS                                                    
C1350C                   EVAL      T0CUST=@PNPCO                                                    
C1350C     KEDTRLP40     SETLL     EDTRLP40                                                         
C1350C     KEDTRLP40     READE     EDTRLP40                                                         
C1350C                   DOW       NOT %EOF(EDTRLP40)                                               
C1350C                   IF        T0EDST<'80' AND                                                  
C1350C                             T0RISK=0                                                         
C1350C                   EVAL      T0RISK=2                                                         
C1350C                   UPDATE    REDTRLP40                                                        
PG615                                                                                               
PG615 ** Nueva llamada a pgm CO2880 para modificar riesgo de pedidos                                
PG615C                   EXSR      LLAMA1413                                                        
PG615                                                                                               
C1350C                   EXSR      CS_UPD_EDTRAU                                                    
C1350C                   ENDIF                                                                      
C1350C     KEDTRLP40     READE     EDTRLP40                                                         
C1350C                   ENDDO                                                                      
C1350 *                                                                                             
C1350C                   ENDSR                                                                      
C1350 **********************************************************************                        
C1350 * Proceso auditoría 034  Desbloqueo albaranes FD desde comercial     *                        
C1350 **********************************************************************                        
C1350C     CS_COD034     BEGSR                                                                      
C1350 *                                                                                             
C1350C                   EVAL      T0CIAS=@PCIAS                                                    
C1350C                   EVAL      T0CUST=@PNPCO                                                    
C1350C     KEDTRLP40     SETLL     EDTRLP40                                                         
C1350C     KEDTRLP40     READE     EDTRLP40                                                         
C1350C                   DOW       NOT %EOF(EDTRLP40)                                               
C1350C                   IF        T0EDST<'80' AND                                                  
C1350C                             T0RISK=2                                                         
C1350C                   EVAL      T0RISK=0                                                         
C1350C                   UPDATE    REDTRLP40                                                        
PG615                                                                                               
PG615 ** Nueva llamada a pgm CO2880 para modificar riesgo de pedidos                                
PG615C                   EXSR      LLAMA1413                                                        
PG615                                                                                               
C1350C                   EXSR      CS_UPD_EDTRAU                                                    
C1350C                   ENDIF                                                                      
C1350C     KEDTRLP40     READE     EDTRLP40                                                         
C1350C                   ENDDO                                                                      
C1350 *                                                                                             
C1350C                   ENDSR                                                                      
67007 *****************************************************************************                 
67007 * Actualizar linea campo excedido riesgo en pedido comercial a largo plazo  *                 
67007 *****************************************************************************                 
67007C     CS_COD053     BEGSR                                                                      
67007 *                                                                                             
67007 * Actualizo campos en registro de trazabilidad                                                
67007 *                                                                                             
67007C                   EVAL      S0CIAS=@PCIAS                                                    
67007C                   EVAL      S0DLGA=@PDLGA                                                    
67007C                   EVAL      S0NPCO=@PNPCO                                                    
67007C                   EVAL      S0TPED=@PTPED                                                    
67007C                   EVAL      S0DATP=@PDATP                                                    
67007C                   EVAL      S0NOPL=@PNOPL                                                    
67007 *                                                                                             
67007C     KCOCAPE       SETLL     CODEPE                                                           
67007C     KCOCAPE       READE(N)  CODEPE                                                           
67007C                   DOW       NOT %EOF(CODEPE)                                                 
67007 *                                                                                             
67007 * Recupero la clave del pedido comercial y actualizo                                          
67007 *                                                                                             
67007C                   EVAL      ZXGRAU=0                                                         
67007C                   EVAL      T0CIAS=S5CIAS                                                    
67007C                   EVAL      T0DLGA=S5DLGA                                                    
67007C                   EVAL      T0NPCO=S5NPCO                                                    
67007C                   EVAL      T0TPED=S5TPED                                                    
67007C                   EVAL      T0DATP=S5DATP                                                    
67007C                   EVAL      T0NOPL=S5NOPL                                                    
67007C                   EVAL      T0LINE=S5LINE                                                    
67007C                   EVAL      T0ARV1=*BLANKS                                                   
67007C                   EVAL      T0COM2=*BLANKS                                                   
67007 *                                                                                             
67007C     KEDTRLP00X    SETLL     EDTRLP00                                                         
67007C     KEDTRLP00     READE     EDTRLP00                                                         
67007C                   DOW       NOT %EOF(EDTRLP00)                                               
67007 *                                                                                             
67007 * Trata las líneas con riesgo excedido en EDTRLP                                              
67007 *                                                                                             
67007C                   if        t0risk > 0                                                       
67007 *                                                                                             
67007C                   EVAL      S0CIAS=@PCIAS                                                    
67007C                   EVAL      S0DLGA=@PDLGA                                                    
67007C                   EVAL      S0NPCO=@PNPCO                                                    
67007C                   EVAL      S0TPED=@PTPED                                                    
67007C                   EVAL      S0DATP=@PDATP                                                    
67007C                   EVAL      S0NOPL=@PNOPL                                                    
67007 *                                                                                             
67007C     KCOCAPE       CHAIN(N)  COCAPE                                                           
67007C                   IF        %FOUND(COCAPE)                                                   
67007 *                                                                                             
67007 * Sólo actúo si retenido financiero es largo plazo y riesgo excedido                          
67007 * y autorización riesgo de COCAPE están a blanco                                              
67007 *                                                                                             
67007C                   IF        s0phld >= '3' and s0rexc = ' '                                   
67007C                                           and s0raut = ' '                                   
67007 *                                                                                             
67007C                   EVAL      T0DWRF=*DATE                                                     
67007C                   TIME                    T0HWRF                                             
67007C                   EVAL      T0RISK=0                                                         
67007C                   UPDATE    REDTRLP00                                                        
67007 *                                                                                             
67007 * Auditoría sólo para la 1ª línea                                                             
67007 *                                                                                             
67007C                   IF        ZXGRAU=0                                                         
67007C                   EXSR      CS_UPD_EDTRAU                                                    
67007C                   EVAL      ZXGRAU=1                                                         
67007C                   ENDIF                                                                      
67007 *                                                                                             
67007C                   ENDIF                                                                      
67007 *                                                                                             
67007C                   ENDIF                                                                      
67007 *                                                                                             
67007C                   ENDIF                                                                      
67007 *                                                                                             
67007C     KEDTRLP00     READE     EDTRLP00                                                         
67007C                   ENDDO                                                                      
67007 *                                                                                             
67007C     KCOCAPE       READE(N)  CODEPE                                                           
67007C                   ENDDO                                                                      
67007 *                                                                                             
67007C                   ENDSR                                                                      
      **********************************************************************                        
      * Proceso auditoría 100  Alta línea pedido ED en compras             *                        
      **********************************************************************                        
     C     CS_COD100     BEGSR                                                                      
      *                                                                                             
      * Recupero la clave del pedido de compras y luego el pedido de ventas                         
      *                                                                                             
     C                   EVAL      C0CIAS=@PCIAS                                                    
     C                   EVAL      C0DLGA=@PDLGA                                                    
     C                   EVAL      C0NPCO=@PNPCO                                                    
     C                   EVAL      C0TPED=@PTPED                                                    
     C                   EVAL      C0DATP=@PDATP                                                    
     C                   EVAL      C0NOPL=@PNOPL                                                    
     C     KPUCAPE       CHAIN     PUCAPE                                                           
     C                   IF        %FOUND(PUCAPE)                                                   
     C                   EVAL      C5CIAS=@PCIAS                                                    
     C                   EVAL      C5DLGA=@PDLGA                                                    
     C                   EVAL      C5NPCO=@PNPCO                                                    
     C                   EVAL      C5TPED=@PTPED                                                    
     C                   EVAL      C5DATP=@PDATP                                                    
     C                   EVAL      C5NOPL=@PNOPL                                                    
     C                   EVAL      C5LINE=@PLINE                                                    
     C     KPUDEPE       CHAIN     PUDEPE                                                           
     C                   IF        %FOUND(PUDEPE)                                                   
     C                   MOVEL     C5CIVE        S0CIAS                                             
     C                   EVAL      S0DLGA=C5DLVE                                                    
     C                   EVAL      S0NPCO=C5NPVE                                                    
     C                   EVAL      S0TPED=C5TPVE                                                    
     C                   EVAL      S0DATP=C5DAVE                                                    
     C                   EVAL      S0NOPL=C5NOVE                                                    
     C     KCOCAPE       CHAIN(N)  COCAPE                                                           
     C                   IF        %FOUND(COCAPE)                                                   
     C                   MOVEL     C5CIVE        S5CIAS                                             
     C                   EVAL      S5DLGA=C5DLVE                                                    
     C                   EVAL      S5NPCO=C5NPVE                                                    
     C                   EVAL      S5TPED=C5TPVE                                                    
     C                   EVAL      S5DATP=C5DAVE                                                    
     C                   EVAL      S5NOPL=C5NOVE                                                    
     C                   EVAL      S5LINE=C5LIVE                                                    
     C     KCODEPE       CHAIN(N)  CODEPE                                                           
     C                   IF        %FOUND(CODEPE)                                                   
      *                                                                                             
      * Si es una entrega directa actuo                                                             
      *                                                                                             
     C                   IF        S5TPE4='2'                                                       
      *                                                                                             
      * Actualizo datos del pedido de compras                                                       
      *                                                                                             
     C                   EVAL      C0TPE4='2'                                                       
     C                   UPDATE    RPUCAPE                                                          
     C                   EVAL      C5TPE4='2'                                                       
     C                   UPDATE    RPUDEPE                                                          
      *                                                                                             
      * Actualizo datos del pedido de compras desde la 1ª línea original                            
      * si T0ARV1 Y T0COM2 aún están a *blanks                                                      
      *                                                                                             
     C                   EVAL      T0CIAS=S5CIAS                                                    
     C                   EVAL      T0DLGA=S5DLGA                                                    
     C                   EVAL      T0NPCO=S5NPCO                                                    
     C                   EVAL      T0TPED=S5TPED                                                    
     C                   EVAL      T0DATP=S5DATP                                                    
     C                   EVAL      T0NOPL=S5NOPL                                                    
     C                   EVAL      T0LINE=S5LINE                                                    
      *                                                                                             
      * Recupero algunos valores de la 1º línea                                                     
      *                                                                                             
     C                   CLEAR                   ZGARVM                                             
     C                   CLEAR                   ZGCANT                                             
     C                   CLEAR                   ZGCUST                                             
     C                   CLEAR                   ZGTDI1                                             
     C                   CLEAR                   ZGDWR0                                             
     C                   CLEAR                   ZGHWR0                                             
     C                   CLEAR                   ZGUWR0                                             
     C     KEDTRLP00     CHAIN     EDTRLP00                                                         
     C                   IF        %FOUND(EDTRLP00)                                                 
     C                   EVAL      ZGARVM=T0ARVM                                                    
     C                   EVAL      ZGCANT=T0CANT                                                    
     C                   EVAL      ZGCUST=T0CUST                                                    
     C                   EVAL      ZGTDI1=T0TDI1                                                    
     C                   EVAL      ZGDWR0=T0DWR0                                                    
     C                   EVAL      ZGHWR0=T0HWR0                                                    
     C                   EVAL      ZGUWR0=T0UWR0                                                    
     C                   ENDIF                                                                      
      *                                                                                             
      * Compruebo si aún no tiene trazabilidad de compras                                           
      *                                                                                             
     C                   CLEAR                   T0ARV1                                             
     C                   CLEAR                   T0COM2                                             
     C     KEDTRLP00X    CHAIN     EDTRLP00                                                         
      *                                                                                             
     C                   EVAL      T0CIA1=C5CIAS                                                    
     C                   EVAL      T0DLG1=C5DLGA                                                    
     C                   EVAL      T0NPC1=C5NPCO                                                    
     C                   EVAL      T0TPE1=C5TPED                                                    
     C                   EVAL      T0DAT1=C5DATP                                                    
     C                   EVAL      T0NOP1=C5NOPL                                                    
     C                   EVAL      T0LIN1=C5LINE                                                    
     C                   EVAL      ZXARVM=C5ARTI+C5VARI+C5MODE                                      
     C                   MOVEL(P)  ZXARVM        T0ARV1                                             
     C                   MOVEL(P)  '20'          T0EDST                                             
     C                   EVAL      T0CAN1=C5CANT                                                    
FQ710C                   EVAL      T0UNI1=C5UNIM                                                    
     C                   EVAL      T0PRVR=C0PRVR                                                    
C1328c                   exsr      CS_EDDP                                                          
     C                   EVAL      T0DWR1=*DATE                                                     
     C                   TIME                    T0HWR1                                             
     C                   MOVEL(P)  SDSUSR        T0UWR1                                             
     C                   EVAL      T0DWRF=T0DWR1                                                    
     C                   EVAL      T0HWRF=T0HWR1                                                    
IT228C                   IF        P7EDOM='1'                                                       
IT228C                   EXSR      CS_EXCEPM3                                                       
IT228C                   ENDIF                                                                      
      *                                                                                             
      * Si es conjunto de venta hay que Extraer el coeficiente                                      
      * del componente                                                                              
      *                                                                                             
     C                   EVAL      T0CFC1=0                                                         
     C                   IF        S5TCOJ<>*BLANKS                                                  
     C                   EVAL      NDCIAS=S5CIAS                                                    
     C                   EVAL      NDARTI=S5ARTI                                                    
     C                   EVAL      NDVARI=S5VARI                                                    
     C                   EVAL      NDMODE=S5MODE                                                    
     C                   EVAL      NDTCOJ=S5TCOJ                                                    
     C                   EVAL      NDCOMP=C5ARTI                                                    
     C                   EVAL      NDVAR2=C5VARI                                                    
     C                   EVAL      NDMOD2=C5MODE                                                    
     C                   EVAL      NDTCO2=C5TCOJ                                                    
     C     KMSCOJD       CHAIN     MSCOJD                                                           
     C                   IF        %FOUND(MSCOJD)                                                   
     C                             AND NDBAJA<>'1'                                                  
     C                   EVAL      T0CFC1=NDCANT                                                    
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
      *                                                                                             
     C                   IF        %FOUND(EDTRLP00)                                                 
     C                   UPDATE    REDTRLP00                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
     C                   ELSE                                                                       
     C                   EVAL      T0ARVM=ZGARVM                                                    
     C                   EVAL      T0CANT=ZGCANT                                                    
     C                   EVAL      T0CUST=ZGCUST                                                    
     C                   EVAL      T0TDI1=ZGTDI1                                                    
     C                   EVAL      T0DWR0=ZGDWR0                                                    
     C                   EVAL      T0HWR0=ZGHWR0                                                    
     C                   EVAL      T0UWR0=ZGUWR0                                                    
     C                   EVAL      T0UWR0=ZGUWR0                                                    
     C                   EVAL      T0TREG=1                                                         
21050C                   WRITE     REDTRLP00                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
     C                   ENDIF                                                                      
      *                                                                                             
     C                   EXSR      CS_UPD_EDTRAU                                                    
      *                                                                                             
      * Posible E-Mail con datos del pedido de compras                                              
      *                                                                                             
     C                   MOVEL(P)  T0CIA1        @EMCIAA                                            
     C                   MOVEL(P)  T0DLG1        @EMDLGA                                            
     C                   MOVEL(P)  T0PRVR        @EMCODE                                            
     C                   MOVEL(P)  T0NPC1        @EMNDOC                                            
     C                   MOVE      T0DAT1        @EMFDOC                                            
     C                   MOVE      T0LIN1        @EMLDOC                                            
      *                                                                                             
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
      *                                                                                             
      * Sino es entrega directa libera registro (Sólo aquí)                                         
      *                                                                                             
     C                   ELSE                                                                       
     C                   UNLOCK    PUCAPE                                                           
     C                   UNLOCK    PUDEPE                                                           
     C                   ENDIF                                                                      
      *                                                                                             
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Anular línea en pedido de Compra                                   *                        
      **********************************************************************                        
     C     CS_COD105     BEGSR                                                                      
      *                                                                                             
      * Recupero la clave del pedido de compra                                                      
      *                                                                                             
     C                   EVAL      ZXGRAU=0                                                         
     C                   EVAL      T0CIA1=@PCIAS                                                    
     C                   EVAL      T0DLG1=@PDLGA                                                    
     C                   EVAL      T0NPC1=@PNPCO                                                    
     C                   EVAL      T0TPE1=@PTPED                                                    
     C                   EVAL      T0DAT1=@PDATP                                                    
     C                   EVAL      T0NOP1=@PNOPL                                                    
     C                   EVAL      T0LIN1=@PLINE                                                    
     C     KEDTRLP10     SETLL     EDTRLP10                                                         
     C     KEDTRLP10     READE     EDTRLP10                                                         
     C                   DOW       NOT %EOF(EDTRLP10)                                               
      *                                                                                             
15060C                   IF        T0CANS=0                                                         
02060C                   WRITE     REDTRLX00                            80                          
11060C                   DOW       *IN80=*ON                                                        
02060C                   EVAL      T0HWR0 = T0HWR0+1                                                
02060C                   WRITE     REDTRLX00                            80                          
02060C                   ENDDO                                                                      
     C                   DELETE    REDTRLP10                                                        
15060C                   ENDIF                                                                      
      *                                                                                             
      * Auditoría sólo para la 1ª línea                                                             
      *                                                                                             
     C                   IF        ZXGRAU=0                                                         
     C                   EXSR      CS_UPD_EDTRAU                                                    
     C                   EVAL      ZXGRAU=1                                                         
     C                   ENDIF                                                                      
      *                                                                                             
     C     KEDTRLP10     READE     EDTRLP10                                                         
     C                   ENDDO                                                                      
      *                                                                                             
      * En este caso cierro todas las auditorias relacionadas                                       
      *                                                                                             
     C     KEDTRLP00X    SETLL     EDTRAU00                                                         
     C     KEDTRLP00X    READE     EDTRAU00                                                         
     C                   DOW       NOT %EOF(EDTRAU00)                                               
02060C                   DOU       *IN80=*OFF                                                       
02060C                   EVAL      ZXTIM1 = %TIMESTAMP()                                            
02060C                   MOVEL     ZXTIM1        ZXTIMESTAMP                                        
02060C                   MOVEL     ZXTIMESTAMP   T1TMST                                             
02060C                   WRITE     REDTRAX00                            80                          
02060C                   ENDDO                                                                      
     C                   DELETE    REDTRAU00                                                        
     C     KEDTRLP00X    READE     EDTRAU00                                                         
     C                   ENDDO                                                                      
      *                                                                                             
      * Posible E-Mail con datos del pedido de compras                                              
      *                                                                                             
     C                   MOVEL(P)  T0CIA1        @EMCIAA                                            
     C                   MOVEL(P)  T0DLG1        @EMDLGA                                            
     C                   MOVEL(P)  T0PRVR        @EMCODE                                            
     C                   MOVEL(P)  T0NPC1        @EMNDOC                                            
     C                   MOVE      T0DAT1        @EMFDOC                                            
     C                   MOVE      T0LIN1        @EMLDOC                                            
      *                                                                                             
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Modificar cantidad (+) en pedido compra                            *                        
      **********************************************************************                        
     C     CS_COD106     BEGSR                                                                      
      *                                                                                             
      * Actualizo campos en registro de trazabilidad                                                
      *                                                                                             
     C                   EVAL      C5CIAS=@PCIAS                                                    
     C                   EVAL      C5DLGA=@PDLGA                                                    
     C                   EVAL      C5NPCO=@PNPCO                                                    
     C                   EVAL      C5TPED=@PTPED                                                    
     C                   EVAL      C5DATP=@PDATP                                                    
     C                   EVAL      C5NOPL=@PNOPL                                                    
     C                   EVAL      C5LINE=@PLINE                                                    
     C     KPUDEPE       CHAIN(N)  PUDEPE                                                           
     C                   IF        %FOUND(PUDEPE)                                                   
      *                                                                                             
      * Recupero la clave del pedido de compra                                                      
      *                                                                                             
     C                   EVAL      ZXGRAU=0                                                         
     C                   EVAL      T0CIA1=@PCIAS                                                    
     C                   EVAL      T0DLG1=@PDLGA                                                    
     C                   EVAL      T0NPC1=@PNPCO                                                    
     C                   EVAL      T0TPE1=@PTPED                                                    
     C                   EVAL      T0DAT1=@PDATP                                                    
     C                   EVAL      T0NOP1=@PNOPL                                                    
     C                   EVAL      T0LIN1=@PLINE                                                    
     C     KEDTRLP10     SETLL     EDTRLP10                                                         
     C     KEDTRLP10     READE     EDTRLP10                                                         
     C                   DOW       NOT %EOF(EDTRLP10)                                               
      *                                                                                             
     C                   EVAL      T0DWRF=*DATE                                                     
     C                   TIME                    T0HWRF                                             
     C                   EVAL      T0CAN1=C5CANT                                                    
FQ710C                   EVAL      T0UNI1=C5UNIM                                                    
     C                   UPDATE    REDTRLP10                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
      *                                                                                             
      * Auditoría sólo para la 1ª línea                                                             
      *                                                                                             
     C                   IF        ZXGRAU=0                                                         
     C                   EXSR      CS_UPD_EDTRAU                                                    
     C                   EVAL      ZXGRAU=1                                                         
     C                   ENDIF                                                                      
      *                                                                                             
     C     KEDTRLP10     READE     EDTRLP10                                                         
     C                   ENDDO                                                                      
      *                                                                                             
      * Posible E-Mail con datos del pedido de compras                                              
      *                                                                                             
     C                   MOVEL(P)  T0CIA1        @EMCIAA                                            
     C                   MOVEL(P)  T0DLG1        @EMDLGA                                            
     C                   MOVEL(P)  T0PRVR        @EMCODE                                            
     C                   MOVEL(P)  T0NPC1        @EMNDOC                                            
     C                   MOVE      T0DAT1        @EMFDOC                                            
     C                   MOVE      T0LIN1        @EMLDOC                                            
      *                                                                                             
     C                   ENDIF                                                                      
      *                                                                                             
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Modificar cantidad (-) en pedido compra                            *                        
      **********************************************************************                        
     C     CS_COD107     BEGSR                                                                      
      *                                                                                             
      * Actualizo campos en registro de trazabilidad                                                
      *                                                                                             
     C                   EVAL      C5CIAS=@PCIAS                                                    
     C                   EVAL      C5DLGA=@PDLGA                                                    
     C                   EVAL      C5NPCO=@PNPCO                                                    
     C                   EVAL      C5TPED=@PTPED                                                    
     C                   EVAL      C5DATP=@PDATP                                                    
     C                   EVAL      C5NOPL=@PNOPL                                                    
     C                   EVAL      C5LINE=@PLINE                                                    
     C     KPUDEPE       CHAIN(N)  PUDEPE                                                           
     C                   IF        %FOUND(PUDEPE)                                                   
      *                                                                                             
      * Recupero la clave del pedido de compra                                                      
      *                                                                                             
     C                   EVAL      ZXGRAU=0                                                         
     C                   EVAL      T0CIA1=@PCIAS                                                    
     C                   EVAL      T0DLG1=@PDLGA                                                    
     C                   EVAL      T0NPC1=@PNPCO                                                    
     C                   EVAL      T0TPE1=@PTPED                                                    
     C                   EVAL      T0DAT1=@PDATP                                                    
     C                   EVAL      T0NOP1=@PNOPL                                                    
     C                   EVAL      T0LIN1=@PLINE                                                    
     C     KEDTRLP10     SETLL     EDTRLP10                                                         
     C     KEDTRLP10     READE     EDTRLP10                                                         
     C                   DOW       NOT %EOF(EDTRLP10)                                               
      *                                                                                             
     C                   EVAL      T0DWRF=*DATE                                                     
     C                   TIME                    T0HWRF                                             
     C                   EVAL      T0CAN1=C5CANT                                                    
FQ710C                   EVAL      T0UNI1=C5UNIM                                                    
     C                   UPDATE    REDTRLP10                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
      *                                                                                             
      * Auditoría sólo para la 1ª línea                                                             
      *                                                                                             
     C                   IF        ZXGRAU=0                                                         
     C                   EXSR      CS_UPD_EDTRAU                                                    
     C                   EVAL      ZXGRAU=1                                                         
     C                   ENDIF                                                                      
      *                                                                                             
     C     KEDTRLP10     READE     EDTRLP10                                                         
     C                   ENDDO                                                                      
      *                                                                                             
      * Posible E-Mail con datos del pedido de compras                                              
      *                                                                                             
     C                   MOVEL(P)  T0CIA1        @EMCIAA                                            
     C                   MOVEL(P)  T0DLG1        @EMDLGA                                            
     C                   MOVEL(P)  T0PRVR        @EMCODE                                            
     C                   MOVEL(P)  T0NPC1        @EMNDOC                                            
     C                   MOVE      T0DAT1        @EMFDOC                                            
     C                   MOVE      T0LIN1        @EMLDOC                                            
      *                                                                                             
     C                   ENDIF                                                                      
      *                                                                                             
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Retener línea pedido compra                                        *                        
      **********************************************************************                        
     C     CS_COD108     BEGSR                                                                      
      *                                                                                             
      * Actualizo campos en registro de trazabilidad                                                
      *                                                                                             
     C                   EVAL      C5CIAS=@PCIAS                                                    
     C                   EVAL      C5DLGA=@PDLGA                                                    
     C                   EVAL      C5NPCO=@PNPCO                                                    
     C                   EVAL      C5TPED=@PTPED                                                    
     C                   EVAL      C5DATP=@PDATP                                                    
     C                   EVAL      C5NOPL=@PNOPL                                                    
     C                   EVAL      C5LINE=@PLINE                                                    
     C     KPUDEPE       CHAIN(N)  PUDEPE                                                           
     C                   IF        %FOUND(PUDEPE)                                                   
      *                                                                                             
      * Recupero la clave del pedido de compra                                                      
      *                                                                                             
     C                   EVAL      ZXGRAU=0                                                         
     C                   EVAL      T0CIA1=@PCIAS                                                    
     C                   EVAL      T0DLG1=@PDLGA                                                    
     C                   EVAL      T0NPC1=@PNPCO                                                    
     C                   EVAL      T0TPE1=@PTPED                                                    
     C                   EVAL      T0DAT1=@PDATP                                                    
     C                   EVAL      T0NOP1=@PNOPL                                                    
     C                   EVAL      T0LIN1=@PLINE                                                    
     C     KEDTRLP10     SETLL     EDTRLP10                                                         
     C     KEDTRLP10     READE     EDTRLP10                                                         
     C                   DOW       NOT %EOF(EDTRLP10)                                               
      *                                                                                             
     C                   EVAL      T0DWRF=*DATE                                                     
     C                   TIME                    T0HWRF                                             
     C                   EVAL      T0PHLD=1                                                         
     C                   UPDATE    REDTRLP10                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
      *                                                                                             
      * Auditoría sólo para la 1ª línea                                                             
      *                                                                                             
     C                   IF        ZXGRAU=0                                                         
     C                   EXSR      CS_UPD_EDTRAU                                                    
     C                   EVAL      ZXGRAU=1                                                         
     C                   ENDIF                                                                      
      *                                                                                             
     C     KEDTRLP10     READE     EDTRLP10                                                         
     C                   ENDDO                                                                      
      *                                                                                             
      * Posible E-Mail con datos del pedido de compras                                              
      *                                                                                             
     C                   MOVEL(P)  T0CIA1        @EMCIAA                                            
     C                   MOVEL(P)  T0DLG1        @EMDLGA                                            
     C                   MOVEL(P)  T0PRVR        @EMCODE                                            
     C                   MOVEL(P)  T0NPC1        @EMNDOC                                            
     C                   MOVE      T0DAT1        @EMFDOC                                            
     C                   MOVE      T0LIN1        @EMLDOC                                            
      *                                                                                             
     C                   ENDIF                                                                      
      *                                                                                             
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Cambiar línea en compra ED -> EN                                   *                        
      **********************************************************************                        
     C     CS_COD109     BEGSR                                                                      
      *                                                                                             
      * Es como una anulación de línea                                                              
      * Recupero la clave del pedido de compra y actualizo                                          
      *                                                                                             
     C                   EVAL      ZXGRAU=0                                                         
     C                   EVAL      T0CIA1=@PCIAS                                                    
     C                   EVAL      T0DLG1=@PDLGA                                                    
     C                   EVAL      T0NPC1=@PNPCO                                                    
     C                   EVAL      T0TPE1=@PTPED                                                    
     C                   EVAL      T0DAT1=@PDATP                                                    
     C                   EVAL      T0NOP1=@PNOPL                                                    
     C                   EVAL      T0LIN1=@PLINE                                                    
     C     KEDTRLP10     SETLL     EDTRLP10                                                         
     C     KEDTRLP10     READE     EDTRLP10                                                         
     C                   DOW       NOT %EOF(EDTRLP10)                                               
15060C                   IF        T0CANS=0                                                         
02060C                   WRITE     REDTRLX00                            80                          
11060C                   DOW       *IN80=*ON                                                        
02060C                   EVAL      T0HWR0 = T0HWR0+1                                                
02060C                   WRITE     REDTRLX00                            80                          
02060C                   ENDDO                                                                      
     C                   DELETE    REDTRLP10                                                        
15060C                   ENDIF                                                                      
      *                                                                                             
     C                   IF        ZXGRAU=0                                                         
     C                   EXSR      CS_UPD_EDTRAU                                                    
     C                   EVAL      ZXGRAU=1                                                         
     C                   ENDIF                                                                      
      *                                                                                             
     C     KEDTRLP10     READE     EDTRLP10                                                         
     C                   ENDDO                                                                      
      *                                                                                             
      * En este caso cierro todas las auditorias relacionadas                                       
      *                                                                                             
     C     KEDTRLP00X    SETLL     EDTRAU00                                                         
     C     KEDTRLP00X    READE     EDTRAU00                                                         
     C                   DOW       NOT %EOF(EDTRAU00)                                               
02060C                   DOU       *IN80=*OFF                                                       
02060C                   EVAL      ZXTIM1 = %TIMESTAMP()                                            
02060C                   MOVEL     ZXTIM1        ZXTIMESTAMP                                        
02060C                   MOVEL     ZXTIMESTAMP   T1TMST                                             
02060C                   WRITE     REDTRAX00                            80                          
02060C                   ENDDO                                                                      
     C                   DELETE    REDTRAU00                                                        
     C     KEDTRLP00X    READE     EDTRAU00                                                         
     C                   ENDDO                                                                      
      *                                                                                             
      * Posible E-Mail con datos del pedido de compras                                              
      *                                                                                             
     C                   MOVEL(P)  T0CIA1        @EMCIAA                                            
     C                   MOVEL(P)  T0DLG1        @EMDLGA                                            
     C                   MOVEL(P)  T0PRVR        @EMCODE                                            
     C                   MOVEL(P)  T0NPC1        @EMNDOC                                            
     C                   MOVE      T0DAT1        @EMFDOC                                            
     C                   MOVE      T0LIN1        @EMLDOC                                            
      *                                                                                             
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Cambiar línea en compra EN -> ED                                   *                        
      **********************************************************************                        
     C     CS_COD110     BEGSR                                                                      
      *                                                                                             
      * Recupero la clave del pedido de compras y luego el pedido de ventas                         
      *                                                                                             
     C                   EVAL      C0CIAS=@PCIAS                                                    
     C                   EVAL      C0DLGA=@PDLGA                                                    
     C                   EVAL      C0NPCO=@PNPCO                                                    
     C                   EVAL      C0TPED=@PTPED                                                    
     C                   EVAL      C0DATP=@PDATP                                                    
     C                   EVAL      C0NOPL=@PNOPL                                                    
     C     KPUCAPE       CHAIN     PUCAPE                                                           
     C                   IF        %FOUND(PUCAPE)                                                   
     C                   EVAL      C5CIAS=@PCIAS                                                    
     C                   EVAL      C5DLGA=@PDLGA                                                    
     C                   EVAL      C5NPCO=@PNPCO                                                    
     C                   EVAL      C5TPED=@PTPED                                                    
     C                   EVAL      C5DATP=@PDATP                                                    
     C                   EVAL      C5NOPL=@PNOPL                                                    
     C                   EVAL      C5LINE=@PLINE                                                    
     C     KPUDEPE       CHAIN     PUDEPE                                                           
     C                   IF        %FOUND(PUDEPE)                                                   
     C                   MOVEL     C5CIVE        S0CIAS                                             
     C                   EVAL      S0DLGA=C5DLVE                                                    
     C                   EVAL      S0NPCO=C5NPVE                                                    
     C                   EVAL      S0TPED=C5TPVE                                                    
     C                   EVAL      S0DATP=C5DAVE                                                    
     C                   EVAL      S0NOPL=C5NOVE                                                    
     C     KCOCAPE       CHAIN(N)  COCAPE                                                           
     C                   IF        %FOUND(COCAPE)                                                   
     C                   MOVEL     C5CIVE        S5CIAS                                             
     C                   EVAL      S5DLGA=C5DLVE                                                    
     C                   EVAL      S5NPCO=C5NPVE                                                    
     C                   EVAL      S5TPED=C5TPVE                                                    
     C                   EVAL      S5DATP=C5DAVE                                                    
     C                   EVAL      S5NOPL=C5NOVE                                                    
     C                   EVAL      S5LINE=C5LIVE                                                    
     C     KCODEPE       CHAIN(N)  CODEPE                                                           
     C                   IF        %FOUND(CODEPE)                                                   
      *                                                                                             
      * Si es una entrega directa actuo                                                             
      *                                                                                             
     C                   IF        S5TPE4='2'                                                       
      *                                                                                             
      * Actualizo datos del pedido de compras                                                       
      *                                                                                             
     C                   EVAL      C0TPE4='2'                                                       
     C                   UPDATE    RPUCAPE                                                          
     C                   EVAL      C5TPE4='2'                                                       
     C                   UPDATE    RPUDEPE                                                          
      *                                                                                             
      * Actualizo datos del pedido de compras desde la 1ª línea original                            
      * si T0ARV1 Y T0COM2 aún están a *blanks                                                      
      *                                                                                             
     C                   EVAL      T0CIAS=S5CIAS                                                    
     C                   EVAL      T0DLGA=S5DLGA                                                    
     C                   EVAL      T0NPCO=S5NPCO                                                    
     C                   EVAL      T0TPED=S5TPED                                                    
     C                   EVAL      T0DATP=S5DATP                                                    
     C                   EVAL      T0NOPL=S5NOPL                                                    
     C                   EVAL      T0LINE=S5LINE                                                    
      *                                                                                             
      * Recupero algunos valores de la 1º línea                                                     
      *                                                                                             
     C                   CLEAR                   ZGARVM                                             
     C                   CLEAR                   ZGCANT                                             
     C                   CLEAR                   ZGCUST                                             
     C                   CLEAR                   ZGTDI1                                             
     C                   CLEAR                   ZGDWR0                                             
     C                   CLEAR                   ZGHWR0                                             
     C                   CLEAR                   ZGUWR0                                             
     C     KEDTRLP00     CHAIN     EDTRLP00                                                         
     C                   IF        %FOUND(EDTRLP00)                                                 
     C                   EVAL      ZGARVM=T0ARVM                                                    
     C                   EVAL      ZGCANT=T0CANT                                                    
     C                   EVAL      ZGCUST=T0CUST                                                    
     C                   EVAL      ZGTDI1=T0TDI1                                                    
     C                   EVAL      ZGDWR0=T0DWR0                                                    
     C                   EVAL      ZGHWR0=T0HWR0                                                    
     C                   EVAL      ZGUWR0=T0UWR0                                                    
     C                   ENDIF                                                                      
      *                                                                                             
      * Compruebo si aún no tiene trazabilidad de compras                                           
      *                                                                                             
     C                   CLEAR                   T0ARV1                                             
     C                   CLEAR                   T0COM2                                             
     C     KEDTRLP00X    CHAIN     EDTRLP00                                                         
      *                                                                                             
     C                   EVAL      T0CIA1=C5CIAS                                                    
     C                   EVAL      T0DLG1=C5DLGA                                                    
     C                   EVAL      T0NPC1=C5NPCO                                                    
     C                   EVAL      T0TPE1=C5TPED                                                    
     C                   EVAL      T0DAT1=C5DATP                                                    
     C                   EVAL      T0NOP1=C5NOPL                                                    
     C                   EVAL      T0LIN1=C5LINE                                                    
     C                   EVAL      ZXARVM=C5ARTI+C5VARI+C5MODE                                      
     C                   MOVEL(P)  ZXARVM        T0ARV1                                             
     C                   MOVEL(P)  '20'          T0EDST                                             
     C                   EVAL      T0CAN1=C5CANT                                                    
FQ710C                   EVAL      T0UNI1=C5UNIM                                                    
     C                   EVAL      T0PRVR=C0PRVR                                                    
H4034c                   exsr      CS_EDDP                                                          
     C                   EVAL      T0DWR1=*DATE                                                     
     C                   TIME                    T0HWR1                                             
     C                   MOVEL(P)  SDSUSR        T0UWR1                                             
     C                   EVAL      T0DWRF=T0DWR1                                                    
     C                   EVAL      T0HWRF=T0HWR1                                                    
      *                                                                                             
      * Si es conjunto de venta hay que Extraer el coeficiente                                      
      * del componente                                                                              
      *                                                                                             
     C                   EVAL      T0CFC1=0                                                         
     C                   IF        S5TCOJ<>*BLANKS                                                  
     C                   EVAL      NDCIAS=S5CIAS                                                    
     C                   EVAL      NDARTI=S5ARTI                                                    
     C                   EVAL      NDVARI=S5VARI                                                    
     C                   EVAL      NDMODE=S5MODE                                                    
     C                   EVAL      NDTCOJ=S5TCOJ                                                    
     C                   EVAL      NDCOMP=C5ARTI                                                    
     C                   EVAL      NDVAR2=C5VARI                                                    
     C                   EVAL      NDMOD2=C5MODE                                                    
     C                   EVAL      NDTCO2=C5TCOJ                                                    
     C     KMSCOJD       CHAIN     MSCOJD                                                           
     C                   IF        %FOUND(MSCOJD)                                                   
     C                             AND NDBAJA<>'1'                                                  
     C                   EVAL      T0CFC1=NDCANT                                                    
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
      *                                                                                             
     C                   IF        %FOUND(EDTRLP00)                                                 
     C                   UPDATE    REDTRLP00                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
     C                   ELSE                                                                       
     C                   EVAL      T0ARVM=ZGARVM                                                    
     C                   EVAL      T0CANT=ZGCANT                                                    
     C                   EVAL      T0CUST=ZGCUST                                                    
     C                   EVAL      T0TDI1=ZGTDI1                                                    
     C                   EVAL      T0DWR0=ZGDWR0                                                    
     C                   EVAL      T0HWR0=ZGHWR0                                                    
     C                   EVAL      T0UWR0=ZGUWR0                                                    
     C                   EVAL      T0TREG=1                                                         
21050C                   WRITE     REDTRLP00                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
     C                   ENDIF                                                                      
      *                                                                                             
     C                   EXSR      CS_UPD_EDTRAU                                                    
      *                                                                                             
      * Posible E-Mail con datos del pedido de compras                                              
      *                                                                                             
     C                   MOVEL(P)  T0CIA1        @EMCIAA                                            
     C                   MOVEL(P)  T0DLG1        @EMDLGA                                            
     C                   MOVEL(P)  T0PRVR        @EMCODE                                            
     C                   MOVEL(P)  T0NPC1        @EMNDOC                                            
     C                   MOVE      T0DAT1        @EMFDOC                                            
     C                   MOVE      T0LIN1        @EMLDOC                                            
      *                                                                                             
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
      *                                                                                             
      * Sino es entrega directa libera registro (Sólo aquí)                                         
      *                                                                                             
     C                   ELSE                                                                       
     C                   UNLOCK    PUCAPE                                                           
     C                   UNLOCK    PUDEPE                                                           
     C                   ENDIF                                                                      
      *                                                                                             
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Cambiar logística en pedido compra                                 *                        
      **********************************************************************                        
     C     CS_COD111     BEGSR                                                                      
      *                                                                                             
      * Actualizo campos en registro de trazabilidad                                                
      *                                                                                             
     C                   EVAL      C5CIAS=@PCIAS                                                    
     C                   EVAL      C5DLGA=@PDLGA                                                    
     C                   EVAL      C5NPCO=@PNPCO                                                    
     C                   EVAL      C5TPED=@PTPED                                                    
     C                   EVAL      C5DATP=@PDATP                                                    
     C                   EVAL      C5NOPL=@PNOPL                                                    
     C                   EVAL      C5LINE=@PLINE                                                    
     C     KPUDEPE       CHAIN(N)  PUDEPE                                                           
     C                   IF        %FOUND(PUDEPE)                                                   
      *                                                                                             
      * Recupero la clave del pedido de compra                                                      
      *                                                                                             
     C                   EVAL      ZXGRAU=0                                                         
     C                   EVAL      T0CIA1=@PCIAS                                                    
     C                   EVAL      T0DLG1=@PDLGA                                                    
     C                   EVAL      T0NPC1=@PNPCO                                                    
     C                   EVAL      T0TPE1=@PTPED                                                    
     C                   EVAL      T0DAT1=@PDATP                                                    
     C                   EVAL      T0NOP1=@PNOPL                                                    
     C                   EVAL      T0LIN1=@PLINE                                                    
     C     KEDTRLP10     SETLL     EDTRLP10                                                         
     C     KEDTRLP10     READE     EDTRLP10                                                         
     C                   DOW       NOT %EOF(EDTRLP10)                                               
      *                                                                                             
     C                   EVAL      T0DWRF=*DATE                                                     
     C                   TIME                    T0HWRF                                             
     C                   UPDATE    REDTRLP10                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
      *                                                                                             
      * Auditoría sólo para la 1ª línea                                                             
      *                                                                                             
     C                   IF        ZXGRAU=0                                                         
     C                   EXSR      CS_UPD_EDTRAU                                                    
     C                   EVAL      ZXGRAU=1                                                         
     C                   ENDIF                                                                      
      *                                                                                             
     C     KEDTRLP10     READE     EDTRLP10                                                         
     C                   ENDDO                                                                      
      *                                                                                             
      * Posible E-Mail con datos del pedido de compras                                              
      *                                                                                             
     C                   MOVEL(P)  T0CIA1        @EMCIAA                                            
     C                   MOVEL(P)  T0DLG1        @EMDLGA                                            
     C                   MOVEL(P)  T0PRVR        @EMCODE                                            
     C                   MOVEL(P)  T0NPC1        @EMNDOC                                            
     C                   MOVE      T0DAT1        @EMFDOC                                            
     C                   MOVE      T0LIN1        @EMLDOC                                            
      *                                                                                             
     C                   ENDIF                                                                      
      *                                                                                             
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Cambiar dirección de entrega en compra                             *                        
      **********************************************************************                        
     C     CS_COD112     BEGSR                                                                      
      *                                                                                             
      * Actualizo campos en registro de trazabilidad                                                
      *                                                                                             
     C                   EVAL      C5CIAS=@PCIAS                                                    
     C                   EVAL      C5DLGA=@PDLGA                                                    
     C                   EVAL      C5NPCO=@PNPCO                                                    
     C                   EVAL      C5TPED=@PTPED                                                    
     C                   EVAL      C5DATP=@PDATP                                                    
     C                   EVAL      C5NOPL=@PNOPL                                                    
     C                   EVAL      C5LINE=@PLINE                                                    
     C     KPUDEPE       CHAIN(N)  PUDEPE                                                           
     C                   IF        %FOUND(PUDEPE)                                                   
      *                                                                                             
      * Recupero la clave del pedido de compra                                                      
      *                                                                                             
     C                   EVAL      ZXGRAU=0                                                         
     C                   EVAL      T0CIA1=@PCIAS                                                    
     C                   EVAL      T0DLG1=@PDLGA                                                    
     C                   EVAL      T0NPC1=@PNPCO                                                    
     C                   EVAL      T0TPE1=@PTPED                                                    
     C                   EVAL      T0DAT1=@PDATP                                                    
     C                   EVAL      T0NOP1=@PNOPL                                                    
     C                   EVAL      T0LIN1=@PLINE                                                    
     C     KEDTRLP10     SETLL     EDTRLP10                                                         
     C     KEDTRLP10     READE     EDTRLP10                                                         
     C                   DOW       NOT %EOF(EDTRLP10)                                               
      *                                                                                             
     C                   EVAL      T0DWRF=*DATE                                                     
     C                   TIME                    T0HWRF                                             
     C                   UPDATE    REDTRLP10                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
      *                                                                                             
      * Auditoría sólo para la 1ª línea                                                             
      *                                                                                             
     C                   IF        ZXGRAU=0                                                         
     C                   EXSR      CS_UPD_EDTRAU                                                    
     C                   EVAL      ZXGRAU=1                                                         
     C                   ENDIF                                                                      
      *                                                                                             
     C     KEDTRLP10     READE     EDTRLP10                                                         
     C                   ENDDO                                                                      
      *                                                                                             
      * Posible E-Mail con datos del pedido de compras                                              
      *                                                                                             
     C                   MOVEL(P)  T0CIA1        @EMCIAA                                            
     C                   MOVEL(P)  T0DLG1        @EMDLGA                                            
     C                   MOVEL(P)  T0PRVR        @EMCODE                                            
     C                   MOVEL(P)  T0NPC1        @EMNDOC                                            
     C                   MOVE      T0DAT1        @EMFDOC                                            
     C                   MOVE      T0LIN1        @EMLDOC                                            
      *                                                                                             
     C                   ENDIF                                                                      
      *                                                                                             
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Cambiar condición de coenvío en compra                             *                        
      **********************************************************************                        
     C     CS_COD113     BEGSR                                                                      
      *                                                                                             
      * Actualizo campos en registro de trazabilidad                                                
      *                                                                                             
     C                   EVAL      C5CIAS=@PCIAS                                                    
     C                   EVAL      C5DLGA=@PDLGA                                                    
     C                   EVAL      C5NPCO=@PNPCO                                                    
     C                   EVAL      C5TPED=@PTPED                                                    
     C                   EVAL      C5DATP=@PDATP                                                    
     C                   EVAL      C5NOPL=@PNOPL                                                    
     C                   EVAL      C5LINE=@PLINE                                                    
     C     KPUDEPE       CHAIN(N)  PUDEPE                                                           
     C                   IF        %FOUND(PUDEPE)                                                   
      *                                                                                             
      * Recupero la clave del pedido de compra                                                      
      *                                                                                             
     C                   EVAL      ZXGRAU=0                                                         
     C                   EVAL      T0CIA1=@PCIAS                                                    
     C                   EVAL      T0DLG1=@PDLGA                                                    
     C                   EVAL      T0NPC1=@PNPCO                                                    
     C                   EVAL      T0TPE1=@PTPED                                                    
     C                   EVAL      T0DAT1=@PDATP                                                    
     C                   EVAL      T0NOP1=@PNOPL                                                    
     C                   EVAL      T0LIN1=@PLINE                                                    
     C     KEDTRLP10     SETLL     EDTRLP10                                                         
     C     KEDTRLP10     READE     EDTRLP10                                                         
     C                   DOW       NOT %EOF(EDTRLP10)                                               
      *                                                                                             
     C                   EVAL      T0DWRF=*DATE                                                     
     C                   TIME                    T0HWRF                                             
     C                   UPDATE    REDTRLP10                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
      *                                                                                             
      * Auditoría sólo para la 1ª línea                                                             
      *                                                                                             
     C                   IF        ZXGRAU=0                                                         
     C                   EXSR      CS_UPD_EDTRAU                                                    
     C                   EVAL      ZXGRAU=1                                                         
     C                   ENDIF                                                                      
      *                                                                                             
     C     KEDTRLP10     READE     EDTRLP10                                                         
     C                   ENDDO                                                                      
      *                                                                                             
      * Posible E-Mail con datos del pedido de compras                                              
      *                                                                                             
     C                   MOVEL(P)  T0CIA1        @EMCIAA                                            
     C                   MOVEL(P)  T0DLG1        @EMDLGA                                            
     C                   MOVEL(P)  T0PRVR        @EMCODE                                            
     C                   MOVEL(P)  T0NPC1        @EMNDOC                                            
     C                   MOVE      T0DAT1        @EMFDOC                                            
     C                   MOVE      T0LIN1        @EMLDOC                                            
      *                                                                                             
     C                   ENDIF                                                                      
      *                                                                                             
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Cambiar fecha solicitada en pedido compra                          *                        
      **********************************************************************                        
     C     CS_COD114     BEGSR                                                                      
      *                                                                                             
      * Actualizo campos en registro de trazabilidad                                                
      *                                                                                             
     C                   EVAL      C5CIAS=@PCIAS                                                    
     C                   EVAL      C5DLGA=@PDLGA                                                    
     C                   EVAL      C5NPCO=@PNPCO                                                    
     C                   EVAL      C5TPED=@PTPED                                                    
     C                   EVAL      C5DATP=@PDATP                                                    
     C                   EVAL      C5NOPL=@PNOPL                                                    
     C                   EVAL      C5LINE=@PLINE                                                    
     C     KPUDEPE       CHAIN(N)  PUDEPE                                                           
     C                   IF        %FOUND(PUDEPE)                                                   
      *                                                                                             
      * Recupero la clave del pedido de compra                                                      
      *                                                                                             
     C                   EVAL      ZXGRAU=0                                                         
     C                   EVAL      T0CIA1=@PCIAS                                                    
     C                   EVAL      T0DLG1=@PDLGA                                                    
     C                   EVAL      T0NPC1=@PNPCO                                                    
     C                   EVAL      T0TPE1=@PTPED                                                    
     C                   EVAL      T0DAT1=@PDATP                                                    
     C                   EVAL      T0NOP1=@PNOPL                                                    
     C                   EVAL      T0LIN1=@PLINE                                                    
     C     KEDTRLP10     SETLL     EDTRLP10                                                         
     C     KEDTRLP10     READE     EDTRLP10                                                         
     C                   DOW       NOT %EOF(EDTRLP10)                                               
      *                                                                                             
     C                   EVAL      T0DWRF=*DATE                                                     
     C                   TIME                    T0HWRF                                             
     C                   UPDATE    REDTRLP10                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
      *                                                                                             
      * Auditoría sólo para la 1ª línea                                                             
      *                                                                                             
     C                   IF        ZXGRAU=0                                                         
     C                   EXSR      CS_UPD_EDTRAU                                                    
     C                   EVAL      ZXGRAU=1                                                         
     C                   ENDIF                                                                      
      *                                                                                             
     C     KEDTRLP10     READE     EDTRLP10                                                         
     C                   ENDDO                                                                      
      *                                                                                             
      * Posible E-Mail con datos del pedido de compras                                              
      *                                                                                             
     C                   MOVEL(P)  T0CIA1        @EMCIAA                                            
     C                   MOVEL(P)  T0DLG1        @EMDLGA                                            
     C                   MOVEL(P)  T0PRVR        @EMCODE                                            
     C                   MOVEL(P)  T0NPC1        @EMNDOC                                            
     C                   MOVE      T0DAT1        @EMFDOC                                            
     C                   MOVE      T0LIN1        @EMLDOC                                            
      *                                                                                             
     C                   ENDIF                                                                      
      *                                                                                             
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Retener línea pedido compra (Por Riesgo)                           *                        
      **********************************************************************                        
     C     CS_COD115     BEGSR                                                                      
      *                                                                                             
      * Actualizo campos en registro de trazabilidad                                                
      *                                                                                             
     C                   EVAL      C5CIAS=@PCIAS                                                    
     C                   EVAL      C5DLGA=@PDLGA                                                    
     C                   EVAL      C5NPCO=@PNPCO                                                    
     C                   EVAL      C5TPED=@PTPED                                                    
     C                   EVAL      C5DATP=@PDATP                                                    
     C                   EVAL      C5NOPL=@PNOPL                                                    
     C                   EVAL      C5LINE=@PLINE                                                    
     C     KPUDEPE       CHAIN(N)  PUDEPE                                                           
     C                   IF        %FOUND(PUDEPE)                                                   
      *                                                                                             
      * Recupero la clave del pedido de compra                                                      
      *                                                                                             
     C                   EVAL      ZXGRAU=0                                                         
     C                   EVAL      T0CIA1=@PCIAS                                                    
     C                   EVAL      T0DLG1=@PDLGA                                                    
     C                   EVAL      T0NPC1=@PNPCO                                                    
     C                   EVAL      T0TPE1=@PTPED                                                    
     C                   EVAL      T0DAT1=@PDATP                                                    
     C                   EVAL      T0NOP1=@PNOPL                                                    
     C                   EVAL      T0LIN1=@PLINE                                                    
     C     KEDTRLP10     SETLL     EDTRLP10                                                         
     C     KEDTRLP10     READE     EDTRLP10                                                         
     C                   DOW       NOT %EOF(EDTRLP10)                                               
      *                                                                                             
     C                   EVAL      T0DWRF=*DATE                                                     
     C                   TIME                    T0HWRF                                             
     C                   EVAL      T0RISK=1                                                         
     C                   UPDATE    REDTRLP10                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
      *                                                                                             
      * Auditoría sólo para la 1ª línea                                                             
      *                                                                                             
     C                   IF        ZXGRAU=0                                                         
     C                   EXSR      CS_UPD_EDTRAU                                                    
     C                   EVAL      ZXGRAU=1                                                         
     C                   ENDIF                                                                      
      *                                                                                             
     C     KEDTRLP10     READE     EDTRLP10                                                         
     C                   ENDDO                                                                      
      *                                                                                             
      * Posible E-Mail con datos del pedido de compras                                              
      *                                                                                             
     C                   MOVEL(P)  T0CIA1        @EMCIAA                                            
     C                   MOVEL(P)  T0DLG1        @EMDLGA                                            
     C                   MOVEL(P)  T0PRVR        @EMCODE                                            
     C                   MOVEL(P)  T0NPC1        @EMNDOC                                            
     C                   MOVE      T0DAT1        @EMFDOC                                            
     C                   MOVE      T0LIN1        @EMLDOC                                            
      *                                                                                             
     C                   ENDIF                                                                      
      *                                                                                             
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Cerrar línea en pedido de Compra                                   *                        
      **********************************************************************                        
     C     CS_COD118     BEGSR                                                                      
      *                                                                                             
      * Recupero la clave del pedido de compra                                                      
      *                                                                                             
     C                   EVAL      ZXGRAU=0                                                         
     C                   EVAL      T0CIA1=@PCIAS                                                    
     C                   EVAL      T0DLG1=@PDLGA                                                    
     C                   EVAL      T0NPC1=@PNPCO                                                    
     C                   EVAL      T0TPE1=@PTPED                                                    
     C                   EVAL      T0DAT1=@PDATP                                                    
     C                   EVAL      T0NOP1=@PNOPL                                                    
     C                   EVAL      T0LIN1=@PLINE                                                    
     C     KEDTRLP10     SETLL     EDTRLP10                                                         
     C     KEDTRLP10     READE     EDTRLP10                                                         
     C                   DOW       NOT %EOF(EDTRLP10)                                               
      *                                                                                             
     C                   EVAL      T0EDST='95'                                                      
     C                   UPDATE    REDTRLP10                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
      *                                                                                             
      * Auditoría sólo para la 1ª línea                                                             
      *                                                                                             
     C                   IF        ZXGRAU=0                                                         
     C                   EXSR      CS_UPD_EDTRAU                                                    
     C                   EVAL      ZXGRAU=1                                                         
     C                   ENDIF                                                                      
      *                                                                                             
     C     KEDTRLP10     READE     EDTRLP10                                                         
     C                   ENDDO                                                                      
      *                                                                                             
      * En este caso cierro todas las auditorias relacionadas                                       
      *                                                                                             
     C     KEDTRLP00X    SETLL     EDTRAU00                                                         
     C     KEDTRLP00X    READE     EDTRAU00                                                         
     C                   DOW       NOT %EOF(EDTRAU00)                                               
     C                   EVAL      T1STUL='5'                                                       
     C                   UPDATE    REDTRAU00                                                        
     C     KEDTRLP00X    READE     EDTRAU00                                                         
     C                   ENDDO                                                                      
      *                                                                                             
      * Posible E-Mail con datos del pedido de compras                                              
      *                                                                                             
     C                   MOVEL(P)  T0CIA1        @EMCIAA                                            
     C                   MOVEL(P)  T0DLG1        @EMDLGA                                            
     C                   MOVEL(P)  T0PRVR        @EMCODE                                            
     C                   MOVEL(P)  T0NPC1        @EMNDOC                                            
     C                   MOVE      T0DAT1        @EMFDOC                                            
     C                   MOVE      T0LIN1        @EMLDOC                                            
      *                                                                                             
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Reabrir una línea de compra                                        *                        
      **********************************************************************                        
     C     CS_COD119     BEGSR                                                                      
      *                                                                                             
      * Recupero la clave del pedido de compra y sólo leo la 1ª línea                               
      *                                                                                             
     C                   EVAL      ZXGRAU=0                                                         
     C                   EVAL      T0CIA1=@PCIAS                                                    
     C                   EVAL      T0DLG1=@PDLGA                                                    
     C                   EVAL      T0NPC1=@PNPCO                                                    
     C                   EVAL      T0TPE1=@PTPED                                                    
     C                   EVAL      T0DAT1=@PDATP                                                    
     C                   EVAL      T0NOP1=@PNOPL                                                    
     C                   EVAL      T0LIN1=@PLINE                                                    
     C     KEDTRLP10     SETLL     EDTRLP10                                                         
     C     KEDTRLP10     READE(N)  EDTRLP10                                                         
     C                   IF        NOT %EOF(EDTRLP10)                                               
      *                                                                                             
      * Auditoría sólo para la 1ª línea                                                             
      *                                                                                             
     C                   IF        ZXGRAU=0                                                         
     C                   EXSR      CS_UPD_EDTRAU                                                    
     C                   EVAL      ZXGRAU=1                                                         
     C                   ENDIF                                                                      
      *                                                                                             
     C                   ENDIF                                                                      
      *                                                                                             
      * Posible E-Mail con datos del pedido de compras                                              
      *                                                                                             
     C                   MOVEL(P)  T0CIA1        @EMCIAA                                            
     C                   MOVEL(P)  T0DLG1        @EMDLGA                                            
     C                   MOVEL(P)  T0PRVR        @EMCODE                                            
     C                   MOVEL(P)  T0NPC1        @EMNDOC                                            
     C                   MOVE      T0DAT1        @EMFDOC                                            
     C                   MOVE      T0LIN1        @EMLDOC                                            
      *                                                                                             
      *                                                                                             
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Modificación del precio de coste                                   *                        
      **********************************************************************                        
     C     CS_COD120     BEGSR                                                                      
      *                                                                                             
      * Actualizo campos en registro de trazabilidad                                                
      *                                                                                             
     C                   EVAL      C5CIAS=@PCIAS                                                    
     C                   EVAL      C5DLGA=@PDLGA                                                    
     C                   EVAL      C5NPCO=@PNPCO                                                    
     C                   EVAL      C5TPED=@PTPED                                                    
     C                   EVAL      C5DATP=@PDATP                                                    
     C                   EVAL      C5NOPL=@PNOPL                                                    
     C                   EVAL      C5LINE=@PLINE                                                    
     C     KPUDEPE       CHAIN(N)  PUDEPE                                                           
     C                   IF        %FOUND(PUDEPE)                                                   
      *                                                                                             
      * Recupero la clave del pedido de compra                                                      
      *                                                                                             
     C                   EVAL      ZXGRAU=0                                                         
     C                   EVAL      T0CIA1=@PCIAS                                                    
     C                   EVAL      T0DLG1=@PDLGA                                                    
     C                   EVAL      T0NPC1=@PNPCO                                                    
     C                   EVAL      T0TPE1=@PTPED                                                    
     C                   EVAL      T0DAT1=@PDATP                                                    
     C                   EVAL      T0NOP1=@PNOPL                                                    
     C                   EVAL      T0LIN1=@PLINE                                                    
     C     KEDTRLP10     SETLL     EDTRLP10                                                         
     C     KEDTRLP10     READE     EDTRLP10                                                         
     C                   DOW       NOT %EOF(EDTRLP10)                                               
      *                                                                                             
     C                   EVAL      T0DWRF=*DATE                                                     
     C                   TIME                    T0HWRF                                             
     C                   UPDATE    REDTRLP10                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
      *                                                                                             
      * Auditoría sólo para la 1ª línea                                                             
      *                                                                                             
     C                   IF        ZXGRAU=0                                                         
     C                   EXSR      CS_UPD_EDTRAU                                                    
     C                   EVAL      ZXGRAU=1                                                         
     C                   ENDIF                                                                      
      *                                                                                             
     C     KEDTRLP10     READE     EDTRLP10                                                         
     C                   ENDDO                                                                      
      *                                                                                             
      * Posible E-Mail con datos del pedido de compras                                              
      *                                                                                             
     C                   MOVEL(P)  T0CIA1        @EMCIAA                                            
     C                   MOVEL(P)  T0DLG1        @EMDLGA                                            
     C                   MOVEL(P)  T0PRVR        @EMCODE                                            
     C                   MOVEL(P)  T0NPC1        @EMNDOC                                            
     C                   MOVE      T0DAT1        @EMFDOC                                            
     C                   MOVE      T0LIN1        @EMLDOC                                            
      *                                                                                             
     C                   ENDIF                                                                      
      *                                                                                             
     C                   ENDSR                                                                      
19050 **********************************************************************                        
19050 * DesRetener línea pedido compra                                     *                        
19050 **********************************************************************                        
19050C     CS_COD121     BEGSR                                                                      
19050 *                                                                                             
19050 * Actualizo campos en registro de trazabilidad                                                
19050 *                                                                                             
19050C                   EVAL      C5CIAS=@PCIAS                                                    
19050C                   EVAL      C5DLGA=@PDLGA                                                    
19050C                   EVAL      C5NPCO=@PNPCO                                                    
19050C                   EVAL      C5TPED=@PTPED                                                    
19050C                   EVAL      C5DATP=@PDATP                                                    
19050C                   EVAL      C5NOPL=@PNOPL                                                    
19050C                   EVAL      C5LINE=@PLINE                                                    
19050C     KPUDEPE       CHAIN(N)  PUDEPE                                                           
19050C                   IF        %FOUND(PUDEPE)                                                   
19050 *                                                                                             
19050 * Recupero la clave del pedido de compra                                                      
19050 *                                                                                             
19050C                   EVAL      ZXGRAU=0                                                         
19050C                   EVAL      T0CIA1=@PCIAS                                                    
19050C                   EVAL      T0DLG1=@PDLGA                                                    
19050C                   EVAL      T0NPC1=@PNPCO                                                    
19050C                   EVAL      T0TPE1=@PTPED                                                    
19050C                   EVAL      T0DAT1=@PDATP                                                    
19050C                   EVAL      T0NOP1=@PNOPL                                                    
19050C                   EVAL      T0LIN1=@PLINE                                                    
19050C     KEDTRLP10     SETLL     EDTRLP10                                                         
19050C     KEDTRLP10     READE     EDTRLP10                                                         
19050C                   DOW       NOT %EOF(EDTRLP10)                                               
19050 *                                                                                             
19050C                   EVAL      T0DWRF=*DATE                                                     
19050C                   TIME                    T0HWRF                                             
19050C                   EVAL      T0PHLD=0                                                         
19050C                   UPDATE    REDTRLP10                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
19050 *                                                                                             
19050 * Auditoría sólo para la 1ª línea                                                             
19050 *                                                                                             
19050C                   IF        ZXGRAU=0                                                         
19050C                   EXSR      CS_UPD_EDTRAU                                                    
19050C                   EVAL      ZXGRAU=1                                                         
19050C                   ENDIF                                                                      
19050 *                                                                                             
19050C     KEDTRLP10     READE     EDTRLP10                                                         
19050C                   ENDDO                                                                      
19050 *                                                                                             
19050 * Posible E-Mail con datos del pedido de compras                                              
19050 *                                                                                             
19050C                   MOVEL(P)  T0CIA1        @EMCIAA                                            
19050C                   MOVEL(P)  T0DLG1        @EMDLGA                                            
19050C                   MOVEL(P)  T0PRVR        @EMCODE                                            
19050C                   MOVEL(P)  T0NPC1        @EMNDOC                                            
19050C                   MOVE      T0DAT1        @EMFDOC                                            
19050C                   MOVE      T0LIN1        @EMLDOC                                            
19050 *                                                                                             
19050C                   ENDIF                                                                      
19050 *                                                                                             
19050C                   ENDSR                                                                      
      **********************************************************************                        
      * Proceso auditoría 201  Alta línea pedido CODEPE en Productiva      *                        
      **********************************************************************                        
     C     CS_COD201     BEGSR                                                                      
      *                                                                                             
      * Recupero la clave del EDTRLP según el parámetro del lógico                                  
      *                                                                                             
     C                   SELECT                                                                     
     C                   WHEN      @PLOGI=0                                                         
     C                   EVAL      T0CIAS=@PCIAS                                                    
     C                   EVAL      T0DLGA=@PDLGA                                                    
     C                   EVAL      T0NPCO=@PNPCO                                                    
     C                   EVAL      T0TPED=@PTPED                                                    
     C                   EVAL      T0DATP=@PDATP                                                    
     C                   EVAL      T0NOPL=@PNOPL                                                    
     C                   EVAL      T0LINE=@PLINE                                                    
     C                                                                                              
     C                   WHEN      @PLOGI=1                                                         
     C                   EVAL      T0CIA1=@PCIAS                                                    
     C                   EVAL      T0DLG1=@PDLGA                                                    
     C                   EVAL      T0NPC1=@PNPCO                                                    
     C                   EVAL      T0TPE1=@PTPED                                                    
     C                   EVAL      T0DAT1=@PDATP                                                    
     C                   EVAL      T0NOP1=@PNOPL                                                    
     C                   EVAL      T0LIN1=@PLINE                                                    
     C                                                                                              
     C                   WHEN      @PLOGI=2                                                         
     C                   EVAL      T0CIA2=@PCIAS                                                    
     C                   EVAL      T0DLG2=@PDLGA                                                    
     C                   EVAL      T0NPC2=@PNPCO                                                    
     C                   EVAL      T0TPE2=@PTPED                                                    
     C                   EVAL      T0DAT2=@PDATP                                                    
     C                   EVAL      T0NOP2=@PNOPL                                                    
     C                   EVAL      T0LIN2=@PLINE                                                    
     C                                                                                              
     C                   WHEN      @PLOGI=3                                                         
     C                   EVAL      T0CIA3=@PCIAS                                                    
     C                   EVAL      T0DLG3=@PDLGA                                                    
     C                   EVAL      T0NPC3=@PNPCO                                                    
     C                   EVAL      T0TPE3=@PTPED                                                    
     C                   EVAL      T0DAT3=@PDATP                                                    
     C                   EVAL      T0NOP3=@PNOPL                                                    
     C                   EVAL      T0LIN3=@PLINE                                                    
     C                                                                                              
     C                   ENDSL                                                                      
     C                                                                                              
      *                                                                                             
      * Recupero datos del la línea del pedido en la productiva                                     
      *                                                                                             
     C                   EVAL      S5CIAS=@PCIA2                                                    
     C                   EVAL      S5DLGA=@PDLG2                                                    
     C                   EVAL      S5NPCO=@PNPC2                                                    
     C                   EVAL      S5TPED=@PTPE2                                                    
     C                   EVAL      S5DATP=@PDAT2                                                    
     C                   EVAL      S5NOPL=@PNOP2                                                    
     C                   EVAL      S5LINE=@PLIN2                                                    
     C     KCODEPE       CHAIN(N)  CODEPE                                                           
     C                                                                                              
      * Leo archivo de trazabilidad y actualizo los campos correspondientes                         
     C                                                                                              
     C                   EVAL      *IN82=*OFF                                                       
     C                                                                                              
     C                   SELECT                                                                     
     C                   WHEN      @PLOGI=0                                                         
     C     KEDTRLP00     SETLL     EDTRLP00                                                         
     C                   WHEN      @PLOGI=1                                                         
     C     KEDTRLP10     SETLL     EDTRLP10                                                         
     C                   WHEN      @PLOGI=2                                                         
     C     KEDTRLP20     SETLL     EDTRLP20                                                         
     C                   WHEN      @PLOGI=3                                                         
     C     KEDTRLP30     SETLL     EDTRLP30                                                         
     C                   ENDSL                                                                      
     C                                                                                              
     C                   DOW       *IN82=*OFF                                                       
     C                                                                                              
     C                   SELECT                                                                     
     C                   WHEN      @PLOGI=0                                                         
     C     KEDTRLP00     READE     EDTRLP00                               82                        
     C                   WHEN      @PLOGI=1                                                         
     C     KEDTRLP10     READE     EDTRLP10                               82                        
     C                   WHEN      @PLOGI=2                                                         
     C     KEDTRLP20     READE     EDTRLP20                               82                        
     C                   WHEN      @PLOGI=3                                                         
     C     KEDTRLP30     READE     EDTRLP30                               82                        
     C                   ENDSL                                                                      
     C                                                                                              
     C                   IF        *IN82=*OFF                                                       
FDX01 *                                                                                             
FDX01 * Ahora se permiten conjuntos combinados, tenemos que despreciar los                          
FDX01 * componentes de material propio de la comercial y actualizar sólo                            
FDX01 * los que corresponden                                                                        
FDX01 *                                                                                             
FDX01C                   IF        T0PRVR<>*BLANKS                                                  
     C                                                                                              
      * Este evento es un alta de línea en empresa productiva.                                      
      * por tanto actualizo los campos:                                                             
     C                   EVAL      T0CIA2=@PCIA2                                                    
     C                   EVAL      T0DLG2=@PDLG2                                                    
     C                   EVAL      T0NPC2=@PNPC2                                                    
     C                   EVAL      T0TPE2=@PTPE2                                                    
     C                   EVAL      T0DAT2=@PDAT2                                                    
     C                   EVAL      T0NOP2=@PNOP2                                                    
     C                   EVAL      T0LIN2=@PLIN2                                                    
     C                   EVAL      T0ARV2=S5ARTI+S5VARI+S5MODE                                      
     C                   EVAL      T0COM2=*BLANKS                                                   
     C                   EVAL      T0CAN2=@PCANT                                                    
FQ710C                   EVAL      T0UNI2=S5UNIM                                                    
     C                   EVAL      T0CFC2=0                                                         
     C                   EVAL      T0CUS2=S5CUST                                                    
     C                   EVAL      T0DWR2=*DATE                                                     
     C                   TIME                    T0HWR2                                             
     C                   EVAL      T0UWR2=SDSUSR                                                    
     C                   EVAL      T0EDST='30'                                                      
     C                   EVAL      T0DWRF=*DATE                                                     
     C                   TIME                    T0HWRF                                             
     C                                                                                              
     C                   SELECT                                                                     
     C                   WHEN      @PLOGI=0                                                         
     C                   UPDATE    REDTRLP00                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
     C                   WHEN      @PLOGI=1                                                         
     C                   UPDATE    REDTRLP10                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
     C                   WHEN      @PLOGI=2                                                         
     C                   UPDATE    REDTRLP20                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
     C                   WHEN      @PLOGI=3                                                         
     C                   UPDATE    REDTRLP30                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
     C                   ENDSL                                                                      
     C                                                                                              
FDX01C                   ENDIF                                                                      
FDX01 *                                                                                             
     C                   ENDIF                                                                      
     C                                                                                              
     C                   ENDDO                                                                      
     C                                                                                              
      *                                                                                             
      * Se quiere grabar registro de auditoría en EDTRAU?                                           
      *                                                                                             
     C                   EXSR      CS_UPD_EDTRAU                                                    
      *                                                                                             
      * Posible E-Mail con datos del pedido de compra                                               
      *                                                                                             
     C                   MOVEL(P)  T0CIA2        @EMCIAA                                            
     C                   MOVEL(P)  T0DLG2        @EMDLGA                                            
     C                   MOVEL(P)  T0CUST        @EMCODE                                            
     C                   MOVEL(P)  T0NPC2        @EMNDOC                                            
     C                   MOVE      T0DAT2        @EMFDOC                                            
     C                   MOVE      T0LIN2        @EMLDOC                                            
      *                                                                                             
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Proceso auditoría 202  Alta línea pedido CODEP2 en Productiva      *                        
      **********************************************************************                        
     C     CS_COD202     BEGSR                                                                      
      *                                                                                             
      * Recupero componente y línea del CODEP2 en DS desde PTEXT                                    
      *                                                                                             
     C                   EVAL      DSCODEP2=@PTEXT                                                  
      *                                                                                             
      * Recupero datos del la línea del pedido en la productiva                                     
      *                                                                                             
     C                   EVAL      S5CIAS=@PCIAS                                                    
     C                   EVAL      S5DLGA=@PDLGA                                                    
     C                   EVAL      S5NPCO=@PNPCO                                                    
     C                   EVAL      S5TPED=@PTPED                                                    
     C                   EVAL      S5DATP=@PDATP                                                    
     C                   EVAL      S5NOPL=@PNOPL                                                    
     C                   EVAL      S5LINE=@PLINE                                                    
     C     KCODEPE       CHAIN(N)  CODEPE                                                           
     C                                                                                              
      *                                                                                             
      * Recupero datos del la línea del componente en la productiva                                 
      *                                                                                             
     C                   EVAL      C_S5CIAS=@PCIAS                                                  
     C                   EVAL      C_S5DLGA=@PDLGA                                                  
     C                   EVAL      C_S5NPCO=@PNPCO                                                  
     C                   EVAL      C_S5TPED=@PTPED                                                  
     C                   EVAL      C_S5DATP=@PDATP                                                  
     C                   EVAL      C_S5NOPL=@PNOPL                                                  
     C                   EVAL      C_S5LINE=@PLINE                                                  
     C                   MOVE      ZDLIN3        C_S5LIN3                                           
     C     KCODEP2       CHAIN(N)  CODEP2                                                           
      *                                                                                             
      * Recupero datos de la cabecera del pedido en la productiva                                   
      *                                                                                             
     C                   EVAL      S0CIAS=S5CIAS                                                    
     C                   EVAL      S0DLGA=S5DLGA                                                    
     C                   EVAL      S0NPCO=S5NPCO                                                    
     C                   EVAL      S0TPED=S5TPED                                                    
     C                   EVAL      S0DATP=S5DATP                                                    
     C                   EVAL      S0NOPL=S5NOPL                                                    
     C     KCOCAPE       CHAIN(N)  COCAPE                                                           
     C                                                                                              
      *                                                                                             
      * Calculo el estatus de la línea en la productiva                                             
      *                                                                                             
     C                   EVAL      ZXEDST=*BLANKS                                                   
     C                   IF        S0STCO>='20'                                                     
     C                   IF        S5CANR<>0                                                        
     C                   EVAL      ZXEDST='50'                                                      
     C                   ELSE                                                                       
     C                   EVAL      ZXEDST='40'                                                      
     C                   ENDIF                                                                      
     C                   ELSE                                                                       
     C                   EVAL      ZXEDST='30'                                                      
     C                   ENDIF                                                                      
      *                                                                                             
      * Recupero la clave del EDTRLP20 (productiva)                                                 
      *                                                                                             
     C                   EVAL      T0CIA2=@PCIAS                                                    
     C                   EVAL      T0DLG2=@PDLGA                                                    
     C                   EVAL      T0NPC2=@PNPCO                                                    
     C                   EVAL      T0TPE2=@PTPED                                                    
     C                   EVAL      T0DAT2=@PDATP                                                    
     C                   EVAL      T0NOP2=@PNOPL                                                    
     C                   EVAL      T0LIN2=@PLINE                                                    
     C                   EVAL      T0COM2=ZDCOMP+ZDVAR2+ZDMOD2                                      
      *                                                                                             
      * BUSCO el registro en archivo EDTRLP con el código de componente                             
      *                                                                                             
     C     KEDTRLP20X    CHAIN     EDTRLP20                                                         
      *Si no encuento el registro con código de componente significa que                            
      *tengo que buscarlo con componente *blanks                                                    
     C                   IF        NOT %FOUND(EDTRLP20)                                             
     C                   EVAL      T0COM2=*BLANKS                                                   
     C     KEDTRLP20X    CHAIN     EDTRLP20                                                         
      *Si lo encuentro con COMP=*blanks cambio el COMP y el coeficiente                             
     C                   IF        %FOUND(EDTRLP20)                                                 
     C                   EVAL      T0COM2=ZDCOMP+ZDVAR2+ZDMOD2                                      
     C                   EVAL      T0CFC2=(C_S5CA01/S5CANT)                                         
     C                   EVAL      T0DWRF=*DATE                                                     
     C                   TIME                    T0HWRF                                             
      *Actualizo estatus si es inferior a 50 o si era anulado                                       
     C                   if        (T0EDST<='50' or T0EDST='95') and                                
     C                             (ZXEDST<>*BLANKS)                                                
     C                   EVAL      T0EDST=ZXEDST                                                    
     C                   endif                                                                      
     C                   UPDATE    REDTRLP20                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
      *Si no lo encuentro tampoco blancos entonces lo tengo que crear                               
     C                   ELSE                                                                       
      *busco los datos con clave solo línea pedido productiva sin componente                        
     C     KEDTRLP20     CHAIN(N)  EDTRLP20                                                         
     C                   EVAL      T0COM2=ZDCOMP+ZDVAR2+ZDMOD2                                      
     C                   EVAL      T0CFC2=(C_S5CA01/S5CANT)                                         
     C                   EVAL      T0DWRF=*DATE                                                     
     C                   TIME                    T0HWRF                                             
      *Actualizo estatus si es inferior a 50 o si era anulado                                       
     C                   if        (T0EDST<='50' or T0EDST='95') and                                
     C                             (ZXEDST<>*BLANKS)                                                
     C                   EVAL      T0EDST=ZXEDST                                                    
     C                   endif                                                                      
     C                   EVAL      T0TREG=2                                                         
21050C                   WRITE     REDTRLP20                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
     C                   ENDIF                                                                      
      *Si lo encuentro como componente actualizo coeficiente por si acaso                           
     C                   ELSE                                                                       
     C                   EVAL      T0CFC2=(C_S5CA01/S5CANT)                                         
     C                   EVAL      T0DWRF=*DATE                                                     
     C                   TIME                    T0HWRF                                             
      *Actualizo estatus si es inferior a 50 o si era anulado                                       
     C                   if        (T0EDST<='50' or T0EDST='95') and                                
     C                             (ZXEDST<>*BLANKS)                                                
     C                   EVAL      T0EDST=ZXEDST                                                    
     C                   endif                                                                      
     C                   UPDATE    REDTRLP20                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
     C                   ENDIF                                                                      
      *                                                                                             
      * Se quiere grabar registro de auditoría en EDTRAU?                                           
      *                                                                                             
     C                   EXSR      CS_UPD_EDTRAU                                                    
      *                                                                                             
      * Posible E-Mail con datos del pedido de compra                                               
      *                                                                                             
     C                   MOVEL(P)  T0CIA2        @EMCIAA                                            
     C                   MOVEL(P)  T0DLG2        @EMDLGA                                            
     C                   MOVEL(P)  T0CUST        @EMCODE                                            
     C                   MOVEL(P)  T0NPC2        @EMNDOC                                            
     C                   MOVE      T0DAT2        @EMFDOC                                            
     C                   MOVE      T0LIN2        @EMLDOC                                            
      *                                                                                             
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Proceso auditoría 205  Modi línea pedido CODEPE en Productiva      *                        
      **********************************************************************                        
     C     CS_COD205     BEGSR                                                                      
      *                                                                                             
      * Recupero la clave del EDTRLP según el parámetro del lógico                                  
      *                                                                                             
     C                   SELECT                                                                     
     C                   WHEN      @PLOGI=0                                                         
     C                   EVAL      T0CIAS=@PCIAS                                                    
     C                   EVAL      T0DLGA=@PDLGA                                                    
     C                   EVAL      T0NPCO=@PNPCO                                                    
     C                   EVAL      T0TPED=@PTPED                                                    
     C                   EVAL      T0DATP=@PDATP                                                    
     C                   EVAL      T0NOPL=@PNOPL                                                    
     C                   EVAL      T0LINE=@PLINE                                                    
     C                                                                                              
     C                   WHEN      @PLOGI=1                                                         
     C                   EVAL      T0CIA1=@PCIAS                                                    
     C                   EVAL      T0DLG1=@PDLGA                                                    
     C                   EVAL      T0NPC1=@PNPCO                                                    
     C                   EVAL      T0TPE1=@PTPED                                                    
     C                   EVAL      T0DAT1=@PDATP                                                    
     C                   EVAL      T0NOP1=@PNOPL                                                    
     C                   EVAL      T0LIN1=@PLINE                                                    
     C                                                                                              
     C                   WHEN      @PLOGI=2                                                         
     C                   EVAL      T0CIA2=@PCIAS                                                    
     C                   EVAL      T0DLG2=@PDLGA                                                    
     C                   EVAL      T0NPC2=@PNPCO                                                    
     C                   EVAL      T0TPE2=@PTPED                                                    
     C                   EVAL      T0DAT2=@PDATP                                                    
     C                   EVAL      T0NOP2=@PNOPL                                                    
     C                   EVAL      T0LIN2=@PLINE                                                    
     C                                                                                              
     C                   WHEN      @PLOGI=3                                                         
     C                   EVAL      T0CIA3=@PCIAS                                                    
     C                   EVAL      T0DLG3=@PDLGA                                                    
     C                   EVAL      T0NPC3=@PNPCO                                                    
     C                   EVAL      T0TPE3=@PTPED                                                    
     C                   EVAL      T0DAT3=@PDATP                                                    
     C                   EVAL      T0NOP3=@PNOPL                                                    
     C                   EVAL      T0LIN3=@PLINE                                                    
     C                                                                                              
     C                   ENDSL                                                                      
     C                                                                                              
      *                                                                                             
      * Recupero datos del la línea del pedido en la productiva                                     
      *                                                                                             
     C                   EVAL      S5CIAS=@PCIA2                                                    
     C                   EVAL      S5DLGA=@PDLG2                                                    
     C                   EVAL      S5NPCO=@PNPC2                                                    
     C                   EVAL      S5TPED=@PTPE2                                                    
     C                   EVAL      S5DATP=@PDAT2                                                    
     C                   EVAL      S5NOPL=@PNOP2                                                    
     C                   EVAL      S5LINE=@PLIN2                                                    
     C     KCODEPE       CHAIN(N)  CODEPE                                                           
     C                                                                                              
      * Leo archivo de trazabilidad y actualizo los campos correspondientes                         
     C                                                                                              
     C                   EVAL      *IN82=*OFF                                                       
     C                                                                                              
     C                   SELECT                                                                     
     C                   WHEN      @PLOGI=0                                                         
     C     KEDTRLP00     SETLL     EDTRLP00                                                         
     C                   WHEN      @PLOGI=1                                                         
     C     KEDTRLP10     SETLL     EDTRLP10                                                         
     C                   WHEN      @PLOGI=2                                                         
     C     KEDTRLP20     SETLL     EDTRLP20                                                         
     C                   WHEN      @PLOGI=3                                                         
     C     KEDTRLP30     SETLL     EDTRLP30                                                         
     C                   ENDSL                                                                      
     C                                                                                              
     C                   DOW       *IN82=*OFF                                                       
     C                                                                                              
     C                   SELECT                                                                     
     C                   WHEN      @PLOGI=0                                                         
     C     KEDTRLP00     READE     EDTRLP00                               82                        
     C                   WHEN      @PLOGI=1                                                         
     C     KEDTRLP10     READE     EDTRLP10                               82                        
     C                   WHEN      @PLOGI=2                                                         
     C     KEDTRLP20     READE     EDTRLP20                               82                        
     C                   WHEN      @PLOGI=3                                                         
     C     KEDTRLP30     READE     EDTRLP30                               82                        
     C                   ENDSL                                                                      
     C                                                                                              
     C                   IF        *IN82=*OFF                                                       
     C                                                                                              
      * Este evento es una modificación de línea en empresa productiva.                             
      * por tanto actualizo los campos:                                                             
     C                   EVAL      T0CIA2=@PCIA2                                                    
     C                   EVAL      T0DLG2=@PDLG2                                                    
     C                   EVAL      T0NPC2=@PNPC2                                                    
     C                   EVAL      T0TPE2=@PTPE2                                                    
     C                   EVAL      T0DAT2=@PDAT2                                                    
     C                   EVAL      T0NOP2=@PNOP2                                                    
     C                   EVAL      T0LIN2=@PLIN2                                                    
     C                   EVAL      T0ARV2=S5ARTI+S5VARI+S5MODE                                      
     C                   EVAL      T0CAN2=@PCANT                                                    
FQ710C                   EVAL      T0UNI2=S5UNIM                                                    
     C                   EVAL      T0DWRF=*DATE                                                     
     C                   TIME                    T0HWRF                                             
     C                                                                                              
     C                   SELECT                                                                     
     C                   WHEN      @PLOGI=0                                                         
     C                   UPDATE    REDTRLP00                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
     C                   WHEN      @PLOGI=1                                                         
     C                   UPDATE    REDTRLP10                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
     C                   WHEN      @PLOGI=2                                                         
     C                   UPDATE    REDTRLP20                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
     C                   WHEN      @PLOGI=3                                                         
     C                   UPDATE    REDTRLP30                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
     C                   ENDSL                                                                      
     C                                                                                              
     C                   ENDIF                                                                      
     C                                                                                              
     C                   ENDDO                                                                      
     C                                                                                              
      *                                                                                             
      * Se quiere grabar registro de auditoría en EDTRAU?                                           
      *                                                                                             
     C                   EXSR      CS_UPD_EDTRAU                                                    
      *                                                                                             
      * Posible E-Mail con datos del pedido de compra                                               
      *                                                                                             
     C                   MOVEL(P)  T0CIA2        @EMCIAA                                            
     C                   MOVEL(P)  T0DLG2        @EMDLGA                                            
     C                   MOVEL(P)  T0CUST        @EMCODE                                            
     C                   MOVEL(P)  T0NPC2        @EMNDOC                                            
     C                   MOVE      T0DAT2        @EMFDOC                                            
     C                   MOVE      T0LIN2        @EMLDOC                                            
      *                                                                                             
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Proceso auditoría 206  Modi línea pedido CODEP2 en Productiva      *                        
      **********************************************************************                        
     C     CS_COD206     BEGSR                                                                      
      *                                                                                             
      * Recupero componente y línea del CODEP2 en DS desde PTEXT                                    
      *                                                                                             
     C                   EVAL      DSCODEP2=@PTEXT                                                  
      *                                                                                             
      * Recupero datos del la línea del pedido en la productiva                                     
      *                                                                                             
     C                   EVAL      S5CIAS=@PCIAS                                                    
     C                   EVAL      S5DLGA=@PDLGA                                                    
     C                   EVAL      S5NPCO=@PNPCO                                                    
     C                   EVAL      S5TPED=@PTPED                                                    
     C                   EVAL      S5DATP=@PDATP                                                    
     C                   EVAL      S5NOPL=@PNOPL                                                    
     C                   EVAL      S5LINE=@PLINE                                                    
     C     KCODEPE       CHAIN(N)  CODEPE                                                           
     C                                                                                              
      *                                                                                             
      * Recupero datos del la línea del componente en la productiva                                 
      *                                                                                             
     C                   EVAL      C_S5CIAS=@PCIAS                                                  
     C                   EVAL      C_S5DLGA=@PDLGA                                                  
     C                   EVAL      C_S5NPCO=@PNPCO                                                  
     C                   EVAL      C_S5TPED=@PTPED                                                  
     C                   EVAL      C_S5DATP=@PDATP                                                  
     C                   EVAL      C_S5NOPL=@PNOPL                                                  
     C                   EVAL      C_S5LINE=@PLINE                                                  
     C                   MOVE      ZDLIN3        C_S5LIN3                                           
     C     KCODEP2       CHAIN(N)  CODEP2                                                           
     C                                                                                              
      *                                                                                             
      * Recupero datos de la cabecera del pedido en la productiva                                   
      *                                                                                             
     C                   EVAL      S0CIAS=S5CIAS                                                    
     C                   EVAL      S0DLGA=S5DLGA                                                    
     C                   EVAL      S0NPCO=S5NPCO                                                    
     C                   EVAL      S0TPED=S5TPED                                                    
     C                   EVAL      S0DATP=S5DATP                                                    
     C                   EVAL      S0NOPL=S5NOPL                                                    
     C     KCOCAPE       CHAIN(N)  COCAPE                                                           
     C                                                                                              
      *                                                                                             
      * Calculo el estatus de la línea en la productiva                                             
      *                                                                                             
     C                   EVAL      ZXEDST=*BLANKS                                                   
     C                   IF        S0STCO>='20'                                                     
     C                   IF        S5CANR<>0                                                        
     C                   EVAL      ZXEDST='50'                                                      
     C                   ELSE                                                                       
     C                   EVAL      ZXEDST='40'                                                      
     C                   ENDIF                                                                      
     C                   ELSE                                                                       
     C                   EVAL      ZXEDST='30'                                                      
     C                   ENDIF                                                                      
      *                                                                                             
      * Recupero la clave del EDTRLP20 (productiva)                                                 
      *                                                                                             
     C                   EVAL      T0CIA2=@PCIAS                                                    
     C                   EVAL      T0DLG2=@PDLGA                                                    
     C                   EVAL      T0NPC2=@PNPCO                                                    
     C                   EVAL      T0TPE2=@PTPED                                                    
     C                   EVAL      T0DAT2=@PDATP                                                    
     C                   EVAL      T0NOP2=@PNOPL                                                    
     C                   EVAL      T0LIN2=@PLINE                                                    
     C                   EVAL      T0COM2=ZDCOMP+ZDVAR2+ZDMOD2                                      
      *                                                                                             
      * BUSCO el registro en archivo EDTRLP con el código de componente                             
      *                                                                                             
     C     KEDTRLP20X    CHAIN     EDTRLP20                                                         
      *Si no encuento el registro con código de componente significa que                            
      *tengo que buscarlo con componente *blanks                                                    
     C                   IF        NOT %FOUND(EDTRLP20)                                             
     C                   EVAL      T0COM2=*BLANKS                                                   
     C     KEDTRLP20X    CHAIN     EDTRLP20                                                         
      *Si lo encuentro con COMP=*blanks cambio el COMP y el coeficiente                             
     C                   IF        %FOUND(EDTRLP20)                                                 
     C                   EVAL      T0COM2=ZDCOMP+ZDVAR2+ZDMOD2                                      
     C                   EVAL      T0CFC2=(C_S5CA01/S5CANT)                                         
     C                   EVAL      T0DWRF=*DATE                                                     
     C                   TIME                    T0HWRF                                             
      *Actualizo estatus si es inferior a 50 o si era anulado                                       
     C                   if        (T0EDST<='50' or T0EDST='95') and                                
     C                             (ZXEDST<>*BLANKS)                                                
     C                   EVAL      T0EDST=ZXEDST                                                    
     C                   endif                                                                      
     C                   UPDATE    REDTRLP20                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
      *Si no lo encuentro tampoco blancos entonces lo tengo que crear                               
     C                   ELSE                                                                       
      *busco los datos con clave solo línea pedido productiva sin componente                        
     C     KEDTRLP20     CHAIN(N)  EDTRLP20                                                         
     C                   EVAL      T0COM2=ZDCOMP+ZDVAR2+ZDMOD2                                      
     C                   EVAL      T0CFC2=(C_S5CA01/S5CANT)                                         
     C                   EVAL      T0DWRF=*DATE                                                     
     C                   TIME                    T0HWRF                                             
      *Actualizo estatus si es inferior a 50 o si era anulado                                       
     C                   if        (T0EDST<='50' or T0EDST='95') and                                
     C                             (ZXEDST<>*BLANKS)                                                
     C                   EVAL      T0EDST=ZXEDST                                                    
     C                   endif                                                                      
     C                   EVAL      T0TREG=2                                                         
21050C                   WRITE     REDTRLP20                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
     C                   ENDIF                                                                      
      *Si lo encuentro como componente actualizo coeficiente por si acaso                           
     C                   ELSE                                                                       
     C                   EVAL      T0CFC2=(C_S5CA01/S5CANT)                                         
     C                   EVAL      T0DWRF=*DATE                                                     
     C                   TIME                    T0HWRF                                             
      *Actualizo estatus si es inferior a 50 o si era anulado                                       
     C                   if        (T0EDST<='50' or T0EDST='95') and                                
     C                             (ZXEDST<>*BLANKS)                                                
     C                   EVAL      T0EDST=ZXEDST                                                    
     C                   endif                                                                      
     C                   UPDATE    REDTRLP20                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
     C                   ENDIF                                                                      
      *                                                                                             
      * Se quiere grabar registro de auditoría en EDTRAU?                                           
      *                                                                                             
     C                   EXSR      CS_UPD_EDTRAU                                                    
      *                                                                                             
      * Posible E-Mail con datos del pedido de compra                                               
      *                                                                                             
     C                   MOVEL(P)  T0CIA2        @EMCIAA                                            
     C                   MOVEL(P)  T0DLG2        @EMDLGA                                            
     C                   MOVEL(P)  T0CUST        @EMCODE                                            
     C                   MOVEL(P)  T0NPC2        @EMNDOC                                            
     C                   MOVE      T0DAT2        @EMFDOC                                            
     C                   MOVE      T0LIN2        @EMLDOC                                            
      *                                                                                             
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Proceso auditoría 210  Baja línea pedido CODEPE en Productiva      *                        
      **********************************************************************                        
     C     CS_COD210     BEGSR                                                                      
      *                                                                                             
      * Recupero la clave del EDTRLP según el parámetro del lógico                                  
      *                                                                                             
     C                   SELECT                                                                     
     C                   WHEN      @PLOGI=0                                                         
     C                   EVAL      T0CIAS=@PCIAS                                                    
     C                   EVAL      T0DLGA=@PDLGA                                                    
     C                   EVAL      T0NPCO=@PNPCO                                                    
     C                   EVAL      T0TPED=@PTPED                                                    
     C                   EVAL      T0DATP=@PDATP                                                    
     C                   EVAL      T0NOPL=@PNOPL                                                    
     C                   EVAL      T0LINE=@PLINE                                                    
     C                                                                                              
     C                   WHEN      @PLOGI=1                                                         
     C                   EVAL      T0CIA1=@PCIAS                                                    
     C                   EVAL      T0DLG1=@PDLGA                                                    
     C                   EVAL      T0NPC1=@PNPCO                                                    
     C                   EVAL      T0TPE1=@PTPED                                                    
     C                   EVAL      T0DAT1=@PDATP                                                    
     C                   EVAL      T0NOP1=@PNOPL                                                    
     C                   EVAL      T0LIN1=@PLINE                                                    
     C                                                                                              
     C                   WHEN      @PLOGI=2                                                         
     C                   EVAL      T0CIA2=@PCIAS                                                    
     C                   EVAL      T0DLG2=@PDLGA                                                    
     C                   EVAL      T0NPC2=@PNPCO                                                    
     C                   EVAL      T0TPE2=@PTPED                                                    
     C                   EVAL      T0DAT2=@PDATP                                                    
     C                   EVAL      T0NOP2=@PNOPL                                                    
     C                   EVAL      T0LIN2=@PLINE                                                    
     C                                                                                              
     C                   WHEN      @PLOGI=3                                                         
     C                   EVAL      T0CIA3=@PCIAS                                                    
     C                   EVAL      T0DLG3=@PDLGA                                                    
     C                   EVAL      T0NPC3=@PNPCO                                                    
     C                   EVAL      T0TPE3=@PTPED                                                    
     C                   EVAL      T0DAT3=@PDATP                                                    
     C                   EVAL      T0NOP3=@PNOPL                                                    
     C                   EVAL      T0LIN3=@PLINE                                                    
     C                                                                                              
     C                   ENDSL                                                                      
     C                                                                                              
     C                                                                                              
      * Leo archivo de trazabilidad y actualizo los campos correspondientes                         
     C                                                                                              
     C                   EVAL      *IN82=*OFF                                                       
     C                                                                                              
     C                   SELECT                                                                     
     C                   WHEN      @PLOGI=0                                                         
     C     KEDTRLP00     SETLL     EDTRLP00                                                         
     C                   WHEN      @PLOGI=1                                                         
     C     KEDTRLP10     SETLL     EDTRLP10                                                         
     C                   WHEN      @PLOGI=2                                                         
     C     KEDTRLP20     SETLL     EDTRLP20                                                         
     C                   WHEN      @PLOGI=3                                                         
     C     KEDTRLP30     SETLL     EDTRLP30                                                         
     C                   ENDSL                                                                      
     C                                                                                              
     C                   DOW       *IN82=*OFF                                                       
     C                                                                                              
     C                   SELECT                                                                     
     C                   WHEN      @PLOGI=0                                                         
     C     KEDTRLP00     READE     EDTRLP00                               82                        
     C                   WHEN      @PLOGI=1                                                         
     C     KEDTRLP10     READE     EDTRLP10                               82                        
     C                   WHEN      @PLOGI=2                                                         
     C     KEDTRLP20     READE     EDTRLP20                               82                        
     C                   WHEN      @PLOGI=3                                                         
     C     KEDTRLP30     READE     EDTRLP30                               82                        
     C                   ENDSL                                                                      
     C                                                                                              
     C                   IF        *IN82=*OFF                                                       
     C                                                                                              
      * Este evento es una baja de línea en empresa productiva.                                     
      * por tanto actualizo los campos:                                                             
     C                   EVAL      T0CIA2=@PCIA2                                                    
     C                   EVAL      T0DLG2=@PDLG2                                                    
     C                   EVAL      T0NPC2=@PNPC2                                                    
     C                   EVAL      T0TPE2=@PTPE2                                                    
     C                   EVAL      T0DAT2=@PDAT2                                                    
     C                   EVAL      T0NOP2=@PNOP2                                                    
     C                   EVAL      T0LIN2=@PLIN2                                                    
     C                   EVAL      T0DWRF=*DATE                                                     
     C                   TIME                    T0HWRF                                             
     C                   EVAL      T0EDST='95'                                                      
     C                                                                                              
     C                   SELECT                                                                     
     C                   WHEN      @PLOGI=0                                                         
     C                   UPDATE    REDTRLP00                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
     C                   WHEN      @PLOGI=1                                                         
     C                   UPDATE    REDTRLP10                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
     C                   WHEN      @PLOGI=2                                                         
     C                   UPDATE    REDTRLP20                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
     C                   WHEN      @PLOGI=3                                                         
     C                   UPDATE    REDTRLP30                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
     C                   ENDSL                                                                      
     C                                                                                              
     C                   ENDIF                                                                      
     C                                                                                              
     C                   ENDDO                                                                      
     C                                                                                              
      *                                                                                             
      * Se quiere grabar registro de auditoría en EDTRAU?                                           
      *                                                                                             
     C                   EXSR      CS_UPD_EDTRAU                                                    
      *                                                                                             
      * Posible E-Mail con datos del pedido de compra                                               
      *                                                                                             
     C                   MOVEL(P)  T0CIA2        @EMCIAA                                            
     C                   MOVEL(P)  T0DLG2        @EMDLGA                                            
     C                   MOVEL(P)  T0CUST        @EMCODE                                            
     C                   MOVEL(P)  T0NPC2        @EMNDOC                                            
     C                   MOVE      T0DAT2        @EMFDOC                                            
     C                   MOVE      T0LIN2        @EMLDOC                                            
      *                                                                                             
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Proceso auditoría 211  Baja línea pedido CODEP2 en Productiva      *                        
      **********************************************************************                        
     C     CS_COD211     BEGSR                                                                      
      *                                                                                             
      * Recupero componente y línea del CODEP2 en DS desde PTEXT                                    
      *                                                                                             
     C                   EVAL      DSCODEP2=@PTEXT                                                  
      *                                                                                             
      * Recupero datos del la línea del pedido en la productiva                                     
      *                                                                                             
     C                   EVAL      S5CIAS=@PCIAS                                                    
     C                   EVAL      S5DLGA=@PDLGA                                                    
     C                   EVAL      S5NPCO=@PNPCO                                                    
     C                   EVAL      S5TPED=@PTPED                                                    
     C                   EVAL      S5DATP=@PDATP                                                    
     C                   EVAL      S5NOPL=@PNOPL                                                    
     C                   EVAL      S5LINE=@PLINE                                                    
     C     KCODEPE       CHAIN(N)  CODEPE                                                           
     C                                                                                              
      *                                                                                             
      * Recupero datos del la línea del componente en la productiva                                 
      *                                                                                             
     C                   EVAL      C_S5CIAS=@PCIAS                                                  
     C                   EVAL      C_S5DLGA=@PDLGA                                                  
     C                   EVAL      C_S5NPCO=@PNPCO                                                  
     C                   EVAL      C_S5TPED=@PTPED                                                  
     C                   EVAL      C_S5DATP=@PDATP                                                  
     C                   EVAL      C_S5NOPL=@PNOPL                                                  
     C                   EVAL      C_S5LINE=@PLINE                                                  
     C                   MOVE      ZDLIN3        C_S5LIN3                                           
     C     KCODEP2       CHAIN(N)  CODEP2                                                           
     C                                                                                              
      *                                                                                             
      * Recupero la clave del EDTRLP20 (productiva)                                                 
      *                                                                                             
     C                   EVAL      T0CIA2=@PCIAS                                                    
     C                   EVAL      T0DLG2=@PDLGA                                                    
     C                   EVAL      T0NPC2=@PNPCO                                                    
     C                   EVAL      T0TPE2=@PTPED                                                    
     C                   EVAL      T0DAT2=@PDATP                                                    
     C                   EVAL      T0NOP2=@PNOPL                                                    
     C                   EVAL      T0LIN2=@PLINE                                                    
     C                   EVAL      T0COM2=ZDCOMP+ZDVAR2+ZDMOD2                                      
      *                                                                                             
      * BUSCO el registro en archivo EDTRLP con el código de componente                             
      *                                                                                             
     C     KEDTRLP20X    CHAIN     EDTRLP20                                                         
      *Si no encuento el registro con código de componente significa que                            
      *tengo que buscarlo con componente *blanks                                                    
     C                   IF        NOT %FOUND(EDTRLP20)                                             
     C                   EVAL      T0COM2=*BLANKS                                                   
     C     KEDTRLP20X    CHAIN     EDTRLP20                                                         
      *Si lo encuentro con COMP=*blanks cambio el COMP y el coeficiente                             
     C                   IF        %FOUND(EDTRLP20)                                                 
     C                   EVAL      T0COM2=ZDCOMP+ZDVAR2+ZDMOD2                                      
     C                   EVAL      T0CFC2=(C_S5CA01/S5CANT)                                         
     C                   EVAL      T0DWRF=*DATE                                                     
     C                   TIME                    T0HWRF                                             
     C                   EVAL      T0EDST='95'                                                      
     C                   UPDATE    REDTRLP20                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
      *Si no lo encuentro tampoco blancos entonces lo tengo que crear                               
     C                   ELSE                                                                       
      *busco los datos con clave solo línea pedido productiva sin componente                        
     C     KEDTRLP20     CHAIN(N)  EDTRLP20                                                         
     C                   EVAL      T0COM2=ZDCOMP+ZDVAR2+ZDMOD2                                      
     C                   EVAL      T0CFC2=(C_S5CA01/S5CANT)                                         
     C                   EVAL      T0DWRF=*DATE                                                     
     C                   TIME                    T0HWRF                                             
     C                   EVAL      T0EDST='95'                                                      
     C                   EVAL      T0TREG=2                                                         
21050C                   WRITE     REDTRLP20                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
     C                   ENDIF                                                                      
      *Si lo encuentro como componente actualizo coeficiente por si acaso                           
     C                   ELSE                                                                       
     C                   EVAL      T0CFC2=(C_S5CA01/S5CANT)                                         
     C                   EVAL      T0DWRF=*DATE                                                     
     C                   TIME                    T0HWRF                                             
     C                   EVAL      T0EDST='95'                                                      
     C                   UPDATE    REDTRLP20                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
     C                   ENDIF                                                                      
      *                                                                                             
      * Se quiere grabar registro de auditoría en EDTRAU?                                           
      *                                                                                             
     C                   EXSR      CS_UPD_EDTRAU                                                    
      *                                                                                             
      * Posible E-Mail con datos del pedido de compra                                               
      *                                                                                             
     C                   MOVEL(P)  T0CIA2        @EMCIAA                                            
     C                   MOVEL(P)  T0DLG2        @EMDLGA                                            
     C                   MOVEL(P)  T0CUST        @EMCODE                                            
     C                   MOVEL(P)  T0NPC2        @EMNDOC                                            
     C                   MOVE      T0DAT2        @EMFDOC                                            
     C                   MOVE      T0LIN2        @EMLDOC                                            
      *                                                                                             
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Proceso auditoría 215 Confirmación línea pedido CODEPE en Productiva                        
      **********************************************************************                        
     C     CS_COD215     BEGSR                                                                      
      *                                                                                             
      * Recupero la clave del EDTRLP según el parámetro del lógico                                  
      *                                                                                             
     C                   SELECT                                                                     
     C                   WHEN      @PLOGI=0                                                         
     C                   EVAL      T0CIAS=@PCIAS                                                    
     C                   EVAL      T0DLGA=@PDLGA                                                    
     C                   EVAL      T0NPCO=@PNPCO                                                    
     C                   EVAL      T0TPED=@PTPED                                                    
     C                   EVAL      T0DATP=@PDATP                                                    
     C                   EVAL      T0NOPL=@PNOPL                                                    
     C                   EVAL      T0LINE=@PLINE                                                    
     C                                                                                              
     C                   WHEN      @PLOGI=1                                                         
     C                   EVAL      T0CIA1=@PCIAS                                                    
     C                   EVAL      T0DLG1=@PDLGA                                                    
     C                   EVAL      T0NPC1=@PNPCO                                                    
     C                   EVAL      T0TPE1=@PTPED                                                    
     C                   EVAL      T0DAT1=@PDATP                                                    
     C                   EVAL      T0NOP1=@PNOPL                                                    
     C                   EVAL      T0LIN1=@PLINE                                                    
     C                                                                                              
     C                   WHEN      @PLOGI=2                                                         
     C                   EVAL      T0CIA2=@PCIAS                                                    
     C                   EVAL      T0DLG2=@PDLGA                                                    
     C                   EVAL      T0NPC2=@PNPCO                                                    
     C                   EVAL      T0TPE2=@PTPED                                                    
     C                   EVAL      T0DAT2=@PDATP                                                    
     C                   EVAL      T0NOP2=@PNOPL                                                    
     C                   EVAL      T0LIN2=@PLINE                                                    
     C                                                                                              
     C                   WHEN      @PLOGI=3                                                         
     C                   EVAL      T0CIA3=@PCIAS                                                    
     C                   EVAL      T0DLG3=@PDLGA                                                    
     C                   EVAL      T0NPC3=@PNPCO                                                    
     C                   EVAL      T0TPE3=@PTPED                                                    
     C                   EVAL      T0DAT3=@PDATP                                                    
     C                   EVAL      T0NOP3=@PNOPL                                                    
     C                   EVAL      T0LIN3=@PLINE                                                    
     C                                                                                              
     C                   ENDSL                                                                      
     C                                                                                              
      *                                                                                             
      * Recupero datos del la línea del pedido en la productiva                                     
      *                                                                                             
     C                   EVAL      S5CIAS=@PCIA2                                                    
     C                   EVAL      S5DLGA=@PDLG2                                                    
     C                   EVAL      S5NPCO=@PNPC2                                                    
     C                   EVAL      S5TPED=@PTPE2                                                    
     C                   EVAL      S5DATP=@PDAT2                                                    
     C                   EVAL      S5NOPL=@PNOP2                                                    
     C                   EVAL      S5LINE=@PLIN2                                                    
     C     KCODEPE       CHAIN(N)  CODEPE                                                           
     C                                                                                              
      * Leo archivo de trazabilidad y actualizo los campos correspondientes                         
     C                                                                                              
     C                   EVAL      *IN82=*OFF                                                       
     C                                                                                              
     C                   SELECT                                                                     
     C                   WHEN      @PLOGI=0                                                         
     C     KEDTRLP00     SETLL     EDTRLP00                                                         
     C                   WHEN      @PLOGI=1                                                         
     C     KEDTRLP10     SETLL     EDTRLP10                                                         
     C                   WHEN      @PLOGI=2                                                         
     C     KEDTRLP20     SETLL     EDTRLP20                                                         
     C                   WHEN      @PLOGI=3                                                         
     C     KEDTRLP30     SETLL     EDTRLP30                                                         
     C                   ENDSL                                                                      
     C                                                                                              
     C                   DOW       *IN82=*OFF                                                       
     C                                                                                              
     C                   SELECT                                                                     
     C                   WHEN      @PLOGI=0                                                         
     C     KEDTRLP00     READE     EDTRLP00                               82                        
     C                   WHEN      @PLOGI=1                                                         
     C     KEDTRLP10     READE     EDTRLP10                               82                        
     C                   WHEN      @PLOGI=2                                                         
     C     KEDTRLP20     READE     EDTRLP20                               82                        
     C                   WHEN      @PLOGI=3                                                         
     C     KEDTRLP30     READE     EDTRLP30                               82                        
     C                   ENDSL                                                                      
     C                                                                                              
     C                   IF        *IN82=*OFF                                                       
FDX01 *                                                                                             
FDX01 * Ahora se permiten conjuntos combinados, tenemos que despreciar los                          
FDX01 * componentes de material propio de la comercial y actualizar sólo                            
FDX01 * los que corresponden                                                                        
FDX01 *                                                                                             
FDX01C                   IF        T0PRVR<>*BLANKS                                                  
     C                                                                                              
      * Este evento es una confirmación de línea en empresa productiva.                             
      * por tanto actualizo los campos:                                                             
     C                   EVAL      T0CIA2=@PCIA2                                                    
     C                   EVAL      T0DLG2=@PDLG2                                                    
     C                   EVAL      T0NPC2=@PNPC2                                                    
     C                   EVAL      T0TPE2=@PTPE2                                                    
     C                   EVAL      T0DAT2=@PDAT2                                                    
     C                   EVAL      T0NOP2=@PNOP2                                                    
     C                   EVAL      T0LIN2=@PLIN2                                                    
     C                   EVAL      T0ARV2=S5ARTI+S5VARI+S5MODE                                      
     C                   EVAL      T0CAN2=@PCANT                                                    
FQ710C                   EVAL      T0UNI2=S5UNIM                                                    
     C                   EVAL      T0DWRF=*DATE                                                     
     C                   TIME                    T0HWRF                                             
     C                   EVAL      T0EDST='40'                                                      
     C                                                                                              
     C                   SELECT                                                                     
     C                   WHEN      @PLOGI=0                                                         
     C                   UPDATE    REDTRLP00                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
     C                   WHEN      @PLOGI=1                                                         
     C                   UPDATE    REDTRLP10                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
     C                   WHEN      @PLOGI=2                                                         
     C                   UPDATE    REDTRLP20                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
     C                   WHEN      @PLOGI=3                                                         
     C                   UPDATE    REDTRLP30                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
     C                   ENDSL                                                                      
     C                                                                                              
     C                   ENDIF                                                                      
     C                                                                                              
FDX01 *                                                                                             
FDX01C                   ENDIF                                                                      
     C                   ENDDO                                                                      
     C                                                                                              
      *                                                                                             
      * Se quiere grabar registro de auditoría en EDTRAU?                                           
      *                                                                                             
     C                   EXSR      CS_UPD_EDTRAU                                                    
      *                                                                                             
      * Posible E-Mail con datos del pedido de compra                                               
      *                                                                                             
     C                   MOVEL(P)  T0CIA2        @EMCIAA                                            
     C                   MOVEL(P)  T0DLG2        @EMDLGA                                            
     C                   MOVEL(P)  T0CUST        @EMCODE                                            
     C                   MOVEL(P)  T0NPC2        @EMNDOC                                            
     C                   MOVE      T0DAT2        @EMFDOC                                            
     C                   MOVE      T0LIN2        @EMLDOC                                            
      *                                                                                             
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Proceso auditoría 220 Reserva línea pedido CODEPE en Productiva                             
      **********************************************************************                        
     C     CS_COD220     BEGSR                                                                      
      *                                                                                             
      * Recupero la clave del EDTRLP según el parámetro del lógico                                  
      *                                                                                             
     C                   SELECT                                                                     
     C                   WHEN      @PLOGI=0                                                         
     C                   EVAL      T0CIAS=@PCIAS                                                    
     C                   EVAL      T0DLGA=@PDLGA                                                    
     C                   EVAL      T0NPCO=@PNPCO                                                    
     C                   EVAL      T0TPED=@PTPED                                                    
     C                   EVAL      T0DATP=@PDATP                                                    
     C                   EVAL      T0NOPL=@PNOPL                                                    
     C                   EVAL      T0LINE=@PLINE                                                    
     C                                                                                              
     C                   WHEN      @PLOGI=1                                                         
     C                   EVAL      T0CIA1=@PCIAS                                                    
     C                   EVAL      T0DLG1=@PDLGA                                                    
     C                   EVAL      T0NPC1=@PNPCO                                                    
     C                   EVAL      T0TPE1=@PTPED                                                    
     C                   EVAL      T0DAT1=@PDATP                                                    
     C                   EVAL      T0NOP1=@PNOPL                                                    
     C                   EVAL      T0LIN1=@PLINE                                                    
     C                                                                                              
     C                   WHEN      @PLOGI=2                                                         
     C                   EVAL      T0CIA2=@PCIAS                                                    
     C                   EVAL      T0DLG2=@PDLGA                                                    
     C                   EVAL      T0NPC2=@PNPCO                                                    
     C                   EVAL      T0TPE2=@PTPED                                                    
     C                   EVAL      T0DAT2=@PDATP                                                    
     C                   EVAL      T0NOP2=@PNOPL                                                    
     C                   EVAL      T0LIN2=@PLINE                                                    
     C                                                                                              
     C                   WHEN      @PLOGI=3                                                         
     C                   EVAL      T0CIA3=@PCIAS                                                    
     C                   EVAL      T0DLG3=@PDLGA                                                    
     C                   EVAL      T0NPC3=@PNPCO                                                    
     C                   EVAL      T0TPE3=@PTPED                                                    
     C                   EVAL      T0DAT3=@PDATP                                                    
     C                   EVAL      T0NOP3=@PNOPL                                                    
     C                   EVAL      T0LIN3=@PLINE                                                    
     C                                                                                              
     C                   ENDSL                                                                      
     C                                                                                              
      *                                                                                             
      * Recupero datos del la línea del pedido en la productiva                                     
      *                                                                                             
     C                   EVAL      S5CIAS=@PCIA2                                                    
     C                   EVAL      S5DLGA=@PDLG2                                                    
     C                   EVAL      S5NPCO=@PNPC2                                                    
     C                   EVAL      S5TPED=@PTPE2                                                    
     C                   EVAL      S5DATP=@PDAT2                                                    
     C                   EVAL      S5NOPL=@PNOP2                                                    
     C                   EVAL      S5LINE=@PLIN2                                                    
     C     KCODEPE       CHAIN(N)  CODEPE                                                           
     C                                                                                              
      * Leo archivo de trazabilidad y actualizo los campos correspondientes                         
     C                                                                                              
     C                   EVAL      *IN82=*OFF                                                       
     C                                                                                              
     C                   SELECT                                                                     
     C                   WHEN      @PLOGI=0                                                         
     C     KEDTRLP00     SETLL     EDTRLP00                                                         
     C                   WHEN      @PLOGI=1                                                         
     C     KEDTRLP10     SETLL     EDTRLP10                                                         
     C                   WHEN      @PLOGI=2                                                         
     C     KEDTRLP20     SETLL     EDTRLP20                                                         
     C                   WHEN      @PLOGI=3                                                         
     C     KEDTRLP30     SETLL     EDTRLP30                                                         
     C                   ENDSL                                                                      
     C                                                                                              
     C                   DOW       *IN82=*OFF                                                       
     C                                                                                              
     C                   SELECT                                                                     
     C                   WHEN      @PLOGI=0                                                         
     C     KEDTRLP00     READE     EDTRLP00                               82                        
     C                   WHEN      @PLOGI=1                                                         
     C     KEDTRLP10     READE     EDTRLP10                               82                        
     C                   WHEN      @PLOGI=2                                                         
     C     KEDTRLP20     READE     EDTRLP20                               82                        
     C                   WHEN      @PLOGI=3                                                         
     C     KEDTRLP30     READE     EDTRLP30                               82                        
     C                   ENDSL                                                                      
     C                                                                                              
     C                   IF        *IN82=*OFF                                                       
FDX01 *                                                                                             
FDX01 * Ahora se permiten conjuntos combinados, tenemos que despreciar los                          
FDX01 * componentes de material propio de la comercial y actualizar sólo                            
FDX01 * los que corresponden                                                                        
FDX01 *                                                                                             
FDX01C                   IF        T0PRVR<>*BLANKS                                                  
     C                                                                                              
      * Este evento es una reserva de línea en empresa productiva.                                  
      * por tanto actualizo los campos:                                                             
     C                   EVAL      T0DWRF=*DATE                                                     
     C                   TIME                    T0HWRF                                             
     C                   if        (T0EDST<='50' or T0EDST='95')                                    
     C                   EVAL      T0EDST='50'                                                      
     C                   endif                                                                      
24080C                   EVAL      T0FURE=*DATE                                                     
     C                                                                                              
     C                   SELECT                                                                     
     C                   WHEN      @PLOGI=0                                                         
     C                   UPDATE    REDTRLP00                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
     C                   WHEN      @PLOGI=1                                                         
     C                   UPDATE    REDTRLP10                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
     C                   WHEN      @PLOGI=2                                                         
     C                   UPDATE    REDTRLP20                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
     C                   WHEN      @PLOGI=3                                                         
     C                   UPDATE    REDTRLP30                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
     C                   ENDSL                                                                      
FDX01 *                                                                                             
FDX01C                   ENDIF                                                                      
FDX01 *                                                                                             
     C                   ENDIF                                                                      
     C                                                                                              
     C                   ENDDO                                                                      
     C                                                                                              
      *                                                                                             
      * Se quiere grabar registro de auditoría en EDTRAU?                                           
      *                                                                                             
     C                   EXSR      CS_UPD_EDTRAU                                                    
      *                                                                                             
      * Posible E-Mail con datos del pedido de compra                                               
      *                                                                                             
     C                   MOVEL(P)  T0CIA2        @EMCIAA                                            
     C                   MOVEL(P)  T0DLG2        @EMDLGA                                            
     C                   MOVEL(P)  T0CUST        @EMCODE                                            
     C                   MOVEL(P)  T0NPC2        @EMNDOC                                            
     C                   MOVE      T0DAT2        @EMFDOC                                            
     C                   MOVE      T0LIN2        @EMLDOC                                            
      *                                                                                             
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Proceso auditoría 221 Des-Reserva línea pedido CODEPE en Productiva                         
      **********************************************************************                        
     C     CS_COD221     BEGSR                                                                      
      *                                                                                             
      * Recupero la clave del EDTRLP según el parámetro del lógico                                  
      *                                                                                             
     C                   SELECT                                                                     
     C                   WHEN      @PLOGI=0                                                         
     C                   EVAL      T0CIAS=@PCIAS                                                    
     C                   EVAL      T0DLGA=@PDLGA                                                    
     C                   EVAL      T0NPCO=@PNPCO                                                    
     C                   EVAL      T0TPED=@PTPED                                                    
     C                   EVAL      T0DATP=@PDATP                                                    
     C                   EVAL      T0NOPL=@PNOPL                                                    
     C                   EVAL      T0LINE=@PLINE                                                    
     C                                                                                              
     C                   WHEN      @PLOGI=1                                                         
     C                   EVAL      T0CIA1=@PCIAS                                                    
     C                   EVAL      T0DLG1=@PDLGA                                                    
     C                   EVAL      T0NPC1=@PNPCO                                                    
     C                   EVAL      T0TPE1=@PTPED                                                    
     C                   EVAL      T0DAT1=@PDATP                                                    
     C                   EVAL      T0NOP1=@PNOPL                                                    
     C                   EVAL      T0LIN1=@PLINE                                                    
     C                                                                                              
     C                   WHEN      @PLOGI=2                                                         
     C                   EVAL      T0CIA2=@PCIAS                                                    
     C                   EVAL      T0DLG2=@PDLGA                                                    
     C                   EVAL      T0NPC2=@PNPCO                                                    
     C                   EVAL      T0TPE2=@PTPED                                                    
     C                   EVAL      T0DAT2=@PDATP                                                    
     C                   EVAL      T0NOP2=@PNOPL                                                    
     C                   EVAL      T0LIN2=@PLINE                                                    
     C                                                                                              
     C                   WHEN      @PLOGI=3                                                         
     C                   EVAL      T0CIA3=@PCIAS                                                    
     C                   EVAL      T0DLG3=@PDLGA                                                    
     C                   EVAL      T0NPC3=@PNPCO                                                    
     C                   EVAL      T0TPE3=@PTPED                                                    
     C                   EVAL      T0DAT3=@PDATP                                                    
     C                   EVAL      T0NOP3=@PNOPL                                                    
     C                   EVAL      T0LIN3=@PLINE                                                    
     C                                                                                              
     C                   ENDSL                                                                      
     C                                                                                              
      *                                                                                             
      * Recupero datos del la línea del pedido en la productiva                                     
      *                                                                                             
     C                   EVAL      S5CIAS=@PCIA2                                                    
     C                   EVAL      S5DLGA=@PDLG2                                                    
     C                   EVAL      S5NPCO=@PNPC2                                                    
     C                   EVAL      S5TPED=@PTPE2                                                    
     C                   EVAL      S5DATP=@PDAT2                                                    
     C                   EVAL      S5NOPL=@PNOP2                                                    
     C                   EVAL      S5LINE=@PLIN2                                                    
     C     KCODEPE       CHAIN(N)  CODEPE                                                           
     C                                                                                              
      * Leo archivo de trazabilidad y actualizo los campos correspondientes                         
     C                                                                                              
     C                   EVAL      *IN82=*OFF                                                       
     C                                                                                              
     C                   SELECT                                                                     
     C                   WHEN      @PLOGI=0                                                         
     C     KEDTRLP00     SETLL     EDTRLP00                                                         
     C                   WHEN      @PLOGI=1                                                         
     C     KEDTRLP10     SETLL     EDTRLP10                                                         
     C                   WHEN      @PLOGI=2                                                         
     C     KEDTRLP20     SETLL     EDTRLP20                                                         
     C                   WHEN      @PLOGI=3                                                         
     C     KEDTRLP30     SETLL     EDTRLP30                                                         
     C                   ENDSL                                                                      
     C                                                                                              
     C                   DOW       *IN82=*OFF                                                       
     C                                                                                              
     C                   SELECT                                                                     
     C                   WHEN      @PLOGI=0                                                         
     C     KEDTRLP00     READE     EDTRLP00                               82                        
     C                   WHEN      @PLOGI=1                                                         
     C     KEDTRLP10     READE     EDTRLP10                               82                        
     C                   WHEN      @PLOGI=2                                                         
     C     KEDTRLP20     READE     EDTRLP20                               82                        
     C                   WHEN      @PLOGI=3                                                         
     C     KEDTRLP30     READE     EDTRLP30                               82                        
     C                   ENDSL                                                                      
     C                                                                                              
     C                   IF        *IN82=*OFF                                                       
     C                                                                                              
      * Este evento es una des-reserva de línea en empresa productiva.                              
      * por tanto actualizo los campos:                                                             
     C                   EVAL      T0DWRF=*DATE                                                     
     C                   TIME                    T0HWRF                                             
C2280 ***                if        (T0EDST<='50' or T0EDST='95')                                    
C2280C                   if        T0EDST<='50'                                                     
     C                   EVAL      T0EDST='40'                                                      
     C                   endif                                                                      
     C                                                                                              
     C                   SELECT                                                                     
     C                   WHEN      @PLOGI=0                                                         
     C                   UPDATE    REDTRLP00                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
     C                   WHEN      @PLOGI=1                                                         
     C                   UPDATE    REDTRLP10                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
     C                   WHEN      @PLOGI=2                                                         
     C                   UPDATE    REDTRLP20                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
     C                   WHEN      @PLOGI=3                                                         
     C                   UPDATE    REDTRLP30                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
     C                   ENDSL                                                                      
     C                                                                                              
     C                   ENDIF                                                                      
     C                                                                                              
     C                   ENDDO                                                                      
     C                                                                                              
      *                                                                                             
      * Se quiere grabar registro de auditoría en EDTRAU?                                           
      *                                                                                             
     C                   EXSR      CS_UPD_EDTRAU                                                    
      *                                                                                             
      * Posible E-Mail con datos del pedido de compra                                               
      *                                                                                             
     C                   MOVEL(P)  T0CIA2        @EMCIAA                                            
     C                   MOVEL(P)  T0DLG2        @EMDLGA                                            
     C                   MOVEL(P)  T0CUST        @EMCODE                                            
     C                   MOVEL(P)  T0NPC2        @EMNDOC                                            
     C                   MOVE      T0DAT2        @EMFDOC                                            
     C                   MOVE      T0LIN2        @EMLDOC                                            
      *                                                                                             
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Proceso auditoría 222 Cambio logística línea pedido en Productiva                           
      **********************************************************************                        
     C     CS_COD222     BEGSR                                                                      
      *                                                                                             
      * Recupero la clave del EDTRLP según el parámetro del lógico                                  
      *                                                                                             
     C                   SELECT                                                                     
     C                   WHEN      @PLOGI=0                                                         
     C                   EVAL      T0CIAS=@PCIAS                                                    
     C                   EVAL      T0DLGA=@PDLGA                                                    
     C                   EVAL      T0NPCO=@PNPCO                                                    
     C                   EVAL      T0TPED=@PTPED                                                    
     C                   EVAL      T0DATP=@PDATP                                                    
     C                   EVAL      T0NOPL=@PNOPL                                                    
     C                   EVAL      T0LINE=@PLINE                                                    
     C                                                                                              
     C                   WHEN      @PLOGI=1                                                         
     C                   EVAL      T0CIA1=@PCIAS                                                    
     C                   EVAL      T0DLG1=@PDLGA                                                    
     C                   EVAL      T0NPC1=@PNPCO                                                    
     C                   EVAL      T0TPE1=@PTPED                                                    
     C                   EVAL      T0DAT1=@PDATP                                                    
     C                   EVAL      T0NOP1=@PNOPL                                                    
     C                   EVAL      T0LIN1=@PLINE                                                    
     C                                                                                              
     C                   WHEN      @PLOGI=2                                                         
     C                   EVAL      T0CIA2=@PCIAS                                                    
     C                   EVAL      T0DLG2=@PDLGA                                                    
     C                   EVAL      T0NPC2=@PNPCO                                                    
     C                   EVAL      T0TPE2=@PTPED                                                    
     C                   EVAL      T0DAT2=@PDATP                                                    
     C                   EVAL      T0NOP2=@PNOPL                                                    
     C                   EVAL      T0LIN2=@PLINE                                                    
     C                                                                                              
     C                   WHEN      @PLOGI=3                                                         
     C                   EVAL      T0CIA3=@PCIAS                                                    
     C                   EVAL      T0DLG3=@PDLGA                                                    
     C                   EVAL      T0NPC3=@PNPCO                                                    
     C                   EVAL      T0TPE3=@PTPED                                                    
     C                   EVAL      T0DAT3=@PDATP                                                    
     C                   EVAL      T0NOP3=@PNOPL                                                    
     C                   EVAL      T0LIN3=@PLINE                                                    
     C                                                                                              
     C                   ENDSL                                                                      
     C                                                                                              
      * Con este código de auditoría finalmente no se actualiza el                                  
      * archivo EDTRLP. Solo leo para recuperar valores para luego                                  
      * grabar auditoría.                                                                           
     C                                                                                              
     C                   EVAL      *IN82=*OFF                                                       
     C                                                                                              
     C                   SELECT                                                                     
     C                   WHEN      @PLOGI=0                                                         
     C     KEDTRLP00     SETLL     EDTRLP00                                                         
     C                   WHEN      @PLOGI=1                                                         
     C     KEDTRLP10     SETLL     EDTRLP10                                                         
     C                   WHEN      @PLOGI=2                                                         
     C     KEDTRLP20     SETLL     EDTRLP20                                                         
     C                   WHEN      @PLOGI=3                                                         
     C     KEDTRLP30     SETLL     EDTRLP30                                                         
     C                   ENDSL                                                                      
     C                                                                                              
     C                   DOW       *IN82=*OFF                                                       
     C                                                                                              
     C                   SELECT                                                                     
     C                   WHEN      @PLOGI=0                                                         
     C     KEDTRLP00     READE     EDTRLP00                               82                        
     C                   WHEN      @PLOGI=1                                                         
     C     KEDTRLP10     READE     EDTRLP10                               82                        
     C                   WHEN      @PLOGI=2                                                         
     C     KEDTRLP20     READE     EDTRLP20                               82                        
     C                   WHEN      @PLOGI=3                                                         
     C     KEDTRLP30     READE     EDTRLP30                               82                        
     C                   ENDSL                                                                      
     C                                                                                              
     C                   ENDDO                                                                      
      *                                                                                             
      * Solo se grabará auditoría.                                                                  
     C                   EXSR      CS_UPD_EDTRAU                                                    
      *                                                                                             
      * Posible E-Mail con datos del pedido de compra                                               
      *                                                                                             
     C                   MOVEL(P)  T0CIA2        @EMCIAA                                            
     C                   MOVEL(P)  T0DLG2        @EMDLGA                                            
     C                   MOVEL(P)  T0CUST        @EMCODE                                            
     C                   MOVEL(P)  T0NPC2        @EMNDOC                                            
     C                   MOVE      T0DAT2        @EMFDOC                                            
     C                   MOVE      T0LIN2        @EMLDOC                                            
      *                                                                                             
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Proceso auditoría 223 Autorizar contrapedido a la comercial                                 
      **********************************************************************                        
     C     CS_COD223     BEGSR                                                                      
      *                                                                                             
      * Recupero la clave del EDTRLP según el parámetro del lógico                                  
      *                                                                                             
     C                   SELECT                                                                     
     C                   WHEN      @PLOGI=0                                                         
     C                   EVAL      T0CIAS=@PCIAS                                                    
     C                   EVAL      T0DLGA=@PDLGA                                                    
     C                   EVAL      T0NPCO=@PNPCO                                                    
     C                   EVAL      T0TPED=@PTPED                                                    
     C                   EVAL      T0DATP=@PDATP                                                    
     C                   EVAL      T0NOPL=@PNOPL                                                    
     C                   EVAL      T0LINE=@PLINE                                                    
     C                                                                                              
     C                   WHEN      @PLOGI=1                                                         
     C                   EVAL      T0CIA1=@PCIAS                                                    
     C                   EVAL      T0DLG1=@PDLGA                                                    
     C                   EVAL      T0NPC1=@PNPCO                                                    
     C                   EVAL      T0TPE1=@PTPED                                                    
     C                   EVAL      T0DAT1=@PDATP                                                    
     C                   EVAL      T0NOP1=@PNOPL                                                    
     C                   EVAL      T0LIN1=@PLINE                                                    
     C                                                                                              
     C                   WHEN      @PLOGI=2                                                         
     C                   EVAL      T0CIA2=@PCIAS                                                    
     C                   EVAL      T0DLG2=@PDLGA                                                    
     C                   EVAL      T0NPC2=@PNPCO                                                    
     C                   EVAL      T0TPE2=@PTPED                                                    
     C                   EVAL      T0DAT2=@PDATP                                                    
     C                   EVAL      T0NOP2=@PNOPL                                                    
     C                   EVAL      T0LIN2=@PLINE                                                    
     C                                                                                              
     C                   WHEN      @PLOGI=3                                                         
     C                   EVAL      T0CIA3=@PCIAS                                                    
     C                   EVAL      T0DLG3=@PDLGA                                                    
     C                   EVAL      T0NPC3=@PNPCO                                                    
     C                   EVAL      T0TPE3=@PTPED                                                    
     C                   EVAL      T0DAT3=@PDATP                                                    
     C                   EVAL      T0NOP3=@PNOPL                                                    
     C                   EVAL      T0LIN3=@PLINE                                                    
     C                                                                                              
     C                   ENDSL                                                                      
     C                                                                                              
      * Con este código de auditoría finalmente no se actualiza el                                  
      * archivo EDTRLP. Solo leo para recuperar valores para luego                                  
      * grabar auditoría.                                                                           
     C                                                                                              
     C                   EVAL      *IN82=*OFF                                                       
     C                                                                                              
     C                   SELECT                                                                     
     C                   WHEN      @PLOGI=0                                                         
     C     KEDTRLP00     SETLL     EDTRLP00                                                         
     C                   WHEN      @PLOGI=1                                                         
     C     KEDTRLP10     SETLL     EDTRLP10                                                         
     C                   WHEN      @PLOGI=2                                                         
     C     KEDTRLP20     SETLL     EDTRLP20                                                         
     C                   WHEN      @PLOGI=3                                                         
     C     KEDTRLP30     SETLL     EDTRLP30                                                         
     C                   ENDSL                                                                      
     C                                                                                              
     C                   DOW       *IN82=*OFF                                                       
     C                                                                                              
     C                   SELECT                                                                     
     C                   WHEN      @PLOGI=0                                                         
     C     KEDTRLP00     READE     EDTRLP00                               82                        
     C                   WHEN      @PLOGI=1                                                         
     C     KEDTRLP10     READE     EDTRLP10                               82                        
     C                   WHEN      @PLOGI=2                                                         
     C     KEDTRLP20     READE     EDTRLP20                               82                        
     C                   WHEN      @PLOGI=3                                                         
     C     KEDTRLP30     READE     EDTRLP30                               82                        
     C                   ENDSL                                                                      
     C                                                                                              
     C                   ENDDO                                                                      
      *                                                                                             
      * Solo se grabará auditoría.                                                                  
     C                   EXSR      CS_UPD_EDTRAU                                                    
      *                                                                                             
      * Posible E-Mail con datos del pedido de compra                                               
      *                                                                                             
     C                   MOVEL(P)  T0CIA2        @EMCIAA                                            
     C                   MOVEL(P)  T0DLG2        @EMDLGA                                            
     C                   MOVEL(P)  T0CUST        @EMCODE                                            
     C                   MOVEL(P)  T0NPC2        @EMNDOC                                            
     C                   MOVE      T0DAT2        @EMFDOC                                            
     C                   MOVE      T0LIN2        @EMLDOC                                            
      *                                                                                             
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Proceso auditoría 224 Desautorizar contrapedido a la comercial                              
      **********************************************************************                        
     C     CS_COD224     BEGSR                                                                      
      *                                                                                             
      * Recupero la clave del EDTRLP según el parámetro del lógico                                  
      *                                                                                             
     C                   SELECT                                                                     
     C                   WHEN      @PLOGI=0                                                         
     C                   EVAL      T0CIAS=@PCIAS                                                    
     C                   EVAL      T0DLGA=@PDLGA                                                    
     C                   EVAL      T0NPCO=@PNPCO                                                    
     C                   EVAL      T0TPED=@PTPED                                                    
     C                   EVAL      T0DATP=@PDATP                                                    
     C                   EVAL      T0NOPL=@PNOPL                                                    
     C                   EVAL      T0LINE=@PLINE                                                    
     C                                                                                              
     C                   WHEN      @PLOGI=1                                                         
     C                   EVAL      T0CIA1=@PCIAS                                                    
     C                   EVAL      T0DLG1=@PDLGA                                                    
     C                   EVAL      T0NPC1=@PNPCO                                                    
     C                   EVAL      T0TPE1=@PTPED                                                    
     C                   EVAL      T0DAT1=@PDATP                                                    
     C                   EVAL      T0NOP1=@PNOPL                                                    
     C                   EVAL      T0LIN1=@PLINE                                                    
     C                                                                                              
     C                   WHEN      @PLOGI=2                                                         
     C                   EVAL      T0CIA2=@PCIAS                                                    
     C                   EVAL      T0DLG2=@PDLGA                                                    
     C                   EVAL      T0NPC2=@PNPCO                                                    
     C                   EVAL      T0TPE2=@PTPED                                                    
     C                   EVAL      T0DAT2=@PDATP                                                    
     C                   EVAL      T0NOP2=@PNOPL                                                    
     C                   EVAL      T0LIN2=@PLINE                                                    
     C                                                                                              
     C                   WHEN      @PLOGI=3                                                         
     C                   EVAL      T0CIA3=@PCIAS                                                    
     C                   EVAL      T0DLG3=@PDLGA                                                    
     C                   EVAL      T0NPC3=@PNPCO                                                    
     C                   EVAL      T0TPE3=@PTPED                                                    
     C                   EVAL      T0DAT3=@PDATP                                                    
     C                   EVAL      T0NOP3=@PNOPL                                                    
     C                   EVAL      T0LIN3=@PLINE                                                    
     C                                                                                              
     C                   ENDSL                                                                      
     C                                                                                              
      * Con este código de auditoría finalmente no se actualiza el                                  
      * archivo EDTRLP. Solo leo para recuperar valores para luego                                  
      * grabar auditoría.                                                                           
     C                                                                                              
     C                   EVAL      *IN82=*OFF                                                       
     C                                                                                              
     C                   SELECT                                                                     
     C                   WHEN      @PLOGI=0                                                         
     C     KEDTRLP00     SETLL     EDTRLP00                                                         
     C                   WHEN      @PLOGI=1                                                         
     C     KEDTRLP10     SETLL     EDTRLP10                                                         
     C                   WHEN      @PLOGI=2                                                         
     C     KEDTRLP20     SETLL     EDTRLP20                                                         
     C                   WHEN      @PLOGI=3                                                         
     C     KEDTRLP30     SETLL     EDTRLP30                                                         
     C                   ENDSL                                                                      
     C                                                                                              
     C                   DOW       *IN82=*OFF                                                       
     C                                                                                              
     C                   SELECT                                                                     
     C                   WHEN      @PLOGI=0                                                         
     C     KEDTRLP00     READE     EDTRLP00                               82                        
     C                   WHEN      @PLOGI=1                                                         
     C     KEDTRLP10     READE     EDTRLP10                               82                        
     C                   WHEN      @PLOGI=2                                                         
     C     KEDTRLP20     READE     EDTRLP20                               82                        
     C                   WHEN      @PLOGI=3                                                         
     C     KEDTRLP30     READE     EDTRLP30                               82                        
     C                   ENDSL                                                                      
     C                                                                                              
     C                   ENDDO                                                                      
      *                                                                                             
      * Solo se grabará auditoría.                                                                  
     C                   EXSR      CS_UPD_EDTRAU                                                    
      *                                                                                             
      * Posible E-Mail con datos del pedido de compra                                               
      *                                                                                             
     C                   MOVEL(P)  T0CIA2        @EMCIAA                                            
     C                   MOVEL(P)  T0DLG2        @EMDLGA                                            
     C                   MOVEL(P)  T0CUST        @EMCODE                                            
     C                   MOVEL(P)  T0NPC2        @EMNDOC                                            
     C                   MOVE      T0DAT2        @EMFDOC                                            
     C                   MOVE      T0LIN2        @EMLDOC                                            
      *                                                                                             
     C                   ENDSR                                                                      
24080 **********************************************************************                        
24080 * Proceso auditoría 227 Cambio fecha confirmada en productiva                                 
24080 **********************************************************************                        
24080C     CS_COD227     BEGSR                                                                      
24080 *                                                                                             
24080 * Recupero la clave del EDTRLP según el parámetro del lógico                                  
24080 *                                                                                             
24080C                   SELECT                                                                     
24080C                   WHEN      @PLOGI=0                                                         
24080C                   EVAL      T0CIAS=@PCIAS                                                    
24080C                   EVAL      T0DLGA=@PDLGA                                                    
24080C                   EVAL      T0NPCO=@PNPCO                                                    
24080C                   EVAL      T0TPED=@PTPED                                                    
24080C                   EVAL      T0DATP=@PDATP                                                    
24080C                   EVAL      T0NOPL=@PNOPL                                                    
24080C                   EVAL      T0LINE=@PLINE                                                    
24080C                                                                                              
24080C                   WHEN      @PLOGI=1                                                         
24080C                   EVAL      T0CIA1=@PCIAS                                                    
24080C                   EVAL      T0DLG1=@PDLGA                                                    
24080C                   EVAL      T0NPC1=@PNPCO                                                    
24080C                   EVAL      T0TPE1=@PTPED                                                    
24080C                   EVAL      T0DAT1=@PDATP                                                    
24080C                   EVAL      T0NOP1=@PNOPL                                                    
24080C                   EVAL      T0LIN1=@PLINE                                                    
24080C                                                                                              
24080C                   WHEN      @PLOGI=2                                                         
24080C                   EVAL      T0CIA2=@PCIAS                                                    
24080C                   EVAL      T0DLG2=@PDLGA                                                    
24080C                   EVAL      T0NPC2=@PNPCO                                                    
24080C                   EVAL      T0TPE2=@PTPED                                                    
24080C                   EVAL      T0DAT2=@PDATP                                                    
24080C                   EVAL      T0NOP2=@PNOPL                                                    
24080C                   EVAL      T0LIN2=@PLINE                                                    
24080C                                                                                              
24080C                   WHEN      @PLOGI=3                                                         
24080C                   EVAL      T0CIA3=@PCIAS                                                    
24080C                   EVAL      T0DLG3=@PDLGA                                                    
24080C                   EVAL      T0NPC3=@PNPCO                                                    
24080C                   EVAL      T0TPE3=@PTPED                                                    
24080C                   EVAL      T0DAT3=@PDATP                                                    
24080C                   EVAL      T0NOP3=@PNOPL                                                    
24080C                   EVAL      T0LIN3=@PLINE                                                    
24080C                                                                                              
24080C                   ENDSL                                                                      
24080C                                                                                              
24080 * Con este código de auditoría actualizo el campo T0FRRE  del                                 
24080 * archivo EDTRLP.                                                                             
24080C                                                                                              
24080C                   EVAL      *IN82=*OFF                                                       
24080C                                                                                              
24080C                   SELECT                                                                     
24080C                   WHEN      @PLOGI=0                                                         
24080C     KEDTRLP00     SETLL     EDTRLP00                                                         
24080C                   WHEN      @PLOGI=1                                                         
24080C     KEDTRLP10     SETLL     EDTRLP10                                                         
24080C                   WHEN      @PLOGI=2                                                         
24080C     KEDTRLP20     SETLL     EDTRLP20                                                         
24080C                   WHEN      @PLOGI=3                                                         
24080C     KEDTRLP30     SETLL     EDTRLP30                                                         
24080C                   ENDSL                                                                      
24080C                                                                                              
24080C                   DOW       *IN82=*OFF                                                       
24080C                                                                                              
24080C                   SELECT                                                                     
24080C                   WHEN      @PLOGI=0                                                         
24080C     KEDTRLP00     READE     EDTRLP00                               82                        
24080C                   WHEN      @PLOGI=1                                                         
24080C     KEDTRLP10     READE     EDTRLP10                               82                        
24080C                   WHEN      @PLOGI=2                                                         
24080C     KEDTRLP20     READE     EDTRLP20                               82                        
24080C                   WHEN      @PLOGI=3                                                         
24080C     KEDTRLP30     READE     EDTRLP30                               82                        
24080C                   ENDSL                                                                      
24080C                                                                                              
24080C                   IF        *IN82=*OFF                                                       
24080C                                                                                              
24080C                   EVAL      T0DWRF=*DATE                                                     
24080C                   TIME                    T0HWRF                                             
24080C                   MOVEL     @PTEXT        T0FRRE                                             
24080C                                                                                              
24080C                   SELECT                                                                     
24080C                   WHEN      @PLOGI=0                                                         
24080C                   UPDATE    REDTRLP00                            83                          
24080C   83              EXSR      CS_EDTRLD                                                        
24080C                   WHEN      @PLOGI=1                                                         
24080C                   UPDATE    REDTRLP10                            83                          
24080C   83              EXSR      CS_EDTRLD                                                        
24080C                   WHEN      @PLOGI=2                                                         
24080C                   UPDATE    REDTRLP20                            83                          
24080C   83              EXSR      CS_EDTRLD                                                        
24080C                   WHEN      @PLOGI=3                                                         
24080C                   UPDATE    REDTRLP30                            83                          
24080C   83              EXSR      CS_EDTRLD                                                        
24080C                   ENDSL                                                                      
24080C                                                                                              
24080C                   ENDIF                                                                      
24080C                                                                                              
24080C                   ENDDO                                                                      
24080 *                                                                                             
24080 * Solo se grabará auditoría.                                                                  
24080C                   EXSR      CS_UPD_EDTRAU                                                    
24080 *                                                                                             
24080 * Posible E-Mail con datos del pedido de compra                                               
24080 *                                                                                             
24080C                   MOVEL(P)  T0CIA2        @EMCIAA                                            
24080C                   MOVEL(P)  T0DLG2        @EMDLGA                                            
24080C                   MOVEL(P)  T0CUST        @EMCODE                                            
24080C                   MOVEL(P)  T0NPC2        @EMNDOC                                            
24080C                   MOVE      T0DAT2        @EMFDOC                                            
24080C                   MOVE      T0LIN2        @EMLDOC                                            
24080 *                                                                                             
24080C                   ENDSR                                                                      
      **********************************************************************                        
      * Proceso auditoría 230 Creación albarán X-DOCK.                                              
      **********************************************************************                        
     C     CS_COD230     BEGSR                                                                      
      *                                                                                             
      * Recupero la clave del EDTRLP según el parámetro del lógico                                  
      *                                                                                             
     C                   SELECT                                                                     
     C                   WHEN      @PLOGI=0                                                         
     C                   EVAL      T0CIAS=@PCIAS                                                    
     C                   EVAL      T0DLGA=@PDLGA                                                    
     C                   EVAL      T0NPCO=@PNPCO                                                    
     C                   EVAL      T0TPED=@PTPED                                                    
     C                   EVAL      T0DATP=@PDATP                                                    
     C                   EVAL      T0NOPL=@PNOPL                                                    
     C                   EVAL      T0LINE=@PLINE                                                    
     C                                                                                              
     C                   WHEN      @PLOGI=1                                                         
     C                   EVAL      T0CIA1=@PCIAS                                                    
     C                   EVAL      T0DLG1=@PDLGA                                                    
     C                   EVAL      T0NPC1=@PNPCO                                                    
     C                   EVAL      T0TPE1=@PTPED                                                    
     C                   EVAL      T0DAT1=@PDATP                                                    
     C                   EVAL      T0NOP1=@PNOPL                                                    
     C                   EVAL      T0LIN1=@PLINE                                                    
     C                                                                                              
     C                   WHEN      @PLOGI=2                                                         
     C                   EVAL      T0CIA2=@PCIAS                                                    
     C                   EVAL      T0DLG2=@PDLGA                                                    
     C                   EVAL      T0NPC2=@PNPCO                                                    
     C                   EVAL      T0TPE2=@PTPED                                                    
     C                   EVAL      T0DAT2=@PDATP                                                    
     C                   EVAL      T0NOP2=@PNOPL                                                    
     C                   EVAL      T0LIN2=@PLINE                                                    
     C                                                                                              
     C                   WHEN      @PLOGI=3                                                         
     C                   EVAL      T0CIA3=@PCIAS                                                    
     C                   EVAL      T0DLG3=@PDLGA                                                    
     C                   EVAL      T0NPC3=@PNPCO                                                    
     C                   EVAL      T0TPE3=@PTPED                                                    
     C                   EVAL      T0DAT3=@PDATP                                                    
     C                   EVAL      T0NOP3=@PNOPL                                                    
     C                   EVAL      T0LIN3=@PLINE                                                    
     C                                                                                              
     C                   ENDSL                                                                      
     C                                                                                              
      * Leo archivo de trazabilidad y actualizo los campos correspondientes                         
     C                                                                                              
     C                   EVAL      *IN82=*OFF                                                       
     C                                                                                              
     C                   SELECT                                                                     
     C                   WHEN      @PLOGI=0                                                         
     C     KEDTRLP00     SETLL     EDTRLP00                                                         
     C                   WHEN      @PLOGI=1                                                         
     C     KEDTRLP10     SETLL     EDTRLP10                                                         
     C                   WHEN      @PLOGI=2                                                         
     C     KEDTRLP20     SETLL     EDTRLP20                                                         
     C                   WHEN      @PLOGI=3                                                         
     C     KEDTRLP30     SETLL     EDTRLP30                                                         
     C                   ENDSL                                                                      
     C                                                                                              
     C                   DOW       *IN82=*OFF                                                       
     C                                                                                              
     C                   SELECT                                                                     
     C                   WHEN      @PLOGI=0                                                         
     C     KEDTRLP00     READE     EDTRLP00                               82                        
     C                   WHEN      @PLOGI=1                                                         
     C     KEDTRLP10     READE     EDTRLP10                               82                        
     C                   WHEN      @PLOGI=2                                                         
     C     KEDTRLP20     READE     EDTRLP20                               82                        
     C                   WHEN      @PLOGI=3                                                         
     C     KEDTRLP30     READE     EDTRLP30                               82                        
     C                   ENDSL                                                                      
     C                                                                                              
     C                   IF        *IN82=*OFF                                                       
     C                                                                                              
      * Este evento es la creación de un albarán X-DOCK.                                            
      * por tanto actualizo los campos:                                                             
     C                   EVAL      T0XDOC=1                                                         
     C                   EVAL      T0DWRF=*DATE                                                     
     C                   TIME                    T0HWRF                                             
     C                                                                                              
     C                   SELECT                                                                     
     C                   WHEN      @PLOGI=0                                                         
     C                   UPDATE    REDTRLP00                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
     C                   WHEN      @PLOGI=1                                                         
     C                   UPDATE    REDTRLP10                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
     C                   WHEN      @PLOGI=2                                                         
     C                   UPDATE    REDTRLP20                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
     C                   WHEN      @PLOGI=3                                                         
     C                   UPDATE    REDTRLP30                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
     C                   ENDSL                                                                      
     C                                                                                              
     C                   ENDIF                                                                      
     C                                                                                              
     C                   ENDDO                                                                      
     C                                                                                              
      *                                                                                             
      * Se quiere grabar registro de auditoría en EDTRAU?                                           
      *                                                                                             
     C                   EXSR      CS_UPD_EDTRAU                                                    
      *                                                                                             
      * Posible E-Mail con datos del pedido de compra                                               
      *                                                                                             
     C                   MOVEL(P)  T0CIA2        @EMCIAA                                            
     C                   MOVEL(P)  T0DLG2        @EMDLGA                                            
     C                   MOVEL(P)  T0CUST        @EMCODE                                            
     C                   MOVEL(P)  T0NPC2        @EMNDOC                                            
     C                   MOVE      T0DAT2        @EMFDOC                                            
     C                   MOVE      T0LIN2        @EMLDOC                                            
      *                                                                                             
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Proceso auditoría 231 Creación albarán normal.                                              
      **********************************************************************                        
     C     CS_COD231     BEGSR                                                                      
      *                                                                                             
      * Recupero la clave del EDTRLP según el parámetro del lógico                                  
      *                                                                                             
     C                   SELECT                                                                     
     C                   WHEN      @PLOGI=0                                                         
     C                   EVAL      T0CIAS=@PCIAS                                                    
     C                   EVAL      T0DLGA=@PDLGA                                                    
     C                   EVAL      T0NPCO=@PNPCO                                                    
     C                   EVAL      T0TPED=@PTPED                                                    
     C                   EVAL      T0DATP=@PDATP                                                    
     C                   EVAL      T0NOPL=@PNOPL                                                    
     C                   EVAL      T0LINE=@PLINE                                                    
     C                                                                                              
     C                   WHEN      @PLOGI=1                                                         
     C                   EVAL      T0CIA1=@PCIAS                                                    
     C                   EVAL      T0DLG1=@PDLGA                                                    
     C                   EVAL      T0NPC1=@PNPCO                                                    
     C                   EVAL      T0TPE1=@PTPED                                                    
     C                   EVAL      T0DAT1=@PDATP                                                    
     C                   EVAL      T0NOP1=@PNOPL                                                    
     C                   EVAL      T0LIN1=@PLINE                                                    
     C                                                                                              
     C                   WHEN      @PLOGI=2                                                         
     C                   EVAL      T0CIA2=@PCIAS                                                    
     C                   EVAL      T0DLG2=@PDLGA                                                    
     C                   EVAL      T0NPC2=@PNPCO                                                    
     C                   EVAL      T0TPE2=@PTPED                                                    
     C                   EVAL      T0DAT2=@PDATP                                                    
     C                   EVAL      T0NOP2=@PNOPL                                                    
     C                   EVAL      T0LIN2=@PLINE                                                    
     C                                                                                              
     C                   WHEN      @PLOGI=3                                                         
     C                   EVAL      T0CIA3=@PCIAS                                                    
     C                   EVAL      T0DLG3=@PDLGA                                                    
     C                   EVAL      T0NPC3=@PNPCO                                                    
     C                   EVAL      T0TPE3=@PTPED                                                    
     C                   EVAL      T0DAT3=@PDATP                                                    
     C                   EVAL      T0NOP3=@PNOPL                                                    
     C                   EVAL      T0LIN3=@PLINE                                                    
     C                                                                                              
     C                   ENDSL                                                                      
     C                                                                                              
      * Leo archivo de trazabilidad y actualizo los campos correspondientes                         
     C                                                                                              
     C                   EVAL      *IN82=*OFF                                                       
     C                                                                                              
     C                   SELECT                                                                     
     C                   WHEN      @PLOGI=0                                                         
     C     KEDTRLP00     SETLL     EDTRLP00                                                         
     C                   WHEN      @PLOGI=1                                                         
     C     KEDTRLP10     SETLL     EDTRLP10                                                         
     C                   WHEN      @PLOGI=2                                                         
     C     KEDTRLP20     SETLL     EDTRLP20                                                         
     C                   WHEN      @PLOGI=3                                                         
     C     KEDTRLP30     SETLL     EDTRLP30                                                         
     C                   ENDSL                                                                      
     C                                                                                              
     C                   DOW       *IN82=*OFF                                                       
     C                                                                                              
     C                   SELECT                                                                     
     C                   WHEN      @PLOGI=0                                                         
     C     KEDTRLP00     READE     EDTRLP00                               82                        
     C                   WHEN      @PLOGI=1                                                         
     C     KEDTRLP10     READE     EDTRLP10                               82                        
     C                   WHEN      @PLOGI=2                                                         
     C     KEDTRLP20     READE     EDTRLP20                               82                        
     C                   WHEN      @PLOGI=3                                                         
     C     KEDTRLP30     READE     EDTRLP30                               82                        
     C                   ENDSL                                                                      
     C                                                                                              
     C                   IF        *IN82=*OFF                                                       
     C                                                                                              
      *                                                                                             
      * Recupero datos del la línea del pedido en la productiva                                     
      *                                                                                             
     C                   EVAL      S5CIAS=T0CIA2                                                    
     C                   EVAL      S5DLGA=T0DLG2                                                    
     C                   EVAL      S5NPCO=T0NPC2                                                    
     C                   EVAL      S5TPED=T0TPE2                                                    
     C                   EVAL      S5DATP=T0DAT2                                                    
     C                   EVAL      S5NOPL=T0NOP2                                                    
     C                   EVAL      S5LINE=T0LIN2                                                    
     C     KCODEPE       CHAIN(N)  CODEPE                                                           
      * Este evento es la creación de un albarán normal.                                            
      * por tanto actualizo los campos:                                                             
     C                   EVAL      T0CANS=T0CANS + @PCANT                                           
     C                   EVAL      T0DWRF=*DATE                                                     
     C                   TIME                    T0HWRF                                             
      *estatus servido parcial o total                                                              
     C                   IF        (S5CANS+@PCANT) >= S5CANT                                        
     C                   EVAL      T0EDST='80'                                                      
     C                   ELSE                                                                       
     C                   EVAL      T0EDST='75'                                                      
     C                   ENDIF                                                                      
     C                                                                                              
     C                   SELECT                                                                     
     C                   WHEN      @PLOGI=0                                                         
     C                   UPDATE    REDTRLP00                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
     C                   WHEN      @PLOGI=1                                                         
     C                   UPDATE    REDTRLP10                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
     C                   WHEN      @PLOGI=2                                                         
     C                   UPDATE    REDTRLP20                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
     C                   WHEN      @PLOGI=3                                                         
     C                   UPDATE    REDTRLP30                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
     C                   ENDSL                                                                      
     C                                                                                              
     C                   ENDIF                                                                      
     C                                                                                              
     C                   ENDDO                                                                      
     C                                                                                              
      *                                                                                             
      * Se quiere grabar registro de auditoría en EDTRAU?                                           
      *                                                                                             
     C                   EXSR      CS_UPD_EDTRAU                                                    
      *                                                                                             
      * Posible E-Mail con datos del pedido de compra                                               
      *                                                                                             
     C                   MOVEL(P)  T0CIA2        @EMCIAA                                            
     C                   MOVEL(P)  T0DLG2        @EMDLGA                                            
     C                   MOVEL(P)  T0CUST        @EMCODE                                            
     C                   MOVEL(P)  T0NPC2        @EMNDOC                                            
     C                   MOVE      T0DAT2        @EMFDOC                                            
     C                   MOVE      T0LIN2        @EMLDOC                                            
      *                                                                                             
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Proceso auditoría 251 Errores en pedido en Productiva                                       
      **********************************************************************                        
     C     CS_COD251     BEGSR                                                                      
      *                                                                                             
      *                                                                                             
      * Recupero la clave del EDTRLP según el parámetro del lógico                                  
      *                                                                                             
     C                   SELECT                                                                     
     C                   WHEN      @PLOGI=0                                                         
     C                   EVAL      T0CIAS=@PCIAS                                                    
     C                   EVAL      T0DLGA=@PDLGA                                                    
     C                   EVAL      T0NPCO=@PNPCO                                                    
     C                   EVAL      T0TPED=@PTPED                                                    
     C                   EVAL      T0DATP=@PDATP                                                    
     C                   EVAL      T0NOPL=@PNOPL                                                    
     C                   EVAL      T0LINE=@PLINE                                                    
     C                                                                                              
     C                   WHEN      @PLOGI=1                                                         
     C                   EVAL      T0CIA1=@PCIAS                                                    
     C                   EVAL      T0DLG1=@PDLGA                                                    
     C                   EVAL      T0NPC1=@PNPCO                                                    
     C                   EVAL      T0TPE1=@PTPED                                                    
     C                   EVAL      T0DAT1=@PDATP                                                    
     C                   EVAL      T0NOP1=@PNOPL                                                    
     C                   EVAL      T0LIN1=@PLINE                                                    
     C                                                                                              
     C                   WHEN      @PLOGI=2                                                         
     C                   EVAL      T0CIA2=@PCIAS                                                    
     C                   EVAL      T0DLG2=@PDLGA                                                    
     C                   EVAL      T0NPC2=@PNPCO                                                    
     C                   EVAL      T0TPE2=@PTPED                                                    
     C                   EVAL      T0DAT2=@PDATP                                                    
     C                   EVAL      T0NOP2=@PNOPL                                                    
     C                   EVAL      T0LIN2=@PLINE                                                    
     C                                                                                              
     C                   WHEN      @PLOGI=3                                                         
     C                   EVAL      T0CIA3=@PCIAS                                                    
     C                   EVAL      T0DLG3=@PDLGA                                                    
     C                   EVAL      T0NPC3=@PNPCO                                                    
     C                   EVAL      T0TPE3=@PTPED                                                    
     C                   EVAL      T0DAT3=@PDATP                                                    
     C                   EVAL      T0NOP3=@PNOPL                                                    
     C                   EVAL      T0LIN3=@PLINE                                                    
     C                                                                                              
     C                   ENDSL                                                                      
     C                                                                                              
      * Con este código de auditoría finalmente no se actualiza el                                  
      * archivo EDTRLP. Solo leo para recuperar valores para luego                                  
      * grabar auditoría.                                                                           
     C                                                                                              
     C                   EVAL      *IN82=*OFF                                                       
     C                                                                                              
     C                   SELECT                                                                     
     C                   WHEN      @PLOGI=0                                                         
     C     KEDTRLP00     SETLL     EDTRLP00                                                         
     C                   WHEN      @PLOGI=1                                                         
     C     KEDTRLP10     SETLL     EDTRLP10                                                         
     C                   WHEN      @PLOGI=2                                                         
     C     KEDTRLP20     SETLL     EDTRLP20                                                         
     C                   WHEN      @PLOGI=3                                                         
     C     KEDTRLP30     SETLL     EDTRLP30                                                         
     C                   ENDSL                                                                      
     C                                                                                              
     C                   DOW       *IN82=*OFF                                                       
     C                                                                                              
     C                   SELECT                                                                     
     C                   WHEN      @PLOGI=0                                                         
     C     KEDTRLP00     READE     EDTRLP00                               82                        
     C                   WHEN      @PLOGI=1                                                         
     C     KEDTRLP10     READE     EDTRLP10                               82                        
     C                   WHEN      @PLOGI=2                                                         
     C     KEDTRLP20     READE     EDTRLP20                               82                        
     C                   WHEN      @PLOGI=3                                                         
     C     KEDTRLP30     READE     EDTRLP30                               82                        
     C                   ENDSL                                                                      
     C                                                                                              
     C                   ENDDO                                                                      
      *                                                                                             
      * Buscar código error en tabla EDER                                                           
      *                                                                                             
     C                   EVAL      PECTAB='EDER'                                                    
     C                   EVAL      PECLTA=@PERAV                                                    
     C     KPMTAB2       CHAIN(N)  PMTAB2                                                           
     C                   IF        %FOUND(PMTAB2)                                                   
      *Si existe código email específico para error lo recupero                                     
     C                   IF        PEBL65<>*BLANKS                                                  
     C                   MOVEL(P)  PEBL65        @EMEVEN                                            
     C                   ENDIF                                                                      
      *Recuperar descripción error                                                                  
FQ726C**                 EVAL      @PTEXT=PEDESC                                                    
FQ726C                   EVAL      @PTEXT=ZXDESCAUD                                                 
     C                   ENDIF                                                                      
      *                                                                                             
      * Volver a Buscar código auditoría en PMTAB2                                                  
      *                                                                                             
     C                   EVAL      PECTAB='EDAU'                                                    
     C                   EVAL      PECLTA=@PEDAU                                                    
     C     KPMTAB2       CHAIN(N)  PMTAB2                             81                            
      *                                                                                             
      * Solo se grabará auditoría.                                                                  
     C                   EXSR      CS_UPD_EDTRAU                                                    
      *                                                                                             
      * Posible E-Mail con datos del pedido de compra                                               
      *                                                                                             
     C                   MOVEL(P)  T0CIA2        @EMCIAA                                            
     C                   MOVEL(P)  T0DLG2        @EMDLGA                                            
     C                   MOVEL(P)  T0CUST        @EMCODE                                            
     C                   MOVEL(P)  T0NPC2        @EMNDOC                                            
     C                   MOVE      T0DAT2        @EMFDOC                                            
     C                   MOVE      T0LIN2        @EMLDOC                                            
      *                                                                                             
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Proceso auditoría 260 Avísos en pedido en Productiva                                        
      **********************************************************************                        
     C     CS_COD260     BEGSR                                                                      
      *                                                                                             
      *                                                                                             
      * Recupero la clave del EDTRLP según el parámetro del lógico                                  
      *                                                                                             
     C                   SELECT                                                                     
     C                   WHEN      @PLOGI=0                                                         
     C                   EVAL      T0CIAS=@PCIAS                                                    
     C                   EVAL      T0DLGA=@PDLGA                                                    
     C                   EVAL      T0NPCO=@PNPCO                                                    
     C                   EVAL      T0TPED=@PTPED                                                    
     C                   EVAL      T0DATP=@PDATP                                                    
     C                   EVAL      T0NOPL=@PNOPL                                                    
     C                   EVAL      T0LINE=@PLINE                                                    
     C                                                                                              
     C                   WHEN      @PLOGI=1                                                         
     C                   EVAL      T0CIA1=@PCIAS                                                    
     C                   EVAL      T0DLG1=@PDLGA                                                    
     C                   EVAL      T0NPC1=@PNPCO                                                    
     C                   EVAL      T0TPE1=@PTPED                                                    
     C                   EVAL      T0DAT1=@PDATP                                                    
     C                   EVAL      T0NOP1=@PNOPL                                                    
     C                   EVAL      T0LIN1=@PLINE                                                    
     C                                                                                              
     C                   WHEN      @PLOGI=2                                                         
     C                   EVAL      T0CIA2=@PCIAS                                                    
     C                   EVAL      T0DLG2=@PDLGA                                                    
     C                   EVAL      T0NPC2=@PNPCO                                                    
     C                   EVAL      T0TPE2=@PTPED                                                    
     C                   EVAL      T0DAT2=@PDATP                                                    
     C                   EVAL      T0NOP2=@PNOPL                                                    
     C                   EVAL      T0LIN2=@PLINE                                                    
     C                                                                                              
     C                   WHEN      @PLOGI=3                                                         
     C                   EVAL      T0CIA3=@PCIAS                                                    
     C                   EVAL      T0DLG3=@PDLGA                                                    
     C                   EVAL      T0NPC3=@PNPCO                                                    
     C                   EVAL      T0TPE3=@PTPED                                                    
     C                   EVAL      T0DAT3=@PDATP                                                    
     C                   EVAL      T0NOP3=@PNOPL                                                    
     C                   EVAL      T0LIN3=@PLINE                                                    
     C                                                                                              
     C                   ENDSL                                                                      
     C                                                                                              
      * Con este código de auditoría finalmente no se actualiza el                                  
      * archivo EDTRLP. Solo leo para recuperar valores para luego                                  
      * grabar auditoría.                                                                           
     C                                                                                              
     C                   EVAL      *IN82=*OFF                                                       
     C                                                                                              
     C                   SELECT                                                                     
     C                   WHEN      @PLOGI=0                                                         
     C     KEDTRLP00     SETLL     EDTRLP00                                                         
     C                   WHEN      @PLOGI=1                                                         
     C     KEDTRLP10     SETLL     EDTRLP10                                                         
     C                   WHEN      @PLOGI=2                                                         
     C     KEDTRLP20     SETLL     EDTRLP20                                                         
     C                   WHEN      @PLOGI=3                                                         
     C     KEDTRLP30     SETLL     EDTRLP30                                                         
     C                   ENDSL                                                                      
     C                                                                                              
     C                   DOW       *IN82=*OFF                                                       
     C                                                                                              
     C                   SELECT                                                                     
     C                   WHEN      @PLOGI=0                                                         
     C     KEDTRLP00     READE     EDTRLP00                               82                        
     C                   WHEN      @PLOGI=1                                                         
     C     KEDTRLP10     READE     EDTRLP10                               82                        
     C                   WHEN      @PLOGI=2                                                         
     C     KEDTRLP20     READE     EDTRLP20                               82                        
     C                   WHEN      @PLOGI=3                                                         
     C     KEDTRLP30     READE     EDTRLP30                               82                        
     C                   ENDSL                                                                      
     C                                                                                              
     C                   ENDDO                                                                      
      *                                                                                             
      * Buscar código avíso en tabla EDAV                                                           
      *                                                                                             
     C                   EVAL      PECTAB='EDAV'                                                    
     C                   EVAL      PECLTA=@PERAV                                                    
     C     KPMTAB2       CHAIN(N)  PMTAB2                                                           
     C                   IF        %FOUND(PMTAB2)                                                   
      *Si existe código email específico para avíso lo recupero                                     
     C                   IF        PEBL65<>*BLANKS                                                  
     C                   MOVEL(P)  PEBL65        @EMEVEN                                            
     C                   ENDIF                                                                      
      *Recuperar descripción avíso                                                                  
FQ726C**                 EVAL      @PTEXT=PEDESC                                                    
FQ726C                   EVAL      @PTEXT=ZXDESCAUD                                                 
     C                   ENDIF                                                                      
      *                                                                                             
      * Volver a Buscar código auditoría en PMTAB2                                                  
      *                                                                                             
     C                   EVAL      PECTAB='EDAU'                                                    
     C                   EVAL      PECLTA=@PEDAU                                                    
     C     KPMTAB2       CHAIN(N)  PMTAB2                             81                            
      *                                                                                             
      * Solo se grabará auditoría.                                                                  
     C                   EXSR      CS_UPD_EDTRAU                                                    
      *                                                                                             
      * Posible E-Mail con datos del pedido de compra                                               
      *                                                                                             
     C                   MOVEL(P)  T0CIA2        @EMCIAA                                            
     C                   MOVEL(P)  T0DLG2        @EMDLGA                                            
     C                   MOVEL(P)  T0CUST        @EMCODE                                            
     C                   MOVEL(P)  T0NPC2        @EMNDOC                                            
     C                   MOVE      T0DAT2        @EMFDOC                                            
     C                   MOVE      T0LIN2        @EMLDOC                                            
      *                                                                                             
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Proceso auditoría 301/302 Reserva/Desreserva TRACE                 *                        
      **********************************************************************                        
     C     CS_COD301     BEGSR                                                                      
                                                                                                    
      * Recupero datos del la línea del pedido en Trace                                             
     C                   EVAL      S5CIAS=@PCIA2                                                    
     C                   EVAL      S5DLGA=@PDLG2                                                    
     C                   EVAL      S5NPCO=@PNPC2                                                    
     C                   EVAL      S5TPED=@PTPE2                                                    
     C                   EVAL      S5DATP=@PDAT2                                                    
     C                   EVAL      S5NOPL=@PNOP2                                                    
     C                   EVAL      S5LINE=@PLIN2                                                    
     C     KCODEPE       CHAIN(N)  CODEPE                                                           
b01  C                   IF        %FOUND(CODEPE)                                                   
                                                                                                    
      * Busco Trazabilidad X-DOC en COXDOC                                                          
b02  C                   IF        S5CCPP='1'                                                       
     C                   EVAL      TKCIAS=S5CIAS                                                    
     C                   EVAL      TKDLGA=S5DLGA                                                    
     C                   EVAL      TKNPCO=S5NPCO                                                    
     C                   EVAL      TKTPED=S5TPED                                                    
     C                   EVAL      TKDATP=S5DATP                                                    
     C                   EVAL      TKNOPL=S5NOPL                                                    
     C                   EVAL      TKLINE=S5LINE                                                    
     C     KCOXDOC       SETLL     COXDOC                                                           
     C     KCOXDOC       READE     COXDOC                                                           
e02  C                   ENDIF                                                                      
     C                                                                                              
      * Si no es X-DOC o es X-DOC tipo antiguo sin COXDOC                                           
b02  C                   IF        S5CCPP<>'1' Or                                                   
     C                             (S5CCPP='1' And %EOF(COXDOC))                                    
      * Recupero la clave del EDTRLP según el parámetro del lógico                                  
s03  C                   SELECT                                                                     
     C                   WHEN      @PLOGI=0                                                         
     C                   EVAL      T0CIAS=@PCIAS                                                    
     C                   EVAL      T0DLGA=@PDLGA                                                    
     C                   EVAL      T0NPCO=@PNPCO                                                    
     C                   EVAL      T0TPED=@PTPED                                                    
     C                   EVAL      T0DATP=@PDATP                                                    
     C                   EVAL      T0NOPL=@PNOPL                                                    
     C                   EVAL      T0LINE=@PLINE                                                    
     C                   WHEN      @PLOGI=2                                                         
     C                   EVAL      T0CIA2=@PCIAS                                                    
     C                   EVAL      T0DLG2=@PDLGA                                                    
     C                   EVAL      T0NPC2=@PNPCO                                                    
     C                   EVAL      T0TPE2=@PTPED                                                    
     C                   EVAL      T0DAT2=@PDATP                                                    
     C                   EVAL      T0NOP2=@PNOPL                                                    
     C                   EVAL      T0LIN2=@PLINE                                                    
e03  C                   ENDSL                                                                      
     C                                                                                              
      * Leo archivo de trazabilidad y actualizo los campos correspondientes                         
s03  C                   SELECT                                                                     
     C                   WHEN      @PLOGI=0                                                         
     C     KEDTRLP00     CHAIN     EDTRLP00                           81                            
10051C                   IF        *IN81=*OFF And T0ARV1<>*BLANKS                                   
10051C                   EVAL      T0ARV1=S5ARTI+S5VARI+S5MODE                                      
10051C     KEDTRLP00Z    CHAIN     EDTRLP00                           81                            
10051C                   ENDIF                                                                      
     C                   WHEN      @PLOGI=2                                                         
b04  C                   IF        S5TACC = '1'                                                     
     C                   EVAL      T0COM2=S5ARTI+S5VARI+S5MODE                                      
x04  C                   ELSE                                                                       
     C                   EVAL      T0COM2=*BLANKS                                                   
e04  C                   ENDIF                                                                      
     C     KEDTRLP20X    CHAIN     EDTRLP20                           81                            
e03  C                   ENDSL                                                                      
     C                                                                                              
b03  C                   IF        *IN81=*OFF                                                       
      * Actualizo campos de Trace                                                                   
     C                   EVAL      ZXCANT = S5CANT                                                  
FQ710C                   EVAL      ZXUNIM = S5UNIM                                                  
     C                   EXSR      CS_TRAUPD                                                        
s04  C                   SELECT                                                                     
     C                   WHEN      @PLOGI=0                                                         
     C                   UPDATE    REDTRLP00                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
     C                   WHEN      @PLOGI=2                                                         
     C                   UPDATE    REDTRLP20                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
e04  C                   ENDSL                                                                      
e03  C                   ENDIF                                                                      
     C                                                                                              
      * Actualizo Cantidades en Registro de Tipo 0                                                  
     C                   EVAL      ZYCANT = @PCANT                                                  
     C                   EXSR      CS_CANTID                                                        
     C                                                                                              
x02  C                   ELSE                                                                       
      * Es X-DOC                                                                                    
     C                   EVAL      ZXNP03=*BLANKS                                                   
     C                   EVAL      ZXLI03=*ZEROS                                                    
d03  C                   DOW       NOT %EOF(COXDOC)                                                 
     C                                                                                              
b04  C                   IF        TKNP03<>ZXNP03 Or TKLI03<>ZXLI03                                 
     C                   EVAL      ZXNP03=TKNP03                                                    
     C                   EVAL      ZXLI03=TKLI03                                                    
     C                   EVAL      ZXCANT=0                                                         
e04  C                   ENDIF                                                                      
      * Leo archivo de trazabilidad y actualizo los campos correspondientes                         
     C                   MOVEL     TKCI03        T0CIA2                                             
     C                   EVAL      T0DLG2=TKDL03                                                    
     C                   EVAL      T0NPC2=TKNP03                                                    
     C                   EVAL      T0TPE2=TKTP03                                                    
     C                   EVAL      T0DAT2=TKDA03                                                    
     C                   EVAL      T0NOP2=TKNO03                                                    
     C                   EVAL      T0LIN2=TKLI03                                                    
      * El X-Doc es de un Conjunto ?                                                                
b04  C                   IF        TKARCO<>*BLANKS                                                  
     C                   EVAL      T0COM2=TKARTI+TKVARI+TKMODE                                      
x04  C                   ELSE                                                                       
     C                   EVAL      T0COM2=*BLANKS                                                   
e04  C                   ENDIF                                                                      
     C     KEDTRLP20X    CHAIN     EDTRLP20                                                         
b04  C                   IF        %FOUND(EDTRLP20)                                                 
      * Busco si existe el X-doc con el pedido de Trace                                             
     C                   EVAL      T0NPC3=@PNPC2                                                    
     C                   EVAL      T0LIN3=@PLIN2                                                    
     C     KEDTRLP20F    CHAIN     EDTRLP20                                                         
b05  C                   IF        %FOUND(EDTRLP20)                                                 
      * Actualizo campos de Trace                                                                   
     C                   EVAL      ZXCANT=ZXCANT+TKCANT                                             
FQ710C                   EVAL      ZXUNIM=TKUNIM                                                    
     C                   EXSR      CS_TRAUPD                                                        
     C                   UPDATE    REDTRLP20                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
x05  C                   ELSE                                                                       
      * Busco si existe el registro a blancos                                                       
     C                   EVAL      T0NPC3=*BLANKS                                                   
     C                   EVAL      T0LIN3=0                                                         
     C     KEDTRLP20F    CHAIN     EDTRLP20                                                         
b06  C                   IF        %FOUND(EDTRLP20)                                                 
      * Actualizo campos de Trace                                                                   
     C                   EVAL      ZXCANT=ZXCANT+TKCANT                                             
FQ710C                   EVAL      ZXUNIM=TKUNIM                                                    
     C                   EXSR      CS_TRAUPD                                                        
     C                   UPDATE    REDTRLP20                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
x06  C                   ELSE                                                                       
      * Añado Nuevo registro EDTRLP tipo 3                                                          
     C                   EVAL      ZXCANT = TKCANT                                                  
FQ710C                   EVAL      ZXUNIM = TKUNIM                                                  
     C                   EXSR      CS_TRAADD                                                        
21050C                   WRITE     REDTRLP20                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
e06  C                   ENDIF                                                                      
e05  C                   ENDIF                                                                      
e04  C                   ENDIF                                                                      
                                                                                                    
      * Actualizo Cantidades en Registro de Tipo 0                                                  
     C                   EVAL      ZYCANT = TKCANT                                                  
     C                   EXSR      CS_CANTID                                                        
                                                                                                    
     C     KCOXDOC       READE     COXDOC                                                           
e03  C                   ENDDO                                                                      
     C                                                                                              
e02  C                   ENDIF                                                                      
                                                                                                    
      * Actualizar archivo de auditoría                                                             
      * Recupero el registro original por si lo he perdido en CS_CANTID                             
     C                   EVAL      S5CIAS=@PCIA2                                                    
     C                   EVAL      S5DLGA=@PDLG2                                                    
     C                   EVAL      S5NPCO=@PNPC2                                                    
     C                   EVAL      S5TPED=@PTPE2                                                    
     C                   EVAL      S5DATP=@PDAT2                                                    
     C                   EVAL      S5NOPL=@PNOP2                                                    
     C                   EVAL      S5LINE=@PLIN2                                                    
     C     KCODEPE       CHAIN(N)  CODEPE                                                           
b02  C                   IF        %FOUND(CODEPE)                                                   
s03  C                   SELECT                                                                     
     C                   WHEN      @PLOGI=0                                                         
     C     KEDTRLP00     CHAIN     EDTRLP00                           81                            
10051C                   IF        *IN81=*OFF And T0ARV1<>*BLANKS                                   
10051C                   EVAL      T0ARV1=S5ARTI+S5VARI+S5MODE                                      
10051C     KEDTRLP00Z    CHAIN     EDTRLP00                           81                            
10051C                   ENDIF                                                                      
     C                   WHEN      @PLOGI=2                                                         
b04  C                   IF        S5TACC = '1'                                                     
     C                   EVAL      T0COM2=S5ARTI+S5VARI+S5MODE                                      
x04  C                   ELSE                                                                       
     C                   EVAL      T0COM2=*BLANKS                                                   
e04  C                   ENDIF                                                                      
     C     KEDTRLP20X    CHAIN     EDTRLP20                           81                            
e03  C                   ENDSL                                                                      
e02  C                   ENDIF                                                                      
                                                                                                    
     C                   EXSR      CS_UPD_EDTRAU                                                    
                                                                                                    
e01  C                   ENDIF                                                                      
      *                                                                                             
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Proceso auditoría 303/304 Preparación/Despreparación Trace                                  
      **********************************************************************                        
     C     CS_COD303     BEGSR                                                                      
                                                                                                    
      * Recupero datos del la línea del pedido en Trace                                             
     C                   EVAL      S5CIAS=@PCIA2                                                    
     C                   EVAL      S5DLGA=@PDLG2                                                    
     C                   EVAL      S5NPCO=@PNPC2                                                    
     C                   EVAL      S5TPED=@PTPE2                                                    
     C                   EVAL      S5DATP=@PDAT2                                                    
     C                   EVAL      S5NOPL=@PNOP2                                                    
     C                   EVAL      S5LINE=@PLIN2                                                    
     C     KCODEPE       CHAIN(N)  CODEPE                                                           
b01  C                   IF        %FOUND(CODEPE)                                                   
                                                                                                    
      * Leo archivo de trazabilidad y actualizo los campos correspondientes                         
     C                   EVAL      T0CIA3=@PCIAS                                                    
     C                   EVAL      T0DLG3=@PDLGA                                                    
     C                   EVAL      T0NPC3=@PNPCO                                                    
     C                   EVAL      T0TPE3=@PTPED                                                    
     C                   EVAL      T0DAT3=@PDATP                                                    
     C                   EVAL      T0NOP3=@PNOPL                                                    
     C                   EVAL      T0LIN3=@PLINE                                                    
     C     KEDTRLP30     SETLL     EDTRLP30                                                         
     C     KEDTRLP30     READE     EDTRLP30                                                         
d02  C                   DOW       NOT %EOF(EDTRLP30)                                               
                                                                                                    
      * Actualizo campos de Trace                                                                   
     C                   EXSR      CS_TRAUPD                                                        
     C                   UPDATE    REDTRLP30                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
                                                                                                    
     C     KEDTRLP30     READE     EDTRLP30                                                         
e02  C                   ENDDO                                                                      
                                                                                                    
      * Actualizo Cantidades en Registro de Tipo 0 si es depreparación                              
     C                   IF        @PEDAU = '304'                                                   
     C                   EVAL      ZYCANT = @PCANT                                                  
     C                   EXSR      CS_CANTID                                                        
      * Recupero el registro original por si lo he perdido en CS_CANTID                             
     C                   EVAL      T0CIA3=@PCIAS                                                    
     C                   EVAL      T0DLG3=@PDLGA                                                    
     C                   EVAL      T0NPC3=@PNPCO                                                    
     C                   EVAL      T0TPE3=@PTPED                                                    
     C                   EVAL      T0DAT3=@PDATP                                                    
     C                   EVAL      T0NOP3=@PNOPL                                                    
     C                   EVAL      T0LIN3=@PLINE                                                    
     C     KEDTRLP30     SETLL     EDTRLP30                                                         
     C     KEDTRLP30     READE(N)  EDTRLP30                                                         
     C                   ENDIF                                                                      
      * Actualizar archivo de auditoría                                                             
     C                   EXSR      CS_UPD_EDTRAU                                                    
                                                                                                    
e01  C                   ENDIF                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Proceso auditoría 305/306 Confirmación/Anulación Prepara.Trace                              
      **********************************************************************                        
     C     CS_COD305     BEGSR                                                                      
                                                                                                    
      * busco preparación en Trace                                                                  
     C                   EVAL      SACIAS=@PCIA2                                                    
     C                   EVAL      SATNPE=' '                                                       
     C                   EVAL      SADLGA=@PDLG2                                                    
     C                   EVAL      SANPCO=@PNPC2                                                    
     C                   EVAL      SATPED=@PTPE2                                                    
     C                   EVAL      SADATP=@PDAT2                                                    
     C                   EVAL      SANOPL=@PNOP2                                                    
     C                   EVAL      SALINE=@PLIN2                                                    
     C                   MOVEL     @PTEXT        SANPRP                                             
     C     KCOAPRP01     CHAIN     COAPR101                                                         
b01  C                   IF        Not %FOUND(COAPR101)                                             
     C     KCOAPRP01     CHAIN     COAPRP01                                                         
e01  C                   ENDIF                                                                      
b01  C                   IF        %FOUND(COAPRP01) Or %FOUND(COAPR101)                             
                                                                                                    
      * Recupero datos del la línea del pedido en Trace                                             
     C                   EVAL      S5CIAS=@PCIA2                                                    
     C                   EVAL      S5DLGA=@PDLG2                                                    
     C                   EVAL      S5NPCO=@PNPC2                                                    
     C                   EVAL      S5TPED=@PTPE2                                                    
     C                   EVAL      S5DATP=@PDAT2                                                    
     C                   EVAL      S5NOPL=@PNOP2                                                    
     C                   EVAL      S5LINE=@PLIN2                                                    
     C     KCODEPE       CHAIN(N)  CODEPE                                                           
b02  C                   IF        %FOUND(CODEPE)                                                   
                                                                                                    
      * Leo archivo de trazabilidad y actualizo los campos correspondientes                         
     C                   EVAL      T0CIA3=@PCIAS                                                    
     C                   EVAL      T0DLG3=@PDLGA                                                    
     C                   EVAL      T0NPC3=@PNPCO                                                    
     C                   EVAL      T0TPE3=@PTPED                                                    
     C                   EVAL      T0DAT3=@PDATP                                                    
     C                   EVAL      T0NOP3=@PNOPL                                                    
     C                   EVAL      T0LIN3=@PLINE                                                    
     C     KEDTRLP30     SETLL     EDTRLP30                                                         
     C     KEDTRLP30     READE     EDTRLP30                                                         
d03  C                   DOW       NOT %EOF(EDTRLP30)                                               
                                                                                                    
      * Actualizo campos de Trace                                                                   
     C                   EXSR      CS_TRAUPD                                                        
     C                   UPDATE    REDTRLP30                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
                                                                                                    
     C     KEDTRLP30     READE     EDTRLP30                                                         
e03  C                   ENDDO                                                                      
                                                                                                    
      * Busco Trazabilidad X-DOC en COXDOC                                                          
b03  C                   IF        S5CCPP='1'                                                       
     C                   EVAL      TKCIAS=S5CIAS                                                    
     C                   EVAL      TKDLGA=S5DLGA                                                    
     C                   EVAL      TKNPCO=S5NPCO                                                    
     C                   EVAL      TKTPED=S5TPED                                                    
     C                   EVAL      TKDATP=S5DATP                                                    
     C                   EVAL      TKNOPL=S5NOPL                                                    
     C                   EVAL      TKLINE=S5LINE                                                    
     C     KCOXDOC       SETLL     COXDOC                                                           
     C     KCOXDOC       READE     COXDOC                                                           
e03  C                   ENDIF                                                                      
     C                                                                                              
      * Si no es X-DOC o es X-DOC tipo antiguo sin COXDOC                                           
b03  C                   IF        S5CCPP<>'1' Or                                                   
     C                             (S5CCPP='1' And %EOF(COXDOC))                                    
      * Actualizo Cantidades es Registro de Tipo 0                                                  
     C                   EVAL      ZYCANT = @PCANT                                                  
     C                   EXSR      CS_CANTID                                                        
x03  C                   ELSE                                                                       
      * Es X-DOC                                                                                    
d04  C                   DOW       NOT %EOF(COXDOC)                                                 
     C                                                                                              
      * Leo archivo de trazabilidad y actualizo los campos correspondientes                         
     C                   MOVEL     TKCI03        T0CIA2                                             
     C                   EVAL      T0DLG2=TKDL03                                                    
     C                   EVAL      T0NPC2=TKNP03                                                    
     C                   EVAL      T0TPE2=TKTP03                                                    
     C                   EVAL      T0DAT2=TKDA03                                                    
     C                   EVAL      T0NOP2=TKNO03                                                    
     C                   EVAL      T0LIN2=TKLI03                                                    
      * El X-Doc es de un Conjunto ?                                                                
b05  C                   IF        TKARCO<>*BLANKS                                                  
     C                   EVAL      T0COM2=TKARTI+TKVARI+TKMODE                                      
x05  C                   ELSE                                                                       
     C                   EVAL      T0COM2=*BLANKS                                                   
e05  C                   ENDIF                                                                      
     C     KEDTRLP20X    CHAIN(N)  EDTRLP20                                                         
b05  C                   IF        %FOUND(EDTRLP20)                                                 
      * Actualizo Cantidades en Registro de Tipo 0                                                  
     C                   EVAL      ZYCANT = TKCANT                                                  
     C                   EXSR      CS_CANTID                                                        
e05  C                   ENDIF                                                                      
                                                                                                    
     C     KCOXDOC       READE     COXDOC                                                           
e04  C                   ENDDO                                                                      
     C                                                                                              
e03  C                   ENDIF                                                                      
                                                                                                    
      * Recupero el registro original por si lo he perdido en CS_CANTID                             
     C                   EVAL      T0CIA3=@PCIAS                                                    
     C                   EVAL      T0DLG3=@PDLGA                                                    
     C                   EVAL      T0NPC3=@PNPCO                                                    
     C                   EVAL      T0TPE3=@PTPED                                                    
     C                   EVAL      T0DAT3=@PDATP                                                    
     C                   EVAL      T0NOP3=@PNOPL                                                    
     C                   EVAL      T0LIN3=@PLINE                                                    
     C     KEDTRLP30     SETLL     EDTRLP30                                                         
     C     KEDTRLP30     READE(N)  EDTRLP30                                                         
                                                                                                    
      * Muevo valores a campo de Texto                                                              
     C                   EVAL      @PTEXT=*BLANKS                                                   
     C                   EVAL      ZDNPRP=SANPRP                                                    
     C                   EVAL      ZDEMBQ=SAEMBQ                                                    
     C                   EVAL      ZDXSGA=SAXSGA                                                    
     C                   MOVEL     SALSGA        ZDLSGA                                             
     C                   EVAL      @PTEXT=DSTEXT                                                    
     C                                                                                              
      * Actualizar archivo de auditoría                                                             
     C                   EXSR      CS_UPD_EDTRAU                                                    
e02  C                   ENDIF                                                                      
                                                                                                    
e01  C                   ENDIF                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Proceso auditoría 307 Expedición desde Trace. Crean Albarán                                 
      **********************************************************************                        
     C     CS_COD307     BEGSR                                                                      
                                                                                                    
      * busco preparación en Trace                                                                  
     C                   EVAL      SACIAS=@PCIA2                                                    
     C                   EVAL      SATNPE=' '                                                       
     C                   EVAL      SADLGA=@PDLG2                                                    
     C                   EVAL      SANPCO=@PNPC2                                                    
     C                   EVAL      SATPED=@PTPE2                                                    
     C                   EVAL      SADATP=@PDAT2                                                    
     C                   EVAL      SANOPL=@PNOP2                                                    
     C                   EVAL      SALINE=@PLIN2                                                    
     C                   EVAL      SANPRP=%SUBST(@PTEXT:17:10)                                      
     C     KCOAPRP01     CHAIN     COAPR101                                                         
b01  C                   IF        Not %FOUND(COAPR101)                                             
     C     KCOAPRP01     CHAIN     COAPRP01                                                         
e01  C                   ENDIF                                                                      
b01  C                   IF        %FOUND(COAPRP01) Or %FOUND(COAPR101)                             
                                                                                                    
      * Recupero datos de la línea del pedido en Trace                                              
     C                   EVAL      S5CIAS=@PCIA2                                                    
     C                   EVAL      S5DLGA=@PDLG2                                                    
     C                   EVAL      S5NPCO=@PNPC2                                                    
     C                   EVAL      S5TPED=@PTPE2                                                    
     C                   EVAL      S5DATP=@PDAT2                                                    
     C                   EVAL      S5NOPL=@PNOP2                                                    
     C                   EVAL      S5LINE=@PLIN2                                                    
     C     KCODEPE       CHAIN(N)  CODEPE                                                           
b02  C                   IF        %FOUND(CODEPE)                                                   
                                                                                                    
      * Leo archivo de trazabilidad y actualizo los campos correspondientes                         
     C                   EVAL      T0CIA3=@PCIAS                                                    
     C                   EVAL      T0DLG3=@PDLGA                                                    
     C                   EVAL      T0NPC3=@PNPCO                                                    
     C                   EVAL      T0TPE3=@PTPED                                                    
     C                   EVAL      T0DAT3=@PDATP                                                    
     C                   EVAL      T0NOP3=@PNOPL                                                    
     C                   EVAL      T0LIN3=@PLINE                                                    
     C     KEDTRLP30     SETLL     EDTRLP30                                                         
     C     KEDTRLP30     READE     EDTRLP30                                                         
d03  C                   DOW       NOT %EOF(EDTRLP30)                                               
                                                                                                    
      * Actualizo campos de Trace                                                                   
     C                   EXSR      CS_TRAUPD                                                        
     C                   UPDATE    REDTRLP30                            83                          
21050C   83              EXSR      CS_EDTRLD                                                        
                                                                                                    
     C     KEDTRLP30     READE     EDTRLP30                                                         
e03  C                   ENDDO                                                                      
                                                                                                    
      * Busco Trazabilidad X-DOC en COXDOC                                                          
b03  C                   IF        S5CCPP='1'                                                       
     C                   EVAL      TKCIAS=S5CIAS                                                    
     C                   EVAL      TKDLGA=S5DLGA                                                    
     C                   EVAL      TKNPCO=S5NPCO                                                    
     C                   EVAL      TKTPED=S5TPED                                                    
     C                   EVAL      TKDATP=S5DATP                                                    
     C                   EVAL      TKNOPL=S5NOPL                                                    
     C                   EVAL      TKLINE=S5LINE                                                    
     C     KCOXDOC       SETLL     COXDOC                                                           
     C     KCOXDOC       READE     COXDOC                                                           
e03  C                   ENDIF                                                                      
     C                                                                                              
      * Si no es X-DOC o es X-DOC tipo antiguo sin COXDOC                                           
b03  C                   IF        S5CCPP<>'1' Or                                                   
     C                             (S5CCPP='1' And %EOF(COXDOC))                                    
      * Actualizo Cantidades es Registro de Tipo 0                                                  
     C                   EVAL      ZYCANT = @PCANT                                                  
     C                   EXSR      CS_CANTID                                                        
x03  C                   ELSE                                                                       
      * Es X-DOC                                                                                    
d04  C                   DOW       NOT %EOF(COXDOC)                                                 
     C                                                                                              
      * Leo archivo de trazabilidad y actualizo los campos correspondientes                         
     C                   MOVEL     TKCI03        T0CIA2                                             
     C                   EVAL      T0DLG2=TKDL03                                                    
     C                   EVAL      T0NPC2=TKNP03                                                    
     C                   EVAL      T0TPE2=TKTP03                                                    
     C                   EVAL      T0DAT2=TKDA03                                                    
     C                   EVAL      T0NOP2=TKNO03                                                    
     C                   EVAL      T0LIN2=TKLI03                                                    
      * El X-Doc es de un Conjunto ?                                                                
b05  C                   IF        TKARCO<>*BLANKS                                                  
     C                   EVAL      T0COM2=TKARTI+TKVARI+TKMODE                                      
x05  C                   ELSE                                                                       
     C                   EVAL      T0COM2=*BLANKS                                                   
e05  C                   ENDIF                                                                      
     C     KEDTRLP20X    CHAIN(N)  EDTRLP20                                                         
b05  C                   IF        %FOUND(EDTRLP20)                                                 
      * Actualizo Cantidades en Registro de Tipo 0                                                  
     C                   EVAL      ZYCANT = TKCANT                                                  
     C                   EXSR      CS_CANTID                                                        
e05  C                   ENDIF                                                                      
                                                                                                    
     C     KCOXDOC       READE     COXDOC                                                           
e04  C                   ENDDO                                                                      
     C                                                                                              
e03  C                   ENDIF                                                                      
                                                                                                    
      * Recupero el registro original por si lo he perdido en CS_CANTID                             
     C                   EVAL      T0CIA3=@PCIAS                                                    
     C                   EVAL      T0DLG3=@PDLGA                                                    
     C                   EVAL      T0NPC3=@PNPCO                                                    
     C                   EVAL      T0TPE3=@PTPED                                                    
     C                   EVAL      T0DAT3=@PDATP                                                    
     C                   EVAL      T0NOP3=@PNOPL                                                    
     C                   EVAL      T0LIN3=@PLINE                                                    
     C     KEDTRLP30     SETLL     EDTRLP30                                                         
     C     KEDTRLP30     READE(N)  EDTRLP30                                                         
                                                                                                    
      * Actualizar archivo de auditoría                                                             
     C                   EXSR      CS_UPD_EDTRAU                                                    
e02  C                   ENDIF                                                                      
                                                                                                    
e01  C                   ENDIF                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Proceso auditoría 308 Salida Camión desde Trace                                             
      **********************************************************************                        
     C     CS_COD308     BEGSR                                                                      
                                                                                                    
      * Leo archivo de trazabilidad y actualizo los campos correspondientes                         
     C                   EVAL      T0CIA3=@PCIAS                                                    
     C                   EVAL      T0DLG3=@PDLGA                                                    
     C                   EVAL      T0NPC3=@PNPCO                                                    
     C                   EVAL      T0TPE3=@PTPED                                                    
     C                   EVAL      T0DAT3=@PDATP                                                    
     C                   EVAL      T0NOP3=@PNOPL                                                    
     C                   EVAL      T0LIN3=@PLINE                                                    
     C     KEDTRLP30     SETLL     EDTRLP30                                                         
     C     KEDTRLP30     READE     EDTRLP30                                                         
b01  C                   IF        NOT %EOF(EDTRLP30)                                               
      * Actualizar archivo de auditoría                                                             
     C                   EXSR      CS_UPD_EDTRAU                                                    
e01  C                   ENDIF                                                                      
                                                                                                    
     C                   ENDSR                                                                      
C1579 **********************************************************************                        
C1579 * Proceso auditoría 500 Creación albarán Poolweb                                              
C1579 **********************************************************************                        
C1579C     CS_COD500     BEGSR                                                                      
C1579 *                                                                                             
C1579 * Recupero la clave del EDTRLP según el parámetro del lógico                                  
C1579 *                                                                                             
C1579C                   SELECT                                                                     
C1579C                   WHEN      @PLOGI=0                                                         
C1579C                   EVAL      T0CIAS=@PCIAS                                                    
C1579C                   EVAL      T0DLGA=@PDLGA                                                    
C1579C                   EVAL      T0NPCO=@PNPCO                                                    
C1579C                   EVAL      T0TPED=@PTPED                                                    
C1579C                   EVAL      T0DATP=@PDATP                                                    
C1579C                   EVAL      T0NOPL=@PNOPL                                                    
C1579C                   EVAL      T0LINE=@PLINE                                                    
C1579C                                                                                              
C1579C                   WHEN      @PLOGI=1                                                         
C1579C                   EVAL      T0CIA1=@PCIAS                                                    
C1579C                   EVAL      T0DLG1=@PDLGA                                                    
C1579C                   EVAL      T0NPC1=@PNPCO                                                    
C1579C                   EVAL      T0TPE1=@PTPED                                                    
C1579C                   EVAL      T0DAT1=@PDATP                                                    
C1579C                   EVAL      T0NOP1=@PNOPL                                                    
C1579C                   EVAL      T0LIN1=@PLINE                                                    
C1579C                                                                                              
C1579C                   WHEN      @PLOGI=2                                                         
C1579C                   EVAL      T0CIA2=@PCIAS                                                    
C1579C                   EVAL      T0DLG2=@PDLGA                                                    
C1579C                   EVAL      T0NPC2=@PNPCO                                                    
C1579C                   EVAL      T0TPE2=@PTPED                                                    
C1579C                   EVAL      T0DAT2=@PDATP                                                    
C1579C                   EVAL      T0NOP2=@PNOPL                                                    
C1579C                   EVAL      T0LIN2=@PLINE                                                    
C1579C                                                                                              
C1579C                   WHEN      @PLOGI=3                                                         
C1579C                   EVAL      T0CIA3=@PCIAS                                                    
C1579C                   EVAL      T0DLG3=@PDLGA                                                    
C1579C                   EVAL      T0NPC3=@PNPCO                                                    
C1579C                   EVAL      T0TPE3=@PTPED                                                    
C1579C                   EVAL      T0DAT3=@PDATP                                                    
C1579C                   EVAL      T0NOP3=@PNOPL                                                    
C1579C                   EVAL      T0LIN3=@PLINE                                                    
C1579C                                                                                              
C1579C                   ENDSL                                                                      
C1579C                                                                                              
C1579 * Leo archivo de trazabilidad y actualizo los campos correspondientes                         
C1579C                                                                                              
C1579C                   EVAL      *IN82=*OFF                                                       
C1579C                                                                                              
C1579C                   SELECT                                                                     
C1579C                   WHEN      @PLOGI=0                                                         
C1579C     KEDTRLP00     SETLL     EDTRLP00                                                         
C1579C                   WHEN      @PLOGI=1                                                         
C1579C     KEDTRLP10     SETLL     EDTRLP10                                                         
C1579C                   WHEN      @PLOGI=2                                                         
C1579C     KEDTRLP20     SETLL     EDTRLP20                                                         
C1579C                   WHEN      @PLOGI=3                                                         
C1579C     KEDTRLP30     SETLL     EDTRLP30                                                         
C1579C                   ENDSL                                                                      
C1579C                                                                                              
C1579C                   DOW       *IN82=*OFF                                                       
C1579C                                                                                              
C1579C                   SELECT                                                                     
C1579C                   WHEN      @PLOGI=0                                                         
C1579C     KEDTRLP00     READE     EDTRLP00                               82                        
C1579C                   WHEN      @PLOGI=1                                                         
C1579C     KEDTRLP10     READE     EDTRLP10                               82                        
C1579C                   WHEN      @PLOGI=2                                                         
C1579C     KEDTRLP20     READE     EDTRLP20                               82                        
C1579C                   WHEN      @PLOGI=3                                                         
C1579C     KEDTRLP30     READE     EDTRLP30                               82                        
C1579C                   ENDSL                                                                      
C1579C                                                                                              
C1579C                   IF        *IN82=*OFF                                                       
C1579C                                                                                              
C1579 *                                                                                             
C1579 * Recupero datos del la línea del pedido de compras                                           
C1579 *                                                                                             
C1579C                   EVAL      C5CIAS=T0CIA1                                                    
C1579C                   EVAL      C5DLGA=T0DLG1                                                    
C1579C                   EVAL      C5NPCO=T0NPC1                                                    
C1579C                   EVAL      C5TPED=T0TPE1                                                    
C1579C                   EVAL      C5DATP=T0DAT1                                                    
C1579C                   EVAL      C5NOPL=T0NOP1                                                    
C1579C                   EVAL      C5LINE=T0LIN1                                                    
C1579C     KPUDEPE       CHAIN(N)  PUDEPE                                                           
C1579 * Este evento es la creación de un albarán normal.                                            
C1579 * por tanto actualizo los campos:                                                             
C1579C                   EVAL      T0CANS=T0CANS + @PCANT                                           
C1579C                   EVAL      T0DWRF=*DATE                                                     
C1579C                   TIME                    T0HWRF                                             
C1579 *estatus servido parcial o total                                                              
C1579C                   IF        (C5CANS+@PCANT) >= C5CANT                                        
C1579C                   EVAL      T0EDST='80'                                                      
C1579C                   ELSE                                                                       
C1579C                   EVAL      T0EDST='75'                                                      
C1579C                   ENDIF                                                                      
C1579C                                                                                              
C1579C                   SELECT                                                                     
C1579C                   WHEN      @PLOGI=0                                                         
C1579C                   UPDATE    REDTRLP00                            83                          
C1579C   83              EXSR      CS_EDTRLD                                                        
C1579C                   WHEN      @PLOGI=1                                                         
C1579C                   UPDATE    REDTRLP10                            83                          
C1579C   83              EXSR      CS_EDTRLD                                                        
C1579C                   WHEN      @PLOGI=2                                                         
C1579C                   UPDATE    REDTRLP20                            83                          
C1579C   83              EXSR      CS_EDTRLD                                                        
C1579C                   WHEN      @PLOGI=3                                                         
C1579C                   UPDATE    REDTRLP30                            83                          
C1579C   83              EXSR      CS_EDTRLD                                                        
C1579C                   ENDSL                                                                      
C1579C                                                                                              
C1579C                   ENDIF                                                                      
C1579C                                                                                              
C1579C                   ENDDO                                                                      
C1579C                                                                                              
C1579 *                                                                                             
C1579 * Se quiere grabar registro de auditoría en EDTRAU?                                           
C1579 *                                                                                             
C1579C                   EXSR      CS_UPD_EDTRAU                                                    
C1579 *                                                                                             
C1579 * Posible E-Mail con datos del pedido de compra                                               
C1579 *                                                                                             
C1579C                   MOVEL(P)  T0CIA1        @EMCIAA                                            
C1579C                   MOVEL(P)  T0DLG1        @EMDLGA                                            
C1579C                   MOVEL(P)  T0PRVR        @EMCODE                                            
C1579C                   MOVEL(P)  T0NPC1        @EMNDOC                                            
C1579C                   MOVE      T0DAT1        @EMFDOC                                            
C1579C                   MOVE      T0LIN1        @EMLDOC                                            
C1579 *                                                                                             
C1579C                   ENDSR                                                                      
C1544 **********************************************************************                        
C1544 * Proceso auditoría 309 Salida Camión desde Trace a Consolidador                              
C1544 **********************************************************************                        
C1544C     CS_COD309     BEGSR                                                                      
C1544 * Leo archivo de trazabilidad y actualizo los campos correspondientes                         
C1544C                   EVAL      T0CIA3=@PCIAS                                                    
C1544C                   EVAL      T0DLG3=@PDLGA                                                    
C1544C                   EVAL      T0NPC3=@PNPCO                                                    
C1544C                   EVAL      T0TPE3=@PTPED                                                    
C1544C                   EVAL      T0DAT3=@PDATP                                                    
C1544C                   EVAL      T0NOP3=@PNOPL                                                    
C1544C                   EVAL      T0LIN3=@PLINE                                                    
C1544C     KEDTRLP30     SETLL     EDTRLP30                                                         
C1544C     KEDTRLP30     READE     EDTRLP30                                                         
C1544C                   IF        NOT %EOF(EDTRLP30)                                               
C1544 * Actualizar archivo de auditoría                                                             
C1544C                   EXSR      CS_UPD_EDTRAU                                                    
C1544C                   ENDIF                                                                      
C1544C                   ENDSR                                                                      
      **********************************************************************                        
      * Añadir registro Tipo Trace                                                                  
      **********************************************************************                        
     C     CS_TRAADD     BEGSR                                                                      
                                                                                                    
     C                   EVAL      T0TREG=3                                                         
     C                   EVAL      T0CIA3=@PCIA2                                                    
     C                   EVAL      T0DLG3=@PDLG2                                                    
     C                   EVAL      T0NPC3=@PNPC2                                                    
     C                   EVAL      T0TPE3=@PTPE2                                                    
     C                   EVAL      T0DAT3=@PDAT2                                                    
     C                   EVAL      T0NOP3=@PNOP2                                                    
     C                   EVAL      T0LIN3=@PLIN2                                                    
     C                   EVAL      T0CAN3=ZXCANT                                                    
FQ710C                   EVAL      T0UNI3=ZXUNIM                                                    
     C                   EVAL      T0DWR3=*DATE                                                     
     C                   TIME                    T0HWR3                                             
     C                   EVAL      T0UWR3=SDSUSR                                                    
     C                   EVAL      T0DWRF=*DATE                                                     
     C                   TIME                    T0HWRF                                             
     C                   EVAL      T0CANT=0                                                         
FQ710C                   EVAL      T0IMPO=0                                                         
     C                   EVAL      T0CANR=0                                                         
     C                   EVAL      T0CANP=0                                                         
     C                   EVAL      T0CANS=0                                                         
     C                   EVAL      T0CAN1=0                                                         
     C                   EVAL      T0CAN2=0                                                         
      * Cálculo Status en Trace                                                                     
     C                   EXSR      CS_CALSTS                                                        
                                                                                                    
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Actualizar registro Tipo Trace                                                              
      **********************************************************************                        
     C     CS_TRAUPD     BEGSR                                                                      
                                                                                                    
s01  C                   SELECT                                                                     
                                                                                                    
     C                   WHEN      @PEDAU = '301' Or @PEDAU = '302'                                 
     C                   EVAL      T0CIA3=@PCIA2                                                    
     C                   EVAL      T0DLG3=@PDLG2                                                    
     C                   EVAL      T0NPC3=@PNPC2                                                    
     C                   EVAL      T0TPE3=@PTPE2                                                    
     C                   EVAL      T0DAT3=@PDAT2                                                    
     C                   EVAL      T0NOP3=@PNOP2                                                    
     C                   EVAL      T0LIN3=@PLIN2                                                    
     C                   EVAL      T0CAN3=ZXCANT                                                    
FQ710C                   EVAL      T0UNI3=ZXUNIM                                                    
In193C                   IF        @PEDAU = '301'                                                   
In193C                   EVAL      T0DWR3=*DATE                                                     
In193C                   TIME                    T0HWR3                                             
In193C                   EVAL      T0UWR3=SDSUSR                                                    
28100C                   IF        T0XDOC = 1                                                       
28100C                   EVAL      T0FURE=*DATE                                                     
28100C                   ENDIF                                                                      
In193C                   ENDIF                                                                      
C2185 *                                                                                             
C2185 * Actualizar datos TRACE en EDITRC                                                            
C2185 *                                                                                             
C2185C                   EXSR      CS_EDITRC                                                        
                                                                                                    
     C                   WHEN      @PEDAU = '303'                                                   
     C                   EVAL      T0STCP='10'                                                      
                                                                                                    
     C                   WHEN      @PEDAU = '304'                                                   
     C                   EVAL      T0STCP='  '                                                      
     C                   EVAL      T0STLP=' '                                                       
                                                                                                    
     C                   WHEN      @PEDAU = '305'                                                   
     C                   EVAL      T0STCP='20'                                                      
                                                                                                    
     C                   WHEN      @PEDAU = '306' And S5MPRP='1'                                    
     C                   EVAL      T0STCP='10'                                                      
                                                                                                    
     C                   WHEN      @PEDAU = '306' And S5MPRP=' '                                    
     C                   EVAL      T0STCP='  '                                                      
                                                                                                    
     C                   WHEN      @PEDAU = '307'                                                   
     C                   EVAL      T0STLP=SASTUL                                                    
                                                                                                    
e01  C                   ENDSL                                                                      
                                                                                                    
In193C**                 EVAL      T0DWR3=*DATE                                                     
In193C**                 TIME                    T0HWR3                                             
In193C**                 EVAL      T0UWR3=SDSUSR                                                    
     C                   EVAL      T0DWRF=*DATE                                                     
     C                   TIME                    T0HWRF                                             
      * Cálculo Status en Trace                                                                     
     C                   EXSR      CS_CALSTS                                                        
                                                                                                    
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Actualizo Cantidades en Registro de Tipo 0                                                  
      **********************************************************************                        
     C     CS_CANTID     BEGSR                                                                      
                                                                                                    
      * Si la línea que hemos actualizado es de conjunto divido por                                 
      * el coeficiente                                                                              
s01  C                   SELECT                                                                     
     C                   WHEN      T0CFC1 > 0                                                       
C3477C*                  EVAL      ZYCANT = ZYCANT / T0CFC1                                         
     C                   WHEN      T0CFC2 > 0                                                       
C3477C*                  EVAL      ZYCANT = ZYCANT / T0CFC2                                         
e01  C                   ENDSL                                                                      
      * Leo todos los registros de la línea del pedido en Comercial                                 
     C                   EVAL      ZXCOM1 = 0                                                       
     C                   EVAL      ZXCOM2 = 0                                                       
02070C                   SELECT                                                                     
02070C                   WHEN      @PEDAU = '302'                                                   
02070C                   EVAL      ZXEDST = '50'                                                    
02070C                   WHEN      @PEDAU = '301' Or @PEDAU = '306'                                 
02070C                   EVAL      ZXEDST = '60'                                                    
02070C                   WHEN      @PEDAU = '305'                                                   
02070C                   EVAL      ZXEDST = '70'                                                    
02070C                   WHEN      @PEDAU = '307'                                                   
02070C                   EVAL      ZXEDST = '80'                                                    
02070C                   ENDSL                                                                      
     C     KEDTRLP00     SETLL     EDTRLP00                                                         
     C     KEDTRLP00     READE(N)  EDTRLP00                                                         
d01  C                   DOW       NOT %EOF(EDTRLP00)                                               
      * Calculo el numero de componentes si hay conjunto                                            
s02  C                   SELECT                                                                     
     C                   WHEN      T0CFC1 > 0                                                       
     C                   EVAL      ZXCOM1 = ZXCOM1+1                                                
     C                   WHEN      T0CFC2 > 0                                                       
     C                   EVAL      ZXCOM2 = ZXCOM2+1                                                
e02  C                   ENDSL                                                                      
02070C                   SELECT                                                                     
02070C                   WHEN      @PEDAU = '301' Or @PEDAU = '307'                                 
02070C                   IF        T0EDST < ZXEDST                                                  
02070C                   EVAL      ZXEDST = T0EDST                                                  
02070C                   ENDIF                                                                      
02070C                   WHEN      @PEDAU = '305'                                                   
02070C                   IF        T0STCP < '20'                                                    
02070C                   EVAL      ZXEDST = '60'                                                    
02070C                   ENDIF                                                                      
02070C                   WHEN      @PEDAU = '302' Or @PEDAU = '306'                                 
02070C                   IF        T0EDST > ZXEDST                                                  
02070C                   EVAL      ZXEDST = T0EDST                                                  
02070C                   ENDIF                                                                      
02070C                   ENDSL                                                                      
     C     KEDTRLP00     READE(N)  EDTRLP00                                                         
e01  C                   ENDDO                                                                      
      * Al final divido la cantidad total por el numero de Componentes                              
s01  C                   SELECT                                                                     
     C                   WHEN      ZXCOM1 > 0                                                       
C3477C*                  EVAL      ZYCANT = ZYCANT/ZXCOM1                                           
     C                   WHEN      ZXCOM2 > 0                                                       
C3477C*                  EVAL      ZYCANT = ZYCANT/ZXCOM2                                           
     C                   OTHER                                                                      
e01  C                   ENDSL                                                                      
                                                                                                    
      * Actualizo Registro Tipo 0                                                                   
C3477*                                                                                             
C3477C*    KEDTRLP00     SETLL     EDTRLP00                                                         
C3477C*    KEDTRLP00     READE     EDTRLP00                                                         
C3477C*d01  C                   DOW       NOT %EOF(EDTRLP00)                                        
C3477C*b02  C                   IF        T0TREG = 0                                                
C3477*                                                                                             
C3477c                   eval      t0cia3 = s5cias                                                  
C3477c                   eval      t0dlg3 = s5dlga                                                  
C3477c                   eval      t0npc3 = s5npco                                                  
C3477c                   eval      t0tpe3 = s5tped                                                  
C3477c                   eval      t0dat3 = s5datp                                                  
C3477c                   eval      t0nop3 = s5nopl                                                  
C3477c                   eval      t0lin3 = s5line                                                  
C3477*                                                                                             
C3477C     kedtrlp30     setll     edtrlp30                                                         
C3477C     kedtrlp30     reade     edtrlp30                                                         
C3477C                   dow       not %eof(edtrlp30)                                               
C3477*                                                                                             
s03  C                   SELECT                                                                     
     C                   WHEN      @PEDAU = '301'                                                   
02070C*                  IF        ZXEDST = '60' And (ZXCOM1>0 Or ZXCOM2>0)                         
02070C*                  EVAL(H)   T0CANR = %dech((T0CANR+ZYCANT):5:4)                              
02070C*                  ELSE                                                                       
02070C                   EVAL(H)   T0CANR = T0CANR + ZYCANT                                         
02070C*                  ENDIF                                                                      
     C                   WHEN      @PEDAU = '302'                                                   
02070C*                  IF        ZXEDST = '50' And (ZXCOM1>0 Or ZXCOM2>0)                         
02070C*                  EVAL(H)   T0CANR = %dech((T0CANR-ZYCANT):5:4)                              
02070C*                  ELSE                                                                       
02070C                   EVAL(H)   T0CANR = T0CANR - ZYCANT                                         
02070C*                  ENDIF                                                                      
     C                   IF        T0CANR < 0                                                       
     C                   EVAL      T0CANR = 0                                                       
     C                   ENDIF                                                                      
     C                   WHEN      @PEDAU = '305'                                                   
02070C*                  IF        ZXEDST = '70' And (ZXCOM1>0 Or ZXCOM2>0)                         
02070C*                  EVAL(H)   T0CANP = %dech((T0CANP+ZYCANT):5:4)                              
02070C*                  ELSE                                                                       
02070C                   EVAL(H)   T0CANP = T0CANP + ZYCANT                                         
02070C*                  ENDIF                                                                      
     C                   WHEN      @PEDAU = '306'                                                   
In185C                             Or @PEDAU = '304'                                                
02070C*                  IF        ZXEDST = '60' And (ZXCOM1>0 Or ZXCOM2>0)                         
02070C*                  EVAL(H)   T0CANP = %dech((T0CANP-ZYCANT):5:4)                              
02070C*                  ELSE                                                                       
02070C                   EVAL(H)   T0CANP = T0CANP - ZYCANT                                         
02070C*                  ENDIF                                                                      
     C                   IF        T0CANP < 0                                                       
     C                   EVAL      T0CANP = 0                                                       
     C                   ENDIF                                                                      
     C                   WHEN      @PEDAU = '307'                                                   
02070C*                  IF        ZXEDST = '80' And (ZXCOM1>0 Or ZXCOM2>0)                         
02070C*                  EVAL(H)   T0CANS = %dech((T0CANS+ZYCANT):5:4)                              
02070C*                  EVAL(H)   T0CANP = %dech((T0CANP-ZYCANT):5:4)                              
02070C*                  EVAL(H)   T0CANR = %dech((T0CANR-ZYCANT):5:4)                              
02070C*                  ELSE                                                                       
In193C**                 EVAL(H)   T0CANS = T0CANS + ZYCANT                                         
In193C                   IF        T0COFA > 0 And T0UNIM <> T0UNI3                                  
C3477C*In193C                   IF        T0TCOF = '0'                                              
C3477C*In193C                   EVAL(H)   T0CANS = T0CANS + (ZYCANT * T0COFA)                       
C3477C*In193C                   ELSE                                                                
C3477C*In193C                   EVAL(H)   T0CANS = T0CANS + (ZYCANT / T0COFA)                       
C3477C*In193C                   ENDIF                                                               
In193C                   ELSE                                                                       
In193C                   EVAL(H)   T0CANS = T0CANS + ZYCANT                                         
In193C                   ENDIF                                                                      
02070C                   EVAL(H)   T0CANP = T0CANP - ZYCANT                                         
02070C                   EVAL(H)   T0CANR = T0CANR - ZYCANT                                         
02070C*                  ENDIF                                                                      
02070C                   IF        T0CANS > 0 And T0CANT <> T0CANS                                  
02070C                   EVAL      T0EDST='75'                                                      
02070C                   ENDIF                                                                      
02070C                   IF        T0CANT = T0CANS                                                  
02070C                   EVAL      T0EDST='80'                                                      
02070C                   ENDIF                                                                      
02070C                   IF        T0STLP = '5'                                                     
02070C                   EVAL      T0STCP='  '                                                      
02070C                   ENDIF                                                                      
     C                   IF        T0CANP < 0                                                       
     C                   EVAL      T0CANP = 0                                                       
     C                   ENDIF                                                                      
     C                   IF        T0CANR < 0                                                       
     C                   EVAL      T0CANR = 0                                                       
     C                   ENDIF                                                                      
e03  C                   ENDSL                                                                      
C3477*                                                                                             
C3477C*                  UPDATE    REDTRLP00                            83                          
C3477C*21050C   83              EXSR      CS_EDTRLD                                                 
C3477C*e02  C                   ENDIF                                                               
C3477C*    KEDTRLP00     READE     EDTRLP00                                                         
C3477*                                                                                             
C3477c                   update    redtrlp30                            83                          
C3477c   83              exsr      cs_edtrld                                                        
C3477c     kedtrlp30     reade     edtrlp30                                                         
C3477*                                                                                             
e01  C                   ENDDO                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Cálculo Status en Trace                                                                     
      **********************************************************************                        
     C     CS_CALSTS     BEGSR                                                                      
                                                                                                    
     C                   EVAL      ZXCANR = 0                                                       
     C                   EVAL      ZXCANS = 0                                                       
                                                                                                    
s01  C                   SELECT                                                                     
     C                   WHEN      @PEDAU = '301'                                                   
     C                   EVAL      ZXCANR = (S5CANR + @PCANT)                                       
b02  C                   IF        ZXCANR > S5CANT                                                  
     C                   EVAL      ZXCANR = S5CANT                                                  
e02  C                   ENDIF                                                                      
     C                   EVAL      ZXCANS = S5CANS                                                  
     C                   WHEN      @PEDAU = '302'                                                   
     C                   EVAL      ZXCANR = (S5CANR - @PCANT)                                       
b02  C                   IF        ZXCANR < 0                                                       
     C                   EVAL      ZXCANR = 0                                                       
e02  C                   ENDIF                                                                      
     C                   EVAL      ZXCANS = S5CANS                                                  
     C                   WHEN      @PEDAU = '303' Or @PEDAU = '304'                                 
     C                             Or @PEDAU = '305' Or @PEDAU = '306'                              
     C                   EVAL      ZXCANR = S5CANR                                                  
     C                   EVAL      ZXCANS = S5CANS                                                  
     C                   WHEN      @PEDAU = '307'                                                   
     C                   EVAL      ZXCANR = S5CANR                                                  
     C                   EVAL      ZXCANS = (S5CANS + @PCANT)                                       
e01  C                   ENDSL                                                                      
                                                                                                    
s01  C                   SELECT                                                                     
     C                   WHEN      (ZXCANS>0 And S5CANT=ZXCANS                                      
     C                             And T0TREG<>0)                                                   
     C                             Or (ZXCANS>0 And S5CANT=ZXCANS                                   
02070C                             And T0TREG=0 And T0CANS+ZXCANS>=T0CANT)                          
     C                   EVAL      T0EDST='80'                                                      
     C                   EVAL      T0STCP='  '                                                      
     C                   WHEN      (ZXCANS>0 And S5CANT>ZXCANS                                      
     C                             And T0TREG<>0)                                                   
     C                             Or (ZXCANS>0 And S5CANT>ZXCANS                                   
     C                             And T0TREG=0 And T0CANS+ZXCANS<T0CANT)                           
     C                   EVAL      T0EDST='75'                                                      
02070C                   IF        T0STLP = '5' And @PEDAU = '307'                                  
02070C                   EVAL      T0STCP='  '                                                      
02070C                   ENDIF                                                                      
     C                   WHEN      ZXCANS=0 And S5CANT=S5CAPP                                       
     C                   EVAL      T0EDST='70'                                                      
     C                   WHEN      ZXCANS=0 And S5CAPP>0 And S5CANT>S5CAPP                          
     C                   EVAL      T0EDST='65'                                                      
     C                   WHEN      ZXCANS=0 And S5CAPP=0 And S5CANT=ZXCANR                          
     C                   EVAL      T0EDST='60'                                                      
     C                   WHEN      ZXCANS=0 And S5CAPP=0 And                                        
     C                             ZXCANR>0 And S5CANT>ZXCANR                                       
     C                   EVAL      T0EDST='55'                                                      
C2616C                   WHEN      ZXCANS=0 And S5CAPP=0 And ZXCANR=0                               
C2280C                             And T0EDST<'70'                                                  
C2616C                   EVAL      T0EDST='50'                                                      
e01  C                   ENDSL                                                                      
                                                                                                    
     C                   ENDSR                                                                      
24080 **********************************************************************                        
24080 * Unitats de Mesura                                                                           
24080 **********************************************************************                        
24080C     CS_UNITS      BEGSR                                                                      
24080                                                                                               
24080 * Per defecte                                                                                 
24080C                   EVAL      T0COFA=1                                                         
24080C                   EVAL      T0TCOF='0'                                                       
24080C                   EVAL      T0DECI=0                                                         
24080                                                                                               
24080 * Ara mirem si existeix alguna conversió unitats contra OL                                    
24080C                   EVAL      P6CIAS=S5CIAS                                                    
24080C                   EVAL      P6ARTI=S5ARTI                                                    
24080C                   EVAL      P6VARI=S5VARI                                                    
24080C                   EVAL      P6MODE=S5MODE                                                    
24080C     KPMUNAL       SETLL     PMUNAL                                                           
24080C     KPMUNAL       READE     PMUNAL                                                           
24080C                   DOW       NOT %EOF(PMUNAL)                                                 
24080C                   IF        P6UNOL='1'                                                       
24080C                   EVAL      T0COFA=P6COFA                                                    
24080C                   EVAL      T0TCOF=P6TCOF                                                    
24080C                   EVAL      T0DECI=P6DECI                                                    
24080C                   ENDIF                                                                      
24080C     KPMUNAL       READE     PMUNAL                                                           
24080C                   ENDDO                                                                      
24080                                                                                               
24080C                   ENDSR                                                                      
24080 **********************************************************************                        
24080 * Quantitat Servida des de Delegació                                                          
24080 **********************************************************************                        
24080C     CS_CANDLGA    BEGSR                                                                      
24080                                                                                               
24080C                   EVAL      T0CAND=0                                                         
24080 * Primer miro si ha ha albarans al històric                                                   
24080C                   EVAL      CECIAS=S5CIAS                                                    
24080C                   EVAL      CECUST=S5CUST                                                    
24080C                   EVAL      CENPCO=S5NPCO                                                    
24080C                   EVAL      CETPED=S5TPED                                                    
24080C                   EVAL      CEDATP=S5DATP                                                    
24080C                   EVAL      CENOPL=S5NOPL                                                    
24080C                   EVAL      CELINE=S5LINE                                                    
24080C     KCOALBD10     SETLL     COHALD10                                                         
24080C     KCOALBD10     READE     COHALD10                                                         
24080C                   DOW       NOT %EOF(COHALD10)                                               
24080C                   IF        %SUBST(CEALBA:1:2)<>'OD'                                         
24080C                             And %SUBST(CEALBA:1:2)<>'ED'                                     
24080C                   EVAL      T0CAND=T0CAND+CECANS                                             
24080C                   ENDIF                                                                      
24080C     KCOALBD10     READE     COHALD10                                                         
24080C                   ENDDO                                                                      
24080                                                                                               
24080 * Ara miro si ha ha albarans                                                                  
24080C                   EVAL      CECIAS=S5CIAS                                                    
24080C                   EVAL      CECUST=S5CUST                                                    
24080C                   EVAL      CENPCO=S5NPCO                                                    
24080C                   EVAL      CETPED=S5TPED                                                    
24080C                   EVAL      CEDATP=S5DATP                                                    
24080C                   EVAL      CENOPL=S5NOPL                                                    
24080C                   EVAL      CELINE=S5LINE                                                    
24080C     KCOALBD10     SETLL     COALBD10                                                         
24080C     KCOALBD10     READE     COALBD10                                                         
24080C                   DOW       NOT %EOF(COALBD10)                                               
24080C                   IF        %SUBST(CEALBA:1:2)<>'OD'                                         
24080C                   EVAL      T0CAND=T0CAND+CECANS                                             
24080C                   ENDIF                                                                      
24080C     KCOALBD10     READE     COALBD10                                                         
24080C                   ENDDO                                                                      
24080                                                                                               
24080C                   ENDSR                                                                      
FQ710 **************************************************************                                
FQ710 * Calculo Importe unitario de la linea de pedido             *                                
FQ710 *------------------------------------------------------------*                                
FQ710C     CS_IMPORTE    BEGSR                                                                      
FQ710                                                                                               
FQ710C                   EVAL      ZXMONE2 = S5MONE                                                 
FQ710 * Tipo de IVA                                                                                 
FQ710C                   EVAL      P_PECIAS=S5CIAS                                                  
FQ710C                   EVAL      P_PECTAB='TIV2'                                                  
FQ710C                   EVAL      P_PECLTA=*BLANKS                                                 
FQ710C                   EVAL      P_PECLTA=S0TIV3                                                  
FQ710C     KPMTABD       CHAIN     PMTABD                                                           
FQ710C                   IF        %FOUND(PMTABD)                                                   
FQ710C                   EVAL      ZXTIVC=P_PEBL61                                                  
FQ710C                   EVAL      ZXBL65I=P_PEBL65                                                 
FQ710C                   ELSE                                                                       
FQ710C                   EVAL      ZXPABI=*BLANKS                                                   
FQ710C                   ENDIF                                                                      
FQ710                                                                                               
FQ710C                   EVAL      XZAUXI=*ZEROS                                                    
FQ710C                   EVAL      XZAUXI1=*ZEROS                                                   
FQ710C                   EVAL      MBCIAS=S5CIAS                                                    
FQ710C                   EVAL      MBMONE=ZXMONE2                                                   
FQ710 * Ecotaxe                                                                                     
FQ710C                   EVAL      XZTAXE=0                                                         
FQ710C                   IF        S5ECOP<>*BLANKS                                                  
FQ710C                   CALL      'MN0398'                                                         
FQ710C                   PARM                    @PCIAS                                             
FQ710C                   PARM      S5ECOP        @PEECOP                                            
FQ710C                   PARM      S5DATP        @PEFLCD                                            
FQ710C                   PARM      0             @PETAXE                                            
FQ710C                   EVAL      XZTAXE=@PETAXE                                                   
FQ710C                   ENDIF                                                                      
FQ710 * Buscamos en Ajuste decimal                                                                  
FQ710                                                                                               
FQ710C     KMSDIV0       CHAIN     MSDIV0                                                           
FQ710C                   IF        %FOUND(MSDIV0)                                                   
FQ710C                   EVAL      XZDECI=MBDECI                                                    
FQ710C                   EVAL      XZAJUD=MBAJUD                                                    
FQ710C                   ENDIF                                                                      
FQ710                                                                                               
FQ710 * Buscamos en PMUNAL UNIDADES ALTERNATIVAS                                                    
FQ710                                                                                               
FQ710C                   EVAL      XZCOFU=1                                                         
FQ710C                   IF        S5UNIM<>S5UNDP                                                   
FQ710C                   EVAL      XZCIAS=@PCIAS                                                    
FQ710C                   EVAL      XZARTI=S5ARTI                                                    
FQ710C                   EVAL      XZVARI=S5VARI                                                    
FQ710C                   EVAL      XZMODE=S5MODE                                                    
FQ710C                   EVAL      ZXCA10=1                                                         
FQ710C                   EVAL      ZXCA11=1                                                         
FQ710C                   EVAL      ZXUN10=S5UNIM                                                    
FQ710C                   EVAL      ZXUN11=S5UNDP                                                    
FQ710C* CAMBIO de unidades                                                                          
FQ710C/COPY *LIBL/QSRDSRC,SRD021                                                                    
FQ710C                   ENDIF                                                                      
FQ710                                                                                               
FQ710 * Buscamos en CAMBIO MONEDA CABECERA DEL PEDIDO                                               
FQ710                                                                                               
FQ710C                   IF        ZXMONE2<>S5MONE                                                  
FQ710C                   CALL      'MM2555'                                                         
FQ710C                   PARM      S5CIAS        @PCIAS                                             
FQ710C                   PARM      S5MONE        @PMON1                                             
FQ710C                   PARM      ZXMONE2       @PMON2                                             
FQ710C                   PARM      S5DATP        @PDATA                                             
FQ710C                   PARM      S5NOPL        @PHORA                                             
FQ710C                   PARM      0             @PCMCOCO                                           
FQ710C                   PARM      0             @PCMCCCO                                           
FQ710C                   PARM      *BLANKS       @PEERR                                             
FQ710C                   EVAL      ZXCOCAMB=@PCMCCCO                                                
FQ710C                   ELSE                                                                       
FQ710C                   EVAL      ZXCOCAMB=1                                                       
FQ710C                   ENDIF                                                                      
FQ710                                                                                               
FQ710 * Buscamos en % de IVA                                                                        
FQ710C                   EVAL      MVCIAS=S5CIAS                                                    
FQ710C                   EVAL      MVTIVA=S5TIVA                                                    
FQ710C                   EVAL      MVPABI=ZXPABI                                                    
FQ710C                   EVAL      MVFLCD=@PDATP                                                    
FQ710C     KMSIVAS       SETGT     MSIVAS                                                           
FQ710C     KMSIVAS0      READPE    MSIVAS                                 83                        
FQ710C                   SELECT                                                                     
FQ710C                   WHEN      ZXTIVC=' '                                                       
FQ710C                   EVAL      MVPIV2=*ZEROS                                                    
FQ710C                   WHEN      ZXTIVC='0'                                                       
FQ710C                   EVAL      MVPIV1=*ZEROS                                                    
FQ710C                   EVAL      MVPIV2=*ZEROS                                                    
FQ710C                   ENDSL                                                                      
FQ710                                                                                               
FQ710 * Calculamos el precio de nueva linea o modificada                                            
FQ710C                   EVAL      XZCANT=1                                                         
FQ710C                   EVAL      XZPREC=S5PREC                                                    
FQ710C                   EVAL      XZCADP=S5CADP                                                    
FQ710C                   EVAL      XZDTO1=S5DTO1                                                    
FQ710C                   EVAL      XZDTO2=S5DTO2                                                    
FQ710C                   EVAL      XZDTO3=S5DTO3                                                    
FQ710C                   EVAL      XZDTO4=S5DTO4                                                    
FQ710C                   IF        XZDTO4=*ZEROS                                                    
FQ710C                   EVAL      XZDTO4=@PDTOE                                                    
FQ710C                   ENDIF                                                                      
FQ710C/COPY *LIBL/QSRDSRC,SRD022ECO                                                                 
FQ710C* AJUSTE Y DECIMALES                                                                          
FQ710C/COPY *LIBL/QSRDSRC,SRD001                                                                    
FQ710C                   Z-ADD     XZAUXI        ZXBIMPECO                                          
FQ710C/COPY *LIBL/QSRDSRC,SRD022                                                                    
FQ710                                                                                               
FQ710C* AJUSTE Y DECIMALES                                                                          
FQ710C/COPY *LIBL/QSRDSRC,SRD001                                                                    
FQ710C                   Z-ADD     XZAUXI        ZXBIMP                                             
FQ710C                   ADD       ZXBIMPECO     ZXBIMP                                             
FQ710 * Calculamos el IVA                                                                           
FQ710C                   EVAL      XZAUXI=ZXBIMP*MVPIV1                                             
FQ710C     XZAUXI        DIV(H)    100           XZAUXI                                             
FQ710C* AJUSTE Y DECIMALES                                                                          
FQ710C/COPY *LIBL/QSRDSRC,SRD001                                                                    
FQ710C                   Z-ADD     XZAUXI        ZXIIV1                                             
FQ710 * Calculamos el Recargo de equivalencia                                                       
FQ710C                   EVAL      XZAUXI=ZXBIMP*MVPIV2                                             
FQ710C     XZAUXI        DIV(H)    100           XZAUXI                                             
FQ710C* AJUSTE Y DECIMALES                                                                          
FQ710C/COPY *LIBL/QSRDSRC,SRD001                                                                    
FQ710C                   Z-ADD     XZAUXI        ZXIIV2                                             
FQ710                                                                                               
FQ710 * Omitimos BASE o IVA segun tipo de IVA                                                       
FQ710                                                                                               
FQ710C                   IF        MVOMTB>='1'                                                      
FQ710C                   EVAL      ZXBIMP=ZXBIMP-ZXBIMP                                             
FQ710C                   ENDIF                                                                      
FQ710C                   IF        MVOMTI>='1'                                                      
FQ710C                   EVAL      ZXIIV1=ZXIIV1-ZXIIV1                                             
FQ710C                   EVAL      ZXIIV2=ZXIIV2-ZXIIV2                                             
FQ710C                   ENDIF                                                                      
FQ710                                                                                               
FQ710C                   ENDSR                                                                      
20100 **************************************************************                                
20100 * Cargo Portes                                               *                                
20100 *------------------------------------------------------------*                                
20100C     CS_CARGPORT   BEGSR                                                                      
20100                                                                                               
20100C                   EVAL      T0PORT = 0                                                       
20100C                   EVAL      P_PECIAS=@PCIAS                                                  
20100C                   EVAL      P_PECTAB='PORT'                                                  
20100C                   EVAL      P_PECLTA='ARTICULO'                                              
20100C     KPMTABD       CHAIN     PMTABD                                                           
20100C                   IF        %FOUND(PMTABD)                                                   
20100C                   EVAL      ZXART_PORTES = P_PEDESC                                          
20100C                   ELSE                                                                       
20100C                   EVAL      ZXART_PORTES = *BLANKS                                           
20100C                   ENDIF                                                                      
20100                                                                                               
20100 * Detall Comandes Comercial                                                                   
20100C                   IF        ZXART_PORTES <> *BLANKS                                          
20100                                                                                               
20100C     KCOCAPE       SETLL     CODEPE                                                           
20100C     KCOCAPE       READE     CODEPE                                                           
20100C                   DOW       NOT %EOF(CODEPE)                                                 
20100C                   IF        S5ARTI = ZXART_PORTES                                            
20100C                             And S5STUL<'1'                                                   
20100C                   EVAL      T0PORT = 1                                                       
20100C                   ENDIF                                                                      
20100C     KCOCAPE       READE     CODEPE                                                           
20100C                   ENDDO                                                                      
20100                                                                                               
20100 * Recupero registre CODEPE                                                                    
20100C                   EVAL      S5CIAS=@PCIAS                                                    
20100C                   EVAL      S5DLGA=@PDLGA                                                    
20100C                   EVAL      S5NPCO=@PNPCO                                                    
20100C                   EVAL      S5TPED=@PTPED                                                    
20100C                   EVAL      S5DATP=@PDATP                                                    
20100C                   EVAL      S5NOPL=@PNOPL                                                    
20100C                   EVAL      S5LINE=@PLINE                                                    
20100C     KCODEPE       CHAIN     CODEPE                                                           
20100                                                                                               
20100C                   ENDIF                                                                      
20100                                                                                               
20100C                   ENDSR                                                                      
FQ726 **********************************************************************                        
FQ726 * Comprobar logísticas para servir desde productiva                                           
FQ726 **********************************************************************                        
FQ726C     CS_LOGISTI    BEGSR                                                                      
FQ726                                                                                               
FQ726 * Miro la logística de la linea del pedido                                                    
FQ726C                   EVAL      MICIAS=S5CIAS                                                    
FQ726C                   EVAL      MIDLGA=S5DLGA                                                    
FQ726C                   EVAL      MILGCA=S5LOGE                                                    
FQ726C     KMSLOGI       CHAIN     MSLOGI                                                           
FQ726 * Si es una logistica que va por Entrega Directa y no es OL                                   
FQ726C                   IF        %FOUND(MSLOGI) And MIMI01='1'                                    
FQ726C                             And MIALOL<>'1'                                                  
FQ726C                   EVAL      T0EDDP = 1                                                       
FQ726C                   ENDIF                                                                      
FQ726                                                                                               
FQ726C                   ENDSR                                                                      
      **********************************************************************                        
      * Rutina que graba registro en EDTRAU                                *                        
      **********************************************************************                        
     C     CS_UPD_EDTRAU BEGSR                                                                      
      *                                                                                             
      * Se quiere grabar registro de auditoría en EDTRAU?                                           
      *                                                                                             
     C                   IF        @PWAUD=1                                                         
      * TIMESTAMP                                                                                   
     C*                  EVAL      ZXTIM1 = %TIMESTAMP()                                            
     C*                  MOVEL     ZXTIM1        ZXTIMESTAMP                                        
     C*                  MOVEL     ZXTIMESTAMP   T1TMST                                             
      *                                                                                             
     C                   EVAL      T1CIAS=T0CIAS                                                    
     C                   EVAL      T1DLGA=T0DLGA                                                    
     C                   EVAL      T1NPCO=T0NPCO                                                    
     C                   EVAL      T1TPED=T0TPED                                                    
     C                   EVAL      T1DATP=T0DATP                                                    
     C                   EVAL      T1NOPL=T0NOPL                                                    
     C                   EVAL      T1LINE=T0LINE                                                    
     C                   EVAL      T1ARVM=T0ARVM                                                    
     C                   EVAL      T1ARV1=T0ARV1                                                    
     C                   EVAL      T1COM2=T0COM2                                                    
     C                   EVAL      T1ARV2=T0ARV2                                                    
     C                   EVAL      T1EDAU=@PEDAU                                                    
FQ726C**                 EVAL      T1EDAD=PEDESC                                                    
FQ726C                   EVAL      T1EDAD=ZXDESCAUD                                                 
     C                   EVAL      T1DATR=*DATE                                                     
     C                   TIME                    T1HORR                                             
     C                   EVAL      T1USER=SDSUSR                                                    
     C                   EVAL      T1JOBR=SDSJOB                                                    
     C                   EVAL      T1CANT=@PCANT                                                    
     C                   EVAL      T1EDER=*BLANKS                                                   
     C                   EVAL      T1EDAV=@PERAV                                                    
      *Selecciono si es error o avíso                                                               
     C                   SELECT                                                                     
      *Error                                                                                        
     C                   WHEN      @PEDAU='251'                                                     
     C                   EVAL      T1EDER=@PERAV                                                    
     C                   EVAL      T1EDAV=*BLANKS                                                   
      *Avíso                                                                                        
     C                   WHEN      @PEDAU='260'                                                     
     C                   EVAL      T1EDER=*BLANKS                                                   
     C                   EVAL      T1EDAV=@PERAV                                                    
     C                   ENDSL                                                                      
     C                   EVAL      T1TEXT=@PTEXT                                                    
     C                   EVAL      T1DATO=@PDATO                                                    
     C                   EVAL      T1PGMR=PEBL62                                                    
     C                   EVAL      T1STUL='0'                                                       
      *                                                                                             
      * Todos los eventos de eliminación de una línea de ED                                         
      * se graban directamente en el fichero de eliminaciones                                       
      * sino, en el fichero de ED gestionadas                                                       
      *                                                                                             
     C                   IF        @PEDAU='005' OR @PEDAU='009'                                     
     C                             OR @PEDAU='105' OR @PEDAU='109'                                  
     C                   DOU       *IN80=*OFF                                                       
     C                   EVAL      ZXTIM1 = %TIMESTAMP()                                            
     C                   MOVEL     ZXTIM1        ZXTIMESTAMP                                        
     C                   MOVEL     ZXTIMESTAMP   T1TMST                                             
     C                   WRITE     REDTRAX00                            80                          
     C                   ENDDO                                                                      
     C                   ELSE                                                                       
     C                   DOU       *IN80=*OFF                                                       
     C                   EVAL      ZXTIM1 = %TIMESTAMP()                                            
     C                   MOVEL     ZXTIM1        ZXTIMESTAMP                                        
     C                   MOVEL     ZXTIMESTAMP   T1TMST                                             
     C                   WRITE     REDTRAU00                            80                          
     C                   ENDDO                                                                      
     C                   ENDIF                                                                      
     C                                                                                              
     C                   ENDIF                                                                      
     C                                                                                              
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Procesa Posible E-Mail asociado                                            *                
      **********************************************************************                        
     C     CS_EMAIL      BEGSR                                                                      
      *                                                                                             
     C                   MOVE      '1'           @EMTENV                                            
     C                   MOVE      *BLANKS       @EMJOBN                                            
     C                   MOVE      *BLANKS       @EMEEMA                                            
     C                   MOVE      *BLANKS       @EMREMA                                            
     C                   MOVE      *BLANKS       @EMPGRE                                            
      *                                                                                             
     C                   EVAL      ZXQCMG=*BLANKS                                                   
     C                   EVAL      ZXQCMG='SBMJOB CMD(CALL ED0530'+                                 
     C                             ' PARM('+C(1)+@EMJOBN+C(1)+                                      
     C                             ' '+C(1)+@EMPGRE+C(1)+                                           
     C                             ' '+C(1)+@EMCIAA+C(1)+                                           
     C                             ' '+C(1)+@EMDLGA+C(1)+                                           
     C                             ' '+C(1)+@EMEVEN+C(1)+                                           
     C                             ' '+C(1)+@EMTENV+C(1)+                                           
     C                             ' '+C(1)+@EMCODE+C(1)+                                           
     C                             ' '+C(1)+@EMNDOC+C(1)+                                           
     C                             ' '+C(1)+@EMFDOC+C(1)+                                           
     C                             ' '+C(1)+@EMLDOC+C(1)+                                           
     C                             ' '+C(1)+@EMEEMA+C(1)+                                           
     C                             ' '+C(1)+@EMREMA+C(1)+'))'+                                      
     C                             ' JOBQ(*LIBL/QFACDIG) JOB(ED0530)'                               
      *                                                                                             
     C                   CALL      'QCMDEXC'                                                        
     C                   PARM                    ZXQCMG                                             
     C                   PARM                    ZXLOGG                                             
      *                                                                                             
     C                   ENDSR                                                                      
21050 **********************************************************************                        
21050 * AUDITO REGISTROS DE CLAVES DUPLICADAS EN EDTRLP                            *                
21050 **********************************************************************                        
21050C     CS_EDTRLD     BEGSR                                                                      
21050 *                                                                                             
21050C                   WRITE     REDTRLD                              80                          
21050 *                                                                                             
21050C                   ENDSR                                                                      
14N12 **************************************************************                                
14N12 * Traçabilitat GIC                                           *                                
14N12 **************************************************************                                
14N12C     CS_TRZGIC     BEGSR                                                                      
14N12 *                                                                                             
14N12 * Traçabilitat Comanda                                                                        
14N12C                   EVAL      DS3TIPO='3'                                                      
14N12C                   MOVEL     S5CIAS        DS3CIAS                                            
14N12C                   EVAL      DS3DLGA=S5DLGA                                                   
14N12C                   EVAL      DS3NPCO=S5NPCO                                                   
14N12C                   EVAL      DS3TPED=S5TPED                                                   
14N12C                   MOVEL     S5DATP        DS3DATP                                            
14N12C                   MOVEL     S5NOPL        DS3NOPL                                            
14N12C                   MOVEL     S5LINE        DS3LINE                                            
14N12C                   EVAL      DS3BLAN=*BLANKS                                                  
14N12                                                                                               
14N12 * Cerco si la comanda es del GIC                                 n                            
14N12C                   EVAL      V7CIAS=S5CIAS                                                    
14N12C                   EVAL      V7TRZD=DSTRZD3                                                   
14N12C     KPVDEVI05     CHAIN     PVDEVI05                                                         
14N12C                   IF        %Found(PVDEVI05)                                                 
14N12                                                                                               
14N12 * Actualitzo línia reclamació GIC                                n                            
14N12C                   EVAL      V1NDE2=V7NDE2                                                    
14N12C                   EVAL      V1LIN2=V7LIN2                                                    
14N12C     KPVDEVD10     SETLL     PVDEVD10                                                         
14N12C     KPVDEVD10     READE     PVDEVD10                                                         
14N12C                   DOW       NOT %EOF(PVDEVD10)                                               
14N12C                   EVAL      V1PEFD=ZXPEFD                                                    
14N12C                   EVAL      V1AMPL=X1AMPL                                                    
14N12C                   UPDATE    RPVDEVD                                                          
14N12C     KPVDEVD10     READE     PVDEVD10                                                         
14N12C                   ENDDO                                                                      
14N12                                                                                               
14N12C                   EVAL      T0NDE2=V1NDE2                                                    
14N12C                   EVAL      T0LIR2=V1LIN2                                                    
14N12                                                                                               
14N12C                   ENDIF                                                                      
14N12                                                                                               
14N12C                   ENDSR                                                                      
C1328 **********************************************************************                        
C1328 * Campo de Autorización Entrega Directa Desde Productiva             *                        
C1328 **********************************************************************                        
C1328C     CS_EDDP       BEGSR                                                                      
C1328 *                                                                                             
C1328c                   eval      U_C0CIAS=@PCIAS                                                  
C1328c                   eval      U_C0PRVR=C0PRVR                                                  
C1328c     KPUPROV       CHAIN     PUPROV                                                           
C1328c                   if        %found                                                           
C1328c                             and U_C0EDDP='1'                                                 
C1328c                   move      U_C0EDDP      T0EDDP                                             
C1328c                   endif                                                                      
C1328 *                                                                                             
C1328C                   ENDSR                                                                      
C1350 **************************************************************                                
C1350 * Bloqueo albaranes                                          *                                
C1350 **************************************************************                                
C1350C     CS_BLQALB     BEGSR                                                                      
C1350 *                                                                                             
C2501C                   MOVEL     S0CIAS        ZXCIAS                                             
C2501C                   EVAL      FileCoclin= 'PURLIBF' + ZXCIAS +                                 
C2501C                                          '/COCLIN'                                           
C2501C                   OPEN (E)  COCLIN                                                           
C2501C                   IF        Not %ERROR                                                       
C1350C                   IF        T0RISK<>1                                                        
C1350C     KCOCLIN       CHAIN     COCLIN                                                           
13614C*                  IF        L_S0BABB='1'                                                     
13614C                   IF        L_S0BABB>='1'                                                    
C1350C                   EVAL      T0RISK=2                                                         
C1350C                   ENDIF                                                                      
C1350C                   ENDIF                                                                      
C2501C                   ENDIF                                                                      
C2501C                   CLOSE(E)  COCLIN                                                           
C1350                                                                                               
C1350C                   ENDSR                                                                      
C1350 **************************************************************                                
C1350 * Desbloqueo albaranes                                       *                                
C1350 **************************************************************                                
C1350C     CS_DESBLQALB  BEGSR                                                                      
C1350 *                                                                                             
C2501C                   MOVEL     S0CIAS        ZXCIAS                                             
C2501C                   EVAL      FileCoclin= 'PURLIBF' + ZXCIAS +                                 
C2501C                                          '/COCLIN'                                           
C2501C                   OPEN (E)  COCLIN                                                           
C2501C                   IF        Not %ERROR                                                       
C1350C                   IF        T0RISK<>0                                                        
C1350C     KCOCLIN       CHAIN     COCLIN                                                           
13614C*                  IF        L_S0BABB='1'                                                     
13614C                   IF        L_S0BABB>='1'                                                    
C1350C                   EVAL      T0RISK=2                                                         
C1350C                   ELSE                                                                       
C1350C                   EVAL      T0RISK=0                                                         
C1350C                   ENDIF                                                                      
C1350C                   ENDIF                                                                      
C2501C                   ENDIF                                                                      
C2501C                   CLOSE(E)  COCLIN                                                           
C1350                                                                                               
C1350C                   ENDSR                                                                      
C2185 **************************************************************                                
C2185 * Actualizar datos de TRACE en EDITRC                        *                                
C2185 **************************************************************                                
C2185C     CS_EDITRC     BEGSR                                                                      
C2185 *                                                                                             
C2185 * Buscamos todos los registros del pedido de la comercial en EDITRC                           
C2185 * y los actualizamos con los datos del pedido de TRACE                                        
C2185 *                                                                                             
C2501C                   EVAL      ZXEDITRC='0'                                                     
C2185C                   EVAL      T5CIAS=T0CIAS                                                    
C2185C                   EVAL      T5DLGA=T0DLGA                                                    
C2185C                   EVAL      T5NPCO=T0NPCO                                                    
C2185C                   EVAL      T5TPED=T0TPED                                                    
C2185C                   EVAL      T5DATP=T0DATP                                                    
C2185C                   EVAL      T5NOPL=T0NOPL                                                    
C2185C                   EVAL      T5LINE=T0LINE                                                    
C2185C     KEDITRC       SETLL     EDITRC                                                           
C2185C     KEDITRC       READE     EDITRC                                 83                        
C2185C                   DOW       NOT %EOF(EDITRC)                                                 
C2501C                   EVAL      ZXEDITRC='1'                                                     
C2185C                   EXSR      CS_UPD_EDITRC                                                    
C2185C     KEDITRC       READE     EDITRC                                 83                        
C2185C                   ENDDO                                                                      
C2185 *                                                                                             
C2501 * Si el pedido ha entrado manualmente y no via EDI mediante el                                
C2501 * EDIORD4 o el EDIORD6 lo grabamos ahora como un pedido normal                                
C2501 * sin localizaciones                                                                          
C2501 *                                                                                             
C2501C                   IF        ZXEDITRC='0'                                                     
C2501C                   EXSR      CS_GRA_EDITRC                                                    
C2501C                   ENDIF                                                                      
C2501 *                                                                                             
C2185C                   ENDSR                                                                      
C2185 **************************************************************                                
C2185 * Actualizar datos de TRACE en EDITRC                        *                                
C2185 **************************************************************                                
C2185C     CS_UPD_EDITRC BEGSR                                                                      
C2185 *                                                                                             
C2185 *  Reserva en TRACE (asignamos el pedido de TRACE)                                            
C2185 *                                                                                             
C2185C                   IF        @PEDAU='301'                                                     
C2185C                   EVAL      T5CIA3=T0CIA3                                                    
C2185C                   EVAL      T5DLG3=T0DLG3                                                    
C2185C                   EVAL      T5NPC3=T0NPC3                                                    
C2185C                   EVAL      T5TPE3=T0TPE3                                                    
C2185C                   EVAL      T5DAT3=T0DAT3                                                    
C2185C                   EVAL      T5NOP3=T0NOP3                                                    
C2185C                   EVAL      T5LIN3=T0LIN3                                                    
C2185C                   ENDIF                                                                      
C2185 *                                                                                             
C2185 *  Desreserva en TRACE (desasignamos el pedido de TRACE)                                      
C2185 *                                                                                             
C2185C                   IF        @PEDAU='302'                                                     
C2185C                   EVAL      T5CIA3=*ZEROS                                                    
C2185C                   EVAL      T5DLG3=*BLANKS                                                   
C2185C                   EVAL      T5NPC3=*BLANKS                                                   
C2185C                   EVAL      T5TPE3=*BLANKS                                                   
C2185C                   EVAL      T5DAT3=*ZEROS                                                    
C2185C                   EVAL      T5NOP3=*ZEROS                                                    
C2185C                   EVAL      T5LIN3=*ZEROS                                                    
C2185C                   ENDIF                                                                      
C2185 *                                                                                             
C2185C                   UPDATE    REDITRC                              83                          
C2185 *                                                                                             
C2185C                   ENDSR                                                                      
C2185 **************************************************************                                
C2501 * Grabar datos del pedido en EDITRC                          *                                
C2501 **************************************************************                                
C2501C     CS_GRA_EDITRC BEGSR                                                                      
R2185C                   CLEAR                   REDITRC                                            
C2501 *                                                                                             
C2501 * Datos de localización (no hay)                                                              
C2501 *                                                                                             
C2501C                   EVAL      T5CLA1=*BLANKS                                                   
C2501C                   EVAL      T5CLA2=*BLANKS                                                   
C2501C                   EVAL      T5CLA3=*BLANKS                                                   
C2501C                   EVAL      T5LLOC=*BLANKS                                                   
C2501C***                EVAL      T5CANT=*ZEROS                                                    
C2501C                   EVAL      T5DATE=*BLANKS                                                   
C2501C                   EVAL      T5DATU=*BLANKS                                                   
C2501 *                                                                                             
C2501 * Datos de CODEPE (desde EDTRLP)                                                              
C2501 *                                                                                             
C2501C                   EVAL      T5CIAS=T0CIAS                                                    
C2501C                   EVAL      T5DLGA=T0DLGA                                                    
C2501C                   EVAL      T5NPCO=T0NPCO                                                    
C2501C                   EVAL      T5TPED=T0TPED                                                    
C2501C                   EVAL      T5DATP=T0DATP                                                    
C2501C                   EVAL      T5NOPL=T0NOPL                                                    
C2501C                   EVAL      T5LINE=T0LINE                                                    
C2501C                   EVAL      T5CANT=T0CANT                                                    
C2501C                   EVAL      T5ARVP=T0ARVM                                                    
C2501C                   EVAL      T5CUST=T0CUST                                                    
C2501 *                                                                                             
C2501 * Datos de COCEDI (Sucursal y Dpto)                                                           
C2501 *                                                                                             
C2501C                   MOVEL     T0CIAS        ZXCIAS                                             
C2501C                   EVAL      FileCocedi= 'PURLIBF' + ZXCIAS +                                 
C2501C                                          '/COCEDI'                                           
C2501C                   OPEN (E)  COCEDI                                                           
C2501C                   IF        Not %ERROR                                                       
C2501C                   EVAL      ED_S0CIAS=T0CIAS                                                 
C2501C                   EVAL      ED_S0CUST=T0CUST                                                 
C2501C     KCOCEDI       CHAIN     COCEDI                             81                            
C2501C                   IF        %FOUND(COCEDI)                                                   
C2501*                  EVAL      T5SUCU=ED_S0SUCU                                                 
C2501C                   IF        T5SUCU=' '                                                       
C2501C                   EVAL      T5SUCU=ED_S0RECE                                                 
C2501C                   ENDIF                                                                      
C2501C                   EVAL      T5SUCD=ED_S0SUCD                                                 
C2501C                   ENDIF                                                                      
C2501C                   ENDIF                                                                      
C2501C                   CLOSE(E)  COCEDI                                                           
C2501 *                                                                                             
C2501 * Datos de CODIPR (Dirección de entrega) (desde EDTRLP)                                       
C2501 *                                                                                             
C2501C                   MOVEL     T0CIAS        ZXCIAS                                             
C2501C                   EVAL      FileCodipr= 'PURLIBF' + ZXCIAS +                                 
C2501C                                          '/CODIPR'                                           
C2501C                   OPEN (E)  CODIPR                                                           
C2501C                   IF        Not %ERROR                                                       
C2501C                   EVAL      S2CIAS=T0CIAS                                                    
C2501C                   EVAL      S2CUST=T0CUST                                                    
C2501C                   EVAL      S2TDIR=T0TDI1                                                    
C2501C     KCODIPR       CHAIN     CODIPR                             81                            
C2501C                   IF        %FOUND(CODIPR)                                                   
C2501C                   EVAL      T5RAOS=S2RAOS                                                    
C2501C                   EVAL      T5RAO2=S2RAO2                                                    
C2501C                   EVAL      T5DPTO=S2DPTO                                                    
C2501C                   EVAL      T5DIRE=S2DIRE                                                    
C2501C                   EVAL      T5DIR2=S2DIR2                                                    
C2501C                   EVAL      T5POBL=S2POBL                                                    
C2501C                   EVAL      T5POST=S2POST                                                    
C2501C                   EVAL      T5PAIS=S2PAIS                                                    
C2501C                   EVAL      T5ETES=S2ETES                                                    
C2501C                   ELSE                                                                       
C2501C                   EVAL      T5RAOS=*BLANKS                                                   
C2501C                   EVAL      T5RAO2=*BLANKS                                                   
C2501C                   EVAL      T5DPTO=*BLANKS                                                   
C2501C                   EVAL      T5DIRE=*BLANKS                                                   
C2501C                   EVAL      T5DIR2=*BLANKS                                                   
C2501C                   EVAL      T5POBL=*BLANKS                                                   
C2501C                   EVAL      T5POST=*BLANKS                                                   
C2501C                   EVAL      T5PAIS=*BLANKS                                                   
C2501C                   EVAL      T5ETES=*BLANKS                                                   
C2501C                   ENDIF                                                                      
C2501 *                                                                                             
C2501 * Si la marca de imprimir etiquetas especiales de CODIPR=b ó '0'                              
C2501 * movemos la que tiene el cliente en COCLIN.L_S0ETES                                          
C2501 *                                                                                             
C2501C                   MOVEL     T0CIAS        ZXCIAS                                             
C2501C                   EVAL      FileCoclin= 'PURLIBF' + ZXCIAS +                                 
C2501C                                          '/COCLIN'                                           
C2501C                   OPEN (E)  COCLIN                                                           
C2501C                   IF        Not %ERROR                                                       
C2501C                   IF        S2ETES=*BLANKS OR S2ETES='0'                                     
C2501C                   EVAL      S0CIAS=T0CIAS                                                    
C2501C                   EVAL      S0CUST=T0CUST                                                    
C2501C     KCOCLIN       CHAIN     COCLIN                                                           
C2501C                   EVAL      T5ETES=L_S0ETES                                                  
C2501C                   ENDIF                                                                      
C2501C                   ENDIF                                                                      
C2501C                   CLOSE(E)  COCLIN                                                           
C2501 *                                                                                             
C2501C                   ENDIF                                                                      
C2501C                   CLOSE(E)  CODIPR                                                           
C2501 *                                                                                             
C2501 * Como el pedido no tiene EDIHPE (LOCLPED) quiere decir que el                                
C2501 * pedido no tiene localizaciones y por tanto no es consolidado                                
C2501 *                                                                                             
C2501C                   EVAL      T5MCON='0'                                                       
C2501 *                                                                                             
C2501 *  Reserva en TRACE (asignamos el pedido de TRACE)                                            
C2501 *                                                                                             
C2501C                   EVAL      T5CIA3=T0CIA3                                                    
C2501C                   EVAL      T5DLG3=T0DLG3                                                    
C2501C                   EVAL      T5NPC3=T0NPC3                                                    
C2501C                   EVAL      T5TPE3=T0TPE3                                                    
C2501C                   EVAL      T5DAT3=T0DAT3                                                    
C2501C                   EVAL      T5NOP3=T0NOP3                                                    
C2501C                   EVAL      T5LIN3=T0LIN3                                                    
C2501 *                                                                                             
C2501 * Buscamos la referencia del pedido de la comercial (S5REFE)                                  
C2501 *                                                                                             
C2501C                   MOVEL     T0CIAS        ZXCIAS                                             
C2501C                   EVAL      FileCodepe26= 'PURLIBF' + ZXCIAS +                               
C2501C                                          '/CODEPE26'                                         
C2501C                   OPEN (E)  CODEPE26                                                         
C2501C                   IF        Not %ERROR                                                       
C2501C                   EVAL      DP_S5CIAS=T0CIAS                                                 
C2501C                   EVAL      DP_S5DLGA=T0DLGA                                                 
C2501C                   EVAL      DP_S5NPCO=T0NPCO                                                 
C2501C                   EVAL      DP_S5TPED=T0TPED                                                 
C2501C                   EVAL      DP_S5DATP=T0DATP                                                 
C2501C                   EVAL      DP_S5NOPL=T0NOPL                                                 
C2501C     KCODEPE26     CHAIN     CODEPE26                                                         
C2501C                   IF        %FOUND(CODEPE26)                                                 
C2501C                   EVAL      T5REFE=DP_S5REFE                                                 
C2501C                   ENDIF                                                                      
C2501C                   ENDIF                                                                      
C2501C                   CLOSE(E)  CODEPE26                                                         
C2501 *                                                                                             
C2501 * Si es conjunto desdoblamos el registro y grabamos uno por cada                              
C2501 * componente de MSCOJD                                                                        
C2501 *                                                                                             
C2501C                   EVAL      T5COMP=*BLANKS                                                   
C2501C                   EVAL      T5LIN2=0                                                         
C2501C                   EVAL      T5CANS=0                                                         
C2501 *                                                                                             
C2501C                   EVAL      NDCIAS=T0CIAS                                                    
C2501C                   EVAL      NDARTI=%SUBST(T0ARVM:1:15)                                       
C2501C                   EVAL      NDVARI=%SUBST(T0ARVM:16:3)                                       
C2501C                   EVAL      NDMODE=%SUBST(T0ARVM:19:3)                                       
C2501C                   EVAL      NDTCOJ='4'                                                       
C2501C     KMSCOJC       CHAIN     MSCOJC                             83                            
C2501C                   IF        %FOUND(MSCOJC) AND NDBAJA<'1'                                    
C2501C     KMSCOJD0      SETLL     MSCOJD                                                           
C2501C     KMSCOJD0      READE     MSCOJD                                 83                        
C2501C                   DOW       NOT %EOF(MSCOJD)                                                 
C2501C                   IF        NDBAJA<'1'                                                       
C2501C                   EVAL      T5COMP=NDCOMP+NDVAR2+NDMOD2                                      
C2501C                   EVAL      T5LIN2+=1                                                        
C2501C                   EVAL      T5CANS=T5CANT*NDCANT                                             
C2501C                   WRITE     REDITRC                                                          
C2501C                   ENDIF                                                                      
C2501C     KMSCOJD0      READE     MSCOJD                                 83                        
C2501C                   ENDDO                                                                      
C2501 *                                                                                             
C2501C                   ELSE                                                                       
C2501 *                                                                                             
C2501 * Si no es conjunto no desdoblamos el registro                                                
C2501 *                                                                                             
C2501C                   WRITE     REDITRC                                                          
C2501C                   ENDIF                                                                      
C2501 *                                                                                             
C2501C                   ENDSR                                                                      
C2501 **************************************************************                                
C2684 * Proceso auditoría 232 eliminación X-doc                                                     
C2684 **********************************************************************                        
C2684C     CS_COD232     BEGSR                                                                      
C2684 *                                                                                             
C2684 * Recupero la clave del EDTRLP según el parámetro del lógico                                  
C2684 *                                                                                             
C2684C                   SELECT                                                                     
C2684C                   WHEN      @PLOGI=0                                                         
C2684C                   EVAL      T0CIAS=@PCIAS                                                    
C2684C                   EVAL      T0DLGA=@PDLGA                                                    
C2684C                   EVAL      T0NPCO=@PNPCO                                                    
C2684C                   EVAL      T0TPED=@PTPED                                                    
C2684C                   EVAL      T0DATP=@PDATP                                                    
C2684C                   EVAL      T0NOPL=@PNOPL                                                    
C2684C                   EVAL      T0LINE=@PLINE                                                    
C2684C                                                                                              
C2684C                   WHEN      @PLOGI=1                                                         
C2684C                   EVAL      T0CIA1=@PCIAS                                                    
C2684C                   EVAL      T0DLG1=@PDLGA                                                    
C2684C                   EVAL      T0NPC1=@PNPCO                                                    
C2684C                   EVAL      T0TPE1=@PTPED                                                    
C2684C                   EVAL      T0DAT1=@PDATP                                                    
C2684C                   EVAL      T0NOP1=@PNOPL                                                    
C2684C                   EVAL      T0LIN1=@PLINE                                                    
C2684C                                                                                              
C2684C                   WHEN      @PLOGI=2                                                         
C2684C                   EVAL      T0CIA2=@PCIAS                                                    
C2684C                   EVAL      T0DLG2=@PDLGA                                                    
C2684C                   EVAL      T0NPC2=@PNPCO                                                    
C2684C                   EVAL      T0TPE2=@PTPED                                                    
C2684C                   EVAL      T0DAT2=@PDATP                                                    
C2684C                   EVAL      T0NOP2=@PNOPL                                                    
C2684C                   EVAL      T0LIN2=@PLINE                                                    
C2684C                                                                                              
C2684C                   WHEN      @PLOGI=3                                                         
C2684C                   EVAL      T0CIA3=@PCIAS                                                    
C2684C                   EVAL      T0DLG3=@PDLGA                                                    
C2684C                   EVAL      T0NPC3=@PNPCO                                                    
C2684C                   EVAL      T0TPE3=@PTPED                                                    
C2684C                   EVAL      T0DAT3=@PDATP                                                    
C2684C                   EVAL      T0NOP3=@PNOPL                                                    
C2684C                   EVAL      T0LIN3=@PLINE                                                    
C2684C                                                                                              
C2684C                   ENDSL                                                                      
C2684C                                                                                              
C2684 * Leo archivo de trazabilidad y actualizo los campos correspondientes                         
C2684C                                                                                              
C2684C                   EVAL      *IN82=*OFF                                                       
C2684C                                                                                              
C2684C                   SELECT                                                                     
C2684C                   WHEN      @PLOGI=0                                                         
C2684C     KEDTRLP00     SETLL     EDTRLP00                                                         
C2684C                   WHEN      @PLOGI=1                                                         
C2684C     KEDTRLP10     SETLL     EDTRLP10                                                         
C2684C                   WHEN      @PLOGI=2                                                         
C2684C     KEDTRLP20     SETLL     EDTRLP20                                                         
C2684C                   WHEN      @PLOGI=3                                                         
C2684C     KEDTRLP30     SETLL     EDTRLP30                                                         
C2684C                   ENDSL                                                                      
C2684C                                                                                              
C2684C                   DOW       *IN82=*OFF                                                       
C2684C                                                                                              
C2684C                   SELECT                                                                     
C2684C                   WHEN      @PLOGI=0                                                         
C2684C     KEDTRLP00     READE     EDTRLP00                               82                        
C2684C                   WHEN      @PLOGI=1                                                         
C2684C     KEDTRLP10     READE     EDTRLP10                               82                        
C2684C                   WHEN      @PLOGI=2                                                         
C2684C     KEDTRLP20     READE     EDTRLP20                               82                        
C2684C                   WHEN      @PLOGI=3                                                         
C2684C     KEDTRLP30     READE     EDTRLP30                               82                        
C2684C                   ENDSL                                                                      
C2684C                                                                                              
C2684C                   IF        *IN82=*OFF                                                       
C2684C                                                                                              
C2684 * Este evento es la creación de un albarán X-DOCK.                                            
C2684 * por tanto actualizo los campos:                                                             
C2684C                   EVAL      T0XDOC=0                                                         
C2684C                   EVAL      T0DWRF=*DATE                                                     
C2684C                   TIME                    T0HWRF                                             
C2684C                                                                                              
C2684C                   SELECT                                                                     
C2684C                   WHEN      @PLOGI=0                                                         
C2684C                   UPDATE    REDTRLP00                            83                          
C2684C   83              EXSR      CS_EDTRLD                                                        
C2684C                   WHEN      @PLOGI=1                                                         
C2684C                   UPDATE    REDTRLP10                            83                          
C2684C   83              EXSR      CS_EDTRLD                                                        
C2684C                   WHEN      @PLOGI=2                                                         
C2684C                   UPDATE    REDTRLP20                            83                          
C2684C   83              EXSR      CS_EDTRLD                                                        
C2684C                   WHEN      @PLOGI=3                                                         
C2684C                   UPDATE    REDTRLP30                            83                          
C2684C   83              EXSR      CS_EDTRLD                                                        
C2684C                   ENDSL                                                                      
C2684C                                                                                              
C2684C                   ENDIF                                                                      
C2684C                                                                                              
C2684C                   ENDDO                                                                      
C2684C                                                                                              
C2684 *                                                                                             
C2684 * Se quiere grabar registro de auditoría en EDTRAU?                                           
C2684 *                                                                                             
C2684C                   EXSR      CS_UPD_EDTRAU                                                    
C2684 *                                                                                             
C2684 * Posible E-Mail con datos del pedido de compra                                               
C2684 *                                                                                             
C2684C                   MOVEL(P)  T0CIA2        @EMCIAA                                            
C2684C                   MOVEL(P)  T0DLG2        @EMDLGA                                            
C2684C                   MOVEL(P)  T0CUST        @EMCODE                                            
C2684C                   MOVEL(P)  T0NPC2        @EMNDOC                                            
C2684C                   MOVE      T0DAT2        @EMFDOC                                            
C2684C                   MOVE      T0LIN2        @EMLDOC                                            
C2684 *                                                                                             
C2684C                   ENDSR                                                                      
IT228 **********************************************************************                        
IT228C     CS_EXCEPM3    BEGSR                                                                      
IT228C                                                                                              
IT228C                   EVAL      C3CIAS = T0CIAS                                                  
IT228C                   EVAL      C3PRVR = T0PRVR                                                  
IT228C                   EVAL      C3ARVM = T0ARV1                                                  
IT228C     KPUPRP0       CHAIN     PUPRP0                                                           
IT228 *                                                                                             
IT228C                   IF        %FOUND AND C3ARVP<>*BLANKS                                       
IT228C                   EVAL      @PEARVP = C3ARVP                                                 
IT228C                   ELSE                                                   %FOUND(PUPRP0)      
IT228C                   EVAL      @PEARVP = T0ARV1                                                 
IT228C                   ENDIF                                                  %FOUND(PUPRP0)      
IT228 * Obtener almacén de servicio                                                                 
IT228 *                                                                                             
IT228C                   IF        M5SIOL<>'2'                                                      
IT228C                   EVAL      P_PECIAS=C5CIAS                                                  
IT228C                   EVAL      P_PECTAB='INO2'                                                  
IT228C                   EVAL      P_PECLTA='MAGV'+C5LOGE                                           
IT228C     KPMTABD       CHAIN     PMTABD                                                           
IT228C                   IF        %FOUND(PMTABD)                                                   
IT228C                   EVAL      @PEALMA=P_PEDESC                                                 
IT228C                   ELSE                                                                       
IT228C                   EVAL      @PEALMA=C5LOGE                                                   
IT228C                   ENDIF                                                                      
IT228C                   ELSE                                                                       
IT228C                   EVAL      @PEALMA=C5LOGE                                                   
IT228C                   ENDIF                                                                      
IT228C                   CALL      'MM1411'                                                         
IT228C                   PARM                    C5CIAS                                             
IT228C                   PARM                    @PEALMA                                            
IT228C                   PARM      '2'           @PETIPO                                            
IT228C                   PARM                    C5DLGA                                             
IT228C                   PARM                    @PERESP                                            
IT228 *                                                                                             
IT228C                   IF        @PERESP <> *BLANKS                                               
IT228C                   EVAL      @PEAlm1= @PERESP                                                 
IT228C                   ELSE                                                                       
IT228C                   EVAL      @PEAlm1 = C5loge                                                 
IT228C                   ENDIF                                                                      
IT228 *                                                                                             
IT228C                   CALL      'ED2530'                                                         
IT228C                   PARM                    T0CIAS                                             
IT228C                   PARM                    T0PRVR                                             
IT228C                   PARM                    @PEARVP                                            
IT228C                   PARM                    @PEALM1                                            
IT228C                   PARM                    @PEALM2                                            
IT228C                   PARM                    @PEINFO                                            
IT228 *                                                                                             
IT228C                   IF        @PEINFO='A' OR @PEINFO='P'                                       
IT228C                   EVAL      %SUBST(T0INFD:9:1) = '*'                                         
IT228 *                                                                                             
IT228C                   ENDIF                                                  %FOUND(EDTRLP10)    
IT228 *                                                                                             
IT228C                   ENDSR                                                                      
IT228 **********************************************************************                        
PG615 **************************************************************                                
PG615 *                                                                                             
PG615 *------------------------------------------------------------*                                
PG615C     LLAMA1413     BEGSR                                                                      
PG615                                                                                               
PG615c                   eval      iCnt=*zero                                                       
PG615 * 1er.- Validar si aquesta comanda M3 ja l'hem processat                                      
PG615c                   if        iLnpc2>*zero                                                     
PG615c                   eval      iCnt=%lookup(t0npc2:T_npc2:1:iLnpc2)                             
PG615c                   endif                                                                      
PG615c                   if        iCnt=*zero                                                       
PG615 * 2on.- NO l'hem processat, guardem comanda M3                                                
PG615c                   eval      iLnpc2 += 1                                                      
PG615c                   eval      T_npc2(iLnpc2)=t0npc2                                            
PG615 * 3er.- Actualitzem COCAPE                                                                    
PG615C                   eval      S0CIAS=T0CIAS                                                    
PG615C                   eval      S0DLGA=T0DLGA                                                    
PG615C                   eval      S0NPCO=T0NPCO                                                    
PG615C                   eval      S0TPED=T0TPED                                                    
PG615C                   eval      S0DATP=T0DATP                                                    
PG615C                   eval      S0NOPL=T0NOPL                                                    
PG615C     KCOCAPE       chain     cocape                                                           
E7394c                   if        %found(cocape)                                                   
PG615c                   select                                                                     
PG615c                   when      T0RISK = 2                                                       
PG615c                   eval      S0REXC = '1'                                                     
PG615c                   when      T0RISK = 0                                                       
PG615c                   eval      S0REXC = '0'                                                     
PG615c                   endsl                                                                      
PG615C                   update    rcocape                                                          
PG615 *                                                                                             
PG615 * 3er.- Llençar alineació amb M3                                                              
PG615c                   eval      bkcias = t0cias                                                  
PG615c                   eval      bkdlga = t0dlga                                                  
PG615c                   eval      bknpco = t0npco                                                  
PG615c                   eval      bktped = t0tped                                                  
PG615c                   eval      bkdatp = t0datp                                                  
PG615c                   eval      bknopl = t0nopl                                                  
PG615c                   eval      Tlin(1)= t0line                                                  
PG615c                   eval      pPointer = %addr(dsMM1413)                                       
PG615 *                                                                                             
PG615c                   call      'MM1413'                                                         
PG615c                   parm                    pPointer                                           
E7394c                   endif                                                  %found(cocape)      
PG615 *                                                                                             
PG615c                   endif                                                                      
PG615C                   ENDSR                                                                      
PG615 **********************************************************************                        
** CTDATA C                                                                                         
'                                                                                                   
