      **************************************************************                                
      * APLICACIÓ: MÒDUL DE COMPRES                                *                                
      **************************************************************                                
      * TITOL: ED1000  © Fluidra                                   *                                
      * DATA CREACIO:  06/11/2013       CHANGE REQUEST:  CR0646    *                                
      * FUNCIO DEL PROGRAMA: SIMULACIÓN ALGORITMO DECISION         *                                
      *                                                            *                                
      * DOCUMENTACIO:                                              *                                
      *                                                            *                                
      * ZXOPT1 = NOM DEL PROCÉS                                    *                                
      *        - SN = SUBFITXER N.          N=[01,02,...,99]       *                                
      *        - N TAMBÉ EQUIVAL AL NÚMERO DE FORMAT DEL SFL       *                                
      *          I COINCIDEIX AMB EL Nº DE LÒGIC (ESSENT N=00 EL   *                                
      *          FITXER FÍSIC)                                     *                                
      * ZXOPT2 = RUTINA DINTRE DEL PROCÉS                          *                                
      *        - 'INZ'= INICILITZAR                                *                                
      *        - 'DSP'= VISUALITZA DE PANTALLA                     *                                
      *        - 'CHK'= VALIDACIÓ DE LA PANTALLA                   *                                
      *        - 'CLR'= NETEJA DEL SFL                             *                                
      *        - 'UPD"= ACTUALITZACIONS DELS FITXERS               *                                
      *                                                            *                                
      * ZXNNN00= Últim nº de registre carregat en subarxiu         *                                
      * ZXNRR00= Numerador de registres de subarxiu                *                                
      * ZXCOUNT= ZXNRR00 del 1er registre de la últ. pag.          *                                
      *          que visualizaba el usuario                        *                                
      * ZXLOP00= Numerador de registres en carrega de pantalla     *                                
      * SUFRCDN= SFLRCDNBR del subarxiu                            *                                
      * PREFIXE DE CAMP: CCC- (CAMP COMÚ DE CAPÇALERA: CAMP QUE EL *                                
      *        SEU CONTINGUT NO VARIA EN LES ALTRES CAPÇALERES DE  *                                
      *        L'APLICACIÓ. P.EX.: NOM DEL PGM O DEL TREBALL)      *                                
      *                                                            *                                
      * CS_(NOM): COMMON SUBRUTINE (COL·LOCADES FINAL PGM)        *                                 
      * @PE(NOM) : PARAMETRES D'EXPORTACIÓ                         *                                
      **************************************************************                                
C1632 * DATA DE MODIFICACIÓ: 29/01/2014  MARCA: C1632                          *                    
C1632 * AUTOR: JRGONZALEZ                                                      *                    
C1632 * DOCUMENTACIÓ: Grabacion de la fecha de simulacion                      *                    
C1632 **************************************************************************                    
CR653 *      Modificació: CR653                                                                     
CR653 *            Autor: X.Bou                                                                     
CR653 * Data modificació: 28/10/2013                                                                
CR653 *       Descripció: Tratamiento Proveedores externos en Fluidra                               
CR653 *                   Direct: No cal fer comprobacions d'estoc                                  
CR653 *                   perque asumim que sempre tenen estoc i sempre                             
CR653 *                   es tractan el articles com si no tinguesin                                
CR653 *                   M5SIOL='2'                                                                
CR653 **************************************************************                                
C1158 * DATA DE MODIFICACIÓ: 06/03/2014  MARCA: C1158              *                                
C1158 * AUTOR: MALONSO                                             *                                
C1158 * DOCUMENTACIÓ: Añadir gestión de artículos equivalentes     *                                
C1158 *               en la entrada de pedidos                     *                                
C1158 **************************************************************                                
Q0316 * DATA DE MODIFICACIÓ: 23/04/2014  MARCA: Q0316              *                                
Q0316 * AUTOR: JMARTINEZP                                          *                                
Q0316 * DOCUMENTACIÓ: INCIDENCIA FECHA CABECERA                    *                                
Q0316 **************************************************************                                
C1078 * DATA DE MODIFICACIÓ: 19/01/2012  MARCA: C1078              *                                
C1078 * AUTOR: JMARTINEZP                                          *                                
C1078 * DOCUMENTACIÓ: DOM                                          *                                
C1078 **************************************************************                                
M1078 * DATA DE MODIFICACIÓ: 19/01/2012  MARCA: M1078              *                                
M1078 * AUTOR: JMARTINEZP                                          *                                
M1078 * DOCUMENTACIÓ: DOM - INCLUIR MEJORA IDENTIFICACION CASOS    *                                
M1078 **************************************************************                                
M1078 * DATA DE MODIFICACIÓ: 19/01/2012  MARCA: N1078              *                                
M1078 * AUTOR: JMARTINEZP                                          *                                
M1078 * DOCUMENTACIÓ: INCIDENCIA AL ACTUALIZAR COCAPE27            *                                
M1078 **************************************************************                                
C1865 * DATA DE MODIFICACIÓ: 08/05/2014  MARCA: C1865              *                                
C1865 * AUTOR: VGARCES                                             *                                
C1865 * DOCUMENTACIÓ: ERROR EN ALMACENES DE BAJA                   *                                
C1865 **************************************************************                                
                                                                                                    
F-2OL **************************************************************                                
F-2OL * DATA DE MODIFICACIÓ: 01/12/2021  MARCA: F-2OL              *                                
F-2OL * AUTOR: David Grau                                          *                                
F-2OL * DOCUMENTACIÓ: 2OL- Obrir a més d'un OL                     *                                
F-2OL **************************************************************                                
      *                                                                                             
     H DATEDIT(*YMD/) OPTION(*NODEBUGIO:*SRCSTMT)                                                   
C2510 **************************************************************                                
IT228 * DATA DE MODIFICACIÓ: 24/09/2021  MARCA: IT228              *                                
IT228 * AUTOR: DGrau                                               *                                
IT228 * DOCUMENTACIÓ: 2OL- Obrir a més d'un OL                     *                                
IT228 **************************************************************                                
      *                                                                                             
     FED1000FM  CF   E             WORKSTN INFDS(SFLDS)                                             
     F                                     SFILE(SUFD:ZXNRR00)                                      
C1632F                                     SFILE(SUFD2:ZXNRR00)                                     
     F                                     USROPN                                                   
C1158F*C1632   CODEPE26  IF   E           K DISK    RENAME(RCODEPE:R26)                             
C1158FCODEPE08  UF   E           K DISK    RENAME(RCODEPE:R08)                                      
C1632FCODEPE40  UF   E           K DISK    RENAME(RCODEPE:R40)                                      
     FED0050W   UF   E           K DISK                                                             
     FCOCAPE    UF A E           K DISK                                                             
     FCODEPE    UF A E           K DISK                                                             
     FCOCLIN    IF   E           K DISK    PREFIX(C_)                                               
     FCOCAIM    IF   E           K DISK                                                             
C1158FMSCOJC    IF   E           K DISK                                                             
     FMSDIV0    IF   E           K DISK                                                             
     FMSIVAS    IF   E           K DISK                                                             
     FPMUNAL    IF   E           K DISK                                                             
     FMSTSCA    IF   E           K DISK                                                             
     FMSARTI00  IF   E           K DISK                                                             
     FMSALMA    IF   E           K DISK                                                             
IT228FMSALMA08  IF   E           K DISK    rename(rmsalma:rmsalma08) usropn                         
     FMSALMA05  IF   E           K DISK    RENAME(RMSALMA:RMSALMA05)                                
     FMSLOGI    IF   E           K DISK                                                             
     FCODIPE    IF   E           K DISK                                                             
     FMSPAIS    IF   E           K DISK                                                             
     FMSSGGA    IF   E           K DISK                                                             
     FPMTABD    IF   E           K DISK                                                             
     FEDPARM    IF   E           K DISK                                                             
     FMSTRTA    IF   E           K DISK                                                             
     FCOREPP    IF   E           K DISK                                                             
C1158FMSSTO0    IF   E           K DISK                                                             
C1158FMSARAL    IF   E           K DISK                                                             
      *                                                                                             
C1632FCOCAPE27  UF   E           K DISK    RENAME(RCOCAPE:RCOCAPE27)                                
C1632FCOPPEC    IF   E           K DISK                                                             
M1078FDO0052W   UF   E           K DISK                                                             
      *                                                                                             
      * ESTRUCTURA DE LA INFDS                                                                      
     D                SDS                                                                           
     D  SDSPGM                 1     10                                                             
     D    CCCPGM                     10    OVERLAY(SDSPGM)                                          
     D  SDSSTATUS             11     15S 0                                                          
     D  SDSCODERR             91    170                                                             
     D  SDSJOB               244    253                                                             
     D    CCCJOB                     10    OVERLAY(SDSJOB)                                          
     D  SDSUSR               254    263                                                             
     D  SDSJNBR              264    269                                                             
                                                                                                    
      * AREA DE DADES D'INFORMACIÓ ARXIU                                                            
     D  SFLDS          DS                                                                           
     D    SFLPOCUR           370    371B 0                                                          
     D    SFLPOS1            378    379B 0                                                          
     D    SFLRCD         *RECORD                                                                    
                                                                                                    
      * PLANTILLA D'INDICADORS DEL PROGRAMA (ELS RESERVATS NO SURTEN)                               
      * ELS DE TREBALL ES PODEN REDENOMINAR MITJANÇANT OVERLAY                                      
     D  INDICADORS   E DS                  BASED(INDICADORP)                                        
     D                                     EXTNAME(INDDS:RIND0199)                                  
     D     INPOS01   E                     EXTFLD(SETL01)                                           
     D     INPOS02   E                     EXTFLD(SETL02)                                           
     D     VLDCMDKEY E                     EXTFLD(WRK74)                                            
     D     ROLLDOWN  E                     EXTFLD(WRK77)                                            
     D  INDICADORP     S               *   INZ(%ADDR(*IN))                                          
                                                                                                    
     D  CO2540       E DS                  EXTNAME(CO2540DS)                                        
     D     X5CIAS    E                     EXTFLD(X1CIAS)                                           
     D     X5DLGA    E                     EXTFLD(X1DLGA)                                           
     D     X5NPCO    E                     EXTFLD(X1NPCO)                                           
     D     X5DATP    E                     EXTFLD(X1DATP)                                           
     D     X5TPED    E                     EXTFLD(X1TPED)                                           
     D     X5NOPL    E                     EXTFLD(X1NOPL)                                           
     D     X5ASTE    E                     EXTFLD(X1ASTE)                                           
                                                                                                    
     D    @PECIAS2     S              3                                                             
     D  JOLINE         S              3  0                                                          
                                                                                                    
     D Z1COMA          DS          2000                                                             
                                                                                                    
     D                 DS                                                                           
     D  JOTRAT                 1     18                                                             
     D   ZXJNBR                1      6                                                             
     D   ZXDATA                7     12                                                             
     D   ZXHORA               13     18  0                                                          
                                                                                                    
     D  C              S              1A   DIM(1) CTDATA PERRCD(1)                                  
                                                                                                    
      * CONTROL DEL FLUXE DEL PROGRAMA AMB INICIALITZACIÓ DE POSIC. INICIAL                         
     D                 DS                                                                           
     D  ZXOPT                  1      6    INZ('S01CLR')                                            
     D    ZXOPT1               1      3                                                             
     D    ZXOPT2               4      6                                                             
                                                                                                    
      * ESTRUCTURA DE DADES PELS DIFERENTS FORMATS DE SUBARXIU                                      
      * W1DATA -> S01D                                                                              
     D                 DS                                                                           
     D  W1DATA                 1     74                                                             
     D    S01LINE              1      3                                                             
     D    S01ARTI              5     19                                                             
     D    S01VARI             21     23                                                             
     D    S01MODE             24     25                                                             
     D    S01CANT             26     35                                                             
     D    S01UNIM             37     38                                                             
     D    S01LOGE             40     42                                                             
     D    S01TPL1             44     45                                                             
     D    S01FRRE             47     56                                                             
     D    S01LOGF             59     61                                                             
     D    S01FRRF             63     72                                                             
     D    S01TPLA             74     74                                                             
C1632D                 DS                                                                           
C1632D  W2DATA                 1     74                                                             
C1632D    S02LINE              1      3                                                             
C1632D    S02ARTI              5     19                                                             
C1632D    S02VARI             21     23                                                             
C1632D    S02MODE             24     25                                                             
C1632D    S02CANT             26     35                                                             
C1632D    S02UNIM             37     38                                                             
C1632D    S02LOGF             40     42                                                             
C1632D    S02TPLA             44     45                                                             
C1632D    S02FRRF             47     56                                                             
C1632D*   S02LOGF             59     61                                                             
C1632D*   S02FRRF             63     72                                                             
C1632D*   S02TPLA             74     74                                                             
      *                                                                                             
     D                 DS                                                                           
     D  W1DATA2                1     74                                                             
     D    S01DESC              1     38                                                             
     D    S01NETO             40     52                                                             
     D    S01IMAR             54     64                                                             
     D    S01VOL              66     74                                                             
C1632 *                                                                                             
C1632D                 DS                                                                           
C1632D  W2DATA2                1     74                                                             
C1632D    S02DESC              1     38                                                             
C1632D    S02NETO             40     52                                                             
C1632D    S02IMAR             54     64                                                             
C1632D    S02VOL              66     74                                                             
      *IMPORT/EXPORT PARÀMETRES                                                                     
                                                                                                    
     D    @PCIAS       S                   LIKE(S5CIAS)                                             
     D    @PDLGA       S                   LIKE(S5DLGA)                                             
     D    @PNPCO       S                   LIKE(S5NPCO)                                             
     D    @PTPED       S                   LIKE(S5TPED)                                             
C1632D    @PEPREC      S                   LIKE(S5PREC) INZ                                         
C1632D    @PETCST      S                   LIKE(S5TCST) INZ                                         
     D    @PDATP       S                   LIKE(S5DATP)                                             
     D    @PNOPL       S                   LIKE(S5NOPL)                                             
     D    @PMONV       S                   LIKE(S5MONE)                                             
     D    @PTFHV       S              1                                                             
     D    @PERRO       S              1                                                             
     D    @PDTOE       S                   LIKE(S5DTO1)                                             
     D    ZXERRO       S              1                                                             
     D                                                                                              
     D  @PDATPS        S                   LIKE(S5DATP)                                             
     D  @PECIAS        S                   LIKE(S5CIAS)                                             
     D  @PECUST        S                   LIKE(S5CUST)                                             
C1158D  @PEARVM        S             25                                                             
C1158D  @PECADP        S                   LIKE(S5CADP) INZ                                         
C1158D  @PECLTR        S              2                                                             
C1158D  @PETCOJ        S              1                                                             
C1158D  @PEDTO1        S                   LIKE(S5DTO1)                                             
C1158D  @PEDTO2        S                   LIKE(S5DTO2)                                             
C1158D  @PEDTO3        S                   LIKE(S5DTO3)                                             
C1158D  @PEDTO4        S                   LIKE(S5DTO4)                                             
C1158D  @PETPPR        S                   LIKE(S5TPPR)                                             
C1158D  @PEFPED        S                   LIKE(S0FPED) INZ                                         
C1158D  @PEMONB        S                   LIKE(S5MONE) INZ                                         
C1158D  @PEMONE        S                   LIKE(S5MONE) INZ                                         
C1158D  @PEMONP        S                   LIKE(S5MONE) INZ                                         
C1158D  @PEPCM1        S                   LIKE(S5PCM1) INZ                                         
C1158D  @PEPCM2        S                   LIKE(S5PCM2) INZ                                         
C1158D  @PEPCM3        S                   LIKE(S5PCM3) INZ                                         
C1158D  @PEUNDP        S                   LIKE(S5UNDP) INZ                                         
C1158D  @PEZXCO        S             12  7                                                          
C1158D  @PEPRMO        S                   LIKE(S5PRMO) INZ                                         
     D  @PEDLGA        S                   LIKE(S5DLGA)                                             
     D  @PEOPCI        S              2                                                             
     D  @PETPE2        S              2                                                             
     D  @PEERRO        S              1                                                             
     D  @PENPCO        S                   LIKE(S5NPCO)                                             
     D  @PENOPL        S                   LIKE(S5NOPL)                                             
     D  @PETPED        S                   LIKE(S5TPED)                                             
     D  @PEDATP        S                   LIKE(S5DATP)                                             
     D  @PEARTI        S                   LIKE(S5ARTI)                                             
     D  @PEMODE        S                   LIKE(S5MODE)                                             
     D  @PEVARI        S                   LIKE(S5VARI)                                             
     D  @PECANT        S                   LIKE(S5CANT)                                             
     D  @PEFRRE        S                   LIKE(S5FRRE)                                             
     D  @PEFDDS        S                   LIKE(S5FRRE)                                             
     D  @PECAST        S                   LIKE(S5CANT)                                             
     D  @PEUNST        S                   LIKE(S5UNIM)                                             
     D  @PEUSER        S                   LIKE(S5PANT)                                             
     D  @PEIMPR        S                   LIKE(S5PANT)                                             
     D  @PEPBRU        S                   LIKE(MOPBRU)                                             
     D  @PEUPES        S                   LIKE(MOUPSO)                                             
     D  @PEVOLU        S                   LIKE(MOVOLU)                                             
     D  @PELOGE        S                   LIKE(S5LOGE)                                             
     D  @PEUNIM        S                   LIKE(S5UNIM)                                             
     D  @PETPLA        S              1                                                             
     D  @PEUVOL        S                   LIKE(MOUVOL)                                             
     D  @PEUMED        S                   LIKE(MOUMEL)                                             
     D  @PETPAL        S              1                                                             
     D  @PETCT1        S              2                                                             
     D  @PEVTC1        S              1                                                             
     D  @PENBUL        S              6  0                                                          
     D  @PEPBRE        S                   LIKE(MOPBRU)                                             
     D  @PEVOLB        S                   LIKE(MOVOLU)                                             
     D  @PELINE        S                   LIKE(S5LINE)                                             
     D  @PEFIN         S              1  0                                                          
     D  @POPCI         S              2                                                             
     D  @PERR2         S              1                                                             
      *                                                                                             
     D  @FDCIAS        S                   LIKE(S5CIAS)                                             
     D  @FDDLGA        S              5                                                             
     D  @FDNPCO        S             10                                                             
     D  @FDTPED        S              2                                                             
     D  @FDDATP        S                   LIKE(S5DATP)                                             
     D  @FDNOPL        S                   LIKE(S5NOPL)                                             
     D  @FDLINE        S              3p 0                                                          
     D  @FDARV1        S             25                                                             
     D  @FDCOM2        S             25                                                             
     D  @FDCUST        S                   LIKE(S0CUST)                                             
     D  @FDTDI1        S                   LIKE(S0TDI1)                                             
     D  @FDEDAU        S              3                                                             
     D  @FDLOGI        S              1  0                                                          
     D  @FDORIG        S              1  0                                                          
     D  @FDINTE        S              1  0                                                          
     D  @FDERRO        S              1                                                             
     D  @FDINCI        S              3                                                             
     D  @FDCIA2        S                   LIKE(S5CIAS)                                             
     D  @FDDLG2        S              5                                                             
     D  @FDNPC2        S             10                                                             
     D  @FDTPE2        S              2                                                             
     D  @FDDAT2        S                   LIKE(S5DATP)                                             
     D  @FDNOP2        S                   LIKE(S5NOPL)                                             
     D  @FDLIN2        S                   LIKE(S5LINE)                                             
     D  @FDERAV        S              3                                                             
     D  @FDTEXT        S             50                                                             
     D  @FDDATO        S            300                                                             
     D  @FDWAUD        S              1  0                                                          
     D  @FDCANT        S                   LIKE(S5CANT)                                             
     D  @PLINEA        S                   LIKE(S5LINE)                                             
     D  @PTPE4         S                   LIKE(S5TPE4)                                             
     D  @POK           S              2                                                             
IT228D  @PEALMA        S                   LIKE(M0MAGA)                                             
IT228D  @PETIPO        S                   LIKE(M0BAJA)                                             
IT228D  @PERESP        S                   LIKE(M0MAGA)                                             
IT228D  ZXALMOL        S                   LIKE(M0MAGA)                                             
      *                                                                                             
     D* AREA DE DADES LOCAL I INICIALITZACIO DE VALORS COMUNS                                       
     D  DSLDA        E DS                  EXTNAME(PURLDADS)                                        
     D    CCCDEEM                    30    OVERLAY(ZZDEEM)                                          
                                                                                                    
     D* SERIES A UTILITZAR EN PROGRAMA                                                              
     DSDE              S              1A   DIM(10)                                                  
     DSSSECPA          S              1A   DIM(10)                                                  
                                                                                                    
     D* DEFINICIO DE CAMPS DE TREBALL                                                               
     D  ZXNRR00        S                   LIKE(SUFRCDN)INZ                                         
     D  ZXPUEXP        S                   LIKE(SUFRCDN)INZ                                         
     D  ZXNNN00        S                   LIKE(SUFRCDN)INZ                                         
     D  ZXLOP00        S                   LIKE(SUFRCDN)INZ                                         
     D  ZXCOUNT        S                   LIKE(SUFRCDN)INZ(1)                                      
     D  ZXSEMF         S              1                                                             
     D  ZXAU15         S             15  0                                                          
     D  ZXTLIN         S              3  0                                                          
     D  ZXOLIN         S              3  0                                                          
C1158D  ZXSTKDIS       S                   LIKE(M1SACT)                                             
C1158D  ZXARTI         S                   LIKE(S5ARTI)                                             
C1158D  ZXVARI         S                   LIKE(S5VARI)                                             
C1158D  ZXMODE         S                   LIKE(S5MODE)                                             
C1158D                 DS                                                                           
C1158D  ZXARVMX                1     25                                                             
C1158D    ZXARTIX              1     15                                                             
C1158D    ZXVARIX             16     18                                                             
C1158D    ZXMODEX             19     21                                                             
                                                                                                    
     D* Los Campos que vienen a continuacion guardan los valores                                    
     D* de la primera clave con que se cargo el subarchivo y a partir de                            
     D* los cuales se realizara cualquier accion de refrescar segun                                 
     D* ACCREF 1=SI 0=NO                                                                            
     D  ZXTPE4_1       S                   LIKE(S5TPE4) INZ                                         
     D  ZXLOGE_1       S                   LIKE(S5LOGE) INZ                                         
      *                                                                                             
     D    @PEOPT       S              2                                                             
     D    @PEPGM       S                   LIKE(SDSPGM) INZ                                         
     D    @PEFMT       S                   LIKE(RECORD) INZ                                         
     D    @PEFLD       S                   LIKE(FIELD)  INZ                                         
     D    @PEERR       S              1                 INZ                                         
      *                                                                                             
     D    CCCFMT       S              1                 INZ('1')                                    
     D    ZXFMT        S              1                 INZ('1')                                    
      *                                                                                             
      * El valor ZXCOMCAR marcara cuando se deben guardar los valores                               
      * de primera clave anteriores                                                                 
     D  ZXCOMCAR       S              1  0                                                          
      * Campos de uso para trabajar con la API QCMDEXC                                              
     D  ZXQCMD         S            150                                                             
     D  ZXLOGC         S             15  5 INZ(150)                                                 
      * El valor ZXLIPAG tiene el numero de registros a cargar despues de                           
      * un Clear de subfichero                                                                      
     D  ZXLIPAG        S                   LIKE(SUFRCDN)INZ(8)                                      
     D  ZXLIPA2        S                   LIKE(SUFRCDN)INZ(8)                                      
      * Definicion de posición del cursor en subarchivo                                             
     D  ZXLINEA        S              3  0                                                          
     D  ZXCOLU         S              3  0                                                          
      * DEFINICIÓ DEL POSICIONAMENT DEL CURSOR EL EL SFL                                            
     D                 DS                                                                           
     D  ZXPOSCUR               1      4  2                                                          
     D    ZXPOSX               1      2  0                                                          
     D    ZXPOSY               3      4  0                                                          
                                                                                                    
     D  ZXRUSIOL       S                   LIKE(M5SIOL) INZ                                         
     D  ZXRUTPE4       S                   LIKE(S5TPE4) INZ                                         
     D  ZXRULOGE       S                   LIKE(S5LOGE) INZ                                         
                                                                                                    
     D  ZXVNET         S             17  5                                                          
     D  ZXVIVA         S             17  5                                                          
     D  ZXVTOT         S             17  5                                                          
     D  ZXVOL          S             17  2                                                          
     D  ZXIVOL         S             17  5                                                          
     D  ZXICOS         S             17  5                                                          
     D  ZXIMAR         S             17  5                                                          
     D  ZXMVOL         S             17  5                                                          
     D  ZXVNETCO       S             17  5                                                          
     D  ZXVIVACO       S             17  5                                                          
     D  ZXVTOTCO       S             17  5                                                          
     D  ZXVOLCO        S             17  2                                                          
     D  ZXIVOLCO       S             17  5                                                          
     D  ZXICOSCO       S             17  5                                                          
     D  ZXIMARCO       S             17  5                                                          
     D  ZXVNETA        S             13                                                             
     D  ZXVIVAA        S             11                                                             
     D  ZXVTOTA        S             13                                                             
     D  ZXVOLA         S             17  2                                                          
     D  ZXIVOLA        S             17  5                                                          
     D  ZXICOSA        S             17  5                                                          
     D  ZXIMARA        S             17  5                                                          
     D  ZXMVOLA        S             17  5                                                          
     D  XZCANT         S                   LIKE(S5CANT)                                             
     D  XZAUXI         S             29  9                                                          
     D  XZAUXI1        S             29  9                                                          
     D    XZARTI       S                   LIKE(S5ARTI)                                             
     D    XZVARI       S                   LIKE(S5VARI)                                             
     D    XZMODE       S                   LIKE(S5MODE)                                             
     D    XZCIAS       S                   LIKE(S5CIAS)                                             
     D    XZUNIM       S                   LIKE(S5UNIM)                                             
     D    XZMONE       S                   LIKE(S5MONC)                                             
     D    XZUNDP       S                   LIKE(S5UNDC)                                             
     D    ZXMONV       S                   LIKE(S0MONE)                                             
     D  ZXDTO11        S                   LIKE(S0DTO1)                                             
     D  ZXDTO21        S                   LIKE(S0DTO2)                                             
     D  ZXDTO31        S                   LIKE(S0DTO3)                                             
     D  ZXDTO41        S                   LIKE(S0DTO4)                                             
     D  ZXCAMC         S                   LIKE(S0CAMB) INZ                                         
     D  ZXCMPC         S                   LIKE(S0CMPR) INZ                                         
     D    ZXTIVC       S              1                                                             
     D  ZXHLONG        S             20  5                                                          
     D  ZXCOCAMB       S             15  9                                                          
     D  ZXCOCAM2       S             15  9                                                          
     D    @PCMCOCO     S             20  9                                                          
     D    @PCMCCCO     S             20  9                                                          
     D  @PMON1         S                   LIKE(MBMONE)                                             
     D  @PMON2         S                   LIKE(MBMONE)                                             
     D  @PDATA         S                   LIKE(S0FRRR)                                             
     D  @PHORA         S                   LIKE(S0HORA)                                             
                                                                                                    
     D  ZXIPOR         S             15  5                                                          
     D  ZXARTPOR       S                   LIKE(S5ARTI)                                             
                                                                                                    
     D                 DS                                                                           
     D  ZXBL65A                1      5                                                             
     D    ZXTTA2               1      1                                                             
     D    ZXTTA3               2      2                                                             
     D                 DS                                                                           
     D  ZXBL62A                1     10                                                             
     D    ZXPORC               1      7                                                             
     D                 DS                                                                           
     D  ZXBL63A                1     10                                                             
     D    ZXPOR0               1      7                                                             
     D                 DS                                                                           
     D  ZXBL62B                1     10                                                             
     D    ZXTIVA               1      2                                                             
     D    ZXCCON               3      4                                                             
     D    ZXMONG               5      7                                                             
     D                 DS                                                                           
     D  ZXBL65I                1      5                                                             
     D    ZXPABI               1      1                                                             
     D                 DS                                                                           
     D  ZXBL65TIVA             1      5                                                             
     D    ZXTVO2               1      2                                                             
     D                 DS                                                                           
     D  ZXBL64                 1     10                                                             
                                                                                                    
     D  @PVAN          S             10  0                                                          
     D  @PVAA          S             10                                                             
     D  @PFMI          S              7                                                             
     D  @PFMF          S              7                                                             
     D  @PSEP          S              7                                                             
                                                                                                    
      * VALOR NUMÈRIC                                                                               
     D   PXNUM         S             29  9                                                          
      * VALOR ALFANUMÈRIC                                                                           
     D   PXALPH        S             29                                                             
      * LONGITUD TOTAL DEL CAMP (Nº CARÀCTERS INCLÒS CODI EDICIÓ)                                   
     D   PXFLDD        S              2  0 INZ(20)                                                  
      * Nº DE DECIMALS DEL CAMP                                                                     
     D  PXDCCD         S              1  0                                                          
      * TIPUS DE FORMAT DECIMAL (.,)                                                                
     D  PXFMD1         S                   LIKE(ZZFMD1)INZ                                          
      * CODI D'EDICIÓ (4,M,Q,Z)                                                                     
     D  PXEDTC         S                   LIKE(ZZEDTC)INZ('4')                                     
      * RETORN CODI D'ERROR                                                                         
     D  PXNMER         S              1  0 INZ(0)                                                   
      * TIPUS D'AJUST DECIMAL (0=MIG 1=PER SOBRE 2=PER SOTA)                                        
     D  PXTIPA         S              1                                                             
                                                                                                    
      * Definicion de algunas constantes                                                            
     D  ZXZERO10       S             10A   INZ(*ALL'0')                                             
IT228 *     D  ZXLOGOL        S                   LIKE(MILGCA)                                      
IT228d  T_logol        s                   like(m0logs) dim(10) inz                                 
IT228d  i2OL           s              2  0 inz                                                      
      *                                                                                             
                                                                                                    
     D  T3AMPL         DS                                                                           
     D     T3OPL1              1      3                                                             
     D     T3LVIR              9     11                                                             
C1708D  T3ADOM                14     14                                                             
     D                                                                                              
     D  ZXINCI         S              3                                                             
      *                                                                                             
     D                 DS                                                                           
     D  ZEAMPL                 1    100                                                             
     D    ZEFMTO               1      2                                                             
     D    ZESCAP               4      4                                                             
     D    ZEADCI               5      5                                                             
     D    ZEABRD              23     23                                         Aviso/bloqueo rd    
     D    ZERDMI              24     25                                         % rdto. pedido v    
     D    ZENVCM              19     19                                                             
     D    ZZTPCL              29     29                                                             
     D    ZEEDV2              47     47                                                             
     D    ZEGIND              48     48                                                             
      *                                                                                             
     D  S0AMPL         DS                                                                           
     D    S0COEN               1      1                                                             
     D    S0MOST              70     70                                                             
     D    S0EDLG             100    100                                                             
     D S5AMPL          DS                                                                           
     D  S5NCOE                 1      2                                                             
     D  S5CMRE                99     99                                                             
     D  S5AMP2         DS                                                                           
     D    S5DISP              14     21                                                             
     D  ZXERROR        S              1                                                             
C1632 *                                                                                             
C1632D  X5FRRE         S                   LIKE(S5FRRE)                                             
C1632D  X5FRRR         S                   LIKE(S5FRRE)                                             
C1632D  X5disp         S                   LIKE(S5disp)                                             
CR653D                                                                                              
CR653D  @XCIAS         S                   LIKE(M5CIAS)                                             
CR653D  @XARTI         S                   LIKE(M5ARTI)                                             
CR653D  @XVARI         S                   LIKE(M5VARI)                                             
CR653D  @XMODE         S                   LIKE(M5MODE)                                             
CR653D  @XPRVR         S                   LIKE(M5PRVR)                                             
CR653D  @XGRUP         S              1                                                             
CR653D  @XPEVT         S              1                                                             
      *                                                                                             
C1158D  ZXMAGA_OL      S                   LIKE(M0MAGA)                                             
C1078                                                                                               
F-2OL /free                                                                                         
        dcl-s pPointer pointer;                                                                     
        dcl-s pDsPgmOL pointer;                                                                     
        dcl-ds DsPgmOL based(pDsPgmOL);                                                             
              zoldl like(M0MAGA);                                                                   
              loEdl like(M0LOGE) ;                                                                  
              loSdl like(M0LOGS) ;                                                                  
              zolem like(M0MAGA);                                                                   
              loEem like(M0LOGE) ;                                                                  
              loSem like(M0LOGS) ;                                                                  
              zolgc like(M0MAGA);                                                                   
              loEgc like(M0LOGE) ;                                                                  
              loSgc like(M0LOGS) ;                                                                  
              zolgm like(M0MAGA);                                                                   
              loEgm like(M0LOGE) ;                                                                  
              loSgm like(M0LOGS) ;                                                                  
              zolgt like(M0MAGA);                                                                   
              loEgt like(M0LOGE) ;                                                                  
              loSgt like(M0LOGS) ;                                                                  
        end-ds;                                                                                     
        dcl-pr pgmOL   extpgm('MM1410');                                                            
           xCIAS   like(@PECIAS) const;   // cia                                                    
           xDLGA   like(@PEDLGA) const;   // delega                                                 
           xptr    pointer       ;        // pointer                                                
        end-pr;                                                                                     
F-2OL /end-free                                                                                     
      **************************************************************                                
      * RUTINA PRINCIPAL DEL PGM : DISTRIBUCIÓ DEL PAS PELS 2 SFL  *                                
      *------------------------------------------------------------*                                
      *                                                                                             
C1632C                   IF        NOREG='1'                                                        
C1632C                   EVAL      ZXOPT1='END'                                                     
C1632C                   ENDIF                                                                      
C1632C                   IF        THSIMU='1' OR THSIMU='2'                                         
C1632C                   EVAL      ZXOPT1='S02'                                                     
C1632C                   ENDIF                                                                      
C1632 *                                                                                             
     C     ZXOPT1        DOWNE     'END'                                                            
     C     ZXOPT1        CASEQ     'S01'         S01MAIN                        FMT. PER ARTICLE    
C1632C     ZXOPT1        CASEQ     'S02'         S02MAIN                        FMT. PER ARTICLE    
     C                   ENDCS                                                                      
     C                   ENDDO                                                                      
     C                   SETON                                        LR                            
      **************************************************************                                
      * SUBRUTINA INICIAL. DEFINICIO DE TOTS ELS PARÀMETRES        *                                
      * GENERALS DEL PROGRAMA.                                     *                                
      *------------------------------------------------------------*                                
     C     *INZSR        BEGSR                                                                      
      *                                                                                             
      * DEFINICIO DE LES KLIST DEL PGM                                                              
      *                                                                                             
     C     KCOCAPE27     KLIST                                                                      
     C                   KFLD                    S0CIAS                                             
     C                   KFLD                    S0NPCO                                             
     C                   KFLD                    S0TPED                                             
     C                   KFLD                    S0DATP                                             
     C                   KFLD                    S0NOPL                                             
     C                   KFLD                    S0DLGA                                             
      *                                                                                             
     C     KCOCAPE       KLIST                                                                      
     C                   KFLD                    S0CIAS                                             
     C                   KFLD                    S0DLGA                                             
     C                   KFLD                    S0NPCO                                             
     C                   KFLD                    S0TPED                                             
     C                   KFLD                    S0DATP                                             
     C                   KFLD                    S0NOPL                                             
      *                                                                                             
     C     KCODEPE       KLIST                                                                      
     C                   KFLD                    S5CIAS                                             
     C                   KFLD                    S5DLGA                                             
     C                   KFLD                    S5NPCO                                             
     C                   KFLD                    S5TPED                                             
     C                   KFLD                    S5DATP                                             
     C                   KFLD                    S5NOPL                                             
     C                   KFLD                    S5LINE                                             
C1632C     KCODEPE2      KLIST                                                                      
C1632C                   KFLD                    S5CIAS                                             
C1632C                   KFLD                    S5DLGA                                             
C1632C                   KFLD                    S5NPCO                                             
C1632C                   KFLD                    S5TPED                                             
C1632C                   KFLD                    S5DATP                                             
C1632C                   KFLD                    S5NOPL                                             
                                                                                                    
C1158C*    KCODEPE26     KLIST                                                                      
C1158C     KCODEPE08     KLIST                                                                      
     C                   KFLD                    S5CIAS                                             
     C                   KFLD                    S5DLGA                                             
     C                   KFLD                    S5NPCO                                             
     C                   KFLD                    S5TPED                                             
     C                   KFLD                    S5DATP                                             
     C                   KFLD                    S5NOPL                                             
      *                                                                                             
     C     KCODEPE40     KLIST                                                                      
     C                   KFLD                    S5CIAS                                             
     C                   KFLD                    S5NPCO                                             
     C                   KFLD                    S5TPED                                             
     C                   KFLD                    S5DATP                                             
     C                   KFLD                    S5NOPL                                             
     C                   KFLD                    S5LINE                                             
                                                                                                    
C1158C     KMSCOJC       KLIST                                                                      
C1158C                   KFLD                    NDCIAS                                             
C1158C                   KFLD                    NDARTI                                             
C1158C                   KFLD                    NDVARI                                             
C1158C                   KFLD                    NDMODE                                             
                                                                                                    
C1158C     KMSALMA       KLIST                                                                      
C1158C                   KFLD                    M0CIAS                                             
C1158C                   KFLD                    M0MAGA                                             
                                                                                                    
     C     KMSALMA05     KLIST                                                                      
     C                   KFLD                    M0CIAS                                             
     C                   KFLD                    M0LOGE                                             
                                                                                                    
     C     KCOCLIN       KLIST                                                                      
     C                   KFLD                    S0CIAS                                             
     C                   KFLD                    S0CUST                                             
                                                                                                    
     C     KMSDIV0       KLIST                                                                      
     C                   KFLD                    MBCIAS                                             
     C                   KFLD                    MBMONE                                             
                                                                                                    
     C     KCOCAIM       KLIST                                                                      
     C                   KFLD                    SYCIAS                                             
     C                   KFLD                    SYDLGA                                             
     C                   KFLD                    SYNPCO                                             
     C                   KFLD                    SYTPED                                             
     C                   KFLD                    SYDATP                                             
     C                   KFLD                    SYNOPL                                             
      *                                                                                             
     C     KMSIVAS       KLIST                                                                      
     C                   KFLD                    MVCIAS                                             
     C                   KFLD                    MVTIVA                                             
     C                   KFLD                    MVPABI                                             
     C                   KFLD                    MVFLCD                                             
                                                                                                    
     C     KMSIVAS0      KLIST                                                                      
     C                   KFLD                    MVCIAS                                             
     C                   KFLD                    MVTIVA                                             
     C                   KFLD                    MVPABI                                             
                                                                                                    
     C     KPMUNAL       KLIST                                                                      
     C                   KFLD                    @PCIAS                                             
     C                   KFLD                    P6ARTI                                             
     C                   KFLD                    P6VARI                                             
     C                   KFLD                    P6MODE                                             
     C                   KFLD                    P6UNIM                                             
                                                                                                    
     C     KMSARTI00     KLIST                                                                      
     C                   KFLD                    @PCIAS                                             
     C                   KFLD                    S5ARTI                                             
     C                   KFLD                    S5VARI                                             
     C                   KFLD                    S5MODE                                             
C1158                                                                                               
C1158C     KMSARTI002    KLIST                                                                      
C1158C                   KFLD                    @PCIAS                                             
C1158C                   KFLD                    M5ARTI                                             
C1158C                   KFLD                    M5VARI                                             
C1158C                   KFLD                    M5MODE                                             
                                                                                                    
     C     KMSLOGI       KLIST                                                                      
     C                   KFLD                    MICIAS                                             
     C                   KFLD                    MIDLGA                                             
     C                   KFLD                    MILGCA                                             
                                                                                                    
     C     KCODIPE       KLIST                                                                      
     C                   KFLD                    S2CIAS                                             
     C                   KFLD                    S2DLGA                                             
     C                   KFLD                    S2NPCO                                             
     C                   KFLD                    S2TPED                                             
     C                   KFLD                    S2DATP                                             
     C                   KFLD                    S2NOPL                                             
     C                   KFLD                    S2CDIR                                             
                                                                                                    
     C     KMSPAIS       KLIST                                                                      
     C                   KFLD                    MECIAS                                             
     C                   KFLD                    MEPAIS                                             
                                                                                                    
     C     KMSSGGA       KLIST                                                                      
     C                   KFLD                    MMCIAS                                             
     C                   KFLD                    MMUSER                                             
                                                                                                    
     C     KPMTABD       KLIST                                                                      
     C                   KFLD                    PECIAS                                             
     C                   KFLD                    PECTAB                                             
     C                   KFLD                    PECLTA                                             
      *                                                                                             
     C     KEDPARM       KLIST                                                                      
     C                   KFLD                    T3CIAS                                             
     C                   KFLD                    T3DLGA                                             
                                                                                                    
     C     KMSTRTA       KLIST                                                                      
     C                   KFLD                    N1CIAS                                             
     C                   KFLD                    N1TTTA                                             
                                                                                                    
     C     KCOREPP       KLIST                                                                      
     C                   KFLD                    V0CIAS                                             
     C                   KFLD                    V0REPR                                             
C1632                                                                                               
C1632C     KCOPPEC       KLIST                                                                      
C1632C                   KFLD                    THCIAS                                             
C1632C                   KFLD                    THDLGA                                             
C1158                                                                                               
C1158C     KMSSTO0       KLIST                                                                      
C1158C                   KFLD                    M1CIAS                                             
C1158C                   KFLD                    M1MAGA                                             
C1158C                   KFLD                    M1ARTI                                             
C1158C                   KFLD                    M1VARI                                             
C1158C                   KFLD                    M1MODE                                             
N1078                                                                                               
N1078C     KDO0052W      KLIST                                                                      
N1078C                   KFLD                    D2CIAS                                             
N1078C                   KFLD                    D2DLGA                                             
N1078C                   KFLD                    D2NPCO                                             
N1078C                   KFLD                    D2TPED                                             
N1078C                   KFLD                    D2DATP                                             
N1078C                   KFLD                    D2NOPL                                             
N1078C                   KFLD                    D2LINE                                             
      *                                                                                             
      * ENTRADA DE PARÀMETRES                                                                       
      *                                                                                             
     C     *ENTRY        PLIST                                                                      
     C                   PARM                    @PCIAS                                             
     C                   PARM                    @PDLGA                                             
     C                   PARM                    @PNPCO                                             
     C                   PARM                    @PTPED                                             
     C                   PARM                    @PDATP                                             
     C                   PARM                    @PNOPL                                             
     C                   PARM                    @PMONV                                             
     C                   PARM                    @PTFHV                                             
     C                   PARM                    @PERRO                                             
C1632C                   PARM                    @SIMULA           1                                
      *                                                                                             
     C                   EVAL      ZXERRO=@PERRO                                                    
     C                   EVAL      @PERRO=*BLANKS                                                   
     C                   EVAL      @PDATPS=@PDATP                                                   
      *                                                                                             
      * ZXERRO='1'   Hay que confirmar o cancelar el pedido                                         
      * ZXERRO<'1'   El pedido ya está confirmado                                                   
      *                                                                                             
     C     *DTAARA       DEFINE    PURLDA        DSLDA                                              
     C                   IN        DSLDA                                                            
     C                   EVAL      ZEAMPL=ZZAMPL                                                    
                                                                                                    
C1632 * RECUPERAMOS VALOR THSIMU PARA MOSTRAR UN SFL O OTRO                                         
C1632 *                                                                                             
C1632C                   IF        @SIMULA='0'                                                      
C1632C                   EVAL      THCIAS=@PCIAS                                                    
C1632C                   EVAL      THDLGA=@PDLGA                                                    
C1632C     KCOPPEC       CHAIN     COPPEC                                                           
C1632C                   ELSE                                                                       
C1632C                   EVAL      THSIMU='0'                                                       
C1632C                   ENDIF                                                                      
     C* CAPÇALERES D'OPCIONS DEL SFL  (CODIS D'ARXIU DE MISSATGES)                                  
     C                   EVAL      SUFOPC1='OED1000'                                                
     C***                EVAL      SUFOPC2=*BLANKS                                                  
     C* TITOLS DE PANTALLES (CODIS D'ARXIU DE MISSATGES)                                            
     C                   EVAL      CCCCTIT='TED1000'                                                
     C* ACTIVEM EL SFLDSPCTL                                                                        
     C                   EVAL      SFLCTL=*ON                                                       
C1632C                   IF        THSIMU='1' OR THSIMU='2'                                         
C1632C                   EVAL      SUFOPC1='OED1001'                                                
C1632C                   EVAL      CCCCTIT='TED1001'                                                
C1632C                   ENDIF                                                                      
      *                                                                                             
      * Inicializar Campos                                                                          
      *                                                                                             
N1078C                                                                                              
N1078C                   EVAL      D2CIAS=@PCIAS                                                    
N1078C                   EVAL      D2DLGA=@PDLGA                                                    
N1078C                   EVAL      D2NPCO=@PNPCO                                                    
N1078C                   EVAL      D2TPED=@PTPED                                                    
N1078C                   EVAL      D2DATP=@PDATP                                                    
N1078C                   EVAL      D2NOPL=@PNOPL                                                    
N1078C                                                                                              
C1158C                   EVAL      PECIAS=@PCIAS                                                    
     C                   EVAL      S0CIAS=@PCIAS                                                    
     C                   EVAL      S0DLGA=@PDLGA                                                    
     C                   EVAL      S0NPCO=@PNPCO                                                    
     C                   EVAL      S0TPED=@PTPED                                                    
     C                   EVAL      S0DATP=@PDATP                                                    
     C                   EVAL      S0NOPL=@PNOPL                                                    
     C                   EVAL      S5CIAS=@PCIAS                                                    
     C                   EVAL      S5DLGA=@PDLGA                                                    
     C                   EVAL      S5NPCO=@PNPCO                                                    
     C                   EVAL      S5TPED=@PTPED                                                    
     C                   EVAL      S5DATP=@PDATP                                                    
     C                   EVAL      S5NOPL=@PNOPL                                                    
     C                   EVAL      MBCIAS=@PCIAS                                                    
     C                   EVAL      MVCIAS=@PCIAS                                                    
     C                   EVAL      T3CIAS=@PCIAS                                                    
     C                   EVAL      T3DLGA=@PDLGA                                                    
07111C     KEDPARM       CHAIN     EDPARM                                                           
      *                                                                                             
FQ943C                   OPEN      ED1000FM                                                         
     C                   EVAL      ZXOPT='S01CLR'                                                   
     C                   EXSR      CS_LOGOL                                                         
      *                                                                                             
     C                   EXSR      CS_CPYDAT                                                        
C1632C                   IF        NOREG='1'                                                        
C1632C                   GOTO      TMAIN                                                            
C1632C                   ENDIF                                                                      
     C                   EXSR      CS_PROCESO                                                       
     C                   EXSR      CS_CABINZ                                                        
     C                   EXSR      FD_BASE                                                          
      *                                                                                             
      * Recuperación de la dirección de recepción de pedido                                         
      *                                                                                             
     C                   EVAL      S2CIAS=@PCIAS                                                    
     C                   EVAL      S2DLGA=@PDLGA                                                    
     C                   EVAL      S2NPCO=@PNPCO                                                    
     C                   EVAL      S2TPED=@PTPED                                                    
     C                   EVAL      S2DATP=@PDATP                                                    
     C                   EVAL      S2NOPL=@PNOPL                                                    
     C                   EVAL      S2CDIR='1'                                                       
     C     *NOKEY        CLEAR     *ALL          RCODIPE                                            
     C     KCODIPE       CHAIN     CODIPE                                                           
     C                   IF        %FOUND(CODIPE)                                                   
     C                   EVAL      SUCDIR1=S2DIRE                                                   
     C                   EVAL      SUCDIR2=S2DIR2                                                   
     C                   EVAL      SUCDIR3=S2POBL                                                   
     C                   EVAL      SUCDIR4=S2POST                                                   
      *                                                                                             
     C                   EVAL      MECIAS=S2CIAS                                                    
     C                   EVAL      MEPAIS=S2PAIS                                                    
     C     KMSPAIS       CHAIN     MSPAIS                                                           
     C                   IF        %FOUND(MSPAIS)                                                   
     C                   EVAL      SUCDIR4=S2POST+' '+MEDE30                                        
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
      * Recalcular Importes para evitar errores                                                     
     C                   EXSR      CS_RECALIM                                                       
     C                   EXSR      CS_CABSEG                                                        
      * Parámetros de usuario                                                                       
     C                   EVAL      MMCIAS=@PCIAS                                                    
     C                   EVAL      MMUSER=SDSUSR                                                    
     C     KMSSGGA       CHAIN     MSSGGA                                                           
     C                   EVAL      ERRGRL=*ON                                                       
     C     TMAIN         ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA CONTROL DEL SFL S01                              *                                
      *------------------------------------------------------------*                                
     C     S01MAIN       BEGSR                                                                      
     C                   DOW       ZXOPT1='S01'                                                     
     C     ZXOPT2        CASEQ     'CLR'         S01CLR                                             
     C     ZXOPT2        CASEQ     'INZ'         S01INZ                                             
     C     ZXOPT2        CASEQ     'DSP'         S01DSP                                             
     C     ZXOPT2        CASEQ     'CMD'         S01CMD                                             
     C     ZXOPT2        CASEQ     'CHK'         S01CHK                                             
     C                   ENDCS                                                                      
     C                   ENDDO                                                                      
     C                   ENDSR                                                                      
C1632 **************************************************************                                
C1632 * SUBRUTINA CONTROL DEL SFL S02                              *                                
C1632 *------------------------------------------------------------*                                
C1632C     S02MAIN       BEGSR                                                                      
C1632C                   DOW       ZXOPT1='S02'                                                     
C1632C     ZXOPT2        CASEQ     'CLR'         S02CLR                                             
C1632C     ZXOPT2        CASEQ     'INZ'         S02INZ                                             
C1632C     ZXOPT2        CASEQ     'DSP'         S02DSP                                             
C1632C     ZXOPT2        CASEQ     'CMD'         S02CMD                                             
C1632C     ZXOPT2        CASEQ     'CHK'         S02CHK                                             
C1632C                   ENDCS                                                                      
C1632C                   ENDDO                                                                      
C1632C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA INICIALITZACIÓ I CARREGA DEL SFL                 *                                
      *------------------------------------------------------------*                                
     C     S01INZ        BEGSR                                                                      
     C                   EVAL      ZXOPT2='DSP'                                                     
     C                   EXSR      CS_SFLIN1                                                        
                                                                                                    
     C                   EVAL      ZXPUEXP=0                                                        
     C                   EVAL      ZXRUSIOL=*BLANKS                                                 
     C                   EVAL      ZXRUTPE4=*BLANKS                                                 
     C                   EVAL      ZXRULOGE=*BLANKS                                                 
     C                   EVAL      ZXOLIN=0                                                         
     C                   EVAL      ZXVNETCO=0                                                       
     C                   EVAL      ZXVIVACO=0                                                       
     C                   EVAL      ZXVTOTCO=0                                                       
     C                   EVAL      ZXVOLCO=0                                                        
     C                   EVAL      ZXIVOLCO=0                                                       
     C                   EVAL      ZXICOSCO=0                                                       
     C                   EVAL      ZXIMARCO=0                                                       
      *                                                                                             
     C                   DOW       ZXLOP00 < ZXLIPAG                                                
C1158C*    KCODEPE26     READE     CODEPE26                               82                        
C1158C     KCODEPE08     READE     CODEPE08                               82                        
     C                   IF        EOF=*ON                                                          
     C                   LEAVE                                                                      
     C                   ENDIF                                                                      
      *                                                                                             
     C     KMSARTI00     CHAIN     MSARTI00                                                         
      *                                                                                             
      * GRABO DETALLE CUANDO ROMPA TIPO O LOGÍSTICA                                                 
      *                                                                                             
     C                   EVAL      ZXOLIN=0                                                         
     C                   EVAL      ZXVNETCO=0                                                       
     C                   EVAL      ZXVIVACO=0                                                       
     C                   EVAL      ZXVTOTCO=0                                                       
     C                   EVAL      ZXVOLCO=0                                                        
     C                   EVAL      ZXIVOLCO=0                                                       
     C                   EVAL      ZXICOSCO=0                                                       
     C                   EVAL      ZXIMARCO=0                                                       
      *                                                                                             
     C                   EXSR      CS_VALLIN                                                        
     C                   EVAL      ZXVNETCO=ZXVNETCO+ZXVNET                                         
     C                   EVAL      ZXVIVACO=ZXVIVACO+ZXVIVA                                         
     C                   EVAL      ZXVTOTCO=ZXVTOTCO+ZXVTOT                                         
     C                   EVAL(H)   ZXVOLCO=ZXVOLCO+ZXVOL                                            
     C                   EVAL      ZXICOSCO=ZXICOSCO+M5COSM                                         
     C                   EVAL      ZXIMARCO=ZXVNETCO-ZXICOSCO                                       
     C                   IF        ZXVOLCO<>0                                                       
     C                   EVAL(H)   ZXIVOLCO=ZXIMARCO/ZXVOLCO                                        
     C                   ENDIF                                                                      
     C                   EVAL      ZXOLIN=ZXOLIN+1                                                  
     C                   EVAL      ZXNRR00=ZXNRR00 + 1                                              
     C                   EVAL      ZXLOP00=ZXLOP00 + 1                                              
     C                   EXSR      CS_MOVFP                                                         
     C                   EXSR      CS_SAVFK                                                         
     C                   WRITE     SUFD                                                             
     C                   ENDDO                                                                      
                                                                                                    
     C                   EXSR      CS_SFLIN2                                                        
     C     S01INZT       ENDSR                                                                      
C1632 **************************************************************                                
C1632 * SUBRUTINA INICIALITZACIÓ I CARREGA DEL SFL S02             *                                
C1632 *------------------------------------------------------------*                                
C1632C     S02INZ        BEGSR                                                                      
C1632C                   EVAL      ZXOPT2='DSP'                                                     
C1632C                   EXSR      CS_SFLIN1                                                        
C1632                                                                                               
C1632C                   EVAL      ZXPUEXP=0                                                        
C1632C                   EVAL      ZXRUSIOL=*BLANKS                                                 
C1632C                   EVAL      ZXRUTPE4=*BLANKS                                                 
C1632C                   EVAL      ZXRULOGE=*BLANKS                                                 
C1632C                   EVAL      ZXOLIN=0                                                         
C1632C                   EVAL      ZXVNETCO=0                                                       
C1632C                   EVAL      ZXVIVACO=0                                                       
C1632C                   EVAL      ZXVTOTCO=0                                                       
C1632C                   EVAL      ZXVOLCO=0                                                        
C1632C                   EVAL      ZXIVOLCO=0                                                       
C1632C                   EVAL      ZXICOSCO=0                                                       
C1632C                   EVAL      ZXIMARCO=0                                                       
C1632 *                                                                                             
C1632C                   DOW       ZXLOP00 < ZXLIPAG                                                
C1158C*C1632     KCODEPE26     READE     CODEPE26                         82                        
C1158C     KCODEPE08     READE     CODEPE08                               82                        
C1632C                   IF        EOF=*ON                                                          
C1632C                   LEAVE                                                                      
C1632C                   ENDIF                                                                      
C1632 *                                                                                             
C1632C     KMSARTI00     CHAIN     MSARTI00                                                         
C1632 *                                                                                             
C1632 * GRABO DETALLE CUANDO ROMPA TIPO O LOGÍSTICA                                                 
C1632 *                                                                                             
C1632C                   EVAL      ZXOLIN=0                                                         
C1632C                   EVAL      ZXVNETCO=0                                                       
C1632C                   EVAL      ZXVIVACO=0                                                       
C1632C                   EVAL      ZXVTOTCO=0                                                       
C1632C                   EVAL      ZXVOLCO=0                                                        
C1632C                   EVAL      ZXIVOLCO=0                                                       
C1632C                   EVAL      ZXICOSCO=0                                                       
C1632C                   EVAL      ZXIMARCO=0                                                       
C1632 *                                                                                             
C1632C                   EXSR      CS_VALLIN                                                        
C1632C                   EVAL      ZXVNETCO=ZXVNETCO+ZXVNET                                         
C1632C                   EVAL      ZXVIVACO=ZXVIVACO+ZXVIVA                                         
C1632C                   EVAL      ZXVTOTCO=ZXVTOTCO+ZXVTOT                                         
C1632C                   EVAL(H)   ZXVOLCO=ZXVOLCO+ZXVOL                                            
C1632C                   EVAL      ZXICOSCO=ZXICOSCO+M5COSM                                         
C1632C                   EVAL      ZXIMARCO=ZXVNETCO-ZXICOSCO                                       
C1632C                   IF        ZXVOLCO<>0                                                       
C1632C                   EVAL(H)   ZXIVOLCO=ZXIMARCO/ZXVOLCO                                        
C1632C                   ENDIF                                                                      
C1632C                   EVAL      ZXOLIN=ZXOLIN+1                                                  
C1632C                   EVAL      ZXNRR00=ZXNRR00 + 1                                              
C1632C                   EVAL      ZXLOP00=ZXLOP00 + 1                                              
C1632C                   EXSR      CS_MOVFP                                                         
C1632C                   EXSR      CS_SAVFK                                                         
C1632C                   WRITE     SUFD2                                                            
C1632C                   ENDDO                                                                      
C1632                                                                                               
C1632C                   EXSR      CS_SFLIN2                                                        
C1632C     S02INZT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VISUALITZACIÓ SFL                                *                                
      *------------------------------------------------------------*                                
     C     S01DSP        BEGSR                                                                      
     C                   EVAL      ZXOPT2='CMD'                                                     
     C                   IF        ZXERRO='1'                                                       
     C                   EVAL      PPPCMD1='CMD7817'                                                
     C                   ELSE                                                                       
     C                   EVAL      PPPCMD1='CMD3031'                                                
     C                   ENDIF                                                                      
     C                   EVAL      SUFHED1='HED1000'                                                
                                                                                                    
     C                   EXSR      CS_SFLDSP                                                        
                                                                                                    
     C     S01DSPT       ENDSR                                                                      
C1632 **************************************************************                                
C1632 * SUBRUTINA VISUALITZACIÓ SFL S2                             *                                
C1632 *------------------------------------------------------------*                                
C1632C     S02DSP        BEGSR                                                                      
C1632C                   EVAL      ZXOPT2='CMD'                                                     
C1632C                   IF        ZXERRO='1'                                                       
C1632C                   EVAL      PPPCMD1='CMD7817'                                                
C1632C                   ELSE                                                                       
C1632C                   EVAL      PPPCMD1=*BLANKS                                                  
C1632C                   IF        THSIMU= '2'                                                      
C1632C                   EVAL      PPPCMD1='CMD3105'                                                
C1632C                   ENDIF                                                                      
C1632C                   IF        THSIMU= '1'                                                      
C1632C                   EVAL      PPPCMD1='CMD3106'                                                
C1632C                   ENDIF                                                                      
C1632C                   ENDIF                                                                      
C1632C                   EVAL      SUFHED1='HED1001'                                                
C1632                                                                                               
C1632C                   EXSR      CS_SFLDSP2                                                       
C1632                                                                                               
C1632C     S02DSPT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VALIDACIÓ DELS CMD'S                             *                                
      *------------------------------------------------------------*                                
     C     S01CMD        BEGSR                                                                      
     C                   EVAL      ZXOPT2='CHK'                                                     
     C                   EXSR      CS_SFLCMD                                                        
     C     S01CMDT       ENDSR                                                                      
C1632 **************************************************************                                
C1632 * SUBRUTINA VALIDACIÓ DELS CMD'S S02                         *                                
C1632 *------------------------------------------------------------*                                
C1632C     S02CMD        BEGSR                                                                      
C1632C                   EVAL      ZXOPT2='CHK'                                                     
C1632C                   EXSR      CS_SFLCMD2                                                       
C1632C     S02CMDT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VALIDACIÓ DEL SFL: FORMAT SFL I OPCIONS          *                                
      *------------------------------------------------------------*                                
     C     S01CHK        BEGSR                                                                      
     C                   EVAL      ZXOPT2='DSP'                                                     
                                                                                                    
      * SUBRUTINA COMÚ DE VALIDACIÓ DEL SFL                                                         
     C                   EXSR      CS_SFLCHK                                                        
                                                                                                    
     C     S01CHKT       ENDSR                                                                      
C1632 **************************************************************                                
C1632 * SUBRUTINA VALIDACIÓ DEL SFL: FORMAT SFL I OPCIONS S02      *                                
C1632 *------------------------------------------------------------*                                
C1632C     S02CHK        BEGSR                                                                      
C1632C                   EVAL      ZXOPT2='DSP'                                                     
C1632                                                                                               
C1632 * SUBRUTINA COMÚ DE VALIDACIÓ DEL SFL                                                         
C1632C                   EXSR      CS_SFLCHK2                                                       
C1632                                                                                               
C1632C     S02CHKT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA DE NETEJA DEL SFL                                *                                
      *------------------------------------------------------------*                                
     C     S01CLR        BEGSR                                                                      
     C                   EVAL      ZXOPT='S01INZ'                                                   
     C                   MOVEA     ZXZERO10      *IN(90)                                            
     C                   EVAL      INPOS01=*ON                                                      
     C                   EXSR      CS_SFLCLR                                                        
C1158C*    KCODEPE26     SETLL     CODEPE26                                                         
CC158C     KCODEPE08     SETLL     CODEPE08                                                         
     C     S01CLRT       ENDSR                                                                      
C1632 **************************************************************                                
C1632 * SUBRUTINA DE NETEJA DEL SFL                                *                                
C1632 *------------------------------------------------------------*                                
C1632C     S02CLR        BEGSR                                                                      
C1632C                   EVAL      ZXOPT='S02INZ'                                                   
C1632C                   MOVEA     ZXZERO10      *IN(90)                                            
C1632C                   EVAL      INPOS01=*ON                                                      
C1632C                   EXSR      CS_SFLCLR                                                        
C1158C*C1632     KCODEPE26     SETLL     CODEPE26                                                   
C1158C     KCODEPE08     SETLL     CODEPE08                                                         
C1632C     S02CLRT       ENDSR                                                                      
      **************************************************************                                
      * COMMON SUBRUTINE (CS_) :                                  *                                 
      * SUBRUTINA DE NETEJA DEL SFL                                *                                
      *------------------------------------------------------------*                                
     C     CS_SFLCLR     BEGSR                                                                      
     C                   EVAL      SFLDSP=*OFF                                                      
     C                   EVAL      SFLCTL=*OFF                                                      
     C                   EVAL      SFLCLR=*ON                                                       
     C                   WRITE     SUFC                                                             
C1632C                   WRITE     SUFC2                                                            
     C                   EVAL      SFLDSP=*ON                                                       
     C                   EVAL      SFLCTL=*ON                                                       
     C                   EVAL      SFLCLR=*OFF                                                      
     C                   CLEAR                   SUFRCDN                        SFLRCDNBR           
     C                   RESET                   ZXNRR00                        ULT.NRR             
     C                   RESET                   ZXNNN00                        ULT.NRR             
      * Inicialitza la variable que indica inici de carrega de subarxiu                             
     C                   EVAL      ZXCOMCAR=0                                                       
     C                   MOVEA     ZXZERO10      *IN(40)                                            
     C                   MOVEA     ZXZERO10      *IN(50)                                            
     C     SFLCLRT       ENDSR                                                                      
      **************************************************************                                
      * COMMON SUBRUTINE (CS_) :                                  *                                 
      * SUBRUTINA INICIALITZACIÓ DEL SFL (1º PART)                 *                                
      *------------------------------------------------------------*                                
     C     CS_SFLIN1     BEGSR                                                                      
     C                   RESET                   ZXLOP00                                            
     C                   RESET                   ZXLIPAG                                            
     C                   EVAL      ZXNRR00=ZXNNN00                                                  
     C                   IF        ACCREF=*ON                                                       
     C                   RESET                   ZXNRR00                                            
     C                   EVAL      ZXLIPAG=ZXCOUNT+ZXLIPAG-1                                        
     C                   ENDIF                                                                      
     C                   RESET                   ZXNNN00                        ULT.NRR             
     C                   EVAL      SFLEND=*OFF                                                      
     C                   EVAL      EOF=*OFF                                                         
     C     SFLIN1T       ENDSR                                                                      
      **************************************************************                                
      * COMMON SUBRUTINE (CS_) :                                  *                                 
      * SUBRUTINA DE MOURE CAMPS                                   *                                
      *------------------------------------------------------------*                                
     C     CS_MOVFP      BEGSR                                                                      
     C                   SELECT                                                                     
     C                   WHEN      ZXOPT1='S01'                                                     
     C                   EVAL      SUFOPCI=*BLANKS                                                  
     C                   EVAL      SFLNXC=*OFF                                                      
     C                   EXSR      S01MFP                                                           
C1632C                   WHEN      ZXOPT1='S02'                                                     
C1632C                   EVAL      SUFOPCI=*BLANKS                                                  
C1632C                   EVAL      SFLNXC=*OFF                                                      
C1632C                   EXSR      S02MFP                                                           
     C                   ENDSL                                                                      
     C                   ENDSR                                                                      
      **************************************************************                                
      * COMMON SUBRUTINE (CS_) :                                  *                                 
      * GUARDO LA CLAU DE POSICIONAMENT DEL PRIMER REGISTRE DESPRES*                                
      * DE LA NETEJA DEL SUBARXIU                                  *                                
      *------------------------------------------------------------*                                
     C     CS_SAVFK      BEGSR                                                                      
     C                   IF        ZXCOMCAR=0                                                       
                                                                                                    
     C                   EVAL      ZXTPE4_1=S5TPE4                                                  
     C                   EVAL      ZXLOGE_1=S5LOGE                                                  
     C                   EVAL      ZXCOMCAR=1                                                       
                                                                                                    
     C                   ENDIF                                                                      
     C     CS_SAVFKT     ENDSR                                                                      
      **************************************************************                                
      * COMMON SUBRUTINE (CS_) :                                  *                                 
      * SUBRUTINA INICIALITZACIÓ DEL SFL  (2ª PART)                *                                
      *------------------------------------------------------------*                                
     C     CS_SFLIN2     BEGSR                                                                      
     C                   EVAL      ZXNNN00=ZXNRR00                                                  
     C                   EVAL      SUFRCDN=ZXNRR00                                                  
     C                   EVAL      ACCREF=*ON                                   SFLRCDNBR           
     C                   IF        EOF=*ON                                                          
     C                   EVAL      SFLEND=*ON                                                       
     C                   ENDIF                                                                      
                                                                                                    
     C                   IF        ZXNRR00=0                                                        
     C                   EVAL      SFLDSP=*OFF                                                      
     C                   ELSE                                                                       
     C                   EVAL      SFLDSP=*ON                                                       
     C                   ENDIF                                                                      
                                                                                                    
     C     SFLIN2T       ENDSR                                                                      
      **************************************************************                                
      * COMMON SUBRUTINE (CS_) :                                  *                                 
      * SUBRUTINA VALIDACIÓ DELS CMD'S                             *                                
      *------------------------------------------------------------*                                
     C     CS_SFLCMD     BEGSR                                                                      
     C                   IF        VLDCMDKEY=*OFF                                                   
     C                   GOTO      SFLCMDT                                                          
     C                   ENDIF                                                                      
                                                                                                    
     C                   EVAL      ACCREF=*ON                                                       
     C                   EXSR      CS_SECCMD                                                        
     C     ERRGRL        CABEQ     *ON           SFLCMDT                                            
     C                   SELECT                                                                     
      * F04=AJUDA DE PANTALLA                                                                       
     C                   WHEN      HELP=*ON                                                         
     C                   EVAL      ZXOPT2='DSP'                                                     
     C                   EXSR      CS_POSCUR                                                        
     C                   EVAL      ACCREF=*OFF                                                      
      *                                                                                             
     C                   IF        FIELD='CCCFMT'                                                   
     C                   EVAL      @PEFMT=*BLANKS                                                   
     C                   EVAL      @PEFLD=*BLANKS                                                   
     C                   EVAL      @PEFLD='CFMT'                                                    
     C                   ENDIF                                                                      
     C                   IF        FIELD='SUFOPCI'                                                  
     C                   EVAL      @PEFMT=*BLANKS                                                   
     C                   EVAL      @PEFLD=*BLANKS                                                   
     C                   EVAL      @PEFLD='OPCI'                                                    
     C                   ENDIF                                                                      
     C                   CALL      'MMPROM'                                     Query-Aut-F4   X    
     C                   PARM      *BLANKS       @PEOPT                         PARM Qry-F4         
     C                   PARM      SDSPGM        @PEPGM                         PARM Qry-F4         
     C                   PARM                    @PEFMT                         PARM Qry-F4         
     C                   PARM                    @PEFLD                         PARM Qry-F4         
     C                   PARM      *BLANKS       @PEERR                         PARM Qry-F4         
      * Si el dato no tiene soporte F4 avisamos                                                     
     C                   IF        @PEERR>'0'                                                       
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      WRK40=*ON                                                        
     C                   EVAL      MSGER='ADP0304'                                                  
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           HELPT                                              
      * Si no han realizado ninguna selección no tocamos nada                                       
     C                   IF        @PEERR='A'                                                       
     C                   EVAL      ERRGRL=*ON                                                       
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           HELPT                                              
     C                   IF        FIELD='CCCFMT'                                                   
     C                   EVAL      CCCFMT=@PEOPT                                                    
     C                   ENDIF                                                                      
     C                   IF        FIELD='SUFOPCI'                                                  
    C                   EVAL      ZXNRR00=SFLPOS1+(CSRFILA-13)                                     
     C     ZXNRR00       CHAIN     SUFD                               81                            
     C                   IF        CHAIN=*OFF                                                       
     C                   EVAL      SUFOPCI=@PEOPT                                                   
     C                   EVAL      SFLNXC=*ON                                                       
     C                   UPDATE    SUFD                                                             
     C                   EVAL      ERRGRL=*ON                                                       
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
     C     HELPT         TAG                                                                        
      * F03=SORTIR DEL PROGRAMA                                                                     
     C                   WHEN      EXIT=*ON                                                         
     C                   EVAL      ZXOPT1='END'                                                     
     C                   EVAL      @PDATP=@PDATPS                                                   
      * F12=CANCELAR                                                                                
     C                   WHEN      RETRO=*ON                                                        
     C                   EVAL      ZXOPT1='END'                                                     
      * PAGINAR                                                                                     
     C                   WHEN      ROLLUP=*ON                                                       
     C                   EVAL      ACCREF=*OFF                                                      
     C                   EVAL      ZXOPT2='INZ'                                                     
      * PAGINAR                                                                                     
     C                   WHEN      ROLLDOWN=*ON                                                     
     C                   EVAL      ZXSEMF=*BLANKS                                                   
     C                   EXSR      CS_RSTFK                                                         
     C                   EXSR      CS_ROLLDOWN                                                      
     C                   EVAL      ACCREF=*OFF                                                      
     C                   EVAL      ZXOPT2='CLR'                                                     
     C                   ENDSL                                                                      
                                                                                                    
     C     SFLCMDT       TAG                                                                        
     C                   IF        ERRGRL=*ON AND ACCREF=*ON                                        
     C                   EVAL      ACCREF=*OFF                                                      
     C                   ENDIF                                                                      
                                                                                                    
     C                   ENDSR                                                                      
C1632 **************************************************************                                
C1632 * COMMON SUBRUTINE (CS_) :                                  *                                 
C1632 * SUBRUTINA VALIDACIÓ DELS CMD'S S02                         *                                
C1632 *------------------------------------------------------------*                                
C1632C     CS_SFLCMD2    BEGSR                                                                      
C1632C                   MOVEL     '1'           INT               1                                
C1632C                   IF        VLDCMDKEY=*OFF                                                   
C1632C                   GOTO      SFLCMDT2                                                         
C1632C                   ENDIF                                                                      
C1632                                                                                               
C1632C                   EVAL      ACCREF=*ON                                                       
C1632C                   EXSR      CS_SECCMD                                                        
C1632C     ERRGRL        CABEQ     *ON           SFLCMDT2                                           
C1632C                   SELECT                                                                     
C1632 * F3=SALIR                                                                                    
C1632C                   WHEN      EXIT=*ON                                                         
C1632C                   EVAL      ZXOPT1='END'                                                     
C1632C                   MOVEL     '0'           INT                                                
C1632 * F12=CANCELAR                                                                                
C1632C                   WHEN      RETRO=*ON                                                        
C1632C                   EVAL      ZXOPT1='END'                                                     
C1632C                   MOVEL     '0'           INT                                                
C1632 * PAGINAR                                                                                     
C1632C                   WHEN      ROLLUP=*ON                                                       
C1632C                   EVAL      ACCREF=*OFF                                                      
C1632C                   EVAL      ZXOPT2='INZ'                                                     
C1632C                   MOVEL     '0'           INT                                                
C1632 * PAGINAR                                                                                     
C1632C                   WHEN      ROLLDOWN=*ON                                                     
C1632C                   EVAL      ZXSEMF=*BLANKS                                                   
C1632C                   EXSR      CS_RSTFK                                                         
C1632C                   EXSR      CS_ROLLDOWN                                                      
C1632C                   EVAL      ACCREF=*OFF                                                      
C1632C                   EVAL      ZXOPT2='CLR'                                                     
C1632C                   MOVEL     '0'           INT                                                
C1632 * F10 = CONFIRMAR                                                                             
C1632C                   WHEN      *IN10=*ON                                                        
C1632C                   IF        THSIMU='2'                                                       
C1632C                   EXSR      CS_ACTDAT                                                        
C1632C                   EVAL      ZXOPT1='END'                                                     
C1632C                   ENDIF                                                                      
C1632C                   ENDSL                                                                      
C1632                                                                                               
C1632C     SFLCMDT2      TAG                                                                        
C1632C                   IF        ERRGRL=*ON AND ACCREF=*ON                                        
C1632C                   EVAL      ACCREF=*OFF                                                      
C1632C                   ENDIF                                                                      
C1632                                                                                               
C1632C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VALIDACIÓ DELS CMD'S                             *                                
      *------------------------------------------------------------*                                
     C     CS_SECCMD     BEGSR                                                                      
      * Validacion de seguridad teclas de función                                                   
     C                   EVAL      @PEFLD=*BLANKS                                                   
     C                   EVAL      @PEOPT=*BLANKS                                                   
     C                   EVAL      @PEFMT=*BLANKS                                                   
     C                   EVAL      @PEFLD='OPCI'                                                    
     C                   EVAL      @PEPGM=*BLANKS                                                   
     C                   EVAL      @PEPGM=SDSPGM                                                    
     C                   IF        CREATE=*ON                                                       
     C                   EVAL      @PEOPT='1 '                                                      
     C                   ENDIF                                                                      
     C                   EXSR      CS_SECMDOP                                                       
     C     ERRGRL        CABEQ     *ON           SECCMDT                                            
     C     SECCMDT       ENDSR                                                                      
      **************************************************************                                
      * COMMON SUBRUTINE (CS_) :                                  *                                 
      * SUBRUTINA VALIDACIÓ DEL SFL: FORMAT SFL I OPCIONS          *                                
      *------------------------------------------------------------*                                
     C     CS_SFLCHK     BEGSR                                                                      
     C                   EVAL      ACCREF=*ON                                                       
      *                                                                                             
     C                   EXSR      CS_CHKOPT                                                        
     C     ERRGRL        CABEQ     *ON           SFLCHKT                                            
      *                                                                                             
     C     SFLCHKT       TAG                                                                        
     C                   IF        ERRGRL=*ON AND ACCREF=*ON                                        
     C                   EVAL      ACCREF=*OFF                                                      
     C                   ENDIF                                                                      
      *                                                                                             
     C                   ENDSR                                                                      
C1632 **************************************************************                                
C1632 * COMMON SUBRUTINE (CS_) :                                  *                                 
C1632 * SUBRUTINA VALIDACIÓ DEL SFL S02: FORMAT SFL I OPCIONS     *                                 
C1632 *------------------------------------------------------------*                                
C1632C     CS_SFLCHK2    BEGSR                                                                      
C1632C                   EVAL      ACCREF=*ON                                                       
C1632 *                                                                                             
C1632C                   EXSR      CS_CHKOPT2                                                       
C1632C     ERRGRL        CABEQ     *ON           SFLCHKT2                                           
C1632 *                                                                                             
C1632C     SFLCHKT2      TAG                                                                        
C1632C                   IF        ERRGRL=*ON AND ACCREF=*ON                                        
C1632C                   EVAL      ACCREF=*OFF                                                      
C1632C                   ENDIF                                                                      
C1632 *                                                                                             
C1632 * SI SE HA PULSADO INTRO FINALIZAR                                                            
C1632 *                                                                                             
C1632C                   IF        INT='1'                                                          
C1632C                   IF        THSIMU='1'                                                       
C1632C                   EXSR      CS_ACTDAT                                                        
C1632C                   EVAL      ZXOPT1='END'                                                     
C1632C                   ENDIF                                                                      
C1632C                   ENDIF                                                                      
C1632 *                                                                                             
C1632C                   ENDSR                                                                      
      **************************************************************                                
      * COMMON SUBRUTINE (CS_) :                                  *                                 
      * SUBRUTINA DE 1er REGISTRE DE PANTALLA DE SUBARXIUS         *                                
      *------------------------------------------------------------*                                
     C     CS_RSTFK      BEGSR                                                                      
     C                   EVAL      S5TPE4=ZXTPE4_1                                                  
     C                   EVAL      S5LOGE=ZXLOGE_1                                                  
     C     RSTFKT        ENDSR                                                                      
      **************************************************************                                
      * COMMON SUBRUTINE (CS_) :                                  *                                 
      * SUBRUTINA DE NETEJA DE CAMPS DE POSIBLES CLAUS             *                                
      *------------------------------------------------------------*                                
     C     CS_CLRK       BEGSR                                                                      
     C                   CLEAR                   S5TPE4                                             
     C                   CLEAR                   S5LOGE                                             
     C     CLRKT         ENDSR                                                                      
      **************************************************************                                
      * COMMON SUBRUTINE (CS_) :                                  *                                 
      * SUBRUTINA DE TRATAMIENTO DE OPCIONES EN SUBARCHIVO         *                                
      *------------------------------------------------------------*                                
     C     CS_CHKOPT     BEGSR                                                                      
      *                                                                                             
      * Validacion clase de subarchivo                                                              
      *                                                                                             
     C                   EVAL      @PEFLD=*BLANKS                                                   
     C                   EVAL      @PEOPT=*BLANKS                                                   
     C                   EVAL      @PEFMT=*BLANKS                                                   
     C                   EVAL      @PEFLD='CFMT'                                                    
     C                   EVAL      @PEOPT=CCCFMT                                                    
     C                   CALL      'MMPROM'                                     Query-Aut-F4   X    
     C                   PARM                    @PEOPT                         PARM Qry-F4         
     C                   PARM      SDSPGM        @PEPGM                         PARM Qry-F4         
     C                   PARM                    @PEFMT                         PARM Qry-F4         
     C                   PARM                    @PEFLD                         PARM Qry-F4         
     C                   PARM      'V'           @PEERR                         PARM Qry-F4         
      *                                                                                             
     C                   IF        @PEERR>'0'                                                       
     C                   EVAL      ZXFMT=CCCFMT                                                     
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      WRK40=*ON                                                        
     C                   EVAL      MSGER='ASG1003'                                                  
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           CHKOPTT                                            
      *                                                                                             
      * VALIDACIO DE LES OPCIONS DE DETALL DEL SFL                                                  
      *                                                                                             
     C                   EVAL      ACCREF=*OFF                                                      
     C                   EVAL      EOF=*OFF                                                         
     C                   IF        SFLDSP=*ON                                                       
      *                                                                                             
     C                   DO        *HIVAL                                                           
     C                   READC     SUFD                                   82                        
     C                   IF        EOF=*ON                                                          
     C                   LEAVE                                                                      
     C                   ENDIF                                                                      
     C                   EVAL      ACCREF=*ON                                                       
     C                   EVAL      ZXOPT2='CLR'                                                     
      * Validacion opciones de subarchivo                                                           
     C                   EVAL      SFLNXC=*OFF                                                      
     C                   IF        SUFOPCI=*BLANKS                                                  
     C                   GOTO      TNEXOPC                                                          
     C                   ELSE                                                                       
     C                   EVAL      ZXCOUNT=ZXNRR00                                                  
     C                   ENDIF                                                                      
      *                                                                                             
     C                   EVAL      @PEFLD=*BLANKS                                                   
     C                   EVAL      @PEFMT=*BLANKS                                                   
     C                   EVAL      @PEFLD='OPCI'                                                    
     C                   EVAL      @PEOPT=SUFOPCI                                                   
     C                   EVAL      @PEPGM=SDSPGM                                                    
     C                   EXSR      CS_SECMDOP                                                       
     C                   IF        ERRGRL=*ON                                                       
     C                   EVAL      WRK41=*ON                                                        
     C                   ENDIF                                                                      
C1158 *                                                                                             
C1158C                   IF        %TRIM(@PEOPT)='5' AND                                            
C1158C                             SUFBAJA<>'E' AND SUFBAJA<>'e'                                    
C1158C                   EVAL      ERRGRL=*ON                                                       
C1158C                   EVAL      WRK40=*ON                                                        
C1158C                   EVAL      MSGER='MSG0600'                                                  
C1158C                   ENDIF                                                                      
C1158 *                                                                                             
C1158C                   IF        %TRIM(@PEOPT)='2' AND SUFBAJA <> 'E'                             
C1158C                   EVAL      ERRGRL=*ON                                                       
C1158C                   EVAL      WRK40=*ON                                                        
C1158C                   EVAL      MSGER='MSG0601'                                                  
C1158C                   ENDIF                                                                      
      *                                                                                             
     C     ERRGRL        CABEQ     *ON           TNEXOPC                                            
      *                                                                                             
      * Seguridad por usuario y en comercial                                                        
      *                                                                                             
      * Ejecutar                                                                                    
      *                                                                                             
C1158C                   IF        %TRIM(@PEOPT)='2' OR                                             
C1158C                             %TRIM(@PEOPT)='5'                                                
C1158 *                                                                                             
C1158C                   EVAL      @POK=%TRIM(@PEOPT)                                               
C1158C                   CALL      'CO0860'                                                         
C1158C                   PARM                    @PCIAS                                             
C1158C                   PARM                    @PDLGA                                             
C1158C                   PARM                    @PNPCO                                             
C1158C                   PARM                    @PTPED                                             
C1158C                   PARM                    @PDATP                                             
C1158C                   PARM                    @PNOPL                                             
C1158C                   PARM                    @PTFHV                                             
C1158C                   PARM      SUFLINE       @PLINEA                                            
C1158C                   PARM      SUFTPE4       @PTPE4                                             
C1158C                   PARM                    @POK                                               
C1158 *                                                                                             
C1158C                   IF        %TRIM(@PEOPT)='2' AND @POK = 'S'                                 
C1158C                   EVAL      ZXOPT1='END'                                                     
C1158C                   EVAL      @PERRO='@'                                                       
C1158C                   LEAVE                                                                      
C1158C                   ENDIF                                                                      
C1158 *                                                                                             
C1158C                   ENDIF                                                                      
C1158 *                                                                                             
C1158C*                  SELECT                                                                     
      *                                                                                             
      * Poner toda la logística seleccionada como ED                                                
      *                                                                                             
C1158C*                  WHEN      @PEOPT='42'                                                      
C1158C*                  CALL      'MM0095'                                                         
C1158C*                  PARM      @PCIAS        @PECIAS                                            
C1158C*                  PARM      SUFARTI       @PEARTI                                            
C1158C*                  PARM      SUFVARI       @PEVARI                                            
C1158C*                  PARM      SUFMODE       @PEMODE                                            
C1158C*                  PARM      '42'          @PEOPT                                             
C1158C*                  PARM      *BLANKS       @PEERR                                             
     C*                  EXSR      CS_LOGENED                                                       
     C*                  EVAL      ZXOPT='S01CLR'                                                   
     C*                  EVAL      SUFOPCI=*BLANKS                                                  
     C*                  EVAL      SFLNXC=*OFF                                                      
      *                                                                                             
C1158C*                  ENDSL                                                                      
      *                                                                                             
     C     TNEXOPC       TAG                                                                        
     C                   EVAL      *IN33=IND33                                                      
     C                   UPDATE    SUFD                                                             
     C                   IF        ERRGRL=*ON                                                       
     C                   EVAL      ZXOPT2='DSP'                                                     
     C                   EVAL      ZXCOUNT=ZXNRR00                                                  
     C                   EXSR      CS_POSCER0                                                       
     C                   LEAVE                                                                      
     C                   ENDIF                                                                      
     C                   ENDDO                                                                      
      *                                                                                             
      * Si existen errores entonces mantengo la posicion del primer error                           
      * y muestro pantalla                                                                          
      *                                                                                             
     C                   ENDIF                                                                      
      *                                                                                             
     C                   IF        ERRGRL=*OFF                                                      
     C                   EXSR      CS_RSTFK                                                         
     C                   EXSR      CS_POSCER0                                                       
     C                   ENDIF                                                                      
      *                                                                                             
     C     CHKOPTT       ENDSR                                                                      
C1632 **************************************************************                                
C1632 * COMMON SUBRUTINE (CS_) :                                  *                                 
C1632 * SUBRUTINA DE TRATAMIENTO DE OPCIONES EN SUBARCHIVO S02     *                                
C1632 *------------------------------------------------------------*                                
C1632C     CS_CHKOPT2    BEGSR                                                                      
C1632 *                                                                                             
C1632 * Validacion clase de subarchivo                                                              
C1632 *                                                                                             
C1632C                   EVAL      @PEFLD=*BLANKS                                                   
C1632C                   EVAL      @PEOPT=*BLANKS                                                   
C1632C                   EVAL      @PEFMT=*BLANKS                                                   
C1632C                   EVAL      @PEFLD='CFMT'                                                    
C1632C                   EVAL      @PEOPT=CCCFMT                                                    
C1632C                   CALL      'MMPROM'                                     Query-Aut-F4   X    
C1632C                   PARM                    @PEOPT                         PARM Qry-F4         
C1632C                   PARM      SDSPGM        @PEPGM                         PARM Qry-F4         
C1632C                   PARM                    @PEFMT                         PARM Qry-F4         
C1632C                   PARM                    @PEFLD                         PARM Qry-F4         
C1632C                   PARM      'V'           @PEERR                         PARM Qry-F4         
C1632 *                                                                                             
C1632C                   IF        @PEERR>'0'                                                       
C1632C                   EVAL      ZXFMT=CCCFMT                                                     
C1632C                   EVAL      ERRGRL=*ON                                                       
C1632C                   EVAL      WRK40=*ON                                                        
C1632C                   EVAL      MSGER='ASG1003'                                                  
C1632C                   ENDIF                                                                      
C1632C     ERRGRL        CABEQ     *ON           CHKOPTT2                                           
C1632 *                                                                                             
C1632 * VALIDACIO DE LES OPCIONS DE DETALL DEL SFL                                                  
C1632 *                                                                                             
C1632C                   EVAL      ACCREF=*OFF                                                      
C1632C                   EVAL      EOF=*OFF                                                         
C1632C                   IF        SFLDSP=*ON                                                       
C1632 *                                                                                             
C1632C                   DO        *HIVAL                                                           
C1632C                   READC     SUFD2                                  82                        
C1632C                   IF        EOF=*ON                                                          
C1632C                   LEAVE                                                                      
C1632C                   ENDIF                                                                      
C1632C                   EVAL      ACCREF=*ON                                                       
C1632C                   EVAL      ZXOPT2='CLR'                                                     
C1632 * Validacion opciones de subarchivo                                                           
C1632C                   EVAL      SFLNXC=*OFF                                                      
C1632C                   IF        SUFOPCI=*BLANKS                                                  
C1632C                   GOTO      TNEXOPC2                                                         
C1632C                   ELSE                                                                       
C1632C                   EVAL      ZXCOUNT=ZXNRR00                                                  
C1632C                   ENDIF                                                                      
C1632 *                                                                                             
C1632C                   EVAL      @PEFLD=*BLANKS                                                   
C1632C                   EVAL      @PEFMT=*BLANKS                                                   
C1632C                   EVAL      @PEFLD='OPCI2'                                                   
C1632C                   EVAL      @PEOPT=SUFOPCI                                                   
C1632C                   EVAL      @PEPGM=SDSPGM                                                    
C1632C                   EXSR      CS_SECMDOP                                                       
C1632C                   IF        ERRGRL=*ON                                                       
C1632C                   EVAL      WRK41=*ON                                                        
C1632C                   ENDIF                                                                      
C1632C     ERRGRL        CABEQ     *ON           TNEXOPC2                                           
C1632 *                                                                                             
C1632 * Seguridad por usuario y en comercial                                                        
C1632 *                                                                                             
C1632 * Ejecutar                                                                                    
C1632 *                                                                                             
C1632C                   SELECT                                                                     
C1632 *                                                                                             
C1632 * Visualizar detalle de lineas del pedido                                                     
C1632 *                                                                                             
C1632C                   WHEN      @PEOPT=' 5'                                                      
C1632C                   EVAL      @PEPREC=S5PREC                                                   
C1632C                   MOVEL     S02LINE       @PELINE                                            
C1632C                   CALL      'CO0141'                                                         
C1632C                   PARM      @PCIAS        @PECIAS                                            
C1632C                   PARM                    @PEDLGA                                            
C1632C                   PARM      @PNPCO        @PENPCO                                            
C1632C                   PARM      @PTPED        @PETPED                                            
C1632C                   PARM      @PDATP        @PEDATP                                            
C1632C                   PARM      @PNOPL        @PENOPL                                            
C1632C                   PARM                    @PELINE                                            
C1632C                   PARM      *BLANKS       @PEARTI                                            
C1632C                   PARM      *BLANKS       @PEVARI                                            
C1632C                   PARM      *BLANKS       @PEMODE                                            
C1632C                   PARM      *BLANKS       @PETCOJ                                            
C1632C                   PARM      *ZEROS        @PECANT                                            
C1632C                   PARM      *BLANKS       @PEUNIM                                            
C1632C                   PARM      *ZEROS        @PECAST                                            
C1632C                   PARM      *BLANKS       @PETCST                                            
C1632C                   PARM      SUFOPCI       @PEOPT                                             
C1632C                   PARM      *BLANKS       @PEERR                                             
C1632C                   PARM                    @PEPREC                                            
C1632C                   MOVE      '0'           INT                                                
C1632C                   ENDSL                                                                      
C1632 *                                                                                             
C1632C     TNEXOPC2      TAG                                                                        
C1632C                   UPDATE    SUFD2                                                            
C1632C                   IF        ERRGRL=*ON                                                       
C1632C                   MOVE      '0'           INT                                                
C1632C                   EVAL      ZXOPT2='DSP'                                                     
C1632C                   EVAL      ZXCOUNT=ZXNRR00                                                  
C1632C                   EXSR      CS_POSCER0                                                       
C1632C                   LEAVE                                                                      
C1632C                   ENDIF                                                                      
C1632C                   ENDDO                                                                      
C1632 *                                                                                             
C1632 * Si existen errores entonces mantengo la posicion del primer error                           
C1632 * y muestro pantalla                                                                          
C1632 *                                                                                             
C1632C                   ENDIF                                                                      
C1632 *                                                                                             
C1632C                   IF        ERRGRL=*OFF                                                      
C1632C                   EXSR      CS_RSTFK                                                         
C1632C                   EXSR      CS_POSCER0                                                       
C1632C                   ENDIF                                                                      
C1632 *                                                                                             
C1632C     CHKOPTT2      ENDSR                                                                      
      **************************************************************                                
      * COMMON SUBRUTINE (CS_) :                                  *                                 
      * SUBRUTINA DE POSICIONAMENT DEL CURSOR                      *                                
      *------------------------------------------------------------*                                
     C     CS_POSCUR     BEGSR                                                                      
      * OBTENIM LA POSICIO DEL CURSOR                                                               
     C     SFLPOCUR      DIV       256           CSRFILA                                            
     C                   MVR                     CSRCOLU                                            
     C                   EVAL      ZXLINEA=CSRFILA                                                  
     C                   EVAL      ZXCOLU=CSRCOLU                                                   
     C                   ENDSR                                                                      
      **************************************************************                                
      * COMMON SUBRUTINE (CS_) :                                  *                                 
      * SUBRUTINA DE POSICIONAMENT DEL CURSOR                      *                                
      *------------------------------------------------------------*                                
     C     CS_POSCER0    BEGSR                                                                      
     C* Línea de subarchivo donde se posiciona cursor si error en opción                            
     C                   IF        ZXLIPAG<>0                                                       
     C     ZXCOUNT       DIV       ZXLIPA2       ZXAU15                                             
     C                   MVR                     CSRFILA                                            
     C                   IF        CSRFILA=0 AND ZXAU15>0                                           
     C                   EVAL      CSRFILA=ZXLIPA2                                                  
     C                   ENDIF                                                                      
     C                   EVAL      CSRFILA=CSRFILA+13-1                                             
     C                   ENDIF                                                                      
     C                   EVAL      CSRCOLU=4                                                        
     C                   IF        CSRFILA<=0                                                       
     C                   EVAL      CSRFILA=0                                                        
     C                   EVAL      CSRCOLU=0                                                        
     C                   ENDIF                                                                      
      *                                                                                             
     C                   ENDSR                                                                      
      **************************************************************                                
      * COMMON SUBRUTINE (CS_) :                                  *                                 
      * SUBRUTINA VISUALITZACIÓ SFL                                *                                
      *------------------------------------------------------------*                                
     C     CS_SFLDSP     BEGSR                                                                      
     C                   EVAL      ZXOPT2='CMD'                                                     
M1078C                   UNLOCK    CODEPE08                                                         
M1078C                   UNLOCK    CODEPE40                                                         
M1078C                   UNLOCK    COCAPE27                                                         
M1078C                   UNLOCK    COCAPE                                                           
M1078C                   UNLOCK    CODEPE                                                           
      * Posicionament en el subarxiu si no s'ha realitzat cap acció                                 
     C                   IF        ACCREF=*OFF AND SFLDSP=*ON                                       
     C                   EVAL      SUFRCDN=ZXCOUNT                                                  
     C                   ENDIF                                                                      
                                                                                                    
     C                   WRITE     SUFP                                                             
     C                   EXFMT     SUFC                                                             
     C* Guardem el nº de registre que es visualitza actualment per no                               
     C* canviar de pàgina si no fan res                                                             
     C                   EVAL      ZXCOUNT=SFLPOS1                                                  
     C                   EVAL      ERRGRL=*OFF                                                      
     C                   EVAL      MSGER=*BLANKS                                                    
     C                   MOVEA     ZXZERO10      *IN(40)                                            
     C                   MOVEA     ZXZERO10      *IN(50)                                            
     C     SFLDSPT       ENDSR                                                                      
C1632 **************************************************************                                
C1632 * COMMON SUBRUTINE (CS_) :                                  *                                 
C1632 * SUBRUTINA VISUALITZACIÓ SFL S02                            *                                
C1632 *------------------------------------------------------------*                                
C1632C     CS_SFLDSP2    BEGSR                                                                      
C1632C                   EVAL      ZXOPT2='CMD'                                                     
M1078C                   UNLOCK    CODEPE08                                                         
M1078C                   UNLOCK    CODEPE40                                                         
M1078C                   UNLOCK    COCAPE27                                                         
M1078C                   UNLOCK    COCAPE                                                           
M1078C                   UNLOCK    CODEPE                                                           
C1632 * Posicionament en el subarxiu si no s'ha realitzat cap acció                                 
C1632C                   IF        ACCREF=*OFF AND SFLDSP=*ON                                       
C1632C                   EVAL      SUFRCDN=ZXCOUNT                                                  
C1632C                   ENDIF                                                                      
C1632                                                                                               
C1632C                   WRITE     SUFP2                                                            
C1632C                   EXFMT     SUFC2                                                            
C1632C* Guardem el nº de registre que es visualitza actualment per no                               
C1632C* canviar de pàgina si no fan res                                                             
C1632C                   EVAL      ZXCOUNT=SFLPOS1                                                  
C1632C                   EVAL      ERRGRL=*OFF                                                      
C1632C                   EVAL      MSGER=*BLANKS                                                    
C1632C                   MOVEA     ZXZERO10      *IN(40)                                            
C1632C                   MOVEA     ZXZERO10      *IN(50)                                            
C1632C     SFLDSPT2      ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA PER MOURE CAMPS AL SFL                           *                                
      *------------------------------------------------------------*                                
     C     S01MFP        BEGSR                                                                      
     C                   EVAL      SUFOPCI=*BLANKS                                                  
     C                   EVAL      SFLNXC=*OFF                                                      
     C                   EVAL      WRK50=*OFF                                                       
                                                                                                    
     C                   EVAL      @PVAA=*BLANKS                                                    
     C                   CALL      'MM2510'                                                         
     C                   PARM      S5FRRE        @PVAN                                              
     C                   PARM                    @PVAA                                              
     C                   PARM      'YYMD'        @PFMI                                              
     C                   PARM      ZZFMFF        @PFMF                                              
     C                   PARM      ZZFMFS        @PSEP                                              
     C                   PARM      ' '           @PEERR                                             
     C                   EVAL      S01FRRE=@PVAA                                                    
      *                                                                                             
     C                   EVAL      PXNUM =S5CANT                                                    
     C                   EVAL      PXALPH=*BLANKS                                                   
     C                   CALL      'PRD650'                                                         
     C                   PARM                    PXNUM                          CAMP NUMÈRIC        
     C                   PARM                    PXALPH                         CAMP ALFANUMÈRIC    
     C                   PARM                    PXFLDD                         Nº CARACT. VISUA    
     C                   PARM      2             PXDCCD                         Nº DECIMALS         
     C                   PARM                    PXFMD1                         AJUST DECIMAL (.    
     C                   PARM      '4'           PXEDTC                         CODI EDICIO(4,M,    
     C                   PARM                    PXNMER                         RETORN ERROR        
     C                   PARM                    PXTIPA                         TIPO AJUSTE (0,1    
     C                   MOVE      PXALPH        S01CANT                                            
     C                   MOVE      S5LINE        S01LINE                                            
     C                   EVAL      S01LOGE=S5LOGE                                                   
     C                   EVAL      S01TPL1=S5TPLA                                                   
N1078C                   IF        T3ADOM='1'                                                       
N1078C                   EVAL      D2LINE=S5LINE                                                    
N1078C     KDO0052W      CHAIN     DO0052W                                                          
N1078C                   IF        %FOUND                                                           
      *                                                                                             
     C                   SELECT                                                                     
     C                   WHEN      D2TREG='Z' AND                                                   
     C                             D2VA05=1                                                         
     C                   MOVEL     'OB'          S01TPL1                                            
     C                   WHEN      D2TREG='Z' AND                                                   
     C                             D2VA21=1                                                         
     C                   MOVEL     'OC'          S01TPL1                                            
     C                   WHEN      D2TREG='Z' AND                                                   
     C                             D2VA06=1                                                         
     C                   MOVEL     'SS'          S01TPL1                                            
     C                   WHEN      D2TREG='Z' AND                                                   
     C                             D2VA14=1                                                         
     C                   MOVEL     'B '          S01TPL1                                            
     C                   WHEN      D2TREG<>'Z' AND                                                  
     C                             D2VA23=1                                                         
     C                   MOVEL     'P1'          S01TPL1                                            
     C                   WHEN      D2TREG<>'Z' AND                                                  
     C                             D2VA23=2                                                         
     C                   MOVEL     'DF'          S01TPL1                                            
     C                   WHEN      D2TREG<>'Z' AND                                                  
     C                             D2VA23<>1                                                        
     C                   MOVEL     'PR'          S01TPL1                                            
C2557C                   OTHER                                                                      
C2557C                   MOVEL     'FZ'          S01TPL1                                            
     C                   ENDSL                                                                      
      *                                                                                             
N1078C                   ENDIF                                                                      
N1078C                   ENDIF                                                                      
     C                   EVAL      S01UNIM=S5UNIM                                                   
      *                                                                                             
     C     KCODEPE       CHAIN     CODEPE                                                           
C1632C     KCODEPE       CHAIN(N)  CODEPE                                                           
      *                                                                                             
     C*                  EVAL      S01TPE4=S5TPE4                                                   
     C                   EVAL      @PVAA=*BLANKS                                                    
     C                   CALL      'MM2510'                                                         
     C                   PARM      S5FRRE        @PVAN                                              
     C                   PARM                    @PVAA                                              
     C                   PARM      'YYMD'        @PFMI                                              
     C                   PARM      ZZFMFF        @PFMF                                              
     C                   PARM      ZZFMFS        @PSEP                                              
     C                   PARM      ' '           @PEERR                                             
     C                   EVAL      S01FRRF=@PVAA                                                    
     C                   EVAL      S01ARTI=S5ARTI                                                   
     C                   EVAL      S01VARI=S5VARI                                                   
     C                   EVAL      S01MODE=S5MODE                                                   
     C                   EVAL      S01LOGF=S5LOGE                                                   
     C                   EVAL      S01DESC=S5DES1                                                   
     C                   EVAL      S01TPLA=S5TPLA                                                   
C1158 *                                                                                             
C1158 * Revisar artículos equivalentes en el caso de que no haya                                    
C1158 * suficiente stock para cubrir el pedido                                                      
C1158 *                                                                                             
C1158C                   EXSR      VEREQU                                                           
C1158 *                                                                                             
     C*                  EVAL      S01TPE4=S5TPE4                                                   
C1158C                   EVAL      SUFTPE4=S5TPE4                                                   
     C                   IF        S5TPE4='2'                                                       
     C                   EVAL      WRK50=*ON                                                        
     C                   ENDIF                                                                      
      *                                                                                             
     C                   EVAL      PXALPH=*BLANKS                                                   
     C                   EVAL      PXNUM=ZXVNETCO*ZXCOCAMB                                          
     C                   EVAL      ZXVTOTCO=PXNUM                                                   
     C                   CALL      'PRD650'                                                         
     C                   PARM                    PXNUM                          CAMP NUMÈRIC        
     C                   PARM                    PXALPH                         CAMP ALFANUMÈRIC    
     C                   PARM                    PXFLDD                         Nº CARACT. VISUA    
     C                   PARM      2             PXDCCD                         Nº DECIMALS         
     C                   PARM                    PXFMD1                         AJUST DECIMAL (.    
     C                   PARM                    PXEDTC                         CODI EDICIO(4,M,    
     C                   PARM                    PXNMER                         RETORN ERROR        
     C                   PARM                    PXTIPA                         TIPO AJUSTE (0,1    
     C                   MOVE      PXALPH        S01NETO                                            
                                                                                                    
     C                   EVAL      PXALPH=*BLANKS                                                   
     C                   EVAL      PXNUM=ZXVOLCO                                                    
     C                   CALL      'PRD650'                                                         
     C                   PARM                    PXNUM                          CAMP NUMÈRIC        
     C                   PARM                    PXALPH                         CAMP ALFANUMÈRIC    
     C                   PARM                    PXFLDD                         Nº CARACT. VISUA    
     C                   PARM      2             PXDCCD                         Nº DECIMALS         
     C                   PARM                    PXFMD1                         AJUST DECIMAL (.    
     C                   PARM                    PXEDTC                         CODI EDICIO(4,M,    
     C                   PARM                    PXNMER                         RETORN ERROR        
     C                   PARM                    PXTIPA                         TIPO AJUSTE (0,1    
     C                   MOVE      PXALPH        S01VOL                                             
                                                                                                    
     C                   EVAL      PXDCCD=2                                                         
     C                   EVAL      PXEDTC='4'                                                       
     C                   EXSR      CS_DETSEG                                                        
     C                   EXSR      CS_KEYPF                                                         
     C                   EVAL      SUFDATA=W1DATA                                                   
     C     S01MFPT       ENDSR                                                                      
C1632 **************************************************************                                
C1632 * SUBRUTINA PER MOURE CAMPS AL SFL S02                       *                                
C1632 *------------------------------------------------------------*                                
C1632C     S02MFP        BEGSR                                                                      
C1632C                   EVAL      SUFOPCI=*BLANKS                                                  
C1632C                   EVAL      SFLNXC=*OFF                                                      
C1632C                   EVAL      WRK50=*OFF                                                       
C1632                                                                                               
C1632C                   EVAL      PXNUM =S5CANT                                                    
C1632C                   EVAL      PXALPH=*BLANKS                                                   
C1632C                   CALL      'PRD650'                                                         
C1632C                   PARM                    PXNUM                          CAMP NUMÈRIC        
C1632C                   PARM                    PXALPH                         CAMP ALFANUMÈRIC    
C1632C                   PARM                    PXFLDD                         Nº CARACT. VISUA    
C1632C                   PARM      2             PXDCCD                         Nº DECIMALS         
C1632C                   PARM                    PXFMD1                         AJUST DECIMAL (.    
C1632C                   PARM      '4'           PXEDTC                         CODI EDICIO(4,M,    
C1632C                   PARM                    PXNMER                         RETORN ERROR        
C1632C                   PARM                    PXTIPA                         TIPO AJUSTE (0,1    
C1632C                   MOVE      PXALPH        S02CANT                                            
C1632C                   MOVE      S5LINE        S02LINE                                            
C1632C*                  EVAL      S02LOGE=S5LOGE                                                   
C1632C*                  EVAL      S02TPL1=S5TPLA                                                   
C1632C                   EVAL      S02UNIM=S5UNIM                                                   
C1632 *                                                                                             
C1632C     KCODEPE       CHAIN(N)  CODEPE                                                           
C1632 *                                                                                             
C1632C*                  EVAL      S02TPE4=S5TPE4                                                   
C1632 *                                                                                             
C1632C                   EVAL      @PVAA=*BLANKS                                                    
C1632C                   CALL      'MM2510'                                                         
C1632C                   PARM      S5FRRE        @PVAN                                              
C1632C                   PARM                    @PVAA                                              
C1632C                   PARM      'YYMD'        @PFMI                                              
C1632C                   PARM      ZZFMFF        @PFMF                                              
C1632C                   PARM      ZZFMFS        @PSEP                                              
C1632C                   PARM      ' '           @PEERR                                             
C1632C                   EVAL      S02FRRF=@PVAA                                                    
C1632C                   EVAL      S02ARTI=S5ARTI                                                   
C1632C                   EVAL      S02VARI=S5VARI                                                   
C1632C                   EVAL      S02MODE=S5MODE                                                   
C1632C                   EVAL      S02LOGF=S5LOGE                                                   
C1632C                   EVAL      S02DESC=S5DES1                                                   
C1632C                   EVAL      S02TPLA=S5TPLA                                                   
C1632 *                                                                                             
C1632C*                  EVAL      S02TPE4=S5TPE4                                                   
C1632C                   IF        S5TPE4='2'                                                       
C1632C                   EVAL      WRK50=*ON                                                        
C1632C                   ENDIF                                                                      
C1632 *                                                                                             
C1632C                   EVAL      PXALPH=*BLANKS                                                   
C1632C                   EVAL      PXNUM=ZXVNETCO*ZXCOCAMB                                          
C1632C                   EVAL      ZXVTOTCO=PXNUM                                                   
C1632C                   CALL      'PRD650'                                                         
C1632C                   PARM                    PXNUM                          CAMP NUMÈRIC        
C1632C                   PARM                    PXALPH                         CAMP ALFANUMÈRIC    
C1632C                   PARM                    PXFLDD                         Nº CARACT. VISUA    
C1632C                   PARM      2             PXDCCD                         Nº DECIMALS         
C1632C                   PARM                    PXFMD1                         AJUST DECIMAL (.    
C1632C                   PARM                    PXEDTC                         CODI EDICIO(4,M,    
C1632C                   PARM                    PXNMER                         RETORN ERROR        
C1632C                   PARM                    PXTIPA                         TIPO AJUSTE (0,1    
C1632C                   MOVE      PXALPH        S02NETO                                            
C1632                                                                                               
C1632C                   EVAL      PXALPH=*BLANKS                                                   
C1632C                   EVAL      PXNUM=ZXVOLCO                                                    
C1632C                   CALL      'PRD650'                                                         
C1632C                   PARM                    PXNUM                          CAMP NUMÈRIC        
C1632C                   PARM                    PXALPH                         CAMP ALFANUMÈRIC    
C1632C                   PARM                    PXFLDD                         Nº CARACT. VISUA    
C1632C                   PARM      2             PXDCCD                         Nº DECIMALS         
C1632C                   PARM                    PXFMD1                         AJUST DECIMAL (.    
C1632C                   PARM                    PXEDTC                         CODI EDICIO(4,M,    
C1632C                   PARM                    PXNMER                         RETORN ERROR        
C1632C                   PARM                    PXTIPA                         TIPO AJUSTE (0,1    
C1632C                   MOVE      PXALPH        S02VOL                                             
C1632                                                                                               
C1632C                   EVAL      PXDCCD=2                                                         
C1632C                   EVAL      PXEDTC='4'                                                       
C1632C                   EXSR      CS_DETSEG                                                        
C1632C                   EXSR      CS_KEYPF                                                         
C1632C                   EVAL      SUFDATA=W2DATA                                                   
C1632C     S02MFPT       ENDSR                                                                      
C1632 **************************************************************                                
C1632 * SUBRUTINA ACTUALIZA DATOS DE FECHAS EN CODEPE Y COCAPE     *                                
C1632 *------------------------------------------------------------*                                
C1632C     CS_ACTDAT     BEGSR                                                                      
C1632 *                                                                                             
C1632C                   EVAL      S0CIAS=@PCIAS                                                    
C1632C                   EVAL      S0NPCO=@PNPCO                                                    
C1632C                   EVAL      S0TPED=@PTPED                                                    
C1632C                   EVAL      S0DATP=@PDATP                                                    
C1632C                   EVAL      S0NOPL=@PNOPL                                                    
C1632C                   EVAL      S0DLGA=@PDLGA                                                    
N1078C     KCOCAPE27     CHAIN     COCAPE27                                                         
C1632C     KCOCAPE       CHAIN     COCAPE                                                           
C1632 *                                                                                             
     C                   CLEAR                   S0FRRE                                             
      *                                                                                             
C1632C                   EVAL      S5CIAS=@PCIAS                                                    
C1632C                   EVAL      S5DLGA=@PDLGA                                                    
C1632C                   EVAL      S5NPCO=@PNPCO                                                    
C1632C                   EVAL      S5TPED=@PTPED                                                    
C1632C                   EVAL      S5DATP=@PDATP                                                    
C1632C                   EVAL      S5NOPL=@PNOPL                                                    
C1632C     *LOVAL        SETLL     CODEPE                                                           
C1632C                   READ      CODEPE                                                           
C1632C                   DOW       NOT%EOF                                                          
C1632C                   EVAL      X5FRRE=S5FRRE                                                    
C1632C                   EVAL      X5FRRR=S5FRRE                                                    
C1632C                   EVAL      X5disp=S5disp                                                    
C1632C     KCODEPE40     CHAIN     CODEPE40                           99                            
C1632C                   EVAL      S5FRRE=X5FRRE                                                    
C1632C                   EVAL      S5FRRR=X5FRRR                                                    
C1632C                   eval      S5DISP=x5disp                                                    
C1632C                   UPDATE    R40                                                              
     C                   IF        S5FRRE>S0FRRE                                                    
     C                   EVAL      S0FRRE=S5FRRE                                                    
     C                   ENDIF                                                                      
C1632C                   READ      CODEPE                                                           
C1632C                   ENDDO                                                                      
      *                                                                                             
C1632C                   UPDATE    RCOCAPE27                                                        
C1632 *                                                                                             
C1632C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA QUE GUARDA LAS CLAVES DE TODOS TIPOS DE SFL      *                                
      *------------------------------------------------------------*                                
     C     CS_KEYPF      BEGSR                                                                      
     C                   EVAL      SUFARTI=S5ARTI                                                   
     C                   EVAL      SUFVARI=S5VARI                                                   
     C                   EVAL      SUFMODE=S5MODE                                                   
C1158C                   EVAL      SUFLINE=S5LINE                                                   
     C                   ENDSR                                                                      
      **************************************************************                                
      * Busca nueva situación del SFL.                             *                                
      *------------------------------------------------------------*                                
     C     CS_ROLLDOWN   BEGSR                                                                      
                                                                                                    
     C                   RESET                   ZXLOP00                                            
     C                   RESET                   ZXLIPAG                                            
     C                   EVAL      ZXCOUNT=1                                                        
                                                                                                    
     C                   IF        ZXSEMF=*BLANKS                                                   
     C                   EVAL      ZXLIPAG=ZXLIPAG+1                                                
     C                   ENDIF                                                                      
                                                                                                    
C1158C*    KCODEPE26     SETGT     CODEPE26                                                         
C1158C     KCODEPE08     SETGT     CODEPE08                                                         
                                                                                                    
     C                   DOW       ZXLOP00 < ZXLIPAG                                                
C1158C*    KCODEPE26     READPE    CODEPE26                               82                        
C1158C     KCODEPE08     READPE    CODEPE08                               82                        
                                                                                                    
     C                   IF        EOF=*ON                                                          
     C                   LEAVE                                                                      
     C                   ENDIF                                                                      
     C                   EVAL      ZXLOP00=ZXLOP00+1                                                
     C     TNEXDOWN      TAG                                                                        
     C                   ENDDO                                                                      
     C                                                                                              
     C                   IF        ZXSEMF=*BLANKS AND                                               
     C                             EOF=*ON        AND                                               
     C                             ZXLOP00=1                                                        
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='MSG0114'                                                  
     C                   ENDIF                                                                      
     C                   EVAL      ZXCOMCAR=0                                                       
     C                   EXSR      CS_SAVFK                                                         
     C                   EVAL      ZXSEMF=*BLANKS                                                   
                                                                                                    
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA QUE BUSCA DATOS DE CABECERA                      *                                
      *------------------------------------------------------------*                                
     C     CS_CABINZ     BEGSR                                                                      
      *                                                                                             
     C                   EVAL      SUCNPCO=@PNPCO                                                   
     C     KCOCAPE27     CHAIN     COCAPE27                                                         
      *                                                                                             
     C                   EVAL      ZXMONV=ZZMONE                                                    
     C                   EVAL      ZXCOCAMB=1                                                       
     C                   EXSR      CS_ZXCOCAM                                                       
     C                   EVAL      SUCTDI1=S0TDI1                                                   
      *                                                                                             
      * Resto de datos de cabecera                                                                  
      *                                                                                             
     C                   EVAL      SUCCUST=S0CUST                                                   
     C     KCOCLIN       CHAIN     COCLIN                                                           
     C                   EVAL      SUCCUSTD=C_S0DES1                                                
      *                                                                                             
     C                   IF        C_S0TCLI='9'                                                     
     C                   EVAL      SUCCUSTD=S0DES1                                                  
     C                   ENDIF                                                                      
      *                                                                                             
     C                   EXSR      CS_CMDCIM                                                        
      *                                                                                             
                                                                                                    
     C                   EVAL      @PVAA=*BLANKS                                                    
     C                   CALL      'MM2510'                                                         
     C                   PARM      S0FRRE        @PVAN                                              
     C                   PARM                    @PVAA                                              
     C                   PARM      'YYMD'        @PFMI                                              
     C                   PARM      ZZFMFF        @PFMF                                              
     C                   PARM      ZZFMFS        @PSEP                                              
     C                   PARM      ' '           @PEERR                                             
     C                   EVAL      SUCFRRE=@PVAA                                                    
                                                                                                    
     C                   EVAL      @PVAA=*BLANKS                                                    
     C                   CALL      'MM2510'                                                         
     C                   PARM      S0FREP        @PVAN                                              
     C                   PARM                    @PVAA                                              
     C                   PARM      'YYMD'        @PFMI                                              
     C                   PARM      ZZFMFF        @PFMF                                              
     C                   PARM      ZZFMFS        @PSEP                                              
     C                   PARM      ' '           @PEERR                                             
     C                   EVAL      SUCFREP=@PVAA                                                    
                                                                                                    
     C                   EVAL      @PVAA=*BLANKS                                                    
     C                   CALL      'MM2510'                                                         
     C                   PARM      S0FPED        @PVAN                                              
     C                   PARM                    @PVAA                                              
     C                   PARM      'YYMD'        @PFMI                                              
     C                   PARM      ZZFMFF        @PFMF                                              
     C                   PARM      ZZFMFS        @PSEP                                              
     C                   PARM      ' '           @PEERR                                             
     C                   EVAL      SUCFPED=@PVAA                                                    
     C                   EVAL      SUCTTTA=S0TTTA                                                   
     C                   EVAL      N1CIAS=S0CIAS                                                    
     C                   EVAL      N1TTTA=S0TTTA                                                    
     C     KMSTRTA       CHAIN     MSTRTA                                                           
     C                   EVAL      SUCTTAD=N1DES1                                                   
     C                   EVAL      V0CIAS=S0CIAS                                                    
     C                   EVAL      V0REPR=S0REPR                                                    
     C     KCOREPP       CHAIN     COREPP                                                           
     C                   EVAL      SUCREPD=V0DES1                                                   
     C                   EVAL      SUCREPR=V0REPR                                                   
     C                   EVAL      SUCREFE=S0REFE                                                   
     C                   EVAL      SUCCOEN=S0COEN                                                   
     C                   EVAL      SUCTPOR=S0TPOR                                                   
     C                   EVAL      SUCFPAG=S0FPAG                                                   
     C     KCOCAPE       CHAIN(N)  COCAPE                                                           
                                                                                                    
     C                   EVAL      @PVAA=*BLANKS                                                    
     C                   CALL      'MM2510'                                                         
     C                   PARM      S0FRRE        @PVAN                                              
     C                   PARM                    @PVAA                                              
     C                   PARM      'YYMD'        @PFMI                                              
     C                   PARM      ZZFMFF        @PFMF                                              
     C                   PARM      ZZFMFS        @PSEP                                              
     C                   PARM      ' '           @PEERR                                             
     C                   EVAL      SUCFRRF=@PVAA                                                    
                                                                                                    
     C                   ENDSR                                                                      
      **************************************************************                                
      * Calcula importes para todas las vistas                     *                                
      *------------------------------------------------------------*                                
     C     CS_CMDCIM     BEGSR                                                                      
                                                                                                    
     C                   EVAL      SYCIAS=S0CIAS                                                    
     C                   EVAL      SYDLGA=S0DLGA                                                    
     C                   EVAL      SYNPCO=S0NPCO                                                    
     C                   EVAL      SYTPED=S0TPED                                                    
     C                   EVAL      SYDATP=S0DATP                                                    
     C                   EVAL      SYNOPL=S0NOPL                                                    
                                                                                                    
     C                   EVAL      ZXVNET=0                                                         
     C                   EVAL      ZXVIVA=0                                                         
     C                   EVAL      ZXVTOT=0                                                         
                                                                                                    
     C     KCOCAIM       SETLL     COCAIM                                                           
     C     KCOCAIM       READE     COCAIM                                 84                        
     C                   DOW       READ2=*OFF                                                       
     C                   EVAL      ZXVNET=ZXVNET+SYBIMP                                             
     C                   EVAL      ZXVIVA=ZXVIVA+SYIIV1+SYIIV2                                      
     C                   EXSR      CS_ZXCOCA2                                                       
     C     KCOCAIM       READE     COCAIM                                 84                        
     C                   ENDDO                                                                      
      * Le quito los portes tipo APE                                                                
     C                   EVAL      ZXVNET=ZXVNET-ZXIPOR                                             
      * Los descuentos a utilizar serán los previstos salvo que exista precio confirmado            
     C                   EVAL      ZXDTO11=S0DTO1                                                   
     C                   EVAL      ZXDTO21=S0DTO2                                                   
     C                   EVAL      ZXDTO31=S0DTO3                                                   
     C                   EVAL      ZXDTO41=S0DTO4                                                   
     C                   IF        S0CAMC<>0                                                        
     C                   EVAL      ZXDTO11=S0DT1C                                                   
     C                   EVAL      ZXDTO21=S0DT1C                                                   
     C                   EVAL      ZXDTO31=S0DT1C                                                   
     C                   EVAL      ZXDTO41=S0DT1C                                                   
     C                   ENDIF                                                                      
      * Trato los dtos sobre pedido                                                                 
     C                   EVAL      XZAUXI=ZXVNET                                                    
      * DTO1                                                                                        
     C                   EVAL      XZAUXI1=XZAUXI*ZXDTO11                                           
     C     XZAUXI1       DIV(H)    100           XZAUXI1                                            
     C                   EVAL      XZAUXI=XZAUXI-XZAUXI1                                            
      * DTO2                                                                                        
     C                   EVAL      XZAUXI1=XZAUXI *ZXDTO21                                          
     C     XZAUXI1       DIV(H)    100           XZAUXI1                                            
     C                   EVAL      XZAUXI =XZAUXI -XZAUXI1                                          
      * DTO3                                                                                        
     C                   EVAL      XZAUXI1=XZAUXI *ZXDTO31                                          
     C     XZAUXI1       DIV(H)    100           XZAUXI1                                            
     C                   EVAL      XZAUXI =XZAUXI -XZAUXI1                                          
      * DTO4                                                                                        
     C                   EVAL      XZAUXI1=XZAUXI *ZXDTO41                                          
     C     XZAUXI1       DIV(H)    100           XZAUXI1                                            
     C                   EVAL      XZAUXI =XZAUXI -XZAUXI1                                          
                                                                                                    
     C                   EVAL(H)   ZXVNET=XZAUXI                                                    
                                                                                                    
     C                   EVAL      XZAUXI=ZXVIVA                                                    
      * DTO1                                                                                        
     C                   EVAL      XZAUXI1=XZAUXI*ZXDTO11                                           
     C     XZAUXI1       DIV(H)    100           XZAUXI1                                            
     C                   EVAL      XZAUXI=XZAUXI-XZAUXI1                                            
      * DTO2                                                                                        
     C                   EVAL      XZAUXI1=XZAUXI *ZXDTO21                                          
     C     XZAUXI1       DIV(H)    100           XZAUXI1                                            
     C                   EVAL      XZAUXI =XZAUXI -XZAUXI1                                          
      * DTO3                                                                                        
     C                   EVAL      XZAUXI1=XZAUXI *ZXDTO31                                          
     C     XZAUXI1       DIV(H)    100           XZAUXI1                                            
     C                   EVAL      XZAUXI =XZAUXI -XZAUXI1                                          
      * DTO4                                                                                        
     C                   EVAL      XZAUXI1=XZAUXI *ZXDTO41                                          
     C     XZAUXI1       DIV(H)    100           XZAUXI1                                            
     C                   EVAL      XZAUXI =XZAUXI -XZAUXI1                                          
                                                                                                    
     C                   EVAL(H)   ZXVIVA=XZAUXI                                                    
      * Decimales de la moneda                                                                      
     C                   EVAL      MBMONE=ZXMONV                                                    
     C     KMSDIV0       CHAIN     MSDIV0                             81                            
                                                                                                    
     C                   EVAL      PXALPH=*BLANKS                                                   
     C                   EVAL      PXNUM=ZXVNET*ZXCOCAMB                                            
     C                   EVAL      ZXVTOT=PXNUM                                                     
     C                   CALL      'PRD650'                                                         
     C                   PARM                    PXNUM                          CAMP NUMÈRIC        
     C                   PARM                    PXALPH                         CAMP ALFANUMÈRIC    
     C                   PARM                    PXFLDD                         Nº CARACT. VISUA    
     C                   PARM      2             PXDCCD                         Nº DECIMALS         
     C                   PARM                    PXFMD1                         AJUST DECIMAL (.    
     C                   PARM                    PXEDTC                         CODI EDICIO(4,M,    
     C                   PARM                    PXNMER                         RETORN ERROR        
     C                   PARM                    PXTIPA                         TIPO AJUSTE (0,1    
     C                   MOVE      PXALPH        ZXVNETA                                            
                                                                                                    
     C                   EVAL      PXALPH=*BLANKS                                                   
     C                   EVAL      PXNUM=ZXVIVA*ZXCOCAMB                                            
     C                   EVAL      ZXVTOT=ZXVTOT+PXNUM                                              
     C                   CALL      'PRD650'                                                         
     C                   PARM                    PXNUM                          CAMP NUMÈRIC        
     C                   PARM                    PXALPH                         CAMP ALFANUMÈRIC    
     C                   PARM                    PXFLDD                         Nº CARACT. VISUA    
     C                   PARM      2             PXDCCD                         Nº DECIMALS         
     C                   PARM                    PXFMD1                         AJUST DECIMAL (.    
     C                   PARM                    PXEDTC                         CODI EDICIO(4,M,    
     C                   PARM                    PXNMER                         RETORN ERROR        
     C                   PARM                    PXTIPA                         TIPO AJUSTE (0,1    
     C                   MOVE      PXALPH        ZXVIVAA                                            
                                                                                                    
     C                   EVAL      PXALPH=*BLANKS                                                   
     C                   EVAL      PXNUM=ZXVTOT                                                     
     C                   CALL      'PRD650'                                                         
     C                   PARM                    PXNUM                          CAMP NUMÈRIC        
     C                   PARM                    PXALPH                         CAMP ALFANUMÈRIC    
     C                   PARM                    PXFLDD                         Nº CARACT. VISUA    
     C                   PARM      2             PXDCCD                         Nº DECIMALS         
     C                   PARM                    PXFMD1                         AJUST DECIMAL (.    
     C                   PARM                    PXEDTC                         CODI EDICIO(4,M,    
     C                   PARM                    PXNMER                         RETORN ERROR        
     C                   PARM                    PXTIPA                         TIPO AJUSTE (0,1    
     C                   MOVE      PXALPH        ZXVTOTA                                            
                                                                                                    
     C                   EVAL      PXDCCD=2                                                         
     C                   EVAL      PXEDTC='4'                                                       
     C                   ENDSR                                                                      
      **************************************************************                                
      * Calcula importes de 1 Línea                                *                                
      *------------------------------------------------------------*                                
     C     CS_VALLIN     BEGSR                                                                      
     C                   EVAL      ZXVNET=0                                                         
     C                   EVAL      ZXVIVA=0                                                         
     C                   EVAL      ZXVTOT=0                                                         
      *                                                                                             
      * Movemos campos a campos de trabaja                                                          
      *                                                                                             
     C                   EVAL      XZCANT=S5CANT                                                    
     C                   IF        S5CANC<>0                                                        
     C                   EVAL      XZCANT=S5CANC                                                    
     C                   ENDIF                                                                      
     C                   EVAL      XZUNIM=S5UNIM                                                    
                                                                                                    
      * Buscamos en PMUNAL UNIDADES ALTERNATIVAS                                                    
                                                                                                    
     C                   EVAL      XZCOFU=1                                                         
     C                   IF        XZUNIM<>XZUNDP                                                   
     C                   EVAL      XZCIAS=@PCIAS                                                    
     C                   EVAL      XZARTI=S5ARTI                                                    
     C                   EVAL      XZVARI=S5VARI                                                    
     C                   EVAL      XZMODE=S5MODE                                                    
     C                   EVAL      ZXCA10=XZCANT                                                    
     C                   EVAL      ZXCA11=XZCANT                                                    
     C                   EVAL      ZXUN10=XZUNIM                                                    
     C                   EVAL      ZXUN11=XZUNDP                                                    
     C* CAMBIO de unidades                                                                          
     C/COPY *LIBL/QSRDSRC,SRD021                                                                    
     C                   EVAL      XZCANT=ZXCA11                                                    
     C                   ENDIF                                                                      
      * Decimales de la moneda                                                                      
     C                   EVAL      MBMONE=ZXMONV                                                    
     C     KMSDIV0       CHAIN     MSDIV0                             81                            
      * Buscamos en % de IVA según fecha del pedido                                                 
                                                                                                    
     C                   EVAL      MVTIVA=S5TIVA                                                    
     C                   EVAL      MVPABI=ZXPABI                                                    
     C                   EVAL      MVFLCD=S0FREP                                                    
     C                   IF        S0FRRE>0                                                         
     C                   EVAL      MVFLCD=S0FRRE                                                    
     C                   ENDIF                                                                      
     C     KMSIVAS       SETGT     MSIVAS                                                           
     C     KMSIVAS0      READPE    MSIVAS                                 83                        
     C                   SELECT                                                                     
     C                   WHEN      ZXTIVC=' '                                                       
     C                   EVAL      MVPIV2=*ZEROS                                                    
     C                   WHEN      ZXTIVC='0'                                                       
     C                   EVAL      MVPIV1=*ZEROS                                                    
     C                   EVAL      MVPIV2=*ZEROS                                                    
     C                   ENDSL                                                                      
      *                                                                                             
      * Calculamos los totales de línea en la moneda de la línea                                    
      * después de aplicados los dtos.                                                              
      *                                                                                             
     C                   Z-ADD     0             ZXVALOR          25 5                              
     C                   Z-ADD     0             ZXHELP1          25 5                              
     C                   Z-ADD     0             ZXHELP2          25 5                              
      *                                                                                             
     C                   EVAL      ZXVALOR=(S5PREC*XZCANT)                                          
      *                                                                                             
      * POR DESCUENTO CONFIRMADO O NORMAL                                                           
      *                                                                                             
     C                   if        S5DT1C<>0                                                        
     C                   eval      zxhelp2=zxvalor*(S5DT1C/100)                                     
     C                   eval      zxvalor=zxvalor-zxhelp2                                          
     C                   else                                                                       
     C                   if        S5DTO1<>0                                                        
     C                   eval      zxhelp2=zxvalor*(S5DTO1/100)                                     
     C                   eval      zxvalor=zxvalor-zxhelp2                                          
     C                   endif                                                                      
     C                   endif                                                                      
      *                                                                                             
     C                   if        S5DT2C<>0                                                        
     C                   eval      zxhelp2=zxvalor*(S5DT2C/100)                                     
     C                   eval      zxvalor=zxvalor-zxhelp2                                          
     C                   else                                                                       
     C                   if        S5DTO2<>0                                                        
     C                   eval      zxhelp2=zxvalor*(S5DTO2/100)                                     
     C                   eval      zxvalor=zxvalor-zxhelp2                                          
     C                   endif                                                                      
     C                   endif                                                                      
      *                                                                                             
     C                   if        S5DT3C<>0                                                        
     C                   eval      zxhelp2=zxvalor*(S5DT3C/100)                                     
     C                   eval      zxvalor=zxvalor-zxhelp2                                          
     C                   else                                                                       
     C                   if        S5DTO3<>0                                                        
     C                   eval      zxhelp2=zxvalor*(S5DTO3/100)                                     
     C                   eval      zxvalor=zxvalor-zxhelp2                                          
     C                   endif                                                                      
     C                   endif                                                                      
      *                                                                                             
     C                   if        S5DT4C<>0                                                        
     C                   eval      zxhelp2=zxvalor*(S5DT4C/100)                                     
     C                   eval      zxvalor=zxvalor-zxhelp2                                          
     C                   else                                                                       
     C                   if        S5DTO4<>0                                                        
     C                   eval      zxhelp2=zxvalor*(S5DTO4/100)                                     
     C                   eval      zxvalor=zxvalor-zxhelp2                                          
     C                   endif                                                                      
     C                   endif                                                                      
     C                   EVAL      XZAUXI=ZXVALOR                                                   
      *                                                                                             
     C                   EVAL      XZDECI=MBDECI                                                    
     C                   EVAL      XZAJUD=MBAJUD                                                    
     C* AJUSTE Y DECIMALES                                                                          
     C/COPY *LIBL/QSRDSRC,SRD001                                                                    
     C                   Z-ADD     XZAUXI        ZXVNET                                             
      * Calculamos el IVA                                                                           
     C                   EVAL      XZAUXI=ZXVNET*MVPIV1                                             
     C     XZAUXI        DIV(H)    100           XZAUXI                                             
     C* AJUSTE Y DECIMALES                                                                          
     C/COPY *LIBL/QSRDSRC,SRD001                                                                    
     C                   Z-ADD     XZAUXI        ZXIIV1           17 5                              
      * Calculamos el Recargo de equivalencia                                                       
     C                   EVAL      XZAUXI=ZXVNET*MVPIV2                                             
     C     XZAUXI        DIV(H)    100           XZAUXI                                             
     C* AJUSTE Y DECIMALES                                                                          
     C/COPY *LIBL/QSRDSRC,SRD001                                                                    
     C                   Z-ADD     XZAUXI        ZXIIV2           17 5                              
                                                                                                    
      * Omitimos BASE o IVA segun tipo de IVA                                                       
                                                                                                    
     C                   IF        MVOMTB>='1'                                                      
     C                   EVAL      ZXVNET=ZXVNET-ZXVNET                                             
     C                   ENDIF                                                                      
     C                   IF        MVOMTI>='1'                                                      
     C                   EVAL      ZXIIV1=ZXIIV1-ZXIIV1                                             
     C                   EVAL      ZXIIV2=ZXIIV2-ZXIIV2                                             
     C                   ENDIF                                                                      
     C                   EVAL      PXEDTC='4'                                                       
                                                                                                    
     C                   EVAL      ZXVIVA=ZXIIV1+ZXIIV2                                             
     C                   EVAL      ZXVTOT=ZXVNET+ZXVIVA                                             
      *                                                                                             
      * VOLUMEN DE LA LÍNEA                                                                         
      *                                                                                             
     C                   CALL      'MM2686'                                                         
     C                   PARM      S5CIAS        @PECIAS                                            
     C                   PARM      S5ARTI        @PEARTI                                            
     C                   PARM      S5VARI        @PEVARI                                            
     C                   PARM      S5MODE        @PEMODE                                            
     C                   PARM      S5TCOJ        @PETCOJ                                            
     C                   PARM      XZCANT        @PECAST                                            
     C                   PARM      S5UNIM        @PEUNST                                            
     C                   PARM      0             @PEPBRE                                            
     C                   PARM      *BLANKS       @PEUPES                                            
     C                   PARM      0             @PEVOLB                                            
     C                   PARM      *BLANKS       @PEUVOL                                            
     C                   PARM      ZZUMED        @PEUMED                                            
     C                   PARM      0             @PENBUL                                            
     C                   PARM      *BLANKS       @PETPAL                                            
     C                   PARM      *BLANKS       @PETCT1                                            
     C                   PARM      *BLANKS       @PEVTC1                                            
     C                   PARM      *BLANKS       @PEERR                                             
                                                                                                    
     C                   EVAL(H)   ZXVOL=@PEVOLB                                                    
     C                   EVAL      ZXIVOL=0                                                         
     C                   EVAL(H)   ZXIMAR=ZXVNET-M5COSM                                             
     C                   IF        ZXVOL<>0                                                         
     C                   EVAL(H)   ZXIVOL=(ZXIMAR/ZXVOL)                                            
     C                   ENDIF                                                                      
      *                                                                                             
     C                   ENDSR                                                                      
      * Búsqueda del cambio para moneda de visualización según SETUP.                               
      **************************************************************                                
      * SUBRUTINA CLACULO DE COEFICIENTE DE CAMBIO                   *                              
      *------------------------------------------------------------*                                
     C     CS_ZXCOCAM    BEGSR                                                                      
     C                   EVAL      @PDATA=S0FPED                                                    
     C                   TIME                    @PHORA                                             
     C                   IF        @PDATA=*ZEROS                                                    
     C                   EVAL      @PDATA=ZZDATS                                                    
     C                   ENDIF                                                                      
      * Busco el primer cambio existente al comenzar Enero a las 12 horas                           
      * si se desean cambios en el momento de entrada                                               
     C                   IF        @PTFHV='1'                                                       
     C                   EVAL      @PDATA=S0FRRR                                                    
     C                   ENDIF                                                                      
                                                                                                    
     C                   IF        @PDATA=*ZEROS                                                    
     C                   EVAL      @PDATA=*DATE                                                     
     C                   ENDIF                                                                      
                                                                                                    
     C                   EVAL      ZXCAMC=S0CAMB                                                    
     C                   EVAL      ZXCMPC=S0CMPR                                                    
     C                   IF        S0CAMC<>0                                                        
     C                   EVAL      ZXCAMC=S0CAMC                                                    
     C                   EVAL      ZXCMPC=S0CMPC                                                    
     C                   ENDIF                                                                      
                                                                                                    
     C                   EVAL      ZXCOCAMB=1                                                       
     C                   IF        S0MONE<>ZXMONV                                                   
     C                   CALL      'MM2555'                                                         
     C                   PARM                    @PCIAS                         PARM Qry-F4         
     C                   PARM      S0MONE        @PMON1                         PARM Qry-F4         
     C                   PARM      ZXMONV        @PMON2                         PARM Qry-F4         
     C                   PARM                    @PDATA                         PARM Qry-F4         
     C                   PARM                    @PHORA                         PARM Qry-F4         
     C                   PARM      0             @PCMCOCO                                           
     C                   PARM      0             @PCMCCCO                                           
     C                   PARM      *BLANKS       @PEERR                         PARM Qry-F4         
     C                   EVAL      ZXCOCAMB=@PCMCCCO                                                
     C                   ENDIF                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA CLACULO DE COEFICIENTE DE CAMBIO                   *                              
      *------------------------------------------------------------*                                
     C     CS_ZXCOCA2    BEGSR                                                                      
     C                   EVAL      @PDATA=S0FPED                                                    
     C                   TIME                    @PHORA                                             
     C                   IF        @PDATA=*ZEROS                                                    
     C                   EVAL      @PDATA=ZZDATS                                                    
     C                   ENDIF                                                                      
      * Busco el primer cambio existente al comenzar Enero a las 12 horas                           
      * si se desean cambios en el momento de entrada                                               
     C                   IF        @PTFHV='1'                                                       
     C                   EVAL      @PDATA=S0FRRR                                                    
     C                   ENDIF                                                                      
                                                                                                    
     C                   IF        @PDATA=*ZEROS                                                    
     C                   EVAL      @PDATA=*DATE                                                     
     C                   ENDIF                                                                      
                                                                                                    
     C                   EVAL      ZXCAMC=S0CAMB                                                    
     C                   EVAL      ZXCMPC=S0CMPR                                                    
     C                   IF        S0CAMC<>0                                                        
     C                   EVAL      ZXCAMC=S0CAMC                                                    
     C                   EVAL      ZXCMPC=S0CMPC                                                    
     C                   ENDIF                                                                      
                                                                                                    
     C                   EVAL      ZXCOCAM2=1                                                       
     C                   IF        SYCOMO<>S0MONE                                                   
     C                   CALL      'MM2555'                                                         
     C                   PARM                    @PCIAS                         PARM Qry-F4         
     C                   PARM      SYCOMO        @PMON1                         PARM Qry-F4         
     C                   PARM      S0MONE        @PMON2                         PARM Qry-F4         
     C                   PARM                    @PDATA                         PARM Qry-F4         
     C                   PARM                    @PHORA                         PARM Qry-F4         
     C                   PARM      0             @PCMCOCO                                           
     C                   PARM      0             @PCMCCCO                                           
     C                   PARM      *BLANKS       @PEERR                         PARM Qry-F4         
     C                   EVAL      ZXCOCAM2=@PCMCCCO                                                
     C                   ENDIF                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **************************************************************                                
      * Comprobación de Seguridad en Costes                        *                                
      *------------------------------------------------------------*                                
     C     CS_CABSEG     BEGSR                                                                      
      *                                                                                             
     C                   IF        ZZNPG2>='1'                                                      
     C                   ENDIF                                                                      
      *                                                                                             
     C                   ENDSR                                                                      
      **************************************************************                                
      * Comprobación de Seguridad en Costes                        *                                
      *------------------------------------------------------------*                                
     C     CS_DETSEG     BEGSR                                                                      
      *                                                                                             
     C                   IF        ZZNPG2>='1'                                                      
     C                   MOVE      *ALL'*'       S01IMAR                                            
C1632C                   MOVE      *ALL'*'       S02IMAR                                            
     C*                  MOVE      *ALL'*'       S01IVOL                                            
     C                   ENDIF                                                                      
      *                                                                                             
     C                   ENDSR                                                                      
      **************************************************************                                
      * Recalcular Importes (En interactivo)                       *                                
      *------------------------------------------------------------*                                
     C     CS_RECALIM    BEGSR                                                                      
      *                                                                                             
     C                   MOVE      SDSJNBR       ZXJNBR                                             
     C                   MOVE      UDATE         ZXDATA                                             
     C                   TIME                    ZXHORA                                             
      *                                                                                             
     C                   CLEAR                   Z1COMA                                             
     C     DSLDA         CAT(P)    Z1COMA:0      Z1COMA                                             
     C                   Z-ADD     86            JOLINE                                             
     C                   CALL      'PRD935'                                                         
     C                   PARM                    JOTRAT                                             
     C                   PARM                    JOLINE                                             
     C                   PARM                    Z1COMA                                             
      *                                                                                             
     C                   MOVE      @PCIAS        @PECIAS2                                           
     C                   EVAL      X5CIAS=S0CIAS                                                    
     C                   EVAL      X5DLGA=S0DLGA                                                    
     C                   EVAL      X5NPCO=S0NPCO                                                    
     C                   EVAL      X5DATP=S0DATP                                                    
     C                   EVAL      X5TPED=S0TPED                                                    
     C                   EVAL      X5NOPL=S0NOPL                                                    
     C                   CLEAR                   Z1COMA                                             
     C     CO2540        CAT       Z1COMA:0      Z1COMA                                             
     C                   EVAL      JOLINE=88                                                        
     C                   CALL      'PRD935'                                                         
     C                   PARM                    JOTRAT                                             
     C                   PARM                    JOLINE                                             
     C                   PARM                    Z1COMA                                             
      *                                                                                             
     C                   Z-ADD     150           ZXLOGC           15 5                              
     C                   MOVE      *BLANKS       ZXQCMD                                             
     C     ZXQCMD        CAT       'CALL (':0    ZXQCMD                                             
     C     ZXQCMD        CAT       'PRDGJ8':0    ZXQCMD                                             
     C     ZXQCMD        CAT       'CL)':0       ZXQCMD                                             
     C     ZXQCMD        CAT       'PARM(':1     ZXQCMD                                             
     C     ZXQCMD        CAT       C(1):0        ZXQCMD                                             
     C     ZXQCMD        CAT       JOTRAT:0      ZXQCMD                                             
     C     ZXQCMD        CAT       C(1):0        ZXQCMD                                             
     C     ZXQCMD        CAT       C(1):1        ZXQCMD                                             
     C     ZXQCMD        CAT       'CO2540':0    ZXQCMD                                             
     C     ZXQCMD        CAT       C(1):0        ZXQCMD                                             
     C     ZXQCMD        CAT       C(1):1        ZXQCMD                                             
     C     ZXQCMD        CAT       C(1):1        ZXQCMD                                             
     C     ZXQCMD        CAT       ')':0         ZXQCMD                                             
      *                                                                                             
     C                   CALL      'QCMDEXC'                                                        
     C                   PARM                    ZXQCMD                                             
     C                   PARM                    ZXLOGC                                             
      *                                                                                             
     C                   ENDSR                                                                      
      **************************************************************                                
      * GUARDA LOGISTICA DEL OL                                    *                                
      *------------------------------------------------------------*                                
     C     CS_LOGOL      BEGSR                                                                      
      *                                                                                             
IT228C*    @PCIAS        SETLL     MSALMA                                                           
IT228C*    @PCIAS        READE     MSALMA                                                           
IT228C*                  DOW       NOT %EOF(MSALMA)                                                 
IT228C*                  IF        M0TAL1='8' AND M0BAJA<>'1'                                       
IT228C*                  EVAL      ZXLOGOL=M0LOGS                                                   
IT228C*                  LEAVE                                                                      
IT228C*                  ENDIF                                                                      
IT228C*    @PCIAS        READE     MSALMA                                 84                        
IT228C*                  ENDDO                                                                      
      *                                                                                             
IT228 * Add-begin                                                                                   
                  i2ol = *zero;                                                                     
                  open msalma08;                                                                    
                  setll (@PCIAS:'8') msalma08;                                                      
                  reade (@PCIAS:'8') msalma08;                                                      
                  dow not %eof(msalma08);                                                           
                    if m0tal1 = '8' and m0baja <> '1' and                                           
                        i2OL < %elem(T_logol) ;                                                     
                      i2OL += 1;                                                                    
                      T_logol(i2OL) = m0logs;                                                       
                    endif;                                                                          
                    reade (@PCIAS:'8') msalma08;                                                    
                  enddo;                                                                            
                  close msalma08;                                                                   
IT228 * Add-end                                                                                     
IT228C*                  EVAL      ZXMAGA_OL=*BLANKS                                                
IT228C*                  EVAL      PECTAB='INO2'                                                    
IT228C*                  EVAL      PECLTA='MAGA'                                                    
IT228C*    KPMTABD       CHAIN     PMTABD                                                           
IT228C*                  IF        %FOUND(PMTABD)                                                   
IT228C*                  EVAL      ZXMAGA_OL=PEDESC                                                 
IT228C*                  ENDIF                                                                      
IT228C*                                                                                             
     C                   ENDSR                                                                      
      **************************************************************                                
      * Rutina Base para Fluidra direct                            *                                
      **************************************************************                                
     C     FD_BASE       BEGSR                                                                      
      *                                                                                             
      * Determinar el tipo de empresa en la que estoy                                               
      *                                                                                             
     C                   SELECT                                                                     
      * Comercial                                                                                   
     C                   WHEN      S0PPED<>'99' AND ZZALOL<'1'                                      
     C                   EVAL      @FDORIG=0                                                        
      * Productiva                                                                                  
     C                   WHEN      S0PPED='99' AND ZZALOL<'1'                                       
     C                   EVAL      @FDORIG=2                                                        
      * Trace                                                                                       
     C                   WHEN      ZZALOL='1'                                                       
     C                   EVAL      @FDORIG=3                                                        
      *                                                                                             
     C                   ENDSL                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      *                                                                                             
      **************************************************************                                
      * Altera temporalmente la logística si SIOL=2 y no es OL                                      
      *------------------------------------------------------------*                                
     C     CS_ALTSIOL    BEGSR                                                                      
      *                                                                                             
     C                   EVAL      S5LINE=0                                                         
     C     KCODEPE       SETLL     CODEPE                                                           
     C     KCOCAPE       READE     CODEPE                                                           
     C                   DOW       NOT %EOF(CODEPE)                                                 
     C                   IF        S5ARTI<>ZXARTPOR                                                 
     C     KMSARTI00     CHAIN     MSARTI00                                                         
     C     KCODEPE       CHAIN     ED0050W                                                          
     C                   IF        M5SIOL='2'                                                       
     C                             AND T2ENTD=1                                                     
     C                   EVAL      S5TPE4='2'                                                       
     C*                  EVAL      S5LOGE=ZXLOGOL                                                   
     C                   ENDIF                                                                      
     C                   UPDATE    RCODEPE                                                          
     C                   ENDIF                                                                      
     C     KCOCAPE       READE     CODEPE                                                           
     C                   ENDDO                                                                      
      *                                                                                             
     C                   ENDSR                                                                      
      **************************************************************                                
      * No se permite línea FD con bloqueo de compras              *                                
      *------------------------------------------------------------*                                
     C     CS_PROCESO    BEGSR                                                                      
F-2OL /free                                                                                         
         callp PgmOL(@PCIAS:@PDLGA:pPointer);                                                       
         pDsPgmOl = pPointer;                                                                       
         zxalmol = zoldl;                                                                           
F-2OL /end-free                                                                                     
     C                   EVAL      S0CIAS=@PCIAS                                                    
     C                   EVAL      S0DLGA=@PDLGA                                                    
     C                   EVAL      S0NPCO=@PNPCO                                                    
     C                   EVAL      S0TPED=@PTPED                                                    
     C                   EVAL      S0DATP=@PDATP                                                    
     C                   EVAL      S0NOPL=@PNOPL                                                    
     C     KCOCAPE       CHAIN(N)  COCAPE                                                           
     C                   IF        S0PPED<>'99'                                                     
      *                                                                                             
      * Comercial: Confirmación del pedido                                                          
      *                                                                                             
     C                   IF        @FDORIG=0                                                        
      *                                                                                             
      * Algoritmo de calculo ED (Sólo V2 activa)                                                    
      *                                                                                             
     C                   IF        ZEEDV2='1' AND S0MOST<>'1'                                       
     C                   CALL      'ED0050'                             55                          
     C                   PARM                    @PCIAS                                             
     C                   PARM                    @PDLGA                                             
     C                   PARM                    @PNPCO                                             
     C                   PARM                    @PTPED                                             
     C                   PARM                    @PDATP                                             
     C                   PARM                    @PNOPL                                             
     C                   ENDIF                                                                      
      *                                                                                             
     C                   IF        ZEGIND='1' AND ZXERRO<>'R'                                       
C1078C                             AND T3ADOM<>'1'                                                  
     C                   CALL      'CO2735'                             55                          
     C                   PARM                    @PCIAS                                             
     C                   PARM                    @PDLGA                                             
     C                   PARM                    @PNPCO                                             
     C                   PARM                    @PTPED                                             
     C                   PARM                    @PDATP                                             
     C                   PARM                    @PNOPL                                             
     C                   PARM      *BLANKS       @POPCI                                             
     C                   PARM      *BLANKS       @PERR2                                             
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
     C*                  EXSR      CS_ALTSIOL                                                       
     C                   ENDIF                                                                      
      *                                                                                             
     C     KCOCAPE       SETLL     CODEPE                                                           
     C     KCOCAPE       READE     CODEPE                                                           
     C                   DOW       NOT%EOF                                                          
      *                                                                                             
     C                   IF        S5TPE4='2'                                                       
     C                   EVAL      M5CIAS=S5CIAS                                                    
     C                   EVAL      M5ARTI=S5ARTI                                                    
     C                   EVAL      M5VARI=S5VARI                                                    
     C                   EVAL      M5MODE=S5MODE                                                    
     C     KMSARTI00     CHAIN     MSARTI00                                                         
CR653C*                                                                                             
CR653C*                  EXSR      CS_PRV2                                                          
CR653C*                  IF        @XPEVT<>'2'                                                      
CR653C*                                                                                             
     C                   IF        %FOUND  AND M5SIOL='2'                                           
IT228c                   if        (%lookup(S5LOGE:T_logol)>0)                                      
IT228C                   ELSE                                                                       
IT228C                   IF        LOEDL<>*BLANKS                                                   
IT228C*                  EVAL      S5LOGE=ZXLOGOL                                                   
IT228C                   EVAL      S5LOGE=LOEDL                                                     
IT228C                   ELSE                                                                       
IT228C                   EVAL      S5LOGE=LOEEM                                                     
IT228C                   ENDIF                                                                      
IT228c                   endif                                                                      
     C                   ELSE                                                                       
     C                   EVAL      M0CIAS=S5CIAS                                                    
     C                   EVAL      M0LOGE=S5LOGE                                                    
     C     KMSALMA05     CHAIN     MSALMA05                                                         
C1078C*                  IF        M0PUBI='1' AND %FOUND                                            
C1078C                   IF        %FOUND                                                           
IT228C* ACCEDER AL PMTABD                                                                           
      *                                                                                             
IT228C                   EVAL      PECIAS=S5CIAS                                                    
IT228C                   EVAL      PECTAB='INO2'                                                    
IT228C                   EVAL      PECLTA='MAGV'+S5LOGE                                             
IT228C     KPMTABD       CHAIN     PMTABD                                                           
IT228C                   IF        %FOUND(PMTABD)                                                   
     C                   EVAL      T3CIAS=@PCIAS                                                    
     C                   EVAL      T3DLGA=M0DLGA                                                    
IT228C                   ELSE                                                                       
     C     KEDPARM       CHAIN     EDPARM                                                           
     C                   IF        T3OPL1=*BLANKS  AND T3LVIR<>*BLANKS                              
     C                             AND %FOUND                                                       
C2557C                             AND M0TAL1<>'7'                                                  
     C                   EVAL      S5LOGE=T3LVIR                                                    
     C                   ENDIF                                                                      
IT228C                   ENDIF                                                                      
IT228C* __________________________________________________                                          
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
CR653C*                  ENDIF                                                                      
      *                                                                                             
     C                   CALL      'CO2610'                             55                          
     C                   PARM                    @PCIAS                                             
     C                   PARM      S5DLGA        @PEDLGA                                            
     C                   PARM      S5ARTI        @PEARTI                                            
     C                   PARM      S5VARI        @PEVARI                                            
     C                   PARM      S5MODE        @PEMODE                                            
     C                   PARM      *BLANKS       @PETCOJ                                            
     C                   PARM      *ZEROS        @PEFRRE                                            
     C                   PARM      *ZEROS        @PEFDDS                                            
     C                   PARM      S5CANT        @PECANT                                            
     C                   PARM      S5UNIM        @PEUNIM                                            
     C                   PARM      S5LOGE        @PELOGE                                            
     C                   PARM      *BLANKS       @PETPLA                                            
     C                   PARM      '*'           @PERRO                                             
     C                   PARM      S5NPCO        @FDNPCO                                            
     C                   PARM      S5TPED        @FDTPED                                            
     C                   PARM      S5DATP        @FDDATP                                            
     C                   PARM      S5NOPL        @FDNOPL                                            
     C                   PARM      S5LINE        @FDLINE                                            
     C                   EVAL      S5TPLA=@PETPLA                                                   
     C                   EVAL      S5FRRE=@PEFRRE                                                   
     C                   MOVE      @PEFDDS       S5DISP                                             
     C                   UPDATE    RCODEPE                                                          
     C     KCOCAPE       READE     CODEPE                                                           
     C                   ENDDO                                                                      
      *                                                                                             
     C                   CALL      'ED1020'                             55                          
     C                   PARM      S0CIAS        @PCIAS                                             
     C                   PARM      S0DLGA        @PDLGA                                             
     C                   PARM      S0NPCO        @PNPCO                                             
     C                   PARM      S0TPED        @PTPED                                             
     C                   PARM      S0DATP        @PDATP                                             
     C                   PARM      S0NOPL        @PNOPL                                             
     C                   PARM      'RP'          @POPCI                                             
     C                   PARM      @PERRO        @PERRO                                             
Q0316                                                                                               
Q0316C     KCOCAPE       CHAIN     COCAPE                                                           
Q0316C                   IF        %FOUND(COCAPE)                                                   
Q0316C                   CLEAR                   S0FRRE                                             
Q0316C     KCOCAPE       SETLL     CODEPE                                                           
Q0316C     KCOCAPE       READE     CODEPE                                                           
Q0316C                   DOW       NOT%EOF                                                          
Q0316C                   IF        S5FRRE>S0FRRE                                                    
Q0316C                   EVAL      S0FRRE=S5FRRE                                                    
Q0316C                   ENDIF                                                                      
Q0316C     KCOCAPE       READE     CODEPE                                                           
Q0316C                   ENDDO                                                                      
Q0316C                   UPDATE    RCOCAPE                                                          
Q0316C                   ENDIF                                                                      
      *                                                                                             
     C                   ENDSR                                                                      
      **************************************************************                                
      * No se permite línea FD con bloqueo de compras              *                                
      *------------------------------------------------------------*                                
     C     CS_CPYDAT     BEGSR                                                                      
     C                   EVAL      S0CIAS=@PCIAS                                                    
     C                   EVAL      S0NPCO=@PNPCO                                                    
     C                   EVAL      S0TPED=@PTPED                                                    
     C                   EVAL      S0DATP=@PDATP                                                    
     C                   EVAL      S0NOPL=@PNOPL                                                    
     C                   EVAL      S0DLGA=@PDLGA                                                    
     C     KCOCAPE27     CHAIN     COCAPE27                                                         
     C                   WRITE     RCOCAPE                                                          
      *                                                                                             
     C                   EVAL      S5CIAS=@PCIAS                                                    
     C                   EVAL      S5DLGA=@PDLGA                                                    
     C                   EVAL      S5NPCO=@PNPCO                                                    
     C                   EVAL      S5TPED=@PTPED                                                    
     C                   EVAL      S5DATP=@PDATP                                                    
     C                   EVAL      S5NOPL=@PNOPL                                                    
C1632C                   MOVE      '1'           NOREG             1                                
C1158C*    KCODEPE26     SETLL     CODEPE26                                                         
C1158C*    KCODEPE26     READE     CODEPE26                                                         
C1158C     KCODEPE08     SETLL     CODEPE08                                                         
C1158C     KCODEPE08     READE     CODEPE08                                                         
     C                   DOW       NOT%EOF                                                          
C1632C                   MOVE      '0'           NOREG             1                                
     C                   IF        T3OPL1<>*BLANKS                                                  
     C                   EVAL      S5LOGE=T3OPL1                                                    
     C                   ENDIF                                                                      
     C                   WRITE     RCODEPE                                                          
C1158C*    KCODEPE26     READE     CODEPE26                                                         
C1158C     KCODEPE08     READE     CODEPE08                                                         
     C                   ENDDO                                                                      
      *                                                                                             
     C                   ENDSR                                                                      
C1158 *                                                                                             
C1158 **************************************************************                                
C1158 * VERIFICAR SI HAY EQUIVALENTES CON STOCK SUFICIENTE EN EL   *                                
C1158 * CASO DEL QUE NO LO HAYA PARA EL ARTÍCULO PEDIDO            *                                
C1158 **************************************************************                                
C1158                                                                                               
C1158C     VEREQU        BEGSR                                                                      
C1158 *                                                                                             
C1158C                   MOVEL     *BLANKS       SUFBAJA                                            
C1158 *                                                                                             
C1158C                   EVAL      ZXARTIX=S5ARTI                                                   
C1158C                   EVAL      ZXVARIX=S5VARI                                                   
C1158C                   EVAL      ZXMODEX=S5MODE                                                   
C1158C                   EVAL      I0ARES=ZXARVMX                                                   
C1158C     I0ARES        SETLL     MSARAL                                                           
C1158C     I0ARES        READE     MSARAL                                                           
C1158 *                                                                                             
C1158C                   DOW       NOT %EOF                                                         
C1158C                             AND SUFBAJA<>'E'                                                 
C1158 *                                                                                             
C1158C                   IF        I0TROL = 0 AND I0BAJA = 0                                        
C1158C                             AND I0DTIN <= *DATE AND                                          
C1158C                             ( I0DTFI = 0 OR I0DTFI >= *DATE )                                
C1158 *                                                                                             
C1158C                   MOVEL(P)  I0ARAL        ZXARVMX                                            
C1158C                   EVAL      M5ARTI=ZXARTIX                                                   
C1158C                   EVAL      M5VARI=ZXVARIX                                                   
C1158C                   EVAL      M5MODE=ZXMODEX                                                   
C1158C     KMSARTI002    CHAIN     MSARTI00                                                         
C1158 *                                                                                             
C1158C                   IF        %FOUND AND M5PPV2 < '1'                                          
C1158 *                                                                                             
C1158C                   EVAL      NDCIAS=M5CIAS                                                    
C1188C                   EVAL      NDARTI=M5ARTI                                                    
C1158C                   EVAL      NDVARI=M5VARI                                                    
C1158C                   EVAL      NDMODE=M5MODE                                                    
C1158C     KMSCOJC       CHAIN     MSCOJC                                                           
C1158 *                                                                                             
C1158C                   IF        %FOUND                                                           
C1158C                   EVAL      @PETCOJ='4'                                                      
C1158C                   ELSE                                                                       
C1158C                   EVAL      @PETCOJ=*BLANKS                                                  
C1158C                   ENDIF                                                                      
C1158 *                                                                                             
C1158C**                 MOVEL(P)  I0ARAL        @PEARVM                                            
C1158C**                 CALL      'CO2600'                                                         
C1158C**                 PARM      S5CIAS        @PECIAS                                            
C1158C**                 PARM      S0CUST        @PECUST                                            
C1158C**                 PARM                    @PEARVM                                            
C1158C**                 PARM                    @PETCOJ                                            
C1158C**                 PARM      S0FPED        @PEFPED                                            
C1158C**                 PARM      S5CANT        @PECANT                                            
C1158C**                 PARM      S5UNIM        @PEUNIM                                            
C1158C**                 PARM      S0MONE        @PEMONP                                            
C1158C**                 PARM      S0MONB        @PEMONB                                            
C1158C**                 PARM                    @PEZXCO                                            
C1158C**                 PARM      S0CLTR        @PECLTR                                            
C1158C**                 PARM      0             @PEPREC                                            
C1158C**                 PARM      0             @PEDTO1                                            
C1158C**                 PARM      0             @PEDTO2                                            
C1158C**                 PARM      0             @PEDTO3                                            
C1158C**                 PARM      0             @PEDTO4                                            
C1158C**                 PARM      *BLANKS       @PEMONE                                            
C1158C**                 PARM      0             @PECADP                                            
C1158C**                 PARM      *BLANKS       @PEUNDP                                            
C1158C**                 PARM      *BLANKS       @PETCST                                            
C1158C**                 PARM      *BLANKS       @PETPPR                                            
C1158C**                 PARM      *BLANKS       @PEPRMO                                            
C1158C**                 PARM      0             @PEPCM1                                            
C1158C**                 PARM      0             @PEPCM2                                            
C1158C**                 PARM      0             @PEPCM3                                            
C1158C**                 PARM      'F'           @PEERR                                             
C1158 *                                                                                             
C1158C**                 IF        @PEPREC > 0                                                      
C1158C                   EVAL      SUFBAJA='e'                                                      
C1158C                   EVAL      ZXARTI=ZXARTIX                                                   
C1158C                   EVAL      ZXVARI=ZXVARIX                                                   
C1158C                   EVAL      ZXMODE=ZXMODEX                                                   
C1158C                   EXSR      CALCSTKDIS                                                       
C1158C                   IF        S5CANT <= ZXSTKDIS                                               
C1158C                   EVAL      SUFBAJA='E'                                                      
C1158C                   ENDIF                                                                      
C1158C**                 ENDIF                                                                      
C1158C                   ENDIF                                                                      
C1158C                   ENDIF                                                                      
C1158C     I0ARES        READE     MSARAL                                                           
C1158C                   ENDDO                                                                      
C1158 *                                                                                             
C1158C                   EVAL      ZXARTI=S5ARTI                                                    
C1158C                   EVAL      ZXVARI=S5VARI                                                    
C1158C                   EVAL      ZXMODE=S5MODE                                                    
C1158C                   EXSR      CALCSTKDIS                                                       
C1158 *                                                                                             
C1158C                   IF        S5CANT > ZXSTKDIS                                                
C1158C                             AND SUFBAJA = 'E'                                                
C1158C                   SETON                                        33                            
C1158C                   ELSE                                                                       
C1158C                   SETOFF                                       33                            
C1158C                   ENDIF                                                                      
C1158C                   EVAL      IND33=*IN33                                                      
C1158 *                                                                                             
C1158C                   ENDSR                                                                      
C1158 *                                                                                             
C1158 **************************************************************                                
C1158 * CALCULAR STOCK DISPONIBLE DE UN ARTÍCULO                   *                                
C1158 *------------------------------------------------------------*                                
C1158                                                                                               
C1158C     CALCSTKDIS    BEGSR                                                                      
C1158 *                                                                                             
C1158C                   Z-ADD     0             ZXSTKDIS                                           
C1158C                   EVAL      M0CIAS=S5CIAS                                                    
C1158 *                                                                                             
C1158C                   IF        S5TPE4='2'                                                       
IT228C*                  EVAL      M0MAGA=ZXMAGA_OL                                                 
IT228C                   if        (%lookup(S5LOGE:T_logol)>0)                                      
IT228C*                  EVAL      M0MAGA=S5LOGE                                                    
IT228C                   EVAL      M0CIAS=S5CIAS                                                    
IT228C                   EVAL      M0LOGE=S5LOGE                                                    
IT228C     KMSALMA05     CHAIN     MSALMA05                                                         
IT228C*                  IF        %FOUND AND M0BAJA<>'1'                                           
IT228C                   ELSE                                                                       
IT228C*_call al MM1411_________                                                                     
IT228C                   EXSR      LOG_VIRTUAL                                                      
IT228C*                  ENDIF                                                                      
IT228C                   ENDIF                                                                      
C1158C     KMSALMA       CHAIN     MSALMA                                                           
C1158C*C1865             IF        %FOUND AND M0TAL1='8' AND M0BAJA=''                              
C1865C                   IF        %FOUND AND M0TAL1='8' AND M0BAJA<>'1'                            
F-2OLC                   EVAL      @qmaga = M0MAGA                                                  
C1158C*                  call      'JV0097'                                                         
F-2OLC                   call      'MM1412'                                                         
C1158C                   PARM                    @PCIAS                                             
C1158C                   PARM      ZXARTI        @PEARTI                                            
C1158C                   PARM      ZXVARI        @PEVARI                                            
C1158C                   PARM      ZXMODE        @PEMODE                                            
C1158C                   PARM      0             @QSTOK           15 5                              
C1158C                   PARM      ' '           @QSERV            2                                
F-2OLC                   PARM                    @qmaga            5                                
C1158C                   EVAL      ZXSTKDIS = @QSTOK                                                
C1158C                   ENDIF                                                                      
C1158C                   ELSE                                                                       
C1158C                   EVAL      M0LOGE=S5LOGE                                                    
C1158C     KMSALMA05     SETLL     MSALMA05                                                         
C1158C     KMSALMA05     READE     MSALMA05                                                         
C1158C                   DOW       NOT %EOF                                                         
C1158C*C1865                       AND M0TAL1<>'' AND M0BAJA<>''                                    
C1865C                   IF        M0TAL1='' AND M0BAJA<>'1'                                        
C1865C                   LEAVE                                                                      
C1865C                   ENDIF                                                                      
C1158C     KMSALMA05     READE     MSALMA05                                                         
C1158C                   ENDDO                                                                      
C1158C                   IF        NOT %EOF                                                         
C1158C                   EVAL      M1CIAS=M0CIAS                                                    
C1158C                   EVAL      M1MAGA=M0MAGA                                                    
C1158C                   EVAL      M1ARTI=ZXARTI                                                    
C1158C                   EVAL      M1VARI=ZXVARI                                                    
C1158C                   EVAL      M1MODE=ZXMODE                                                    
C1158C     KMSSTO0       CHAIN     MSSTO0                                                           
C1158C                   IF        %FOUND                                                           
C1158C                   EVAL      ZXSTKDIS = ZXSTKDIS + M1SACT - M1SKRE                            
C1158C                                        - M1SKRP - M1SKR1 - M1SKR2                            
C1158C                   ENDIF                                                                      
C1158C                   ENDIF                                                                      
C1158C                   ENDIF                                                                      
C1158 *                                                                                             
C1158C                   ENDSR                                                                      
C1158 *                                                                                             
CR653 **************************************************************                                
CR653 * COMPROBAR SI EL PROVEEDOR ES DE ENTREGAS DIRECTAS          *                                
CR653 *------------------------------------------------------------*                                
CR653C     CS_PRV2       BEGSR                                                                      
CR653C*                  CALL      'XBB001'                                                         
CR653C*                  PARM      S5CIAS        @XCIAS                                             
CR653C*                  PARM      S5ARTI        @XARTI                                             
CR653C*                  PARM      S5VARI        @XVARI                                             
CR653C*                  PARM      S5MODE        @XMODE                                             
CR653C*                  PARM      *BLANKS       @XPRVR                                             
CR653C*                  PARM      *BLANKS       @XGRUP                                             
CR653C*                  PARM      *BLANKS       @XPEVT                                             
CR653C                   ENDSR                                                                      
      ******************************************************************************************    
IT228                                                                                               
IT228 **************************************************************                                
IT228 * RECALCULAR LOGISTICA VIRTUAL                               *                                
IT228 *------------------------------------------------------------*                                
IT228 *                                                                                             
IT228C     LOG_VIRTUAL   BEGSR                                                                      
IT228 *                                                                                             
IT228 * Obtener logística virtual                                                                   
IT228 *                                                                                             
IT228C                   CALL      'MM1411'                                                         
IT228C                   PARM                    s5CIAS                                             
IT228C                   PARM      S5LOGE        @PEALMA                                            
IT228C                   PARM      '1'           @PETIPO                                            
IT228C                   PARM                    s5DLGA                                             
IT228C                   PARM                    @PERESP                                            
IT228 *                                                                                             
IT228C                   IF        @PERESP <> *BLANKS                                               
IT228C                   EVAL      M0MAGA = @PERESP                                                 
IT228C                   ENDIF                                                                      
IT228C                   ENDSR                                                                      
IT228 *                                                                                             
     C* validación de opciones                                                                      
      ******************************************************************************************    
     C/COPY *LIBL/QSRDSRC,SRD030                                                                    
** CTDATA C                                                                                         
'                                                                                                   
