      **************************************************************                                
      * APLICACIÓ: MÒDUL COMERCIAL                                 *                                
      **************************************************************                                
      * TITOL: ED0050  © FLUIDRA SERVICES                          *                                
      * DATA CREACIO:  25/01/2010                                  *                                
      * FUNCIO DEL PROGRAMA: Entregas Directas. Algoritmo decisión *                                
      *                                                            *                                
      * DOCUMENTACIÓN PARAMETROS:                                  *                                
      * @PCIAS   CIAS de la Clave de Pedido de la empresa @PCIAS   *                                
      * @PDLGA   DLGA de la Clave de Pedido de la empresa @PCIAS   *                                
      * @PNPCO   NPCO de la Clave de Pedido de la empresa @PCIAS   *                                
      * @PTPED   TPED de la Clave de Pedido de la empresa @PCIAS   *                                
      * @PDATP   DATP de la Clave de Pedido de la empresa @PCIAS   *                                
      * @PNOPL   NOPL de la Clave de Pedido de la empresa @PCIAS   *                                
      **************************************************************                                
55138 * Modificación: 55138                                        *                                
55138 *        Autor: Josep de las Heras                           *                                
55138 * Fecha Inicio: 14/05/2024                                   *                                
55138 *  Descripción: Evitar casque pgm cuando pedido tiene        *                                
55138 *               artículos deservicio.                        *                                
55138 **************************************************************                                
C8918 * Modificación: C8918                                        *                                
C8918 *        Autor: JULIAN                                       *                                
C8918 * Fecha Inicio: 30/01/2025                                   *                                
C8918 *  Descripción: EXCEPCION TRANSPORTISTA AL CONFIRMAR PEDIDO  *                                
C8918 *               EN CALCULO DOM                               *                                
C8918 **************************************************************                                
     H DATEDIT(*YMD/)                                                                               
     H OPTION(*NODEBUGIO:*SRCSTMT)                                                                  
     H DFTACTGRP(*NO) ACTGRP(*CALLER)                                                               
      *                                                                                             
     FED0050W   UF A E           K DISK    USROPN                                                   
     FPMEMPR    IF   E           K DISK                                                             
     FEDPARM    IF   E           K DISK                                                             
     FEDPARC    IF   E           K DISK                                                             
     FCOCLIN    IF   E           K DISK    PREFIX(C_)                                               
     FCOCAPE    IF   E           K DISK                                                             
     FCODEPE    iF   E           K DISK                                                             
     FMSLOGI    IF   E           K DISK                                                             
     FMSLOAD    IF   E           K DISK                                                             
     FMSALMA    IF   E           K DISK                                                             
     FMSALMA05  IF   E           K DISK    RENAME(RMSALMA:RMSALMA05)                                
     FMSALMA08  IF   E           K DISK    rename(rmsalma:rmsalma08) usropn                         
     FMSDLDL05  IF   E           K DISK    RENAME(RMSDLDL:RMSDLDL05)                                
     FMSDLDL03  IF   E           K DISK    RENAME(RMSDLDL:RMSDLDL03)                                
     FMSDIV0    IF   E           K DISK                                                             
     FMSIVAS    IF   E           K DISK                                                             
     FPMUNAL    IF   E           K DISK                                                             
     FPMTABD    IF   E           K DISK                                                             
     FMSSTOK    IF   E           K DISK                                                             
     FMSSTO01   IF   E           K DISK                                                             
     FMSTRTA    IF   E           K DISK                                                             
     FUTCOM0    IF   E           K DISK                                                             
     FPUPROV    IF   E           K DISK                                                             
     FPUPRP0    IF   E           K DISK                                                             
     FGXEQPR    IF   E           K DISK                                                             
     FPMLIBL    IF   E           K DISK                                                             
     FMSARTI00  IF   E           K DISK                                                             
     FMSARTI    IF   E           K Disk    ExtFile(FileArti_erp)                                    
     F                                     RENAME(RMSARTI:RMSARTIXX)                                
     F                                     USROPN PREFIX(A_)                                        
     FMITMAS00  IF   E           K DISK    ExtFile(File_mitmas)                                     
     F                                     USROPN                                                   
     FMSCOJC    IF   E           K Disk    ExtFile(FileCojc_erp)                                    
     F                                     RENAME(RMSCOJC:RMSCOJCXX)                                
     F                                     USROPN                                                   
     FMSCOJD    IF   E           K Disk    ExtFile(FileCojd_erp)                                    
     F                                     RENAME(RMSCOJD:RMSCOJDXX)                                
     F                                     USROPN                                                   
     FPMCAOR01  IF   E           K DISK    USROPN                                                   
     FPMCAOR08  IF   E           K DISK    RENAME(RPMCAOR:RPMCAOR08)                                
     F                                     USROPN                                                   
     FPMDEOR05  IF   E           K DISK    USROPN                                                   
     FCMNDIV00  IF   E           K DISK    ExtFile(File_cmndiv)                                     
     F                                     USROPN                                                   
     FMPDHED00  IF   E           K DISK    ExtFile(File_mpdhed)                                     
     F                                     USROPN PREFIX(H_)                                        
     FMPDMAT00  IF   E           K DISK    ExtFile(File_mpdmat)                                     
     F                                     USROPN                                                   
     FGXEQAR    IF   E           K DISK                                                             
     FCOCAIP    IF   E           K DISK                                                             
     FAQPEDI00  IF   E           K DISK    ExtFile(File_AQPEDI)                                     
     F                                     USROPN                                                   
     FZAQITN00  IF   E           K DISK    ExtFile(File_ZAQITN)                                     
     F                                     USROPN                                                   
     FGMTABD01  IF   E           K DISK    ExtFile(File_GMTABD)                                     
     F                                     USROPN RENAME(GMTABD:RGMTABD01)                          
     FMITFAC00  IF   E           K DISK    ExtFile(File_MITFAC)                                     
     F                                     USROPN                                                   
                                                                                                    
     D* AREA DE DADES DE PROGRAMA I INICIALITZACIO DE VALORS COMUNS                                 
     D                SDS                                                                           
     D  SDSPGM                 1     10                                                             
     D    CCCPGM                     10    OVERLAY(SDSPGM)                                          
     D  SDSJOB               244    253                                                             
     D    CCCJOB                     10    OVERLAY(SDSJOB)                                          
     D  SDSSTS           *STATUS                                                                    
     D  SDSUSR               254    263                                                             
     D  SDSJNBR              264    269                                                             
                                                                                                    
     D* AREA DE DADES LOCAL I INICIALITZACIO DE VALORS COMUNS                                       
     D  DSLDA        E DS                  EXTNAME(PURLDADS)                                        
     D    CCCDEEM                    30    OVERLAY(ZZDEEM)                                          
                                                                                                    
      * PLANTILLA D'INDICADORS DEL PROGRAMA (ELS RESERVATS NO SURTEN)                               
     D  INDICADORS   E DS                  BASED(INDICADORP)                                        
     D                                     EXTNAME(INDDS:RIND0199)                                  
     D  INDICADORP     S               *   INZ(%ADDR(*IN))                                          
                                                                                                    
     D  @PEFILE1       S             10                                                             
     D  @PELOG11       S             10                                                             
     D  @PELOG12       S             10                                                             
     D  @PELOG13       S             10                                                             
     D  @PEFILE2       S             10                                                             
     D  @PELOG21       S             10                                                             
     D  @PELOG22       S             10                                                             
     D  @PELOG23       S             10                                                             
     D  @PEFILE3       S             10                                                             
     D  @PELOG31       S             10                                                             
     D  @PELOG32       S             10                                                             
     D  @PELOG33       S             10                                                             
     D  @PEPROGR       S             10                                                             
     D  @PEPARMS       S            250                                                             
      *                                                                                             
     D  @PCIAS         S                   LIKE(S5CIAS)                                             
     D  @PDLGA         S                   LIKE(S5DLGA)                                             
     D  @PNPCO         S                   LIKE(S5NPCO)                                             
     D  @PTPED         S                   LIKE(S5TPED)                                             
     D  @PDATP         S                   LIKE(S5DATP)                                             
     D  @PNOPL         S                   LIKE(S5NOPL)                                             
     D  @3LINE         S                   LIKE(S5LINE)                                             
     D  @@PLINE        S                   LIKE(S5LINE)                                             
     D  @PLINE         S                   LIKE(S5LINE)                                             
     D  @FDARV1        S             25                                                             
     D  @FDCOM2        S             25                                                             
     D  @PCUST         S             10                                                             
     D  @PTDI1         S              2                                                             
     D  @PEDAU         S              3                                                             
     D  @PLOGI         S              1  0                                                          
     D  @PORIG         S              1  0                                                          
     D  @PINTE         S              1  0                                                          
                                                                                                    
     D  @PECIAS        S                   LIKE(M1CIAS) INZ                                         
     D  @PEDLGA        S                   LIKE(ZZDLGA) INZ                                         
     D  @PEARTI        S                   LIKE(M1ARTI) INZ                                         
     D  @PEVARI        S                   LIKE(M1VARI) INZ                                         
     D  @PEMODE        S                   LIKE(M1MODE) INZ                                         
     D  @PEDATD        S                   LIKE(M1DAT8) INZ                                         
     D  @PEDATH        S                   LIKE(M1DAT8) INZ                                         
     D  @PECANT        S                   LIKE(M1SACT) INZ                                         
     D  @PECAN1        S                   LIKE(M1SACT) INZ                                         
     D  @PECAN2        S                   LIKE(M1SACT) INZ                                         
     D  @PECUST        S             10                                                             
     D  @PETCOJ        S              1                                                             
     D  @PERRO         S              1                                                             
     D  @PINCI         S              3                                                             
C8918D  ZXNODOM        S              1                                                             
                                                                                                    
     D  ZXTCOJ         S                   LIKE(NDTCOJ)                                             
     D  ZXPRVR         S                   LIKE(M5PRVR)                                             
     D  ZXSTKA         S             15  5                                                          
     D  ZXCANS0        S             15  5                                                          
     D  ZXCANE0        S             15  5                                                          
     D  ZXDEPO0        S             15  5                                                          
     D  ZXSTDD         S             15  5                                                          
     D  ZXDATD         S               D   DATFMT(*ISO)                                             
     D  ZXDATH         S               D   DATFMT(*ISO)                                             
     D  ZXCIAD         S                   LIKE(S5CIAS)                                             
     D  ZXARTTRAC      S                   LIKE(M5ARTI)                                             
     D  ZXVARTRAC      S                   LIKE(M5VARI)                                             
     D  ZXMODTRAC      S                   LIKE(M5MODE)                                             
     D  ZXARTDLGA      S             15                                                             
     D  ZXVARDLGA      S              3                                                             
     D  ZXMODDLGA      S              3                                                             
     D  ZXARVM         S             25                                                             
     D  ZXARVMPRO      S             25                                                             
     D  ZKARVM         S             25                                                             
     D  ZXARVP         S                   LIKE(C3ARVP)                                             
     D  ZXCANT         S                   LIKE(S5CANT)                                             
     D  Z0CANT         S                   LIKE(S5CANT)                                             
     D  Z1CANT         S                   LIKE(S5CANT)                                             
     D  Z2CANT         S                   LIKE(S5CANT)                                             
     D  ZXLOGE         S                   LIKE(S5LOGE)                                             
     D  XZAUXI1        S             29  9                                                          
     D  ZXCOCAMB       S             15  9                                                          
     D  @PCMCOCO       S             20  9                                                          
     D  @PCMCCCO       S             20  9                                                          
     D  @PDATA         S                   LIKE(S0DATP)                                             
     D  @PHORA         S                   LIKE(S0NOPL)                                             
     D  @PMON1         S                   LIKE(S0MONE)                                             
     D  @PMON2         S                   LIKE(S0MONE)                                             
     D  @PDTOE         S                   LIKE(S5DTO1)                                             
     D  @PEERR         S              1                 INZ                                         
     D  ZXSERV         S                   LIKE(PEBL61)                                             
     D  XZARTI         S                   LIKE(S5ARTI)                                             
     D  XZVARI         S                   LIKE(S5VARI)                                             
     D  XZMODE         S                   LIKE(S5MODE)                                             
     D  XZCIAS         S                   LIKE(S5CIAS)                                             
     D  ZXMONE2        S                   LIKE(S0MONE)                                             
     D  ZXIMPO         S                   LIKE(S5COST)                                             
     D  ZXTIVC         S              1                                                             
     D  ZXINCI         S              3                                                             
     D  ZXTCST         S                   LIKE(M5TCS1)                                             
     DSDE              S              1A   DIM(10)                                                  
      *Ecotaxe                                                                                     
     D    @PEECOP      S                   LIKE(S5ECOP)                                             
     D    @PEFLCD      S                   LIKE(S5DATP)                                             
     D    @PETAXE      S                   LIKE(S5PRCC)                                             
                                                                                                    
     D  ZXPEDT         S                   LIKE(T2ENTD)                                             
     D  ZXPEDD         S                   LIKE(T2ENTD)                                             
     D  ZXSTPR         S                   LIKE(T2VA05)                                             
     D  ZXSTDL         S                   LIKE(T2VA05)                                             
     D  ZXLG05         S                   LIKE(T2VA05)                                             
     D  ZXVSTK         S                   LIKE(T2VA05)                                             
     D  ZXPEXP         S              3  0                                                          
     D  ZXVA09         S                   LIKE(T2VA09)                                             
     D  ZXVA10         S                   LIKE(T2VA10)                                             
     D  ZXFORZ         S                   LIKE(T2FORZ)                                             
     D  ZW             S              3  0                                                          
     D  X              S              3  0                                                          
     D  FileArti_erp   S             21                                                             
     D  File_mitmas    S             21                                                             
     D  FileCojc_erp   S             21                                                             
     D  FileCojd_erp   S             21                                                             
     D  File_cmndiv    S             21                                                             
     D  File_mpdhed    S             21                                                             
     D  File_mpdmat    S             21                                                             
     D  File_AQPEDI    S             21                                                             
     D  File_ZAQITN    S             21                                                             
     D  File_GMTABD    S             21                                                             
     D  File_MITFAC    S             21                                                             
     D  LIBLMVX        S             10                                                             
     D  LIBLAQA        S             10                                                             
                                                                                                    
      * Series                                                                                      
     D SARVMCJT        S             25    DIM(100)                                                 
     D SARPRCJT        S             25    DIM(100)                                                 
     D SPRVRCJT        S             10    DIM(100)                                                 
     D SCANTCJT        S             15  5 DIM(100)                                                 
     D SLOGISTI        S              3    DIM(100)                                                 
                                                                                                    
      * Parámetros para GX0150 (Entorno Movex)                                                      
     D  @PECONO        S              3P 0                                                          
     D  @PEDIVI        S              3                                                             
     D  @PEUSER        S             10                                                             
     D  @PEVAL         S            250                                                             
      * Parámetros MSAUDI                                                                           
     D @PEACCI         S              2                                                             
     D @PEARVM         S             25                                                             
     D @PECAUD         S              4                                                             
     D @PEFILD         S                   LIKE(SDSPGM)                                             
     D @PEFILE         S                   LIKE(SDSPGM)                                             
     D @PEPGMO         S             10                                                             
     D @PEVAL1         S             50                                                             
     D @PEVAL2         S             50                                                             
     D @PELINE         S                   LIKE(S5LINE)                                             
     D @PENPCO         S                   LIKE(S5NPCO) INZ                                         
     D @PECLPR         S                   LIKE(S5CUST) INZ                                         
     D @PENOPL         S                   LIKE(S5NOPL) INZ                                         
     D @PEDATP         S                   LIKE(S5DATP) INZ                                         
     D @PETPED         S                   LIKE(S5TPED) INZ                                         
      *                                                                                             
     D  ZXVAL          DS                                                                           
     D    MXCONO               1      3                                                             
     D    MXDIVI               4      6                                                             
     D    MXIDIO               7      8                                                             
     D    MXMONE               9     11                                                             
     D    MXRESTO             12    250                                                             
                                                                                                    
     D                 DS                                                                           
     D  ZXARVMX                1     25                                                             
     D    ZXARTIX              1     15                                                             
     D    ZXVARIX             16     18                                                             
     D    ZXMODEX             19     21                                                             
      *                                                                                             
     D                 DS                                                                           
     D  ZXBL65I                1      5                                                             
     D    ZXPABI               1      1                                                             
      *                                                                                             
     D  S5AMPL         DS                                                                           
     D    S5ECOP              24     24                                                             
                                                                                                    
     D  C0AMP2         DS                                                                           
     D    C0PEVT               1      1                                                             
                                                                                                    
     D  C_S0AMP2       DS                                                                           
     D    C_S0CEVT            96     96                                                             
                                                                                                    
     D  M5AMPL         DS                                                                           
     D    M5PROB              49     50                                                             
     D    M5NOED              63     63                                                             
                                                                                                    
     D  PPBL10         DS                                                                           
     D    PPSERV               6      6                                                             
     D    PPCTBP               8      8                                                             
     D    PPMVXV               9      9                                                             
     D    PPMVXE              10     10                                                             
                                                                                                    
     D  S0AMPL         DS                                                                           
     D    S0ETOD              63     63                                                             
     D    S0EDME              65     65                                                             
     D    S0MOST              70     70                                                             
     D    S0EDLG             100    100                                                             
     D                 DS                                                                           
     D  ZXBL64                 1     10                                                             
     D    ZXNOED               7      7                                                             
                                                                                                    
      *                                                                                             
     D P7AMPL          DS                                                                           
     D  P7FILLER1              1     58                                                             
     D  P7AUTS                59     59                                                             
     D  P7FILLER2             60    100                                                             
      *                                                                                             
     D T3AMPL          DS                                                                           
     D  T3OPL1                 1      3                                                             
     d  T3VFYB                12     12                                                             
     d  T3ADOM                14     14                                                             
     D     T3LVIR              9     11                                                             
     d     T3FDSC             15     15                                                             
     d     T3OFEX             19     19                                                             
     d     T3RESTO            16    100                                                             
      *                                                                                             
     d  s5amp2         ds                                                                           
     d   s5lb2b                       1a   overlay(s5amp2:30)                                       
      *                                                                                             
      *                                                                                             
     d zycant          s                   like(s5cant)                                             
     d zystdd          s             15  5                                                          
     d zystka          s             15  5                                                          
     d zycans0         s             15  5                                                          
     d zycane0         s             15  5                                                          
     d zydepo0         s             15  5                                                          
      *                                                                                             
     D**ZXPWEB         S              1                                                             
      *                                                                                             
     D  ZXMULTIPLA     S               N                                                            
      *                                                                                             
     D  GET_FACI       PR                  LIKE(MMCIAS)                                             
     D    @DIVI                            LIKE(MMPROP) VALUE                                       
     D    @FACI                            LIKE(MMCIAS) VALUE                                       
     D    @ITNO                            LIKE(MMITNO) VALUE                                       
     D  @PALMA         S                   LIKE(M0MAGA)                                             
     D  @PTIPO         S                   LIKE(M0BAJA)                                             
     D  @PRESP         S                   LIKE(M0MAGA)                                             
     D  ZXALMOL        S                   LIKE(M0MAGA)                                             
     d  T_logol        s                   like(m0logs) dim(10) inz                                 
     d  i2OL           s              2  0 inz                                                      
     D  ZXPRV          S                   LIKE(M5PRVR)                                             
      **********************************************************************                        
      * Estructura de Programa                                                                      
      **********************************************************************                        
      *                                                                                             
      * Generamos el/los ficheros de trabajo deseados en QTEMP                                      
      *                                                                                             
     C                   CALL      'UTIFQTMPCL'                                                     
     C                   PARM      'ED0050W   '  @PEFILE1                                           
     C                   PARM      *BLANKS       @PELOG11                                           
     C                   PARM      *BLANKS       @PELOG12                                           
     C                   PARM      *BLANKS       @PELOG13                                           
     C                   PARM      *BLANKS       @PEFILE2                                           
     C                   PARM      *BLANKS       @PELOG21                                           
     C                   PARM      *BLANKS       @PELOG22                                           
     C                   PARM      *BLANKS       @PELOG23                                           
     C                   PARM      *BLANKS       @PEFILE3                                           
     C                   PARM      *BLANKS       @PELOG31                                           
     C                   PARM      *BLANKS       @PELOG32                                           
     C                   PARM      *BLANKS       @PELOG33                                           
     C                   PARM      *BLANKS       @PEPROGR                                           
     C                   PARM      *BLANKS       @PEPARMS                                           
      *                                                                                             
      * Abrir Ficheros QTEMP                                                                        
      *                                                                                             
     C                   OPEN      ED0050W                                                          
      *                                                                                             
     C                   EXSR      CS_LOGOL                                                         
      * Proceso                                                                                     
     C                   EXSR      CS_PROCESO                                                       
      *                                                                                             
      * Cerrar Ficheros QTEMP                                                                       
      *                                                                                             
     C                   CLOSE     ED0050W                                                          
                                                                                                    
     C                   IF        S0PPED<>'26'                                                     
     C                                                                                              
C8918C* NO ACTUA DOM SI TRASPORTISTA NO ED AL CONFIRMAR                                             
C8918C                   EVAL      ZXNODOM=*BLANKS                                                  
OLFGIC                   EVAL      T3CIAS = @PCIAS                                                  
OLFGIC                   EVAL      T3DLGA = @PDLGA                                                  
OLFGIC     KEDPARM       CHAIN     EDPARM                                                           
OLFGIC                   IF        %FOUND AND T3ADOM='1'                                            
OLFGIC                             AND S0STCO<'20'                                                  
C8918C*                            AND (T3OFEX<>'1' OR                                              
C8918C*                            (T3OFEX='1' AND S0EDME<>'5'))                                    
OLFGIC                   EVAL      N1CIAS = @PCIAS                                                  
OLFGIC                   EVAL      N1TTTA = S0TTTA                                                  
OLFGIC     KMSTRTA       CHAIN     MSTRTA                                                           
OLFGIC                   IF        %FOUND(MSTRTA) And N1NOED='2'                                    
C8918C                   EVAL      ZXNODOM='1'                                                      
OLFGIC*                  ELSE                                                                       
C8918C                   ENDIF                                                                      
C8918C                   ENDIF                                                                      
OLFGIC*FIN TRASPORTISTA                                                                             
C8918C                   IF        ZXNODOM=*BLANKS                                                  
     C                   CALL      'DOOM01'                                                         
     C                   PARM                    @PCIAS                                             
     C                   PARM                    @PDLGA                                             
     C                   PARM                    @PNPCO                                             
     C                   PARM                    @PTPED                                             
     C                   PARM                    @PDATP                                             
     C                   PARM                    @PNOPL                                             
     c                   parm                    @3LINE                                             
C0981C*                                                                                             
OLFGIC                   ENDIF                                                                      
C0891C*                  ENDIF                                                                      
C0891C*                                                                                             
     C                   ENDIF                                                                      
                                                                                                    
      *                                                                                             
     C                   SETON                                        LR                            
      **************************************************************                                
      * SUBRUTINA INICIAL                                          *                                
      *------------------------------------------------------------*                                
     C     *INZSR        BEGSR                                                                      
                                                                                                    
      * DEFINICIO DE LES KLIST DEL PGM                                                              
     C     KEDPARM       KLIST                                                                      
     C                   KFLD                    T3CIAS                                             
     C                   KFLD                    T3DLGA                                             
                                                                                                    
     C     KEDPARC       KLIST                                                                      
     C                   KFLD                    T4CIAS                                             
     C                   KFLD                    T4CUST                                             
                                                                                                    
     C     KED0050W      KLIST                                                                      
     C                   KFLD                    T2CIAS                                             
     C                   KFLD                    T2DLGA                                             
     C                   KFLD                    T2NPCO                                             
     C                   KFLD                    T2TPED                                             
     C                   KFLD                    T2DATP                                             
     C                   KFLD                    T2NOPL                                             
                                                                                                    
     C     KPMEMPR       KLIST                                                                      
     C                   KFLD                    P7CIAS                                             
     C                   KFLD                    P7DLGA                                             
                                                                                                    
     C     KCOCLIN       KLIST                                                                      
     C                   KFLD                    C_S0CIAS                                           
     C                   KFLD                    C_S0CUST                                           
                                                                                                    
     C     KCODEPE       KLIST                                                                      
     C                   KFLD                    S5CIAS                                             
     C                   KFLD                    S5DLGA                                             
     C                   KFLD                    S5NPCO                                             
     C                   KFLD                    S5TPED                                             
     C                   KFLD                    S5DATP                                             
     C                   KFLD                    S5NOPL                                             
                                                                                                    
     C     KCODEPE0      KLIST                                                                      
     C                   KFLD                    S5CIAS                                             
     C                   KFLD                    S5DLGA                                             
     C                   KFLD                    S5NPCO                                             
     C                   KFLD                    S5TPED                                             
     C                   KFLD                    S5DATP                                             
     C                   KFLD                    S5NOPL                                             
     C                   KFLD                    S5LINE                                             
                                                                                                    
     C     KCOCAPE       KLIST                                                                      
     C                   KFLD                    S0CIAS                                             
     C                   KFLD                    S0DLGA                                             
     C                   KFLD                    S0NPCO                                             
     C                   KFLD                    S0TPED                                             
     C                   KFLD                    S0DATP                                             
     C                   KFLD                    S0NOPL                                             
                                                                                                    
     C     KPMUNAL       KLIST                                                                      
     C                   KFLD                    @pCIAS                                             
     C                   KFLD                    P6ARTI                                             
     C                   KFLD                    P6VARI                                             
     C                   KFLD                    P6MODE                                             
     C                   KFLD                    P6UNIM                                             
                                                                                                    
     C     KPMTABD       KLIST                                                                      
     C                   KFLD                    PECIAS                                             
     C                   KFLD                    PECTAB                                             
     C                   KFLD                    PECLTA                                             
                                                                                                    
     C     KMSDLDL       KLIST                                                                      
     C                   KFLD                    XACIAS                                             
     C                   KFLD                    XADLGA                                             
     C                   KFLD                    XADLG2                                             
                                                                                                    
     C     KMSDLDL05     KLIST                                                                      
     C                   KFLD                    XACIAS                                             
     C                   KFLD                    XADLGA                                             
                                                                                                    
     C     KMSTRTA       KLIST                                                                      
     C                   KFLD                    N1CIAS                                             
     C                   KFLD                    N1TTTA                                             
                                                                                                    
     C     KMSLOAD       KLIST                                                                      
     C                   KFLD                    MICIAS                                             
     C                   KFLD                    MIDLGA                                             
     C                   KFLD                    MILGCA                                             
                                                                                                    
     C     KMSALMA       KLIST                                                                      
     C                   KFLD                    M0CIAS                                             
     C                   KFLD                    M0MAGA                                             
                                                                                                    
     C     KMSALMA05     KLIST                                                                      
     C                   KFLD                    M0CIAS                                             
     C                   KFLD                    M0LOGE                                             
                                                                                                    
     C     KMSSTOK       KLIST                                                                      
     C                   KFLD                    M1CIAS                                             
     C                   KFLD                    M1MAGA                                             
     C                   KFLD                    M1ARTI                                             
     C                   KFLD                    M1VARI                                             
     C                   KFLD                    M1MODE                                             
                                                                                                    
     C     KMSSTO01      KLIST                                                                      
     C                   KFLD                    M1CIAS                                             
     C                   KFLD                    M1ARTI                                             
     C                   KFLD                    M1VARI                                             
     C                   KFLD                    M1MODE                                             
                                                                                                    
     C     KMSSTO010     KLIST                                                                      
     C                   KFLD                    M1CIAS                                             
     C                   KFLD                    M1ARTI                                             
     C                   KFLD                    M1VARI                                             
     C                   KFLD                    M1MODE                                             
     C                   KFLD                    M1MAGA                                             
     C                   KFLD                    M1CALI                                             
                                                                                                    
     C     KMSSTO909     KLIST                                                                      
     C                   KFLD                    M1CIAS                                             
     C                   KFLD                    M1ARTI                                             
     C                   KFLD                    M1VARI                                             
     C                   KFLD                    M1MODE                                             
     C                   KFLD                    M1MAGA                                             
     C                   KFLD                    M1CALI                                             
                                                                                                    
     C     KMSCOJC       KLIST                                                                      
     C                   KFLD                    NDCIAS                                             
     C                   KFLD                    NDARTI                                             
     C                   KFLD                    NDVARI                                             
     C                   KFLD                    NDMODE                                             
     C                   KFLD                    NDTCOJ                                             
                                                                                                    
     C     KMSARTI       KLIST                                                                      
     C                   KFLD                    A_M5ARTI                                           
     C                   KFLD                    A_M5VARI                                           
     C                   KFLD                    A_M5MODE                                           
                                                                                                    
     C     KMSARTI00     KLIST                                                                      
     C                   KFLD                    M5CIAS                                             
     C                   KFLD                    M5ARTI                                             
     C                   KFLD                    M5VARI                                             
     C                   KFLD                    M5MODE                                             
                                                                                                    
     C     KMITMAS00     KLIST                                                                      
     C                   KFLD                    MMCONO                                             
     C                   KFLD                    MMITNO                                             
                                                                                                    
     C     KGXEQAR       KLIST                                                                      
     C                   KFLD                    Q1CIAS                                             
     C                   KFLD                    Q1ARVM                                             
                                                                                                    
     C     KUTCOM0       KLIST                                                                      
     C                   KFLD                    U0CIAS                                             
     C                   KFLD                    U0TENV                                             
     C                   KFLD                    U0CLP0                                             
     C                   KFLD                    U0CLP2                                             
                                                                                                    
     C     KPUPROV       KLIST                                                                      
     C                   KFLD                    C0CIAS                                             
     C                   KFLD                    C0PRVR                                             
                                                                                                    
     C     KPUPRP0       KLIST                                                                      
     C                   KFLD                    C3CIAS                                             
     C                   KFLD                    C3PRVR                                             
     C                   KFLD                    C3ARVM                                             
                                                                                                    
     C     KGXEQPR       KLIST                                                                      
     C                   KFLD                    Q1CIAS                                             
     C                   KFLD                    Q1PRVR                                             
                                                                                                    
     C     KPMLIBL       KLIST                                                                      
     C                   KFLD                    PPCIAS                                             
                                                                                                    
     C     KCMNDIV00     KLIST                                                                      
     C                   KFLD                    CCCONO                                             
     C                   KFLD                    CCDIVI                                             
                                                                                                    
     C     KMSDIV0       KLIST                                                                      
     C                   KFLD                    MBCIAS                                             
     C                   KFLD                    MBMONE                                             
                                                                                                    
     C     KMSIVAS0      KLIST                                                                      
     C                   KFLD                    MVCIAS                                             
     C                   KFLD                    MVTIVA                                             
     C                   KFLD                    MVPABI                                             
                                                                                                    
     C     KMSIVAS       KLIST                                                                      
     C                   KFLD                    MVCIAS                                             
     C                   KFLD                    MVTIVA                                             
     C                   KFLD                    MVPABI                                             
     C                   KFLD                    MVFLCD                                             
                                                                                                    
     C     KMPDHED00     KLIST                                                                      
     C                   KFLD                    H_PHCONO                                           
     C                   KFLD                    H_PHFACI                                           
     C                   KFLD                    H_PHPRNO                                           
     C                   KFLD                    H_PHSTRT                                           
                                                                                                    
     C     KMPDMAT00     KLIST                                                                      
     C                   KFLD                    PMCONO                                             
     C                   KFLD                    PMFACI                                             
     C                   KFLD                    PMPRNO                                             
     C                   KFLD                    PMSTRT                                             
      *                                                                                             
     C     KAQPEDI00     KLIST                                                                      
     C                   KFLD                    Z1CONO                                             
     C                   KFLD                    Z1DIVI                                             
      *                                                                                             
     C     KZAQITN00     KLIST                                                                      
     C                   KFLD                    MMCONO                                             
     C                   KFLD                    MMITNO                                             
      *                                                                                             
     C     KGMTABD01     KLIST                                                                      
     C                   KFLD                    T1CTAB                                             
     C                   KFLD                    T1DESC                                             
      *                                                                                             
     C     KMITFAC00     KLIST                                                                      
     C                   KFLD                    M9CONO                                             
     C                   KFLD                    M9FACI                                             
     C                   KFLD                    M9ITNO                                             
                                                                                                    
     C     KCOCAIP       KLIST                                                                      
     C                   KFLD                    RXCIAS                                             
     C                   KFLD                    RXDLGA                                             
     C                   KFLD                    RXNPCO                                             
     C                   KFLD                    RXTPED                                             
     C                   KFLD                    RXDATP                                             
     C                   KFLD                    RXNOPL                                             
                                                                                                    
     C     *DTAARA       DEFINE    PURLDA        DSLDA                                              
     C                   IN        DSLDA                                                            
                                                                                                    
     C                   IF        ZZTCIA='1' OR ZZTCIA='2'                                         
     C                   OPEN      PMCAOR01                                                         
     C                   OPEN      PMCAOR08                                                         
     C                   OPEN      PMDEOR05                                                         
     C                   ENDIF                                                                      
                                                                                                    
      * Entrada de parámetros                                                                       
     C     *ENTRY        PLIST                                                                      
     C                   PARM                    @PCIAS                                             
     C                   PARM                    @PDLGA                                             
     C                   PARM                    @PNPCO                                             
     C                   PARM                    @PTPED                                             
     C                   PARM                    @PDATP                                             
     C                   PARM                    @PNOPL                                             
     c                   parm                    @@pline                                            
      *                                                                                             
                         @3line = *zero;                                                            
                         if        %addr(@@pline) <> *null;                                         
                           @3line = @@pline;                                                        
                         endif;                                                                     
      *                                                                                             
     C                   EXSR      CS_CHKLOGE                                                       
      *                                                                                             
                                                                                                    
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Proceso lectura del pedido                                                                  
      **********************************************************************                        
     C     CS_PROCESO    BEGSR                                                                      
                                                                                                    
     C                   EVAL      ZXPEDD = 0                                                       
     C                   EVAL      ZXPEDT = 0                                                       
     C                   EVAL      ZXPEXP = 0                                                       
     C                   EVAL      ZXVA09 = 0                                                       
     C                   EVAL      ZXVA10 = 0                                                       
     C                   EVAL      ZXIMPO = 0                                                       
     C                   EVAL      ZXFORZ = 0                                                       
                                                                                                    
     C                   EVAL      T3CIAS = @PCIAS                                                  
     C                   EVAL      T3DLGA = @PDLGA                                                  
     C     KEDPARM       CHAIN     EDPARM                                                           
     C                   IF        NOT%FOUND OR T3BAJA='1'                                          
     C                   LEAVESR                                                                    
     C                   ENDIF                                                                      
                                                                                                    
     C                   EVAL      S0CIAS = @PCIAS                                                  
     C                   EVAL      S0DLGA = @PDLGA                                                  
     C                   EVAL      S0NPCO = @PNPCO                                                  
     C                   EVAL      S0TPED = @PTPED                                                  
     C                   EVAL      S0DATP = @PDATP                                                  
     C                   EVAL      S0NOPL = @PNOPL                                                  
     C     KCOCAPE       CHAIN     COCAPE                                                           
     C                   IF        %FOUND(COCAPE)                                                   
     C                   IF        S0PPED='90'                                                      
     C                   LEAVESR                                                                    
     C                   ENDIF                                                                      
                                                                                                    
     C                   EVAL      T4CIAS = @PCIAS                                                  
     C                   EVAL      T4CUST = S0CUST                                                  
     C     KEDPARC       CHAIN     EDPARC                                                           
     C                   IF        %FOUND(EDPARC)                                                   
     C                   EVAL      T3LIMP=T4LIMP                                                    
     C                   ENDIF                                                                      
                                                                                                    
      * Si es pedido procedencia Poolweb, tiene que ser Fluidra Direct.                             
     C***                EXSR      CS_POOLWEB                                                       
                                                                                                    
     C                   EVAL      T2CIAS = @PCIAS                                                  
     C                   EVAL      T2DLGA = @PDLGA                                                  
     C                   EVAL      T2NPCO = @PNPCO                                                  
     C                   EVAL      T2TPED = @PTPED                                                  
     C                   EVAL      T2DATP = @PDATP                                                  
     C                   EVAL      T2NOPL = @PNOPL                                                  
                                                                                                    
      * Leo Pedido en CODEPE                                                                        
     C                   EVAL      S5CIAS = @PCIAS                                                  
     C                   EVAL      S5DLGA = @PDLGA                                                  
     C                   EVAL      S5NPCO = @PNPCO                                                  
     C                   EVAL      S5TPED = @PTPED                                                  
     C                   EVAL      S5DATP = @PDATP                                                  
     C                   EVAL      S5NOPL = @PNOPL                                                  
     C     KCODEPE       SETLL     CODEPE                                                           
     C     KCODEPE       READE     CODEPE                                                           
     C                   DOW       NOT %EOF(CODEPE)                                                 
                                                                                                    
     C                   EVAL      T2VA00 = 0                                                       
     C                   EVAL      T2VA01 = 0                                                       
     C                   EVAL      T2VA02 = 0                                                       
     C                   EVAL      T2VA03 = 0                                                       
     C                   EVAL      T2VA04 = 0                                                       
     C                   EVAL      T2VA11 = 0                                                       
     C                   EVAL      T2VA05 = 0                                                       
     C                   EVAL      T2VA06 = 0                                                       
     C                   EVAL      T2VA07 = 0                                                       
     C                   EVAL      T2VA08 = 0                                                       
     C                   EVAL      T2VA12 = 0                                                       
     C                   EVAL      T2VA13 = 0                                                       
     ** Campo para Comprobación de Stock Suficiente en Delegación si Artículo "B".                  
     C                   EVAL      T2VA14 = 0                                                       
     C                   EVAL      T2SART = *BLANKS                                                 
     C                   EVAL      T2SDIS = 0                                                       
     C                   EVAL      T2SMAX = 0                                                       
     C                   EVAL      T2SALM = *BLANKS                                                 
     C                   EVAL      T2TART = *BLANKS                                                 
     C                   EVAL      T2TCAN = 0                                                       
     C                   EVAL      T2TDIS = 0                                                       
     C                   EVAL      T2DART = *BLANKS                                                 
     C                   EVAL      T2DCAN = 0                                                       
     C                   EVAL      T2DDIS = 0                                                       
     C                   EVAL      T2DALM = *BLANKS                                                 
     C                   EVAL      T2IMPM = 0                                                       
     C                   EVAL      T2IMED = 0                                                       
     C                   EVAL      T2INCI = *BLANKS                                                 
     C                   EVAL      T2LOGI = S5LOGE                                                  
     C                   EVAL      T2LOGU = *BLANKS                                                 
     C                   EVAL      T2CJTO = 0                                                       
     c                   eval      T2FORZ = 0                                                       
                                                                                                    
     C                   EVAL      T2LINE = S5LINE                                                  
      *                                                                                             
     c                   if            s5lb2b <> *blanks                                            
     c                             and s5tped = '25'                                                
     c                   GOTO      TWRITE                                                           
     c                   endif                                                                      
      *                                                                                             
      * Si es pedido procedencia Poolweb, tiene que ser Fluidra Direct.                             
     c*                  if        zxpweb='1'                                                       
     C*                  EVAL      @PLINE = S5LINE                                                  
     C*                  EXSR      CS_VALED51                                                       
     C*                  EVAL      T2FORZ = 1                                                       
     C*                  EVAL      ZXSERV = *BLANKS                                                 
      * Comprobar si el artículo es de servicio                                                     
     C*                  EVAL      M5CIAS = S5CIAS                                                  
     C*                  EVAL      M5ARTI = S5ARTI                                                  
     C*                  EVAL      M5VARI = S5VARI                                                  
     C*                  EVAL      M5MODE = S5MODE                                                  
     C*    KMSARTI00     CHAIN     MSARTI00                                                         
     C*                  IF        %FOUND(MSARTI00)                                                 
     C*                  EVAL      PECIAS = S5CIAS                                                  
     C*                  EVAL      PECTAB = 'TIPG'                                                  
     C*                  EVAL      PECLTA = *BLANKS                                                 
     C*                  EVAL      PECLTA = M5TIPG                                                  
     C*    KPMTABD       CHAIN     PMTABD                                                           
     C*                  IF        %FOUND(PMTABD)                                                   
     C*                  EVAL      ZXSERV = PEBL61                                                  
     C*                  ELSE                                                                       
     C*                  EVAL      ZXSERV = *BLANKS                                                 
     C*                  ENDIF                                                                      
     C*                  ENDIF                                                                      
     C*                  IF        ZXSERV <> '1'                                                    
     C*                  GOTO      TFINAL                                                           
     C*                  ELSE                                                                       
     C*                  GOTO      TSERVI                                                           
     C*                  ENDIF                                                                      
     c*                  endif                                                                      
                                                                                                    
      * Si parámetro de Solo Forzada, compruebo que sea ED Forzada                                  
     C                   IF        T3EDFO = '1'                                                     
     C                   IF        S5TPE4 = '2' Or S0TPE4 = '2'                                     
     C                   EVAL      T2FORZ = 1                                                       
     C                   ELSE                                                                       
     C                   EVAL      T2VA12 = 1                                                       
     C                   GOTO      TFINAL                                                           
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
      * Si ENTREGA EN DELEGACIÓN o procedencia pedido esta activado                                 
      * no chequearemos  cliente                                                                    
     C                   IF        S0EDLG='1'                                                       
     C*                            OR S0PPED='25'                                                   
     C                   ELSE                                                                       
                                                                                                    
      * Comprobar Parámetro Cliente                                                                 
     C                   IF        ((S5TPE4 = '2' Or S0TPE4 = '2')                                  
     C                             And T3NCLF <> '1') Or                                            
     C                             (S5TPE4 <> '2' And S0TPE4 <> '2')                                
     C                   EXSR      CS_CLIENT                                                        
     C                   IF        T2VA00 = 1                                                       
     C                   GOTO      TFINAL                                                           
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
     C     TSERVI        TAG                                                                        
                                                                                                    
      * Comprobar si el artículo es de servicio                                                     
     C                   EVAL      M5CIAS = S5CIAS                                                  
     C                   EVAL      M5ARTI = S5ARTI                                                  
     C                   EVAL      M5VARI = S5VARI                                                  
     C                   EVAL      M5MODE = S5MODE                                                  
     C     KMSARTI00     CHAIN     MSARTI00                                                         
     C                   IF        %FOUND(MSARTI00)                                                 
     C                   EVAL      PECIAS = S5CIAS                                                  
     C                   EVAL      PECTAB = 'TIPG'                                                  
     C                   EVAL      PECLTA = *BLANKS                                                 
     C                   EVAL      PECLTA = M5TIPG                                                  
     C     KPMTABD       CHAIN     PMTABD                                                           
     C                   IF        %FOUND(PMTABD)                                                   
     C                   EVAL      ZXSERV = PEBL61                                                  
     C                   ELSE                                                                       
     C                   EVAL      ZXSERV = *BLANKS                                                 
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
                                                                                                    
     C                   IF        ZXSERV <> '1'                                                    
      * Comprobar Parámetro Proveedor                                                               
     C                   IF        M5SIOL <> '2'                                                    
     C                   EXSR      CS_PROVEED                                                       
     C                   IF        T2VA02 = 1 Or T2VA01 = 1                                         
     C                   GOTO      TFINAL                                                           
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
                                                                                                    
      * Comprobar Parámetro Artículo                                                                
     C                   EXSR      CS_ARTICUL                                                       
     C                   IF        T2VA03 = 1                                                       
     C                   GOTO      TFINAL                                                           
     C                   ENDIF                                                                      
                                                                                                    
      * Validaciones para Alta ED (precio compra, artículo, etc...)                                 
     C                   EVAL      @PLINE = S5LINE                                                  
     C                   EXSR      CS_VALED51                                                       
     C                   IF        T2VA08 = 1                                                       
     C                             OR T2CJTO = 1                                                    
     C                   GOTO      TFINAL                                                           
     C                   ENDIF                                                                      
                                                                                                    
      * Comprobar si ED Forzada                                                                     
     C                   IF        S5TPE4 = '2' Or S0TPE4 = '2'                                     
     C                   EVAL      T2FORZ = 1                                                       
     C                   EVAL      ZXFORZ = 1                                                       
     C                   GOTO      TFINAL                                                           
     C                   ELSE                                                                       
     C                   EVAL      T2FORZ = 0                                                       
     C                   ENDIF                                                                      
                                                                                                    
     C                   IF        S0EDLG<>'1'                                                      
      * Comprobar Parámetro Transportista                                                           
     C                   EXSR      CS_TRANSPO                                                       
     C                   IF        T2VA04 = 1                                                       
     C                   GOTO      TFINAL                                                           
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
                                                                                                    
      * Comprobar Paràmetre Forma de Pagament                                                       
     C                   EXSR      CS_FORPAGO                                                       
     C                   IF        T2VA11 = 1                                                       
     C                   GOTO      TFINAL                                                           
     C                   ENDIF                                                                      
                                                                                                    
     C                   IF        S0EDLG<>'1'                                                      
      * Comprobar Logísticas                                                                        
     C                   IF        T3LOGI = '1'                                                     
     C                   EXSR      CS_LOGISTI                                                       
     C                   ENDIF                                                                      
     C                   IF        T2VA13 = 1                                                       
     C                   GOTO      TFINAL                                                           
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
                                                                                                    
      * Comprobar si el artículo es Obsoleto                                                        
     C                   IF        T3OBSO = '1'                                                     
     C                   EXSR      CS_ARTOBSO                                                       
     C                   ENDIF                                                                      
     C                   IF        T2VA05 = 1                                                       
     C                   GOTO      TFINAL                                                           
     C                   ENDIF                                                                      
                                                                                                    
      * Comprobar sobreestock del artículo                                                          
     C                   IF        T3SSTO >= '1'                                                    
     C                   EXSR      CS_SOBRSTK                                                       
     C                   ENDIF                                                                      
     C                   IF        T2VA06 = 1                                                       
     C                   GOTO      TFINAL                                                           
     C                   ENDIF                                                                      
      *                                                                                             
      * Comprobar Stock Artículos "B" (si Parámetro Verificar Artículos "B" = '1')                  
      * Si Delegación es Autoservicio MIXTO (AUTS in '1' '2' y OPL1 = blanco)                       
      * ó  Delegación Convencional (AUTS = blanco ó '0')                                            
     c                   clear                   rpmempr                                            
     c                   eval      p7cias = @pcias                                                  
     c                   eval      p7dlga = @pdlga                                                  
     c     kpmempr       chain     PMEMPR                                                           
     C                   IF        T3VFYB = '1'                                 Verif. Art. "B"     
     c                             and ( (    (P7AUTS = '1' or P7AUTS = '2')    Autoservicio        
     c                                     and T3OPL1 = *blanks                 Mixto               
     c                                    )                                                         
     c                                   or P7AUTS < '1'                        No Autoserv.        
     c                                 )                                                            
     C                   EXSR      CS_VFYARTB                                   Check Stock.        
     C                   ENDIF                                                                      
     C                   IF        T2VA14 = 1                                                       
     C                   GOTO      TFINAL                                                           
     C                   ENDIF                                                                      
                                                                                                    
      * Comprobar Stock en Trace                                                                    
     C                   IF        T3STCK = '1'                                                     
     C                   EXSR      CS_STCKTRA                                                       
     C                   ENDIF                                                                      
     C                   IF        T2VA07 = 1                                                       
     C                   GOTO      TFINAL                                                           
     C                   ENDIF                                                                      
                                                                                                    
     C     TFINAL        TAG                                                                        
      * Grabo fichero de Trabajo                                                                    
     C                   IF        T2VA00=0 And T2VA01=0 And T2VA02=0 And                           
     C                             T2VA03=0 And T2VA04=0 And T2VA05=0 And                           
     C                             T2VA06=0 And T2VA07=0 And T2VA08=0 And                           
     C                             T2VA11=0 And T2VA12=0 And T2VA13=0                               
     C                             AND T2CJTO=0                                                     
     C                             And T2VA14=0                                                     
     C                   EVAL      T2ENTD = 1                                                       
     C                   EVAL      ZXPEDD = 1                                                       
      * Calculo Importe línea pedido, si no es solo Forzadas                                        
     C****               IF        zxpweb<>'1'                                                      
     C                   EXSR      CS_IMPORTE                                                       
     C                   EVAL      ZXIMPO = ZXIMPO + ZXBIMP                                         
     C*****              ENDIF                                                                      
     C                   ELSE                                                                       
     C                   EVAL      T2ENTD = 0                                                       
     C                   EVAL      ZXPEDT = 1                                                       
     C                   ENDIF                                                                      
     c     TWRITE        TAG                                                                        
     C                   WRITE     RED0050W                                                         
      *                                                                                             
     C                   ENDIF                                                                      
     C     KCODEPE       READE     CODEPE                                                           
     C                   ENDDO                                                                      
                                                                                                    
      * Comprobar Importe líneas Pedido ED, si no es solo Forzadas                                  
     C*****              IF        zxpweb<>'1'                                                      
     C                   IF        ZXFORZ = 1 And T3NIMF <> '1'                                     
     C                             Or ZXFORZ = 0                                                    
     C                   IF        ZXPEDD = 1                                                       
     c                             and (s0tped <> 'SC' or t3fdsc <> '1')                            
     C                   EXSR      CS_IMPLINE                                                       
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
     C*****              ENDIF                                                                      
                                                                                                    
      * Comprobar Pedido Completo                                                                   
     C                   EXSR      CS_PEDTOTA                                                       
                                                                                                    
      * Actualizar Marca ED en CODEPE TPE4='2'                                                      
     C                   EXSR      CS_MARCAED                                                       
                                                                                                    
      * Comprobar Puntos de Expedición, si no es solo Forzadas                                      
     C                   IF        T3EDFO <> '1'                                                    
     c******                       And zxpweb<>'1'                                                  
     C                   EXSR      CS_BUSPEXP                                                       
     C                   ENDIF                                                                      
                                                                                                    
     C                   ENDIF                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Comprobar Parámetro Proveedor                                                               
      **********************************************************************                        
     C     CS_PROVEED    BEGSR                                                                      
                                                                                                    
     C                   EVAL      M5CIAS=S5CIAS                                                    
     C                   MOVEL     @PCIAS        PPCIAS                                             
                                                                                                    
      * Miramos si es Conjunto de Venta                                                             
     C                   EVAL      FileCojc_erp= 'PURLIBF' + PPCIAS +                               
     C                                          '/MSCOJC'                                           
     C                   OPEN (E)  MSCOJC                                                           
     C                   IF        Not %ERROR                                                       
     C                   EVAL      ZXTCOJ=' '                                                       
     C                   EVAL      NDCIAS=S5CIAS                                                    
     C                   EVAL      NDARTI=S5ARTI                                                    
     C                   EVAL      NDMODE=S5MODE                                                    
     C                   EVAL      NDVARI=S5VARI                                                    
     C                   EVAL      NDTCOJ='4'                                                       
     C     KMSCOJC       CHAIN     MSCOJC                                                           
     C                   IF        %FOUND(MSCOJC) AND NDBAJA<'1'                                    
      * Miramos si es Conjunto de Compra                                                            
     C                   EVAL      NDTCOJ='1'                                                       
     C     KMSCOJC       CHAIN     MSCOJC                                                           
     C                   IF        %FOUND(MSCOJC) AND NDBAJA<'1'                                    
      * Si es Conjunto de Ventas y de Compra No lo trataremos como Cjto                             
     C                   EVAL      ZXTCOJ=' '                                                       
     C                   ELSE                                                                       
      * Si es Conjunto de Ventas y No de Compra Si lo tratamos                                      
     C                   EVAL      ZXTCOJ='4'                                                       
     C                   ENDIF                                                                      
     C                   ELSE                                                                       
      * Si No es Conjunto de Venta , Pues no es Conjunto y punto                                    
     C                   EVAL      ZXTCOJ=' '                                                       
     C                   ENDIF                                                                      
     C                   CLOSE(E)  MSCOJC                                                           
      * Es Conjunto                                                                                 
     C                   IF        ZXTCOJ='4'                                                       
     C                   EVAL      FileCojd_erp= 'PURLIBF' + PPCIAS +                               
     C                                          '/MSCOJD'                                           
     C                   OPEN (E)  MSCOJD                                                           
     C                   IF        Not %ERROR                                                       
     C                   EVAL      NDCIAS=S5CIAS                                                    
     C                   EVAL      NDARTI=S5ARTI                                                    
     C                   EVAL      NDMODE=S5MODE                                                    
     C                   EVAL      NDVARI=S5VARI                                                    
     C                   EVAL      NDTCOJ = ZXTCOJ                                                  
     C     KMSCOJC       SETLL     MSCOJD                                                           
     C     KMSCOJC       READE     MSCOJD                                                           
     C                   DOW       NOT %EOF(MSCOJD)                                                 
     C                   IF        NDBAJA <> '1'                                                    
     C                   EVAL      M5ARTI=NDCOMP                                                    
     C                   EVAL      M5VARI=NDVAR2                                                    
     C                   EVAL      M5MODE=NDMOD2                                                    
     C     KMSARTI00     CHAIN     MSARTI00                                                         
      * Valido Proveedor                                                                            
      * Siempre que el componente no sea artículo propio                                            
     C                   IF        M5SIOL<>'2'                                                      
     C                   EXSR      CS_PROVEE2                                                       
     C                   IF        T2VA02 = 1                                                       
     C                   LEAVE                                                                      
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
     C     KMSCOJC       READE     MSCOJD                                                           
     C                   ENDDO                                                                      
     C                   ENDIF                                                                      
     C                   CLOSE(E)  MSCOJD                                                           
     C                   ELSE                                                                       
      * NO Es Conjunto                                                                              
     C                   EVAL      M5ARTI=S5ARTI                                                    
     C                   EVAL      M5VARI=S5VARI                                                    
     C                   EVAL      M5MODE=S5MODE                                                    
     C     KMSARTI00     CHAIN     MSARTI00                                                         
      * Valido Proveedor                                                                            
     C                   EXSR      CS_PROVEE2                                                       
     C                   ENDIF                                                                      
                                                                                                    
     C                   ENDIF                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Comprobar Parámetro Cliente                                                                 
      **********************************************************************                        
     C     CS_CLIENT     BEGSR                                                                      
                                                                                                    
     C                   EVAL      C_S0CIAS=S5CIAS                                                  
     C                   EVAL      C_S0CUST=S5CUST                                                  
     C     KCOCLIN       CHAIN     COCLIN                                                           
     C                   IF        %FOUND(COCLIN) And                                               
     C                             (C_S0CEVT = ' ' Or C_S0CEVT = '0')                               
     C                   EVAL      T2VA00 = 1                                                       
     C                   ENDIF                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Comprobar Parámetro Proveedor                                                               
      **********************************************************************                        
     C     CS_PROVEE2    BEGSR                                                                      
                                                                                                    
     c                   EVAL      ZXPRV = *blanks                                                  
     c                   EVAL      @PRESP= *blanks                                                  
     C                   if        (%lookup(S5LOGE:T_logol)>0)                                      
     C                   EVAL      M0CIAS=S5CIAS                                                    
     C                   EVAL      M0LOGE=S5LOGE                                                    
     C     KMSALMA05     CHAIN     MSALMA05                                                         
     C                   IF        %FOUND AND M0BAJA<>'1'                                           
     C                   EVAL      @PRESP=M0MAGA                                                    
     C                   exsr      SRrecu                                                           
     C                   ENDIF                                                                      
     C                   ELSE                                                                       
     C                   EXSR      LOG_VIRTUAL                                                      
     C                   exsr      SRrecu                                                           
     C                   ENDIF                                                                      
     C                   EVAL      C0CIAS=S5CIAS                                                    
     C                   if        ZXPRV = *blanks                                                  
     C                   EVAL      C0PRVR=M5PRVR                                                    
     C                   ELSE                                                                       
     C                   EVAL      C0PRVR=ZXPRV                                                     
     C                   ENDIF                                                                      
     C     KPUPROV       CHAIN     PUPROV                                                           
     C                   IF        %FOUND(PUPROV) And                                               
     C                             (C0PEVT = ' ' Or C0PEVT = '0')                                   
      * Comprobar que el artículo no sea independiente del proveedor                                
      * M5NOED='2'                                                                                  
     C                   EVAL      M5CIAS=S5CIAS                                                    
     C                   EVAL      M5ARTI=S5ARTI                                                    
     C                   EVAL      M5VARI=S5VARI                                                    
     C                   EVAL      M5MODE=S5MODE                                                    
     C     KMSARTI00     CHAIN     MSARTI00                                                         
     C                   IF        %FOUND(MSARTI00) and M5NOED<>'2'                                 
     C                   EVAL      T2VA02 = 1                                                       
     C                   ENDIF                                                                      
     C                   ELSE                                                                       
                                                                                                    
      * Comprobar si el Proveedor es externo                                                        
     C                   EVAL      Q1CIAS=C0CIAS                                                    
     C                   EVAL      Q1PRVR=C0PRVR                                                    
     C     KGXEQPR       CHAIN     GXEQPR                                                           
     C                   IF        %FOUND(GXEQPR) And Q1PGRP = '1'                                  
     C                   EVAL      T2VA01 = 0                                                       
     C                   ELSE                                                                       
     C                   EVAL      T2VA01 = 1                                                       
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Comprobar Parámetro Artículo                                                                
      **********************************************************************                        
     C     CS_ARTICUL    BEGSR                                                                      
                                                                                                    
     C                   EVAL      M5CIAS=S5CIAS                                                    
     C                   EVAL      M5ARTI=S5ARTI                                                    
     C                   EVAL      M5VARI=S5VARI                                                    
     C                   EVAL      M5MODE=S5MODE                                                    
     C     KMSARTI00     CHAIN     MSARTI00                                                         
     C                   IF        %FOUND(MSARTI00) And M5NOED = '1'                                
     C                   EVAL      T2VA03 = 1                                                       
     C                   ENDIF                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Comprobar Parámetro Transportista                                                           
      **********************************************************************                        
     C     CS_TRANSPO    BEGSR                                                                      
                                                                                                    
     C                   EVAL      N1CIAS = S0CIAS                                                  
     C                   EVAL      N1TTTA = S0TTTA                                                  
     C     KMSTRTA       CHAIN     MSTRTA                                                           
     C                   IF        %FOUND(MSTRTA) And N1NOED ='1'                                   
     C                   EVAL      T2VA04 = 1                                                       
     C                   ENDIF                                                                      
     C                   IF        %FOUND(MSTRTA) And N1NOED ='2'                                   
     C                   EVAL      T2VA04 = 1                                                       
     C                   ENDIF                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Comprobar Paràmetre Forma de Pagament                                                       
      **********************************************************************                        
     C     CS_FORPAGO    BEGSR                                                                      
                                                                                                    
     C                   EVAL      PECIAS = S0CIAS                                                  
     C                   EVAL      PECTAB = 'FPAG'                                                  
     C                   EVAL      PECLTA = *BLANKS                                                 
     C                   EVAL      PECLTA = S0FPAG                                                  
     C     KPMTABD       CHAIN     PMTABD                                                           
     C                   IF        %FOUND(PMTABD)                                                   
     C                   EVAL      ZXBL64 = PEBL64                                                  
     C                   ELSE                                                                       
     C                   EVAL      ZXBL64 = *BLANKS                                                 
     C                   ENDIF                                                                      
     C                   IF        ZXNOED ='1'                                                      
     C                   EVAL      T2VA11 = 1                                                       
     C                   ENDIF                                                                      
     C                                                                                              
     C                   IF        T2VA11=1                                                         
     C                   EVAL      RXCIAS=S0CIAS                                                    
     C                   EVAL      RXDLGA=S0DLGA                                                    
     C                   EVAL      RXNPCO=S0NPCO                                                    
     C                   EVAL      RXTPED=S0TPED                                                    
     C                   EVAL      RXDATP=S0DATP                                                    
     C                   EVAL      RXNOPL=S0NOPL                                                    
     C     KCOCAIP       CHAIN     COCAIP                                                           
     C                   IF        %FOUND                                                           
     C                   EVAL      T2VA11=0                                                         
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Comprobar logísticas                                                                        
      **********************************************************************                        
     C     CS_LOGISTI    BEGSR                                                                      
                                                                                                    
      * De momento la linea será ED hasta que diga lo contrario                                     
     C                   EVAL      T2VA13 = 0                                                       
                                                                                                    
      * Miro la logística de la linea del pedido                                                    
     C                   EVAL      MICIAS=S5CIAS                                                    
     C                   EVAL      MIDLGA=S5DLGA                                                    
     C                   EVAL      MILGCA=S5LOGE                                                    
     C     KMSLOAD       CHAIN     MSLOGI                                                           
      * Si no tiene el parámetro de Entregas Directas No puede ser ED                               
     C                   IF        %FOUND(MSLOGI) And MIMI01<>'1'                                   
     C                             Or Not %FOUND(MSLOGI)                                            
     C                   EVAL      T2VA13 = 1                                                       
     C                   ENDIF                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Comprobar si el artículo es Obsoleto                                                        
      **********************************************************************                        
     C     CS_ARTOBSO    BEGSR                                                                      
                                                                                                    
     C                   EVAL      M5CIAS=S5CIAS                                                    
     C                   EVAL      M5ARTI=S5ARTI                                                    
     C                   EVAL      M5VARI=S5VARI                                                    
     C                   EVAL      M5MODE=S5MODE                                                    
     C     KMSARTI00     CHAIN     MSARTI00                                                         
     C                   IF        %FOUND(MSARTI00) And M5PROB = 'OB'                               
     C                   EVAL      ZXARTIX = M5ARTI                                                 
     C                   EVAL      ZXVARIX = M5VARI                                                 
     C                   EVAL      ZXMODEX = M5MODE                                                 
     C                   EVAL      Z1CANT = S5CANT - S5CANR - S5CANS                                
     C                   EVAL      ZXVSTK = 1                                                       
     C                   EXSR      CS_STCKPRO                                                       
     C                   IF        ZXSTPR = 0                                                       
     C                   EVAL      ZXLG05 = 0                                                       
     C                   EVAL      ZXVSTK = 1                                                       
     C                   EXSR      CS_STCKDEL                                                       
     C                   IF        ZXSTDL = 1                                                       
     C                   EVAL      T2VA05 = 1                                                       
     C                   EVAL      T2LOGU = P7LOGS                                                  
     C                   EVAL      S5LOGE = P7LOGS                                                  
     C*                  UPDATE    RCODEPE                                                          
     C                   ENDIF                                                                      
     C                   ELSE                                                                       
     C                   EVAL      T2VA05 = 1                                                       
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Comprobar sobreestock del artículo                                                          
      **********************************************************************                        
     C     CS_SOBRSTK    BEGSR                                                                      
                                                                                                    
     C                   EVAL      ZXCANT = 1                                                       
     C                   EVAL      M5CIAS=S5CIAS                                                    
     C                   MOVEL     @PCIAS        PPCIAS                                             
                                                                                                    
      * Miramos si es Conjunto de Venta                                                             
     C                   EVAL      FileCojc_erp= 'PURLIBF' + PPCIAS +                               
     C                                          '/MSCOJC'                                           
     C                   OPEN (E)  MSCOJC                                                           
     C                   IF        Not %ERROR                                                       
     C                   EVAL      ZXTCOJ=' '                                                       
     C                   EVAL      NDCIAS=S5CIAS                                                    
     C                   EVAL      NDARTI=S5ARTI                                                    
     C                   EVAL      NDMODE=S5MODE                                                    
     C                   EVAL      NDVARI=S5VARI                                                    
     C                   EVAL      NDTCOJ='4'                                                       
     C     KMSCOJC       CHAIN     MSCOJC                                                           
     C                   IF        %FOUND(MSCOJC) AND NDBAJA<'1'                                    
      * Miramos si es Conjunto de Compra                                                            
     C                   EVAL      NDTCOJ='1'                                                       
     C     KMSCOJC       CHAIN     MSCOJC                                                           
     C                   IF        %FOUND(MSCOJC) AND NDBAJA<'1'                                    
      * Si es Conjunto de Ventas y de Compra No lo trataremos como Cjto                             
     C                   EVAL      ZXTCOJ=' '                                                       
     C                   ELSE                                                                       
      * Si es Conjunto de Ventas y No de Compra Si lo tratamos                                      
     C                   EVAL      ZXTCOJ='4'                                                       
     C                   ENDIF                                                                      
     C                   ELSE                                                                       
      * Si No es Conjunto de Venta , Pues no es Conjunto y punto                                    
     C                   EVAL      ZXTCOJ=' '                                                       
     C                   ENDIF                                                                      
     C                   CLOSE(E)  MSCOJC                                                           
      * Es Conjunto                                                                                 
     C                   IF        ZXTCOJ='4'                                                       
     C                   EVAL      FileCojd_erp= 'PURLIBF' + PPCIAS +                               
     C                                          '/MSCOJD'                                           
     C                   OPEN (E)  MSCOJD                                                           
     C                   IF        Not %ERROR                                                       
     C                   EVAL      NDCIAS=S5CIAS                                                    
     C                   EVAL      NDARTI=S5ARTI                                                    
     C                   EVAL      NDMODE=S5MODE                                                    
     C                   EVAL      NDVARI=S5VARI                                                    
     C                   EVAL      NDTCOJ = ZXTCOJ                                                  
     C     KMSCOJC       SETLL     MSCOJD                                                           
     C     KMSCOJC       READE     MSCOJD                                                           
     C                   DOW       NOT %EOF(MSCOJD)                                                 
     C                   IF        NDBAJA <> '1'                                                    
     C                   EVAL      M5ARTI=NDCOMP                                                    
     C                   EVAL      M5VARI=NDVAR2                                                    
     C                   EVAL      M5MODE=NDMOD2                                                    
     C     KMSARTI00     CHAIN     MSARTI00                                                         
      * Valido Sobrestock                                                                           
     C                   EVAL      ZXCANT = NDCANT                                                  
     C                   EXSR      CS_SOBRST2                                                       
     C                   IF        T2VA06 = 1                                                       
     C                   LEAVE                                                                      
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
     C     KMSCOJC       READE     MSCOJD                                                           
     C                   ENDDO                                                                      
     C                   ENDIF                                                                      
     C                   CLOSE(E)  MSCOJD                                                           
     C                   ELSE                                                                       
      * NO Es Conjunto                                                                              
     C                   EVAL      M5ARTI=S5ARTI                                                    
     C                   EVAL      M5VARI=S5VARI                                                    
     C                   EVAL      M5MODE=S5MODE                                                    
     C     KMSARTI00     CHAIN     MSARTI00                                                         
      * Valido Sobrestock                                                                           
     C                   EXSR      CS_SOBRST2                                                       
     C                   ENDIF                                                                      
                                                                                                    
     C                   ENDIF                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Comprobar sobreestock del artículo                                                          
      **********************************************************************                        
     C     CS_SOBRST2    BEGSR                                                                      
                                                                                                    
     C                   EVAL      ZXARTIX = M5ARTI                                                 
     C                   EVAL      ZXVARIX = M5VARI                                                 
     C                   EVAL      ZXMODEX = M5MODE                                                 
     C                   EVAL      Z1CANT = S5CANT - S5CANR - S5CANS                                
     C                   SELECT                                                                     
     C                   WHEN      T3SSTO = '1'                                                     
     C                   EVAL      ZXVSTK = 0                                                       
     C                   WHEN      T3SSTO = '2'                                                     
     C                   EVAL      ZXVSTK = 1                                                       
     C                   ENDSL                                                                      
     C                   EXSR      CS_STCKPRO                                                       
     C                   IF        ZXSTPR = 0                                                       
     C                   EVAL      ZXLG05 = 0                                                       
     C                   EVAL      ZXVSTK = 0                                                       
     C                   EXSR      CS_STCKDEL                                                       
     C                   IF        ZXSTDL = 1                                                       
     C                   EVAL      T2VA06 = 1                                                       
     C                   EVAL      T2LOGU = P7LOGS                                                  
     C                   EVAL      S5LOGE = P7LOGS                                                  
     C*                  UPDATE    RCODEPE                                                          
     C                   ENDIF                                                                      
     C                   ELSE                                                                       
     C                   EVAL      T2VA06 = 1                                                       
     C                   ENDIF                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **********************************************************************                        
      *  Busqueda cantidades de stock pdte servir,fabricar,deposito...                              
      **********************************************************************                        
     C     CS_CANSTOK    BEGSR                                                                      
                                                                                                    
     C                   EVAL      @PEDATD=*DATE                                                    
     C                   EVAL      @PEDATH=*DATE                                                    
     C                   MOVE      @PEDATD       ZXDATD                                             
     C                   MOVE      @PEDATH       ZXDATH                                             
     C                   SUBDUR    1000  :*D     ZXDATD                                             
     C                   ADDDUR    1000  :*D     ZXDATH                                             
     C                   MOVE      ZXDATD        @PEDATD                                            
     C                   MOVE      ZXDATH        @PEDATH                                            
                                                                                                    
     C                   EVAL      @PECIAS=M1CIAS                                                   
     C                   EVAL      @PEARTI=M1ARTI                                                   
     C                   EVAL      @PEVARI=M1VARI                                                   
     C                   EVAL      @PEMODE=M1MODE                                                   
                                                                                                    
     C                   EVAL      M5CIAS=M1CIAS                                                    
     C                   EVAL      M5ARTI=M1ARTI                                                    
     C                   EVAL      M5VARI=M1VARI                                                    
     C                   EVAL      M5MODE=M1MODE                                                    
     C     KMSARTI00     CHAIN     MSARTI00                           81                            
                                                                                                    
      * Pendiente de servir                                                                         
     C                   EVAL      @PETISE=' '                                                      
     C                   CALL      'MM2600'                                                         
     C                   PARM                    @PECIAS                                            
     C                   PARM      ZZDLGA        @PEDLGA                                            
     C                   PARM                    @PEARTI                                            
     C                   PARM                    @PEVARI                                            
     C                   PARM                    @PEMODE                                            
     C                   PARM                    @PETCOJ                                            
     C                   PARM                    @PEDATD                                            
     C                   PARM                    @PEDATH                                            
     C                   PARM                    @PECUST                                            
     C                   PARM      0             @PECANT                                            
     C                   PARM      0             @PECAN1                                            
     C                   PARM                    M1MAGA                                             
     C                   PARM                    @PETISE           4                                
     C                   PARM      '1'           @PERRO            1                                
     C                   EVAL      ZXCANS0 = @PECANT * ZXCANT                                       
                                                                                                    
      * Pendiente de traspasos depositos                                                            
     C                   EVAL      @PETISE=' '                                                      
     C                   CALL      'MM2604'                                                         
     C                   PARM                    @PECIAS                                            
     C                   PARM      ZZDLGA        @PEDLGA                                            
     C                   PARM                    @PEARTI                                            
     C                   PARM                    @PEVARI                                            
     C                   PARM                    @PEMODE                                            
     C                   PARM                    @PETCOJ                                            
     C                   PARM                    @PEDATD                                            
     C                   PARM                    @PEDATH                                            
     C                   PARM      0             @PECANT                                            
     C                   PARM      0             @PECAN1                                            
     C                   PARM                    M1MAGA                                             
     C                   PARM                    @PETISE           4                                
     C                   PARM      *BLANKS       @PERRO            1                                
     C                   EVAL      ZXDEPO0 = @PECANT * ZXCANT                                       
                                                                                                    
      * Esto solo para empresas que utilizan nuestra produccion                                     
     C                   EVAL      @PECAN1=0                                                        
     C                   EVAL      @PECAN2=0                                                        
     C                   IF        ZZTCIA='1' OR ZZTCIA='2'                                         
     C                   EVAL      @PEDATD=*DATE                                                    
     C                   EVAL      @PEDATH=*DATE                                                    
     C                   MOVE      @PEDATD       ZXDATD                                             
     C                   MOVE      @PEDATH       ZXDATH                                             
     C                   SUBDUR    1000  :*D     ZXDATD                                             
     C                   ADDDUR    1000  :*D     ZXDATH                                             
     C                   MOVE      ZXDATD        @PEDATD                                            
     C                   MOVE      ZXDATH        @PEDATH                                            
      * Solo realizaré la búsqued en artículos susceptibles de ser utilizados en                    
      * es decir, que sean estructuras o componentes.                                               
     C     KMSARTI00     CHAIN     PMCAOR01                           81                            
     C                   IF        CHAIN=*ON                                                        
     C     KMSARTI00     CHAIN     PMCAOR08                           81                            
     C                   ENDIF                                                                      
                                                                                                    
      * Búsqueda de las necesidades a tener en cuenta en OF's                                       
     C                   EVAL      @PECAN1=0                                                        
     C                   EVAL      @PECAN2=0                                                        
     C     KMSARTI00     CHAIN     PMDEOR05                           81                            
     C                   IF        CHAIN=*OFF                                                       
      * Si MÑSNCC>='1', entonces (DOLL) se desea que se presente el                                 
      * material asignado                                                                           
     C                   EVAL      @PERRO=*BLANKS                                                   
                                                                                                    
     C                   CALL      'MM2602'                                                         
     C                   PARM                    @PECIAS                                            
     C                   PARM                    @PEARTI                                            
     C                   PARM                    @PEVARI                                            
     C                   PARM                    @PEMODE                                            
     C                   PARM                    @PEDATD                                            
     C                   PARM                    @PEDATH                                            
     C                   PARM      0             @PECAN1                                            
     C                   PARM      0             @PECAN2                                            
     C                   PARM                    M1MAGA                                             
     C                   PARM                    M5MAGD                                             
     C                   PARM                    @PERRO                                             
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
     C                   EVAL      ZXCANE0 = @PECAN2 * ZXCANT                                       
                                                                                                    
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Comprobar Stock en Trace                                                                    
      **********************************************************************                        
     C     CS_STCKTRA    BEGSR                                                                      
                                                                                                    
     C                   MOVEL     @PCIAS        PPCIAS                                             
     C                   EVAL      Z0CANT = S5CANT - S5CANR - S5CANS                                
     C                   EVAL      Z1CANT = S5CANT - S5CANR - S5CANS                                
     C                   EVAL      ZXARTDLGA = S5ARTI                                               
     C                   EVAL      ZXVARDLGA = S5VARI                                               
     C                   EVAL      ZXMODDLGA = S5MODE                                               
      * Si es artículo propio directamente Trace sin pasar por Productiva                           
     C                   EVAL      M5CIAS = S5CIAS                                                  
     C                   EVAL      M5ARTI = S5ARTI                                                  
     C                   EVAL      M5VARI = S5VARI                                                  
     C                   EVAL      M5MODE = S5MODE                                                  
     C     KMSARTI00     CHAIN     MSARTI00                                                         
     C                   IF        M5SIOL = '2'                                                     
     C                   EVAL      ZXARTTRAC = M5ARTI                                               
     C                   EVAL      ZXVARTRAC = M5VARI                                               
     C                   EVAL      ZXMODTRAC = M5MODE                                               
     C                   EVAL      Z2CANT = Z1CANT                                                  
     C                   EXSR      CS_STCK909                                                       
                                                                                                    
      * si no hay stock en Trace busco en Delegaciones.                                             
     C                   IF        T2VA07 = 1                                                       
     C                   EVAL      ZXARTIX = S5ARTI                                                 
     C                   EVAL      ZXVARIX = S5VARI                                                 
     C                   EVAL      ZXMODEX = S5MODE                                                 
      * Delegación Propia                                                                           
     C                   EVAL      ZXVSTK = 1                                                       
     C                   EXSR      CS_STCKPRO                                                       
     C                   IF        ZXSTPR = 1                                                       
     C                   EVAL      T2VA07 = 1                                                       
     C                   ELSE                                                                       
      * Delegaciones cercanas                                                                       
     C                   EVAL      ZXLG05 = 1                                                       
     C                   EVAL      ZXVSTK = 1                                                       
     C                   EXSR      CS_STCKDEL                                                       
     C                   IF        ZXSTDL = 1                                                       
     C                   EVAL      T2VA07 = 1                                                       
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
                                                                                                    
                                                                                                    
     C                   ELSE                                                                       
     C                   MOVEA     *BLANKS       SARVMCJT                                           
     C                   MOVEA     *BLANKS       SARPRCJT                                           
     C                   MOVEA     *BLANKS       SPRVRCJT                                           
     C                   MOVEA     *ZEROS        SCANTCJT                                           
      * Miramos si es Conjunto de Venta                                                             
     C                   EVAL      FileCojc_erp= 'PURLIBF' + PPCIAS +                               
     C                                          '/MSCOJC'                                           
     C                   OPEN (E)  MSCOJC                                                           
     C                   IF        Not %ERROR                                                       
     C                   EVAL      ZXTCOJ=' '                                                       
     C                   EVAL      NDCIAS=S5CIAS                                                    
     C                   EVAL      NDARTI=S5ARTI                                                    
     C                   EVAL      NDMODE=S5MODE                                                    
     C                   EVAL      NDVARI=S5VARI                                                    
     C                   EVAL      NDTCOJ='4'                                                       
     C     KMSCOJC       CHAIN     MSCOJC                                                           
     C                   IF        %FOUND(MSCOJC) AND NDBAJA<'1'                                    
      * Miramos si es Conjunto de Compra                                                            
     C                   EVAL      NDTCOJ='1'                                                       
     C     KMSCOJC       CHAIN     MSCOJC                                                           
     C                   IF        %FOUND(MSCOJC) AND NDBAJA<'1'                                    
      * Si es Conjunto de Ventas y de Compra No lo trataremos como Cjto                             
     C                   EVAL      ZXTCOJ=' '                                                       
     C                   ELSE                                                                       
      * Si es Conjunto de Ventas y No de Compra Si lo tratamos                                      
     C                   EVAL      ZXTCOJ='4'                                                       
     C                   ENDIF                                                                      
     C                   ELSE                                                                       
      * Si No es Conjunto de Venta , Pues no es Conjunto y punto                                    
     C                   EVAL      ZXTCOJ=' '                                                       
     C                   ENDIF                                                                      
     C                   CLOSE(E)  MSCOJC                                                           
      * Es Conjunto en Comercial                                                                    
     C                   IF        ZXTCOJ='4'                                                       
     C                   EVAL      FileCojd_erp= 'PURLIBF' + PPCIAS +                               
     C                                          '/MSCOJD'                                           
     C                   OPEN (E)  MSCOJD                                                           
     C                   IF        Not %ERROR                                                       
     C                   EVAL      NDCIAS=S5CIAS                                                    
     C                   EVAL      NDARTI=S5ARTI                                                    
     C                   EVAL      NDMODE=S5MODE                                                    
     C                   EVAL      NDVARI=S5VARI                                                    
     C                   EVAL      NDTCOJ = ZXTCOJ                                                  
     C     KMSCOJC       SETLL     MSCOJD                                                           
     C     KMSCOJC       READE     MSCOJD                                                           
     C                   DOW       NOT %EOF(MSCOJD)                                                 
     C                   IF        NDBAJA <> '1'                                                    
     C                   EVAL      M5ARTI=NDCOMP                                                    
     C                   EVAL      M5VARI=NDVAR2                                                    
     C                   EVAL      M5MODE=NDMOD2                                                    
     C     KMSARTI00     CHAIN     MSARTI00                                                         
     C                   IF        %FOUND(MSARTI00)                                                 
     C                   EVAL      ZXARTIX=M5ARTI                                                   
     C                   EVAL      ZXVARIX=M5VARI                                                   
     C                   EVAL      ZXMODEX=M5MODE                                                   
     C                   EVAL      ZKARVM=ZXARVMX                                                   
     C                   EXSR      CS_ARTEXIS                                                       
     C                   EVAL      ZXARVM=ZXARVMPRO                                                 
     C                   EVAL      ZXPRVR=M5PRVR                                                    
     C                   EVAL      Z1CANT = Z0CANT * NDCANT                                         
      * Guardo el Componente en la serie para tratarlo después                                      
      *   y asi poder cerrar el fichero MSCOJD usado tambíen después                                
     C                   EVAL      ZW=1                                                             
     C     *BLANKS       LOOKUP    SARVMCJT(ZW)                           81                        
     C                   MOVEL     ZKARVM        SARVMCJT(ZW)                                       
     C                   MOVEL     ZXARVMPRO     SARPRCJT(ZW)                                       
     C                   MOVEL     ZXPRVR        SPRVRCJT(ZW)                                       
     C                   Z-ADD     Z1CANT        SCANTCJT(ZW)                                       
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
     C     KMSCOJC       READE     MSCOJD                                                           
     C                   ENDDO                                                                      
     C                   ENDIF                                                                      
     C                   CLOSE(E)  MSCOJD                                                           
     C                   EXSR      CS_SERCONJ                                                       
     C                   ELSE                                                                       
      * NO Es Conjunto en Comercial                                                                 
     C                   EVAL      M5ARTI=S5ARTI                                                    
     C                   EVAL      M5VARI=S5VARI                                                    
     C                   EVAL      M5MODE=S5MODE                                                    
     C     KMSARTI00     CHAIN     MSARTI00                                                         
     C                   IF        %FOUND(MSARTI00)                                                 
     C                   EVAL      ZXARTIX=M5ARTI                                                   
     C                   EVAL      ZXVARIX=M5VARI                                                   
     C                   EVAL      ZXMODEX=M5MODE                                                   
     C                   EXSR      CS_ARTEXIS                                                       
     C                   EVAL      ZXARVM=ZXARVMPRO                                                 
     C                   EVAL      ZXPRVR=M5PRVR                                                    
      * Conjunto productiva                                                                         
     C                   EXSR      CS_CONJPRO                                                       
                                                                                                    
      * si no hay stock en Trace busco en Delegaciones.                                             
     C                   IF        T2VA07 = 1                                                       
     C                   EVAL      ZXARTIX = S5ARTI                                                 
     C                   EVAL      ZXVARIX = S5VARI                                                 
     C                   EVAL      ZXMODEX = S5MODE                                                 
      * Delegación Propia                                                                           
     C                   EVAL      ZXVSTK = 1                                                       
     C                   EXSR      CS_STCKPRO                                                       
     C                   IF        ZXSTPR = 1                                                       
     C                   EVAL      T2VA07 = 1                                                       
     C                   ELSE                                                                       
      * Delegaciones cercanas                                                                       
     C                   EVAL      ZXLG05 = 1                                                       
     C                   EVAL      ZXVSTK = 1                                                       
     C                   EXSR      CS_STCKDEL                                                       
     C                   IF        ZXSTDL = 1                                                       
     C                   EVAL      T2VA07 = 1                                                       
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
                                                                                                    
     C                   ENDIF                                                                      
                                                                                                    
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Leer Serie Conjunto Comercial Compras                                                       
      **********************************************************************                        
     C     CS_SERCONJ    BEGSR                                                                      
                                                                                                    
     C                   EVAL      ZW=1                                                             
     C     *BLANKS       LOOKUP    SARVMCJT(ZW)                           81                        
                                                                                                    
     C                   IF        ZW>1                                                             
     C                   EVAL      ZW=ZW-1                                                          
      * Leo Componentes Conjunto                                                                    
     C                   FOR       X=1 to ZW                                                        
     C                   MOVEL     SARVMCJT(X)   ZXARVMX                                            
     C                   MOVEL     SARPRCJT(X)   ZXARVMPRO                                          
     C                   MOVEL     SPRVRCJT(X)   ZXPRVR                                             
     C                   Z-ADD     SCANTCJT(X)   Z1CANT                                             
     C                   EVAL      ZXARTDLGA = ZXARTIX                                              
     C                   EVAL      ZXVARDLGA = ZXVARIX                                              
     C                   EVAL      ZXMODDLGA = ZXMODEX                                              
     C                   EXSR      CS_CONJPRO                                                       
     C                   IF        T2VA07 = 1                                                       
     C                   LEAVE                                                                      
     C                   ENDIF                                                                      
     C                   ENDFOR                                                                     
                                                                                                    
      * si no hay stock en Trace busco en Delegaciones.                                             
     C                   IF        T2VA07 = 1                                                       
     C                   FOR       X=1 to ZW                                                        
     C                   MOVEL     SARVMCJT(X)   ZXARVMX                                            
      * Delegación Propia                                                                           
     C                   EVAL      ZXVSTK = 1                                                       
     C                   EXSR      CS_STCKPRO                                                       
     C                   IF        ZXSTPR = 1                                                       
     C                   EVAL      T2VA07 = 1                                                       
     C                   ELSE                                                                       
      * Delegaciones cercanas                                                                       
     C                   EVAL      ZXLG05 = 1                                                       
     C                   EVAL      ZXVSTK = 1                                                       
     C                   EXSR      CS_STCKDEL                                                       
     C                   IF        ZXSTDL = 1                                                       
     C                   EVAL      T2VA07 = 1                                                       
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
      * Si no hay stock del componente en Delg Propia ni cercanas                                   
      *       No miro mas componentes del Conjunto                                                  
     C                   IF        ZXSTPR = 0 And ZXSTDL = 0                                        
     C                   LEAVE                                                                      
     C                   ENDIF                                                                      
     C                   ENDFOR                                                                     
     C                   ENDIF                                                                      
                                                                                                    
     C                   ENDIF                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Comprobar si es Conjunto en Productiva                                                      
      **********************************************************************                        
     C     CS_CONJPRO    BEGSR                                                                      
                                                                                                    
     C                   EVAL      Z2CANT = Z1CANT                                                  
     C                   EVAL      ZXARVMX = ZXARVMPRO                                              
                                                                                                    
      * Busco Empresa Prodcutiva                                                                    
     C                   EVAL      U0CIAS = @PCIAS                                                  
     C                   EVAL      U0TENV = '5'                                                     
     C                   EVAL      U0CLP0 = ZXPRVR                                                  
     C                   EVAL      U0CLP2 = *BLANKS                                                 
     C     KUTCOM0       CHAIN     UTCOM0                                                           
     C                   IF        %FOUND(UTCOM0)                                                   
     C                   MOVEL     U0CIA1        ZXCIAD                                             
                                                                                                    
     C                   MOVEL     ZXCIAD        PPCIAS                                             
     C     KPMLIBL       CHAIN     PMLIBL                                                           
      * MOVEX                                                                                       
     C                   IF        %FOUND(PMLIBL) And PPMVXV = 'V'                                  
      * Buscar Compañía MOVEX                                                                       
     C                   EXSR      CS_CIASMVX                                                       
     C                   EXSR      CS_MVXLIBL                                                       
      * Busco Planta por defecto en la División                                                     
     C                   Eval      File_cmndiv = LIBLMVX + '/CMNDIV00'                              
     C                   OPEN (E)  CMNDIV00                                                         
     C                   IF        Not %ERROR                                                       
     C                   MOVEL     MXCONO        CCCONO                                             
     C                   MOVEL     MXDIVI        CCDIVI                                             
     C     KCMNDIV00     CHAIN     CMNDIV00                                                         
     C                   IF        %FOUND(CMNDIV00)                                                 
      * Busco Si es Conjunto                                                                        
     C                   Eval      File_mpdhed = LIBLMVX + '/MPDHED00'                              
     C                   OPEN (E)  MPDHED00                                                         
     C                   Eval      File_AQPEDI = LIBLAQA + '/AQPEDI00'                              
     C                   OPEN (E)  AQPEDI00                                                         
     C                   Eval      File_ZAQITN = LIBLAQA + '/ZAQITN00'                              
     C                   OPEN (E)  ZAQITN00                                                         
     C                   Eval      File_GMTABD = LIBLAQA + '/GMTABD01'                              
     C                   OPEN (E)  GMTABD01                                                         
     C                   Eval      File_MITFAC = LIBLMVX + '/MITFAC00'                              
     C                   OPEN (E)  MITFAC00                                                         
     C                   IF        Not %ERROR                                                       
      *                                                                                             
      *            Ver si estamos en una división Multiplanta                                       
     C                   MOVEL(P)  MXCONO        Z1CONO                                             
     C                   EVAL      Z1DIVI = MXDIVI                                                  
     C     KAQPEDI00     CHAIN     AQPEDI00                                                         
     C                   EVAL      ZXMULTIPLA = %FOUND(AQPEDI00)                                    
     C                                          AND  Z1L101 = '1'                                   
     C                   MOVEL     MXCONO        H_PHCONO                                           
     C                   MOVEL     ZXARVMPRO     H_PHPRNO                                           
     C                   EVAL      H_PHFACI = GET_FACI(MXDIVI:CCFACI:H_PHPRNO)                      
     C                   MOVEL     'KIT'         H_PHSTRT                                           
     C     KMPDHED00     CHAIN     MPDHED00                                                         
     C                   IF        %FOUND(MPDHED00) And                                             
     C                             H_PHSTAT >= '20' And H_PHSTAT < '90'                             
      * Si es Conjunto leo los Componentes                                                          
     C                   Eval      File_mpdmat = LIBLMVX + '/MPDMAT00'                              
     C                   OPEN (E)  MPDMAT00                                                         
     C                   IF        Not %ERROR                                                       
     C                   MOVEL     MXCONO        PMCONO                                             
     C                   MOVEL     ZXARVMPRO     PMPRNO                                             
     C                   EVAL      PMFACI = GET_FACI(MXDIVI:CCFACI:PMPRNO)                          
     C                   MOVEL     'KIT'         PMSTRT                                             
     C     KMPDMAT00     SETLL     MPDMAT00                                                         
     C     KMPDMAT00     READE     MPDMAT00                                                         
     C                   DOW       NOT %EOF(MPDMAT00)                                               
      * Para cada Componente miro si existe stock en Trace                                          
     C                   MOVEL     PMMTNO        ZXARTTRAC                                          
     C                   MOVEL     *BLANKS       ZXVARTRAC                                          
     C                   MOVEL     *BLANKS       ZXMODTRAC                                          
     C                   EVAL      Z2CANT = Z1CANT * PMCNQT                                         
     C                   EXSR      CS_STCK909                                                       
     C                   IF        T2VA07 = 1                                                       
     C                   LEAVE                                                                      
     C                   ENDIF                                                                      
     C     KMPDMAT00     READE     MPDMAT00                                                         
     C                   ENDDO                                                                      
     C                   ENDIF                                                                      
     C                   CLOSE(E)  MPDMAT00                                                         
     C                   ELSE                                                                       
      * Si No es Conjunto miro si existe stock en Trace                                             
     C                   EVAL      ZXARTTRAC = ZXARTIX                                              
     C                   EVAL      ZXVARTRAC = ZXVARIX                                              
     C                   EVAL      ZXMODTRAC = ZXMODEX                                              
     C                   EXSR      CS_STCK909                                                       
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
     C                   CLOSE(E)  MPDHED00                                                         
     C                   CLOSE(E)  AQPEDI00                                                         
     C                   CLOSE(E)  ZAQITN00                                                         
     C                   CLOSE(E)  GMTABD01                                                         
     C                   CLOSE(E)  MITFAC00                                                         
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
     C                   CLOSE(E)  CMNDIV00                                                         
     C                   ELSE                                                                       
      * AS400                                                                                       
      * Busco Si es Conjunto                                                                        
     C                   EVAL      FileCojc_erp= 'PURLIBF' + PPCIAS +                               
     C                                          '/MSCOJC'                                           
     C                   OPEN (E)  MSCOJC                                                           
     C                   IF        Not %ERROR                                                       
     C                   EVAL      NDCIAS = ZXCIAD                                                  
     C                   EVAL      NDARTI = ZXARTIX                                                 
     C                   EVAL      NDVARI = ZXVARIX                                                 
     C                   EVAL      NDMODE = ZXMODEX                                                 
     C                   EVAL      NDTCOJ = '4'                                                     
     C     KMSCOJC       CHAIN     MSCOJC                                                           
     C                   IF        %FOUND(MSCOJC) AND NDBAJA<'1'                                    
      * Si es Conjunto leo los Componentes                                                          
     C                   EVAL      FileCojd_erp= 'PURLIBF' + PPCIAS +                               
     C                                          '/MSCOJD'                                           
     C                   OPEN (E)  MSCOJD                                                           
     C                   IF        Not %ERROR                                                       
     C     KMSCOJC       SETLL     MSCOJD                                                           
     C     KMSCOJC       READE     MSCOJD                                                           
     C                   DOW       NOT %EOF(MSCOJD)                                                 
     C                   IF        NDBAJA <> '1'                                                    
      * Para cada Componente miro si existe stock en Trace                                          
     C                   EVAL      ZXARTTRAC = NDCOMP                                               
     C                   EVAL      ZXVARTRAC = NDVAR2                                               
     C                   EVAL      ZXMODTRAC = NDMOD2                                               
     C                   EVAL      Z2CANT = Z1CANT * NDCANT                                         
     C                   EXSR      CS_STCK909                                                       
     C                   IF        T2VA07 = 1                                                       
     C                   LEAVE                                                                      
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
     C     KMSCOJC       READE     MSCOJD                                                           
     C                   ENDDO                                                                      
     C                   ENDIF                                                                      
     C                   CLOSE(E)  MSCOJD                                                           
     C                   CLOSE(E)  MSCOJC                                                           
                                                                                                    
     C                   ELSE                                                                       
     C                   CLOSE(E)  MSCOJC                                                           
      * Si No es Conjunto miro si existe stock en Trace                                             
     C                   EVAL      ZXARTTRAC = ZXARTIX                                              
     C                   EVAL      ZXVARTRAC = ZXVARIX                                              
     C                   EVAL      ZXMODTRAC = ZXMODEX                                              
     C                   EXSR      CS_STCK909                                                       
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
                                                                                                    
     C                   ELSE                                                                       
      * Si No encuentro equivalencia del Proveedor miro directamente Trace                          
     C                   EVAL      ZXARTTRAC = ZXARTIX                                              
     C                   EVAL      ZXVARTRAC = ZXVARIX                                              
     C                   EVAL      ZXMODTRAC = ZXMODEX                                              
     C                   EXSR      CS_STCK909                                                       
     C                   ENDIF                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Comprobar si el artículo existe en la productiva                                            
      **********************************************************************                        
     C     CS_ARTEXIS    BEGSR                                                                      
                                                                                                    
     C                   EVAL      ZXARTIX=M5ARTI                                                   
     C                   EVAL      ZXVARIX=M5VARI                                                   
     C                   EVAL      ZXMODEX=M5MODE                                                   
     C                   EVAL      ZXARVM=ZXARVMX                                                   
     C                   EVAL      ZXTCST=M5TCS1                                                    
     C                   EVAL      ZXARVP=*BLANKS                                                   
                                                                                                    
     C                   EVAL      C0CIAS=S5CIAS                                                    
     C                   EVAL      C0PRVR=M5PRVR                                                    
     C     KPUPROV       CHAIN     PUPROV                                                           
     C                   IF        %FOUND(PUPROV)                                                   
                                                                                                    
     C                   EVAL      C3CIAS=S5CIAS                                                    
     C                   EVAL      C3PRVR=M5PRVR                                                    
     C                   EVAL      C3ARVM=ZXARVM                                                    
     C     KPUPRP0       CHAIN     PUPRP0                                                           
     C                   IF        %FOUND(PUPRP0)                                                   
     C                   EVAL      ZXARVP=C3ARVP                                                    
     C                   EVAL      ZXTCST=C3TCST                                                    
     C                   IF        ZXTCST=*BLANKS                                                   
     C                   EVAL      ZXTCST=M5TCS1                                                    
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
                                                                                                    
     C                   IF        ZXARVP <> *BLANKS                                                
     C                   EVAL      ZXARVMPRO=ZXARVP                                                 
     C                   EXSR      CS_ARTEXI2                                                       
     C                   IF        ZXINCI = '005'                                                   
     C                   EVAL      ZXARVMPRO=ZXARVM                                                 
     C                   EXSR      CS_ARTEXI2                                                       
     C                   ENDIF                                                                      
     C                   ELSE                                                                       
     C                   EVAL      ZXARVMPRO=ZXARVM                                                 
     C                   EXSR      CS_ARTEXI2                                                       
     C                   ENDIF                                                                      
     C                   ELSE                                                                       
     C                   ENDIF                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Comprobar si el artículo existe en la productiva                                            
      **********************************************************************                        
     C     CS_ARTEXI2    BEGSR                                                                      
                                                                                                    
      * Busco Empresa Prodcutiva                                                                    
     C                   EVAL      U0CIAS = @PCIAS                                                  
     C                   EVAL      U0TENV = '5'                                                     
     C                   EVAL      U0CLP0 = M5PRVR                                                  
     C                   EVAL      U0CLP2 = *BLANKS                                                 
     C     KUTCOM0       CHAIN     UTCOM0                                                           
     C                   IF        %FOUND(UTCOM0)                                                   
     C                   MOVEL     U0CIA1        ZXCIAD                                             
                                                                                                    
     C                   EVAL      ZXINCI = '   '                                                   
     C                   EVAL      Q1CIAS = ZXCIAD                                                  
     C                   EVAL      Q1ARVM = ZXARVMPRO                                               
      * Si el artículo no existe en GXEQAR buscamos en MSARTI Productiva                            
                                                                                                    
     C                   MOVEL     ZXCIAD        PPCIAS                                             
     C     KPMLIBL       CHAIN     PMLIBL                                                           
      * MOVEX                                                                                       
     C                   IF        %FOUND(PMLIBL) And PPMVXV = 'V'                                  
      * Buscar Compañía MOVEX                                                                       
     C                   EXSR      CS_CIASMVX                                                       
     C                   EXSR      CS_MVXLIBL                                                       
      * Abrir Ficheros MOVEX                                                                        
     C                   Eval      File_mitmas = LIBLMVX + '/MITMAS00'                              
     C                   OPEN (E)  MITMAS00                                                         
     C                   IF        Not %ERROR                                                       
     C                   MOVEL     MXCONO        MMCONO                                             
     C                   EVAL      MMITNO = M5ARTI                                                  
     C                   MOVEL     ZXARVMPRO     MMITNO                                             
     C     KMITMAS00     CHAIN     MITMAS00                                                         
     C                   IF        Not %FOUND(MITMAS00)                                             
     C                             OR MMSTAT<>'20'                                                  
     C                   EVAL      ZXINCI = '005'                                                   
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
     C                   CLOSE(E)  MITMAS00                                                         
                                                                                                    
     C                   ELSE                                                                       
      * AS400                                                                                       
     C                   EVAL      Filearti_erp= 'PURLIBF' + PPCIAS +                               
     C                                          '/MSARTI'                                           
     C                   OPEN (E)  MSARTI                                                           
     C                   IF        Not %ERROR                                                       
     C                   EVAL      ZXARVMX = ZXARVMPRO                                              
     C                   EVAL      A_M5ARTI = ZXARTIX                                               
     C                   EVAL      A_M5VARI = ZXVARIX                                               
     C                   EVAL      A_M5MODE = ZXMODEX                                               
     C     KMSARTI       CHAIN     MSARTI                                                           
     C                   IF        Not %FOUND(MSARTI)                                               
     C                             OR M5BAJA='1'                                                    
     C                   EVAL      ZXINCI = '005'                                                   
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
                                                                                                    
     C                   CLOSE(E)  MSARTI                                                           
                                                                                                    
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Comprobar Stock en Trace                                                                    
      **********************************************************************                        
     C     CS_STCK909    BEGSR                                                                      
                                                                                                    
      * Busco Stock en OL                                                                           
     C                   if        (%lookup(S5LOGE:T_logol)>0)                                      
     C                   EVAL      M0CIAS=S5CIAS                                                    
     C                   EVAL      M0LOGE=S5LOGE                                                    
     C     KMSALMA05     CHAIN     MSALMA05                                                         
     C                   IF        %FOUND AND M0BAJA<>'1'                                           
     C                   EVAL      @qmaga = M0MAGA                                                  
     C                   call      'MM1412'                                                         
     C                   PARM      S5cias        @qCIAS            3 0                              
     C                   PARM      ZXARTTRAC     @qARTI           15                                
     C                   PARM      ZXVARTRAC     @qVARI            3                                
     C                   PARM      ZXMODTRAC     @qMODE            3                                
     C                   PARM      0             @qSTOK           15 5                              
     C                   PARM      ' '           @qSERV            2                                
     C                   PARM                    @qmaga            5                                
     C                   EVAL      T2TDIS = @qSTOK                                                  
     C                   IF        Z2CANT <=@qSTOK                                                  
     C                   EVAL      T2VA07 = 0                                                       
     C                   ELSE                                                                       
     C                   EVAL      T2VA07 = 1                                                       
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
                                                                                                    
     C                   ENDIF                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Comprobar si hay stock suficiente en Delegación Propia                                      
      **********************************************************************                        
     C     CS_STCKPRO    BEGSR                                                                      
                                                                                                    
     C                   EVAL      ZXSTPR = 0                                                       
     C                   EVAL      ZXCANT = 1                                                       
      * De momento la linea será ED hasta que no encontremos stock                                  
     C                   EVAL      T2VA07 = 0                                                       
                                                                                                    
      * Logística asociada a la delegación                                                          
     C                   EVAL      P7CIAS=@PCIAS                                                    
     C                   EVAL      P7DLGA=@PDLGA                                                    
     C     KPMEMPR       CHAIN     PMEMPR                                                           
     C                   IF        %FOUND(PMEMPR)                                                   
     C                             AND (P7AUTS=*BLANKS OR                                           
     C                             T3OPL1=*BLANKS)                                                  
     C                   EVAL      MICIAS=P7CIAS                                                    
     C                   EVAL      MIDLGA=@PDLGA                                                    
     C                   EVAL      MILGCA=P7LOGS                                                    
     C     KMSLOAD       CHAIN     MSLOAD                                                           
     C     KMSLOAD       CHAIN     MSLOGI                                                           
     C                   IF        %FOUND(MSLOAD) AND %FOUND(MSLOGI)                                
     C                   EVAL      M0CIAS=S0CIAS                                                    
     C                   EVAL      M0LOGE=P7LOGS                                                    
     C     KMSALMA05     CHAIN     MSALMA05                                                         
     C                   IF        %FOUND(MSALMA05)                                                 
                                                                                                    
      * Busco Stock en el Almacén de la logística                                                   
     C                   EVAL      M1CIAS = S5CIAS                                                  
     C                   EVAL      M1ARTI = ZXARTIX                                                 
     C                   EVAL      M1VARI = ZXVARIX                                                 
     C                   EVAL      M1MODE = ZXMODEX                                                 
     C                   EVAL      M1MAGA = M0MAGA                                                  
     C                   EVAL      M1CALI = 'A'                                                     
     C     KMSSTO010     CHAIN     MSSTO01                                                          
     C                   IF        %FOUND(MSSTO01)                                                  
                                                                                                    
     C                   EVAL      ZXSTDD = 0                                                       
     C                   EVAL      ZXSTKA = 0                                                       
     C                   EVAL      ZXCANS0 = 0                                                      
     C                   EVAL      ZXCANE0 = 0                                                      
     C                   EVAL      ZXDEPO0 = 0                                                      
                                                                                                    
      * Solo tratamos si el almacén tiene stock                                                     
     C                   IF        M1SACT > 0                                                       
     C                   EVAL      ZXSTKA=M1SACT                                                    
                                                                                                    
      * Busqueda cantidades de stock pdte servir,fabricar,deposito...                               
     C                   EXSR      CS_CANSTOK                                                       
                                                                                                    
     C     KMSSTOK       CHAIN     MSSTOK                                                           
     C                   IF        %FOUND(MSSTOK)                                                   
      * Stock disponible                                                                            
     C                   EVAL      ZXSTDD=ZXSTKA-ZXCANS0-ZXCANE0                                    
     C                   IF        ZXDEPO0>0                                                        
     C                   EVAL      ZXSTDD=ZXSTDD-ZXDEPO0                                            
     C                   ENDIF                                                                      
      * Si stock disponible es mayor o igual a cantidad pedido No ED                                
     C                   EVAL      T2DART = ZXARVMX                                                 
     C                   EVAL      T2DCAN = Z1CANT                                                  
     C                   EVAL      T2DDIS = ZXSTDD                                                  
     C                   EVAL      T2DALM = M1MAGA                                                  
     C                   IF        Z1CANT <= ZXSTDD And ZXVSTK = 1                                  
     C                   EVAL      ZXSTPR = 1                                                       
     C                   ENDIF                                                                      
     C                   IF        M1SMAX<ZXSTDD And ZXVSTK = 0                                     
     C                   IF        Z1CANT <= ZXSTDD                                                 
     C                   EVAL      ZXSTPR = 1                                                       
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Comprobar si hay stock suficiente en alguna Delegación Cercana                              
      **********************************************************************                        
     C     CS_STCKDEL    BEGSR                                                                      
                                                                                                    
     C                   EVAL      ZXSTDL = 0                                                       
     C                   EVAL      ZXCANT = 1                                                       
      * De momento la linea será ED hasta que no encontremos stock                                  
     C                   EVAL      T2VA07 = 0                                                       
                                                                                                    
      * Busco en parámetros de Interdelegaciones,delegaciones cercanas                              
     C                   EVAL      XACIAS = S0CIAS                                                  
     C                   EVAL      XADLGA = S0DLGA                                                  
     C                   IF        ZXLG05 = 1                                                       
     C     KMSDLDL05     SETLL     MSDLDL05                                                         
     C     KMSDLDL05     READE     MSDLDL05                               82                        
     C                   ELSE                                                                       
     C     KMSDLDL05     SETLL     MSDLDL03                                                         
     C     KMSDLDL05     READE     MSDLDL03                               82                        
     C                   ENDIF                                                                      
     C                   DOW       EOF=*OFF                                                         
     C                   IF        (XAPRI2>'0' And ZXLG05 = 1)                                      
     C                             Or (XAPRIS>'0' And ZXLG05 = 0)                                   
                                                                                                    
      * Logística asociada a la delegación                                                          
     C                   EVAL      P7CIAS=S0CIAS                                                    
     C                   EVAL      P7DLGA=XADLG2                                                    
     C     KPMEMPR       CHAIN     PMEMPR                                                           
     C                   IF        %FOUND(PMEMPR)                                                   
     C                   EVAL      MICIAS=P7CIAS                                                    
     C                   EVAL      MIDLGA=XADLGA                                                    
     C                   EVAL      MILGCA=P7LOGS                                                    
     C     KMSLOAD       CHAIN     MSLOAD                                                           
     C     KMSLOAD       CHAIN     MSLOGI                                                           
     C                   IF        %FOUND(MSLOAD) AND %FOUND(MSLOGI)                                
     C                   EVAL      M0CIAS=S0CIAS                                                    
     C                   EVAL      M0LOGE=P7LOGS                                                    
     C     KMSALMA05     CHAIN     MSALMA05                                                         
     C                   IF        %FOUND(MSALMA05)                                                 
                                                                                                    
      * Busco Stock en el Almacén de la logística                                                   
     C                   EVAL      M1CIAS = S5CIAS                                                  
     C                   EVAL      M1ARTI = ZXARTIX                                                 
     C                   EVAL      M1VARI = ZXVARIX                                                 
     C                   EVAL      M1MODE = ZXMODEX                                                 
     C                   EVAL      M1MAGA = M0MAGA                                                  
     C                   EVAL      M1CALI = 'A'                                                     
     C     KMSSTO010     CHAIN     MSSTO01                                                          
     C                   IF        %FOUND(MSSTO01)                                                  
                                                                                                    
     C                   EVAL      ZXSTDD = 0                                                       
     C                   EVAL      ZXSTKA = 0                                                       
     C                   EVAL      ZXCANS0 = 0                                                      
     C                   EVAL      ZXCANE0 = 0                                                      
     C                   EVAL      ZXDEPO0 = 0                                                      
                                                                                                    
      * Solo tratamos si el almacén tiene stock                                                     
     C                   IF        M1SACT > 0                                                       
     C                   EVAL      ZXSTKA=M1SACT                                                    
                                                                                                    
      * Busqueda cantidades de stock pdte servir,fabricar,deposito...                               
     C                   EXSR      CS_CANSTOK                                                       
                                                                                                    
     C     KMSSTOK       CHAIN     MSSTOK                                                           
     C                   IF        %FOUND(MSSTOK)                                                   
      * Stock disponible                                                                            
     C                   EVAL      ZXSTDD=ZXSTKA-ZXCANS0-ZXCANE0                                    
     C                   IF        ZXDEPO0>0                                                        
     C                   EVAL      ZXSTDD=ZXSTDD-ZXDEPO0                                            
     C                   ENDIF                                                                      
      * Si stock disponible es mayor o igual a cantidad pedido No ED                                
     C                   EVAL      T2DART = ZXARVMX                                                 
     C                   EVAL      T2DCAN = Z1CANT                                                  
     C                   EVAL      T2DDIS = ZXSTDD                                                  
     C                   EVAL      T2DALM = M1MAGA                                                  
     C                   IF        Z1CANT <= ZXSTDD And ZXVSTK = 1                                  
     C                   EVAL      ZXSTDL = 1                                                       
     C                   LEAVE                                                                      
     C                   ENDIF                                                                      
     C                   IF        M1SMAX<ZXSTDD And ZXVSTK = 0                                     
     C                   IF        Z1CANT <= ZXSTDD                                                 
     C                   EVAL      ZXSTDL = 1                                                       
     C                   LEAVE                                                                      
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
                                                                                                    
     C                   IF        ZXLG05 = 1                                                       
     C     KMSDLDL05     READE     MSDLDL05                               82                        
     C                   ELSE                                                                       
     C     KMSDLDL05     READE     MSDLDL03                               82                        
     C                   ENDIF                                                                      
     C                   ENDDO                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Validaciones para Alta ED (precio compra, artículo, etc...)                                 
      **********************************************************************                        
     C     CS_VALED51    BEGSR                                                                      
                                                                                                    
     C                   CALL      'ED0051'                                                         
     C                   PARM                    @PCIAS                                             
     C                   PARM                    @PDLGA                                             
     C                   PARM                    @PNPCO                                             
     C                   PARM                    @PTPED                                             
     C                   PARM                    @PDATP                                             
     C                   PARM                    @PNOPL                                             
     C                   PARM                    @PLINE                                             
     C                   PARM      *BLANKS       @FDARV1                                            
     C                   PARM      *BLANKS       @FDCOM2                                            
     C                   PARM      S5CUST        @PCUST                                             
     C                   PARM      S5TDI1        @PTDI1                                             
     C                   PARM      '403'         @PEDAU                                             
     C                   PARM      0             @PLOGI                                             
     C                   PARM      0             @PORIG                                             
     C                   PARM      1             @PINTE                                             
     C                   PARM      ' '           @PERRO                                             
     C                   PARM      *BLANKS       @PINCI                                             
                                                                                                    
     C                   IF        @PERRO <> ' '                                                    
     C                   EVAL      T2INCI = @PINCI                                                  
     C                   ENDIF                                                                      
     C                   IF        @PINCI = '003' OR                                                
     C                             @PINCI = '005'                                                   
     C                             OR @PINCI = '019'                                                
     C                   EVAL      T2VA08 = 1                                                       
     C                   ENDIF                                                                      
                                                                                                    
     C                   IF        @PINCI = '050'                                                   
     C                   EVAL      T2CJTO = 1                                                       
     C                   ENDIF                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **************************************************************                                
      * Calculo Importe línea pedido                               *                                
      *------------------------------------------------------------*                                
     C     CS_IMPORTE    BEGSR                                                                      
                                                                                                    
     C                   EVAL      ZXMONE2 = S5MONE                                                 
      * Tipo de IVA                                                                                 
     C                   EVAL      PECIAS=S5CIAS                                                    
     C                   EVAL      PECTAB='TIV2'                                                    
     C                   EVAL      PECLTA=*BLANKS                                                   
     C                   EVAL      PECLTA=S0TIV3                                                    
     C     KPMTABD       CHAIN     PMTABD                                                           
     C                   IF        %FOUND(PMTABD)                                                   
     C                   EVAL      ZXTIVC=PEBL61                                                    
     C                   EVAL      ZXBL65I=PEBL65                                                   
     C                   ELSE                                                                       
     C                   EVAL      ZXPABI=*BLANKS                                                   
     C                   ENDIF                                                                      
                                                                                                    
     C                   EVAL      XZAUXI=*ZEROS                                                    
     C                   EVAL      XZAUXI1=*ZEROS                                                   
     C                   EVAL      MBCIAS=S5CIAS                                                    
     C                   EVAL      MBMONE=ZXMONE2                                                   
      * Ecotaxe                                                                                     
     C                   EVAL      XZTAXE=0                                                         
     C                   IF        S5ECOP<>*BLANKS                                                  
     C                   CALL      'MN0398'                                                         
     C                   PARM                    @PCIAS                                             
     C                   PARM      S5ECOP        @PEECOP                                            
     C                   PARM      S5DATP        @PEFLCD                                            
     C                   PARM      0             @PETAXE                                            
     C                   EVAL      XZTAXE=@PETAXE                                                   
     C                   ENDIF                                                                      
      * Buscamos en Ajuste decimal                                                                  
                                                                                                    
     C     KMSDIV0       CHAIN     MSDIV0                                                           
     C                   IF        %FOUND(MSDIV0)                                                   
     C                   EVAL      XZDECI=MBDECI                                                    
     C                   EVAL      XZAJUD=MBAJUD                                                    
     C                   ENDIF                                                                      
                                                                                                    
      * Buscamos en PMUNAL UNIDADES ALTERNATIVAS                                                    
                                                                                                    
     C                   EVAL      XZCOFU=1                                                         
     C                   IF        S5UNIM<>S5UNDP                                                   
     C                   EVAL      XZCIAS=@PCIAS                                                    
     C                   EVAL      XZARTI=S5ARTI                                                    
     C                   EVAL      XZVARI=S5VARI                                                    
     C                   EVAL      XZMODE=S5MODE                                                    
     C                   EVAL      ZXCA10=S5CANT                                                    
     C                   EVAL      ZXCA11=S5CANT                                                    
     C                   EVAL      ZXUN10=S5UNIM                                                    
     C                   EVAL      ZXUN11=S5UNDP                                                    
     C* CAMBIO de unidades                                                                          
     C/COPY *LIBL/QSRDSRC,SRD021                                                                    
     C                   ENDIF                                                                      
                                                                                                    
      * Buscamos en CAMBIO MONEDA CABECERA DEL PEDIDO                                               
                                                                                                    
     C                   IF        ZXMONE2<>S5MONE                                                  
     C                   CALL      'MM2555'                                                         
     C                   PARM      S5CIAS        @PCIAS                                             
     C                   PARM      S5MONE        @PMON1                                             
     C                   PARM      ZXMONE2       @PMON2                                             
     C                   PARM      S5DATP        @PDATA                                             
     C                   PARM      S5NOPL        @PHORA                                             
     C                   PARM      0             @PCMCOCO                                           
     C                   PARM      0             @PCMCCCO                                           
     C                   PARM      *BLANKS       @PEERR                                             
     C                   EVAL      ZXCOCAMB=@PCMCCCO                                                
     C                   ELSE                                                                       
     C                   EVAL      ZXCOCAMB=1                                                       
     C                   ENDIF                                                                      
                                                                                                    
      * Buscamos en % de IVA                                                                        
     C                   EVAL      MVCIAS=S5CIAS                                                    
     C                   EVAL      MVTIVA=S5TIVA                                                    
     C                   EVAL      MVPABI=ZXPABI                                                    
     C                   EVAL      MVFLCD=@PDATP                                                    
     C     KMSIVAS       SETGT     MSIVAS                                                           
     C     KMSIVAS0      READPE    MSIVAS                                 83                        
     C                   SELECT                                                                     
     C                   WHEN      ZXTIVC=' '                                                       
     C                   EVAL      MVPIV2=*ZEROS                                                    
     C                   WHEN      ZXTIVC='0'                                                       
     C                   EVAL      MVPIV1=*ZEROS                                                    
     C                   EVAL      MVPIV2=*ZEROS                                                    
     C                   ENDSL                                                                      
                                                                                                    
      * Calculamos el precio de nueva linea o modificada                                            
     C                   EVAL      XZCANT=S5CANT                                                    
     C                   EVAL      XZPREC=S5PREC                                                    
     C                   EVAL      XZCADP=S5CADP                                                    
     C                   EVAL      XZDTO1=S5DTO1                                                    
     C                   EVAL      XZDTO2=S5DTO2                                                    
     C                   EVAL      XZDTO3=S5DTO3                                                    
     C                   EVAL      XZDTO4=S5DTO4                                                    
     C                   IF        XZDTO4=*ZEROS                                                    
     C                   EVAL      XZDTO4=@PDTOE                                                    
     C                   ENDIF                                                                      
     C/COPY *LIBL/QSRDSRC,SRD022ECO                                                                 
     C* AJUSTE Y DECIMALES                                                                          
     C/COPY *LIBL/QSRDSRC,SRD001                                                                    
     C                   Z-ADD     XZAUXI        ZXBIMPECO                                          
     C/COPY *LIBL/QSRDSRC,SRD022                                                                    
                                                                                                    
     C* AJUSTE Y DECIMALES                                                                          
     C/COPY *LIBL/QSRDSRC,SRD001                                                                    
     C                   Z-ADD     XZAUXI        ZXBIMP                                             
     C                   ADD       ZXBIMPECO     ZXBIMP                                             
      * Calculamos el IVA                                                                           
     C                   EVAL      XZAUXI=ZXBIMP*MVPIV1                                             
     C     XZAUXI        DIV(H)    100           XZAUXI                                             
     C* AJUSTE Y DECIMALES                                                                          
     C/COPY *LIBL/QSRDSRC,SRD001                                                                    
     C                   Z-ADD     XZAUXI        ZXIIV1                                             
      * Calculamos el Recargo de equivalencia                                                       
     C                   EVAL      XZAUXI=ZXBIMP*MVPIV2                                             
     C     XZAUXI        DIV(H)    100           XZAUXI                                             
     C* AJUSTE Y DECIMALES                                                                          
     C/COPY *LIBL/QSRDSRC,SRD001                                                                    
     C                   Z-ADD     XZAUXI        ZXIIV2                                             
                                                                                                    
      * Omitimos BASE o IVA segun tipo de IVA                                                       
                                                                                                    
     C                   IF        MVOMTB>='1'                                                      
     C                   EVAL      ZXBIMP=ZXBIMP-ZXBIMP                                             
     C                   ENDIF                                                                      
     C                   IF        MVOMTI>='1'                                                      
     C                   EVAL      ZXIIV1=ZXIIV1-ZXIIV1                                             
     C                   EVAL      ZXIIV2=ZXIIV2-ZXIIV2                                             
     C                   ENDIF                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Validaciones Importe lineas ED                                     *                        
      **********************************************************************                        
     C     CS_IMPLINE    BEGSR                                                                      
                                                                                                    
     C                   EVAL      T2IMPM = T3LIMP                                                  
     C                   EVAL      T2IMED = ZXIMPO                                                  
     C*                  IF        ZXIMPO < XALII2                                                  
     C                   IF        ZXIMPO < T3LIMP                                                  
      * Actualizo fichero temporal                                                                  
     C                   EVAL      ZXVA09 = 1                                                       
     C                   EXSR      CS_FICTEMP                                                       
     C                   ENDIF                                                                      
     C*                  ENDIF                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Comprobar Pedido Completo                                          *                        
      **********************************************************************                        
     C     CS_PEDTOTA    BEGSR                                                                      
                                                                                                    
     C                   IF        ZXPEDT = 1 And S0ETOD = '1'                                      
      * Actualizo fichero temporal                                                                  
     C                   EVAL      ZXVA10 = 1                                                       
     C                   EXSR      CS_FICTEMP                                                       
     C                   ENDIF                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Actualizar fichero temporal                                                                 
      **********************************************************************                        
     C     CS_FICTEMP    BEGSR                                                                      
                                                                                                    
      * Leo Pedido en CODEPE                                                                        
     C     KED0050W      SETLL     ED0050W                                                          
     C     KED0050W      READE     ED0050W                                                          
     C                   DOW       NOT %EOF(ED0050W)                                                
     C                   EVAL      T2VA09 = ZXVA09                                                  
     C                   EVAL      T2VA10 = ZXVA10                                                  
     C                   IF        T2VA10 = 1                                                       
     C                   EVAL      T2ENTD = 0                                                       
     C                   ENDIF                                                                      
     C                   UPDATE    RED0050W                                                         
     C     KED0050W      READE     ED0050W                                                          
     C                   ENDDO                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Actualizar Marca ED en CODEPE TPE4='2'                                                      
      **********************************************************************                        
     C     CS_MARCAED    BEGSR                                                                      
                                                                                                    
      * Leo Pedido en CODEPE                                                                        
     C     KED0050W      SETLL     ED0050W                                                          
     C     KED0050W      READE     ED0050W                                                          
     C                   DOW       NOT %EOF(ED0050W)                                                
     C                   IF        T2ENTD = 1 And T2FORZ = 0                                        
     C                   EVAL      S5CIAS = T2CIAS                                                  
     C                   EVAL      S5DLGA = T2DLGA                                                  
     C                   EVAL      S5NPCO = T2NPCO                                                  
     C                   EVAL      S5TPED = T2TPED                                                  
     C                   EVAL      S5DATP = T2DATP                                                  
     C                   EVAL      S5NOPL = T2NOPL                                                  
     C                   EVAL      S5LINE = T2LINE                                                  
     C     KCODEPE0      CHAIN     CODEPE                                                           
     C                   IF        %FOUND(CODEPE)                                                   
     c                   if        not (s5lb2b <> *blank and s5tped ='25')                          
     C                   IF        S5STUL<>'5' AND S5CAPP=0                                         
     C                   EVAL      S5TPE4 = '2 '                                                    
     c                   ENDIF                                                                      
     C*                  UPDATE    RCODEPE                                                          
     c                   endif                                                                      
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
     C     KED0050W      READE     ED0050W                                                          
     C                   ENDDO                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Buscar Puntos de Expedición                                                                 
      **********************************************************************                        
     C     CS_BUSPEXP    BEGSR                                                                      
                                                                                                    
      * Leo Pedido en CODEPE                                                                        
     C                   MOVEA     *BLANKS       SLOGISTI                                           
     C                   EVAL      S5CIAS = @PCIAS                                                  
     C                   EVAL      S5DLGA = @PDLGA                                                  
     C                   EVAL      S5NPCO = @PNPCO                                                  
     C                   EVAL      S5TPED = @PTPED                                                  
     C                   EVAL      S5DATP = @PDATP                                                  
     C                   EVAL      S5NOPL = @PNOPL                                                  
     C     KCODEPE       SETLL     CODEPE                                                           
     C     KCODEPE       READE(N)  CODEPE                                                           
     C                   DOW       NOT %EOF(CODEPE)                                                 
     C                   IF        S5TPE4 = '2'                                                     
     C                   EVAL      ZXLOGE = 'TRA'                                                   
     C                   ELSE                                                                       
     C                   EVAL      ZXLOGE = S5LOGE                                                  
     C                   ENDIF                                                                      
      * Busco la logística en la serie                                                              
     C                   EVAL      ZW=1                                                             
     C     ZXLOGE        LOOKUP    SLOGISTI(ZW)                           81                        
      * Si no existe grabo logística en la serie                                                    
     C                   IF        CHAIN=*OFF                                                       
     C                   EVAL      ZW=1                                                             
     C     *BLANKS       LOOKUP    SLOGISTI(ZW)                           81                        
     C                   MOVEL     ZXLOGE        SLOGISTI(ZW)                                       
     C                   ENDIF                                                                      
                                                                                                    
     C     KCODEPE       READE(N)  CODEPE                                                           
     C                   ENDDO                                                                      
                                                                                                    
      * Puntos de expedición                                                                        
     C                   EVAL      ZW=1                                                             
     C     *BLANKS       LOOKUP    SLOGISTI(ZW)                           81                        
     C                   IF        ZW>1                                                             
     C                   EVAL      ZW=ZW-1                                                          
     C                   ENDIF                                                                      
                                                                                                    
      * Si los Puntos de Expedición superan la parametrización                                      
      *  cambio todo lo que no sea Entrega Directa a Delegación Propia                              
     C                   IF        ZW > T3PEXP                                                      
      * Logística asociada a la delegación                                                          
     C                   EVAL      P7CIAS=@PCIAS                                                    
     C                   EVAL      P7DLGA=@PDLGA                                                    
     C     KPMEMPR       CHAIN     PMEMPR                                                           
     C                   IF        %FOUND(PMEMPR)                                                   
      * Se define un solo punto de expedición tal como se define                                    
      * en el CR1686. Se define un punto de expedición y                                            
      * si no lo cumple el material se quedará en la logística                                      
      * de la delegación (o en su defecto en la forzada).                                           
     C                                                                                              
      * Leo Pedido en CODEPE                                                                        
     C                   EVAL      S5CIAS = @PCIAS                                                  
     C                   EVAL      S5DLGA = @PDLGA                                                  
     C                   EVAL      S5NPCO = @PNPCO                                                  
     C                   EVAL      S5TPED = @PTPED                                                  
     C                   EVAL      S5DATP = @PDATP                                                  
     C                   EVAL      S5NOPL = @PNOPL                                                  
     C     KCODEPE       SETLL     CODEPE                                                           
     C     KCODEPE       READE     CODEPE                                                           
     C                   DOW       NOT %EOF(CODEPE)                                                 
                                                                                                    
55138C                   EVAL      ZXSERV = *BLANKS                                                 
55138 * Comprobar si el artículo es de servicio                                                     
55138C                   EVAL      M5CIAS = S5CIAS                                                  
55138C                   EVAL      M5ARTI = S5ARTI                                                  
55138C                   EVAL      M5VARI = S5VARI                                                  
55138C                   EVAL      M5MODE = S5MODE                                                  
55138C     KMSARTI00     CHAIN     MSARTI00                                                         
55138C                   IF        %FOUND(MSARTI00)                                                 
55138C                   EVAL      PECIAS = S5CIAS                                                  
55138C                   EVAL      PECTAB = 'TIPG'                                                  
55138C                   EVAL      PECLTA = *BLANKS                                                 
55138C                   EVAL      PECLTA = M5TIPG                                                  
55138C     KPMTABD       CHAIN     PMTABD                                                           
55138C                   IF        %FOUND(PMTABD)                                                   
55138C                   EVAL      ZXSERV = PEBL61                                                  
55138C                   ELSE                                                                       
55138C                   EVAL      ZXSERV = *BLANKS                                                 
55138C                   ENDIF                                                                      
55138C                   ENDIF                                                                      
55138 * Solo trata artículos que NO son de servicio                                                 
55138C                   IF        ZXSERV <> '1'                                                    
                                                                                                    
     C                   SELECT                                                                     
      * + 1 PUNTO EXPEDICIÓN                                                                        
     C                   WHEN      T3PEXP>1                                                         
     C                   IF        S5TPE4 <> '2' And S5LOGE <> P7LOGS                               
     C                   IF        T2LOGI = P7LOGS                                                  
     C                   EVAL      T2LOGU = *BLANKS                                                 
     C                   ELSE                                                                       
     C                   EVAL      T2LOGU = P7LOGS                                                  
     C                   ENDIF                                                                      
     C                   EVAL      S5LOGE = P7LOGS                                                  
     C                   IF        T3OPL1<>*BLANKS                                                  
     C                   EVAL      S5LOGE=T3OPL1                                                    
     C                   ELSE                                                                       
     C                   EVAL      S5LOGE=P7LOGS                                                    
     C                   ENDIF                                                                      
     C*                  UPDATE    RCODEPE                                                          
     C                   ENDIF                                                                      
      *   1 PUNTO EXPEDICIÓN                                                                        
     C                   WHEN      T3PEXP=1                                                         
     C                   IF        T3OPL1<>*BLANKS                                                  
     C                   EVAL      S5LOGE=T3OPL1                                                    
     C                   ELSE                                                                       
     C                   EVAL      S5LOGE=P7LOGS                                                    
     C                   ENDIF                                                                      
     C     KCODEPE0      CHAIN     ED0050W                                                          
     C                   EVAL      T2LOGU = S5LOGE                                                  
     C                   EVAL      T2ENTD= 0                                                        
     C                   EVAL      T2FORZ= 0                                                        
     C                   UPDATE    RED0050W                                                         
     C                   EVAL      S5TPE4= ' '                                                      
     C*                  UPDATE    RCODEPE                                                          
     C                   ENDSL                                                                      
55138C                   ENDIF                                                                      
     C     KCODEPE       READE     CODEPE                                                           
     C                   ENDDO                                                                      
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Recuperar Compañía de MOVEX                                                                 
      **********************************************************************                        
     C     CS_CIASMVX    BEGSR                                                                      
                                                                                                    
      *          Establecer Entorno de Trabajo Movex                                                
     C                   MOVEL     ZXCIAD        @PEDIVI                                            
     C                   CALL      'GX0150'                                                         
     C                   PARM                    @PEDIVI                                            
     C                   PARM      SDSUSR        @PEUSER                                            
     C                   PARM      *BLANKS       @PEVAL                                             
     C                   EVAL      ZXVAL=@PEVAL                                                     
                                                                                                    
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Recuperar Biblioteca de Movex                                                               
      **********************************************************************                        
     C     CS_MVXLIBL    BEGSR                                                                      
                                                                                                    
     C                   EVAL      LIBLMVX = *BLANKS                                                
                                                                                                    
     C                   SELECT                                                                     
     C                   WHEN      %SUBST(PPBIBL:1:7) = 'MVXJDTA'                                   
     C                             Or %SUBST(PPBIBL:1:5) = 'M3EDB'                                  
     C                   EVAL      LIBLMVX = PPBIBL                                                 
     C                   WHEN      %SUBST(PPBIB1:1:7) = 'MVXJDTA'                                   
     C                             Or %SUBST(PPBIB1:1:5) = 'M3EDB'                                  
     C                   EVAL      LIBLMVX = PPBIB1                                                 
     C                   WHEN      %SUBST(PPBIB2:1:7) = 'MVXJDTA'                                   
     C                             Or %SUBST(PPBIB2:1:5) = 'M3EDB'                                  
     C                   EVAL      LIBLMVX = PPBIB2                                                 
     C                   WHEN      %SUBST(PPBIB3:1:7) = 'MVXJDTA'                                   
     C                             Or %SUBST(PPBIB3:1:5) = 'M3EDB'                                  
     C                   EVAL      LIBLMVX = PPBIB3                                                 
     C                   WHEN      %SUBST(PPBIB4:1:7) = 'MVXJDTA'                                   
     C                             Or %SUBST(PPBIB4:1:5) = 'M3EDB'                                  
     C                   EVAL      LIBLMVX = PPBIB4                                                 
     C                   WHEN      %SUBST(PPBIB5:1:7) = 'MVXJDTA'                                   
     C                             Or %SUBST(PPBIB5:1:5) = 'M3EDB'                                  
     C                   EVAL      LIBLMVX = PPBIB5                                                 
     C                   WHEN      %SUBST(PPBIB6:1:7) = 'MVXJDTA'                                   
     C                             Or %SUBST(PPBIB6:1:5) = 'M3EDB'                                  
     C                   EVAL      LIBLMVX = PPBIB6                                                 
     C                   WHEN      %SUBST(PPBIB7:1:7) = 'MVXJDTA'                                   
     C                             Or %SUBST(PPBIB7:1:5) = 'M3EDB'                                  
     C                   EVAL      LIBLMVX = PPBIB7                                                 
     C                   WHEN      %SUBST(PPBIB8:1:7) = 'MVXJDTA'                                   
     C                             Or %SUBST(PPBIB8:1:5) = 'M3EDB'                                  
     C                   EVAL      LIBLMVX = PPBIB8                                                 
     C                   WHEN      %SUBST(PPBIB9:1:7) = 'MVXJDTA'                                   
     C                             Or %SUBST(PPBIB9:1:5) = 'M3EDB'                                  
     C                   EVAL      LIBLMVX = PPBIB9                                                 
     C                   WHEN      %SUBST(PPBI10:1:7) = 'MVXJDTA'                                   
     C                             Or %SUBST(PPBI10:1:5) = 'M3EDB'                                  
     C                   EVAL      LIBLMVX = PPBI10                                                 
     C                   WHEN      %SUBST(PPBI11:1:7) = 'MVXJDTA'                                   
     C                             Or %SUBST(PPBI11:1:5) = 'M3EDB'                                  
     C                   EVAL      LIBLMVX = PPBI11                                                 
     C                   WHEN      %SUBST(PPBI12:1:7) = 'MVXJDTA'                                   
     C                             Or %SUBST(PPBI12:1:5) = 'M3EDB'                                  
     C                   EVAL      LIBLMVX = PPBI12                                                 
     C                   WHEN      %SUBST(PPBI13:1:7) = 'MVXJDTA'                                   
     C                             Or %SUBST(PPBI13:1:5) = 'M3EDB'                                  
     C                   EVAL      LIBLMVX = PPBI13                                                 
     C                   WHEN      %SUBST(PPBI14:1:7) = 'MVXJDTA'                                   
     C                             Or %SUBST(PPBI14:1:5) = 'M3EDB'                                  
     C                   EVAL      LIBLMVX = PPBI14                                                 
     C                   WHEN      %SUBST(PPBI15:1:7) = 'MVXJDTA'                                   
     C                             Or %SUBST(PPBI15:1:5) = 'M3EDB'                                  
     C                   EVAL      LIBLMVX = PPBI15                                                 
     C                   WHEN      %SUBST(PPBI16:1:7) = 'MVXJDTA'                                   
     C                             Or %SUBST(PPBI16:1:5) = 'M3EDB'                                  
     C                   EVAL      LIBLMVX = PPBI16                                                 
     C                   WHEN      %SUBST(PPBI17:1:7) = 'MVXJDTA'                                   
     C                             Or %SUBST(PPBI17:1:5) = 'M3EDB'                                  
     C                   EVAL      LIBLMVX = PPBI17                                                 
     C                   WHEN      %SUBST(PPBI18:1:7) = 'MVXJDTA'                                   
     C                             Or %SUBST(PPBI18:1:5) = 'M3EDB'                                  
     C                   EVAL      LIBLMVX = PPBI18                                                 
     C                   WHEN      %SUBST(PPBI19:1:7) = 'MVXJDTA'                                   
     C                             Or %SUBST(PPBI19:1:5) = 'M3EDB'                                  
     C                   EVAL      LIBLMVX = PPBI19                                                 
     C                   WHEN      %SUBST(PPBI20:1:7) = 'MVXJDTA'                                   
     C                             Or %SUBST(PPBI20:1:5) = 'M3EDB'                                  
     C                   EVAL      LIBLMVX = PPBI20                                                 
     C                   WHEN      %SUBST(PPBI21:1:7) = 'MVXJDTA'                                   
     C                             Or %SUBST(PPBI21:1:5) = 'M3EDB'                                  
     C                   EVAL      LIBLMVX = PPBI21                                                 
     C                   WHEN      %SUBST(PPBI22:1:7) = 'MVXJDTA'                                   
     C                             Or %SUBST(PPBI22:1:5) = 'M3EDB'                                  
     C                   EVAL      LIBLMVX = PPBI22                                                 
     C                   WHEN      %SUBST(PPBI23:1:7) = 'MVXJDTA'                                   
     C                             Or %SUBST(PPBI23:1:5) = 'M3EDB'                                  
     C                   EVAL      LIBLMVX = PPBI23                                                 
     C                   WHEN      %SUBST(PPBI24:1:7) = 'MVXJDTA'                                   
     C                             Or %SUBST(PPBI24:1:5) = 'M3EDB'                                  
     C                   EVAL      LIBLMVX = PPBI24                                                 
     C                   WHEN      %SUBST(PPBI25:1:7) = 'MVXJDTA'                                   
     C                             Or %SUBST(PPBI25:1:5) = 'M3EDB'                                  
     C                   EVAL      LIBLMVX = PPBI25                                                 
     C                   OTHER                                                                      
     C                   EVAL      LIBLMVX = 'MVXJDTA'                                              
     C                   ENDSL                                                                      
                                                                                                    
     C                   EVAL      LIBLAQA = *BLANKS                                                
                                                                                                    
     C                   SELECT                                                                     
     C                   WHEN      %SUBST(PPBIBL:1:5) = 'M3AQA'                                     
     C                   EVAL      LIBLAQA = PPBIBL                                                 
     C                   WHEN      %SUBST(PPBIB1:1:5) = 'M3AQA'                                     
     C                   EVAL      LIBLAQA = PPBIB1                                                 
     C                   WHEN      %SUBST(PPBIB2:1:5) = 'M3AQA'                                     
     C                   EVAL      LIBLAQA = PPBIB2                                                 
     C                   WHEN      %SUBST(PPBIB3:1:5) = 'M3AQA'                                     
     C                   EVAL      LIBLAQA = PPBIB3                                                 
     C                   WHEN      %SUBST(PPBIB4:1:5) = 'M3AQA'                                     
     C                   EVAL      LIBLAQA = PPBIB4                                                 
     C                   WHEN      %SUBST(PPBIB5:1:5) = 'M3AQA'                                     
     C                   EVAL      LIBLAQA = PPBIB5                                                 
     C                   WHEN      %SUBST(PPBIB6:1:5) = 'M3AQA'                                     
     C                   EVAL      LIBLAQA = PPBIB6                                                 
     C                   WHEN      %SUBST(PPBIB7:1:5) = 'M3AQA'                                     
     C                   EVAL      LIBLAQA = PPBIB7                                                 
     C                   WHEN      %SUBST(PPBIB8:1:5) = 'M3AQA'                                     
     C                   EVAL      LIBLAQA = PPBIB8                                                 
     C                   WHEN      %SUBST(PPBIB9:1:5) = 'M3AQA'                                     
     C                   EVAL      LIBLAQA = PPBIB9                                                 
     C                   WHEN      %SUBST(PPBI10:1:5) = 'M3AQA'                                     
     C                   EVAL      LIBLAQA = PPBI10                                                 
     C                   WHEN      %SUBST(PPBI11:1:5) = 'M3AQA'                                     
     C                   EVAL      LIBLAQA = PPBI11                                                 
     C                   WHEN      %SUBST(PPBI12:1:5) = 'M3AQA'                                     
     C                   EVAL      LIBLAQA = PPBI12                                                 
     C                   WHEN      %SUBST(PPBI13:1:5) = 'M3AQA'                                     
     C                   EVAL      LIBLAQA = PPBI13                                                 
     C                   WHEN      %SUBST(PPBI14:1:5) = 'M3AQA'                                     
     C                   EVAL      LIBLAQA = PPBI14                                                 
     C                   WHEN      %SUBST(PPBI15:1:5) = 'M3AQA'                                     
     C                   EVAL      LIBLAQA = PPBI15                                                 
     C                   WHEN      %SUBST(PPBI16:1:5) = 'M3AQA'                                     
     C                   EVAL      LIBLAQA = PPBI16                                                 
     C                   WHEN      %SUBST(PPBI17:1:5) = 'M3AQA'                                     
     C                   EVAL      LIBLAQA = PPBI17                                                 
     C                   WHEN      %SUBST(PPBI18:1:5) = 'M3AQA'                                     
     C                   EVAL      LIBLAQA = PPBI18                                                 
     C                   WHEN      %SUBST(PPBI19:1:5) = 'M3AQA'                                     
     C                   EVAL      LIBLAQA = PPBI19                                                 
     C                   WHEN      %SUBST(PPBI20:1:5) = 'M3AQA'                                     
     C                   EVAL      LIBLAQA = PPBI20                                                 
     C                   WHEN      %SUBST(PPBI21:1:5) = 'M3AQA'                                     
     C                   EVAL      LIBLAQA = PPBI21                                                 
     C                   WHEN      %SUBST(PPBI22:1:5) = 'M3AQA'                                     
     C                   EVAL      LIBLAQA = PPBI22                                                 
     C                   WHEN      %SUBST(PPBI23:1:5) = 'M3AQA'                                     
     C                   EVAL      LIBLAQA = PPBI23                                                 
     C                   WHEN      %SUBST(PPBI24:1:5) = 'M3AQA'                                     
     C                   EVAL      LIBLAQA = PPBI24                                                 
     C                   WHEN      %SUBST(PPBI25:1:5) = 'M3AQA'                                     
     C                   EVAL      LIBLAQA = PPBI25                                                 
     C                   OTHER                                                                      
     C                   EVAL      LIBLAQA = 'MVXJDTA'                                              
     C                   ENDSL                                                                      
      *                                                                                             
     C                   ENDSR                                                                      
                                                                                                    
      **************************************************************************                    
      * SUBRUTINA COMPROBAR SI HAY QUE CAMBIAR LOGÍSTICA DE ENTREGA            *                    
      *------------------------------------------------------------------------*                    
     C     CS_CHKLOGE    BEGSR                                                                      
     C                   EVAL      S0CIAS = @PCIAS                                                  
     C                   EVAL      S0DLGA = @PDLGA                                                  
     C                   EVAL      S0NPCO = @PNPCO                                                  
     C                   EVAL      S0TPED = @PTPED                                                  
     C                   EVAL      S0DATP = @PDATP                                                  
     C                   EVAL      S0NOPL = @PNOPL                                                  
     C     KCOCAPE       CHAIN     COCAPE                                                           
     C                   IF        %FOUND(COCAPE)                                                   
     C                   IF        S0EDLG='1'                                                       
     C                   EXSR      CS_CHGLOGE                                                       
     C                   ELSE                                                                       
     C                   IF        S0MOST<>'1'                                                      
     C                   EVAL      P7CIAS=S0CIAS                                                    
     C                   EVAL      P7DLGA=S0DLGA                                                    
     C     KPMEMPR       CHAIN     PMEMPR                                                           
     C                   IF        %FOUND(PMEMPR) AND P7AUTS<>*BLANKS                               
     C*                  IF        %FOUND(PMEMPR)                                                   
     C                   EXSR      CS_CHGLOGE                                                       
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
     C                   ENDSR                                                                      
      **************************************************************************                    
      * SUBRUTINA CAMBIAR LOGÍSTICA DE ENTREGA                                 *                    
      *------------------------------------------------------------------------*                    
     C     CS_CHGLOGE    BEGSR                                                                      
     C                   EVAL      S5CIAS=S0CIAS                                                    
     C                   EVAL      S5DLGA=S0DLGA                                                    
     C                   EVAL      S5NPCO=S0NPCO                                                    
     C                   EVAL      S5TPED=S0TPED                                                    
     C                   EVAL      S5DATP=S0DATP                                                    
     C                   EVAL      S5NOPL=S0NOPL                                                    
     C     KCODEPE       SETLL     CODEPE                                                           
     C     KCODEPE       READE     CODEPE                                                           
     C                   DOW       NOT %EOF(CODEPE)                                                 
      *                                                                                             
     c                   if            s5lb2b = *blanks                                             
     c                              or s5tped <> '25'                                               
      *                                                                                             
     C                   EVAL      M0CIAS=S5CIAS                                                    
     C                   EVAL      M0LOGE=S5LOGE                                                    
     C     KMSALMA05     CHAIN     MSALMA05                                                         
     C                   IF        %FOUND(MSALMA05)                                                 
     C                             AND (M0TAL1<>'7' OR M0TAL1<>'8')                                 
     C                   EVAL      T3CIAS=M0CIAS                                                    
     C                   EVAL      T3DLGA=M0DLGA                                                    
     C     KEDPARM       CHAIN     EDPARM                                                           
     C                   IF        %FOUND(EDPARM) AND T3OPL1<>*BLANKS AND                           
     C                             T3OPL1<>S5LOGE                                                   
     C                             AND S5LOGE<>T3LVIR                                               
     C                   EXSR      CS_UT2725                                                        
     C                   EVAL      S5LOGE=T3OPL1                                                    
     C**                 UPDATE    RCODEPE                                                          
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
      *                                                                                             
     c                   endif                                                                      
      *                                                                                             
     C     KCODEPE       READE     CODEPE                                                           
     C                   ENDDO                                                                      
     C                   ENDSR                                                                      
      **************************************************************                                
      * FICHERO AUDITORIA                                          *                                
      *------------------------------------------------------------*                                
     C     CS_UT2725     BEGSR                                                                      
      *                                                                                             
     C                   EVAL      @PECIAS=S5CIAS                                                   
     C                   EVAL      @PEDLGA=S5DLGA                                                   
     C                   EVAL      @PENPCO=S5NPCO                                                   
     C                   EVAL      @PETPED=S5TPED                                                   
     C                   EVAL      @PEDATP=S5DATP                                                   
     C                   EVAL      @PENOPL=S5NOPL                                                   
     C                   EVAL      @PELINE=S5LINE                                                   
     C                   EVAL      @PEFILD='S5LOGE'                                                 
     C                   EVAL      @PECAUD='CO51'                                                   
     C                   EVAL      @PEVAL1=S5LOGE                                                   
     C                   EVAL      @PEVAL2=T3OPL1                                                   
     C                   EVAL      @PECLPR=S5CUST                                                   
     C                   EVAL      @PEFILE='CODEPE'                                                 
      *                                                                                             
     C                   CALL      'UT2725'                             55                          
     C                   PARM                    @PECIAS                                            
     C                   PARM                    @PEDLGA                                            
     C                   PARM                    @PENPCO                                            
     C                   PARM                    @PETPED                                            
     C                   PARM                    @PEDATP                                            
     C                   PARM                    @PENOPL                                            
     C                   PARM                    @PELINE                                            
     C                   PARM                    @PECLPR                                            
     C                   PARM                    @PEFILE                                            
     C                   PARM                    @PEFILD                                            
     C                   PARM                    @PECAUD                                            
     C                   PARM                    @PEVAL1                                            
     C                   PARM                    @PEVAL2                                            
     C                   PARM      *BLANKS       @PEACCI                                            
     C                   PARM      *BLANKS       @PEERR                                             
     C                   PARM      SDSPGM        @PEPGMO                                            
     C                   PARM      *BLANKS       @PEARVM                                            
      *                                                                                             
     C                   ENDSR                                                                      
      **********************************************************************                        
      * Comprobar Stock Artículos "B"                                                               
      **********************************************************************                        
     C     CS_VFYARTB    BEGSR                                                                      
      *                                                                                             
     c                   eval      zycant = 1                                                       
     c                   eval      m5cias = s5cias                                                  
     c                   movel     @pcias        ppcias                                             
      *                                                                                             
      * Miramos si es Conjunto de Venta                                                             
     c                   eval      FileCojc_erp= 'PURLIBF' + ppcias +                               
     c                                          '/MSCOJC'                                           
     c                   open(e)   MSCOJC                                                           
     c                   if        not %error                                                       
     c                   eval      ndcias = s5cias                                                  
     c                   eval      ndarti = s5arti                                                  
     c                   eval      ndvari = s5vari                                                  
     c                   eval      ndmode = s5mode                                                  
     c                   eval      ndtcoj = '4'                                                     
     c     kmscojc       chain     MSCOJC                                                           
     c                   if        %found and ndbaja < '1'                                          
     c                   close(e)  MSCOJC                                                           
     c                   LEAVESR                                                                    
     c                   endif                                                                      
     c                   close(e)  MSCOJC                                                           
      *                                                                                             
      * Logística asociada a la delegación                                                          
     c                   eval      micias = p7cias                                                  
     c                   eval      midlga = p7dlga                                                  
     c                   eval      milgca = p7logs                                                  
     c     kmsload       chain     MSLOAD                                                           
     c     kmsload       chain     MSLOGI                                                           
     c                   if        %found(MSLOAD) and %found(MSLOGI)                                
     c                   eval      m0cias = s0cias                                                  
     c                   eval      m0loge = p7logs                                                  
     c     kmsalma05     chain     MSALMA05                                                         
     c                   if        %found                                                           
      * Busco su Categoría de Rotación                                                              
     c                   eval      m1cias = s5cias                                                  
     c                   eval      m1arti = s5arti                                                  
     c                   eval      m1vari = s5vari                                                  
     c                   eval      m1mode = s5mode                                                  
     c                   eval      m1maga = m0maga                                                  
     c     kmsstok       chain     MSSTOK                                                           
     c                   if        %found and m1crot = 'B'                                          
      * Busco Stock en el Almacén de la logística                                                   
     c                   eval      m1cias = s5cias                                                  
     c                   eval      m1arti = s5arti                                                  
     c                   eval      m1vari = s5vari                                                  
     c                   eval      m1mode = s5mode                                                  
     c                   eval      m1maga = m0maga                                                  
     c                   eval      m1cali = 'A'                                                     
     c     kmssto010     chain     MSSTO01                                                          
     c                   if        %found                                                           
                                                                                                    
     c                   eval      zystdd  = *zero                                                  
     c                   eval      zystka  = *zero                                                  
     c                   eval      zycans0 = *zero                                                  
     c                   eval      zycane0 = *zero                                                  
     c                   eval      zydepo0 = *zero                                                  
     c                   eval      z1cant = s5cant - s5canr - s5cans                                
                                                                                                    
      * Solo tratamos si el almacén tiene stock                                                     
     c                   if        m1sact > *zero                                                   
     c                   eval      zystka = m1sact                                                  
      * Busqueda cantidades de stock pdte servir,fabricar,deposito...                               
     c                   exsr      cs_Rtv_Stk                                                       
      * Stock disponible                                                                            
     c                   eval      zystdd = zystka - zycans0 - zycane0                              
     c                   if        zydepo0 > *zero                                                  
     c                   eval      zystdd = zystdd - zydepo0                                        
     c                   endif                                                                      
     c                   eval      t2dart = s5arti + s5vari + s5mode                                
     c                   eval      t2dcan = z1cant                                                  
     c                   eval      t2ddis = zystdd                                                  
     c                   eval      t2dalm = m1maga                                                  
      * Si stock disponible es mayor o igual a cantidad pedido                                      
     c                   if        zystdd >= z1cant                                                 
     c                   eval      t2va14 = 1                                                       
     c                   endif                                                                      
     c                   endif                                                                      
     c                   endif                                                                      
     c                   endif                                                                      
     c                   endif                                                                      
     c                   endif                                                                      
     c                   endif                                                                      
      *                                                                                             
     c                   ENDSR                                                                      
      **********************************************************************                        
      *  Busqueda cantidades de stock pdte servir,fabricar,deposito...                              
      **********************************************************************                        
     C     cs_Rtv_Stk    BEGSR                                                                      
                                                                                                    
     C                   EVAL      @PEDATD=*DATE                                                    
     C                   EVAL      @PEDATH=*DATE                                                    
     C                   MOVE      @PEDATD       ZXDATD                                             
     C                   MOVE      @PEDATH       ZXDATH                                             
     C                   SUBDUR    1000  :*D     ZXDATD                                             
     C                   ADDDUR    1000  :*D     ZXDATH                                             
     C                   MOVE      ZXDATD        @PEDATD                                            
     C                   MOVE      ZXDATH        @PEDATH                                            
                                                                                                    
     C                   EVAL      @PECIAS=M1CIAS                                                   
     C                   EVAL      @PEARTI=M1ARTI                                                   
     C                   EVAL      @PEVARI=M1VARI                                                   
     C                   EVAL      @PEMODE=M1MODE                                                   
                                                                                                    
     C                   EVAL      M5CIAS=M1CIAS                                                    
     C                   EVAL      M5ARTI=M1ARTI                                                    
     C                   EVAL      M5VARI=M1VARI                                                    
     C                   EVAL      M5MODE=M1MODE                                                    
     C     KMSARTI00     CHAIN     MSARTI00                           81                            
                                                                                                    
      * Pendiente de servir                                                                         
     C                   EVAL      @PETISE=' '                                                      
     C                   CALL      'MM2600'                                                         
     C                   PARM                    @PECIAS                                            
     C                   PARM      ZZDLGA        @PEDLGA                                            
     C                   PARM                    @PEARTI                                            
     C                   PARM                    @PEVARI                                            
     C                   PARM                    @PEMODE                                            
     C                   PARM                    @PETCOJ                                            
     C                   PARM                    @PEDATD                                            
     C                   PARM                    @PEDATH                                            
     C                   PARM                    @PECUST                                            
     C                   PARM      0             @PECANT                                            
     C                   PARM      0             @PECAN1                                            
     C                   PARM                    M1MAGA                                             
     C                   PARM                    @PETISE           4                                
     C                   PARM      '1'           @PERRO            1                                
     C                   EVAL      zycans0 = @PECANT * zycant                                       
                                                                                                    
      * Pendiente de traspasos depositos                                                            
     C                   EVAL      @PETISE=' '                                                      
     C                   CALL      'MM2604'                                                         
     C                   PARM                    @PECIAS                                            
     C                   PARM      ZZDLGA        @PEDLGA                                            
     C                   PARM                    @PEARTI                                            
     C                   PARM                    @PEVARI                                            
     C                   PARM                    @PEMODE                                            
     C                   PARM                    @PETCOJ                                            
     C                   PARM                    @PEDATD                                            
     C                   PARM                    @PEDATH                                            
     C                   PARM      0             @PECANT                                            
     C                   PARM      0             @PECAN1                                            
     C                   PARM                    M1MAGA                                             
     C                   PARM                    @PETISE           4                                
     C                   PARM      *BLANKS       @PERRO            1                                
     C                   EVAL      zydepo0 = @PECANT * zycant                                       
                                                                                                    
      * Esto solo para empresas que utilizan nuestra produccion                                     
     c                   eval      @PECAN1=0                                                        
     c                   eval      @PECAN2=0                                                        
     c                   IF        ZZTCIA='1' OR ZZTCIA='2'                                         
     c                   EVAL      @PEDATD=*DATE                                                    
     c                   EVAL      @PEDATH=*DATE                                                    
     c                   MOVE      @PEDATD       ZXDATD                                             
     c                   MOVE      @PEDATH       ZXDATH                                             
     c                   SUBDUR    1000  :*D     ZXDATD                                             
     c                   ADDDUR    1000  :*D     ZXDATH                                             
     c                   MOVE      ZXDATD        @PEDATD                                            
     c                   MOVE      ZXDATH        @PEDATH                                            
      * Solo realizaré la búsqueda en artículos susceptibles de ser utilizados en                   
      * es decir, que sean estructuras o componentes.                                               
     c     KMSARTI00     CHAIN     PMCAOR01                           81                            
     c                   IF        CHAIN=*ON                                                        
     c     KMSARTI00     CHAIN     PMCAOR08                           81                            
     c                   ENDIF                                                                      
                                                                                                    
      * Búsqueda de las necesidades a tener en cuenta en OF's                                       
     C                   EVAL      @PECAN1=0                                                        
     C                   EVAL      @PECAN2=0                                                        
     C     KMSARTI00     CHAIN     PMDEOR05                           81                            
     C                   IF        CHAIN=*OFF                                                       
      * Si MÑSNCC>='1', entonces (DOLL) se desea que se presente el                                 
      * material asignado                                                                           
     C                   EVAL      @PERRO=*BLANKS                                                   
     C                   CALL      'MM2602'                                                         
     C                   PARM                    @PECIAS                                            
     C                   PARM                    @PEARTI                                            
     C                   PARM                    @PEVARI                                            
     C                   PARM                    @PEMODE                                            
     C                   PARM                    @PEDATD                                            
     C                   PARM                    @PEDATH                                            
     C                   PARM      0             @PECAN1                                            
     C                   PARM      0             @PECAN2                                            
     C                   PARM                    M1MAGA                                             
     C                   PARM                    M5MAGD                                             
     C                   PARM                    @PERRO                                             
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
     C                   EVAL      zycane0 = @PECAN2 * zycant                                       
                                                                                                    
     C                   ENDSR                                                                      
      ******************************************************************                            
      * MIRAMOS SI EL PEDIDO ES POOLWEB Y RECUPERAMOS EL PROVEEDOR                                  
      **********************************************************************                        
     C*    CS_POOLWEB    BEGSR                                                                      
      *                                                                                             
     C*                  eval      zxpweb='0'                                                       
      *                                                                                             
      * Para saber si es un proveedor Poolweb,lo buscamos en la tabla                               
      * PWEB con la procedencia del pedido.                                                         
     C*                  eval      pecias=@pcias                                                    
     C*                  eval      pectab='PWEB'                                                    
     C*                  eval      peclta=s0pped                                                    
     C*    kpmtabd       chain     pmtabd                                                           
      *                                                                                             
     C*                  if        %found(pmtabd)                                                   
     C*                  eval      zxpweb='1'                                                       
     C*                  endif                                                                      
      *                                                                                             
     C*                  ENDSR                                                                      
      **************************************************************                                
      * GUARDA LOGISTICA DEL OL                                    *                                
      *------------------------------------------------------------*                                
     C     CS_LOGOL      BEGSR                                                                      
      *                                                                                             
                  i2ol = *zero;                                                                     
                  open msalma08;                                                                    
                  setll (@PCIAS:'8') msalma08;                                                      
                  reade (@PCIAS:'8') msalma08;                                                      
                  dow not %eof(msalma08);                                                           
                    if m0tal1 = '8' and m0baja <> '1' and                                           
                        i2OL < %elem(T_logol) ;                                                     
                      i2OL += 1;                                                                    
                      T_logol(i2OL) = m0logs;                                                       
                    endif;                                                                          
                    reade (@PCIAS:'8') msalma08;                                                    
                  enddo;                                                                            
                  close msalma08;                                                                   
      *                                                                                             
     C                   ENDSR                                                                      
      **************************************************************                                
      * RECALCULAR LOGISTICA VIRTUAL                               *                                
      *------------------------------------------------------------*                                
      *                                                                                             
     C     LOG_VIRTUAL   BEGSR                                                                      
      *                                                                                             
      * Obtener logística virtual                                                                   
      *                                                                                             
     C                   CALL      'MM1411'                                                         
     C                   PARM                    s5CIAS                                             
     C                   PARM      S5LOGE        @PALMA                                             
     C                   PARM      '1'           @PTIPO                                             
     C                   PARM                    s5DLGA                                             
     C                   PARM      *blanks       @PRESP                                             
      *                                                                                             
     C                   IF        @PRESP <> *BLANKS                                                
     C                   EVAL      M0MAGA = @PRESP                                                  
     C                   ENDIF                                                                      
     C                   ENDSR                                                                      
      *                                                                                             
      ******************************************************************                            
      *   Recuperar almacén a partir de la logística del pedido venta                               
      **********************************************************************                        
     C     SRrecu        BEGSR                                                                      
     C                                                                                              
     C                   EVAL      M5CIAS = S5CIAS                                                  
     C                   EVAL      M1MAGA = @PRESP                                                  
     C                   EVAL      M1ARTI = S5ARTI                                                  
     C                   EVAL      M1VARI = S5VARI                                                  
     C                   EVAL      M1MODE = S5MODE                                                  
      *                                                                                             
     c     KMSSTOK       CHAIN     MSSTOK                             90                            
     C                   IF        %FOUND                                                           
     C                   IF        m1prvr <> *blanks                                                
     C                   movel     M1PRVR        ZXPRV                                              
     C                   ENDIF                                                  ECSTK <= *ZEROS     
     C                   ENDIF                                                  ECSTK <= *ZEROS     
      *                                                                                             
     C                   ENDSR                                                                      
      ******************************************************************************************    
      * OBTENER PLANTA PARA ACCEDER A DATOS DEL ARTÍCULO                                            
      ******************************************************************************************    
      *                                                                                             
     P GET_FACI        B                                                                            
     D GET_FACI        PI                  LIKE(MMCIAS)                                             
     D   @DIVI                             LIKE(MMPROP) VALUE                                       
     D   @FACI                             LIKE(MMCIAS) VALUE                                       
     D   @ITNO                             LIKE(MMITNO) VALUE                                       
      *                                                                                             
     C                   IF        ZXMULTIPLA                                                       
      *                                                                                             
      * Si existe registro en ZAQITN en el que la división es propietaria, entonces                 
      * se devuelve la planta propietaria del artículo.                                             
      *                                                                                             
     C                   EVAL      MMITNO = @ITNO                                                   
     C     KZAQITN00     CHAIN     ZAQITN00                                                         
     C                   IF        %FOUND  AND  MMPROP = @DIVI  AND                                 
     C                             MMCIAS <> *BLANKS                                                
     C                   RETURN    MMCIAS                                                           
     C                   ENDIF                                                                      
      *                                                                                             
      * Si la división no es la propietaria, se hace bucle sobre la tabla FACP y                    
      * se devuelve la primera para la que exista MITFAC                                            
      *                                                                                             
     C                   MOVEL(P)  MXCONO        M9CONO                                             
     C                   EVAL      M9ITNO = @ITNO                                                   
      *                                                                                             
     C                   EVAL      T1CTAB = 'FACP'                                                  
     C                   EVAL      T1DESC = @DIVI                                                   
     C     KGMTABD01     SETLL     GMTABD01                                                         
     C     KGMTABD01     READE     GMTABD01                                                         
      *                                                                                             
     C                   DOW       NOT %EOF                                                         
      *                                                                                             
     C                   EVAL      M9FACI = T1CELE                                                  
     C     KMITFAC00     SETLL     MITFAC00                                                         
     C                   IF        %EQUAL                                                           
     C                   RETURN    M9FACI                                                           
     C                   ENDIF                                                                      
      *                                                                                             
     C     KGMTABD01     READE     GMTABD01                                                         
     C                   ENDDO                                                                      
      *                                                                                             
     C                   ENDIF                                                                      
      *                                                                                             
      * Si la división no es multiplanta, o la búsqueda anterior no ha dado frutos,                 
      * devolver la planta entrada                                                                  
      *                                                                                             
     C                   RETURN    @FACI                                                            
      *                                                                                             
     P                 E                                                                            
