     ********************************************************************                          
     * FECHA: 20/06/2022                                        ITOM246 *                          
     * AUTOR: Manuel Alonso                                             *                          
     * DOCUMENTACIÓN: Cambio Forzado de Almacén de Salida               *                          
     ********************************************************************                          
E7218* FECHA: 10/01/2023                                                                           
E7218* AUTOR: MMontana                                                                             
E7218* DOCUMENTACIÓN: Informar lógistica en EnvVar antes de la llamada al ED0015                   
E7218******************************************************************************************    
E7263* FECHA: 10/02/2023                                                                           
E7263* AUTOR: MMontana                                                                             
E7263* DOCUMENTACIÓN: Corrección conversión GRAPH - CHAR temporal                                  
E7263******************************************************************************************    
E7351* FECHA: 06/03/2023                                                                           
E7351* AUTOR: MMontana                                                                             
E7351* DOCUMENTACIÓN: afegim valor en condició, variable s5stul                                    
E7351******************************************************************************************    
E7391* DATA DE MODIFICACIÓ: 03/04/2023  MARCA: E7391                                               
E7391* AUTOR:        MMontana                                                                      
E7391* DOCUMENTACIÓ: Modificar validació del status de l'article/magatzem en M3 contra MITBAL      
E7391*  enlloc de MITMAS. Es modifiquen els procediments ErrExisteArt i ErrExisteArt2              
E7391*  Correccions amb el codi del proveïdor                                                      
E7391*  Tota la codificació s'ha realitzat en format RPG de 1994                                   
E7391* RPG IV, a.k.a. RPGLE was released in 1994 as part of the V3R2 release of OS/400             
E7391******************************************************************************************    
                                                                                                    
     H DatEdit(*YMD/)                                                                               
     H Option(*NoDebugIO:*SrcStmt)                                                                  
     H DftActGrp(*No) ActGrp(*Caller)                                                               
                                                                                                    
     Fed3063fm  CF   E             WorkStn InfDS(SFlDS)                                             
     F                                     SFile(SufD:zxNRR00)                                      
     Fcocape    IF   E           K Disk                                                             
     Fcodepe    UF   E           K Disk                                                             
     Fcodepe01  IF   E           K Disk    Rename(rcodepe:rcodepe01)                                
     Fcodepe02  UF   E           K Disk    Rename(rcodepe:rcodepe02) Prefix(s)                      
     Fcodipe    IF   E           K Disk                                                             
     Fcoppec    IF   E           K Disk                                                             
E7391 *     Fmitmas00  IF   E           K Disk                                                      
E7391FMITBAL00  IF   E           K DISK                                                             
mod01  dcl-f msalma05 usage(*input) keyed rename(rmsalma:rmsalma05);                                
     Fmsalma    IF   E           K Disk                                                             
     Fmsarti    IF   E           K Disk                                                             
     Fmsarti00  IF   E           K Disk    Rename(rmsarti:rmsarti00) Prefix(m)                      
     Fmsarti10  IF   E           K Disk    Rename(rmsarti:rmsarti10) Prefix(m)                      
     F                                     UsrOpn ExtFile(File_MSARTI10)                            
     Fmscojc    IF   E           K Disk                                                             
     Fmscojd    IF   E           K Disk                                                             
     Fmslogi    IF   E           K Disk                                                             
     Fmsstok    IF   E           K Disk                                                             
     Fpmlibl    IF   E           K Disk                                                             
     Fpmempr    IF   E           K Disk                                                             
     Fpmtabd    IF   E           K Disk                                                             
     Fpuprov    IF   E           K Disk                                                             
     Fpuprp0    IF   E           K Disk                                                             
     Futcom0    IF   E           K Disk                                                             
     FEDTRLP00  IF   E           K DISK                                                             
                                                                                                    
      *                                                                                             
      * Estructura INFDS                                                                            
      *                                                                                             
     D                SDS                                                                           
     D  sdspgm                 1     10                                                             
     D    cccpgm                     10    Overlay(sdspgm)                                          
     D  sdsjob               244    253                                                             
     D    cccjob                     10    Overlay(sdsjob)                                          
     D  sdsusr               254    263                                                             
     D  sdsjnbr              264    269                                                             
      *                                                                                             
      * Área de datos de información de archivo                                                     
      *                                                                                             
     D  sflds          DS                                                                           
     D    sflpocur           370    371B 0                                                          
     D    sflpos1            378    379B 0                                                          
     D    sflrcd         *RECORD                                                                    
      *                                                                                             
      * Área de datos local                                                                         
      *                                                                                             
     D dsLDA         E DS                  ExtName(purLDAds)                                        
     D    cccdeem                    30    Overlay(zzdeem)                                          
      *                                                                                             
      * Indicadores                                                                                 
      *                                                                                             
     D  indicadors   E DS                  Based(indicadorp)                                        
     D                                     ExtName(indds:rind0199)                                  
     D     InPos01   E                     ExtFld(SetL01)                                           
     D     VldCmdKey E                     ExtFld(Wrk74)                                            
     D     RollDown  E                     ExtFld(Wrk77)                                            
     D  indicadorp     S               *   Inz(%AddR(*In))                                          
      *                                                                                             
      * Control de flujo                                                                            
      *                                                                                             
     D                 DS                                                                           
     D  zxOpt                  1      6    Inz('S01CLR')                                            
     D    zxOpt1               1      3                                                             
     D    zxOpt2               4      6                                                             
      *                                                                                             
      * Control coenvíos                                                                            
      *                                                                                             
     D  dsCtrlCoen     DS                  Dim(999) Qualified                                       
     D    Coenvio                     2                                                             
     D    Logistica                        Like(s5loge)                                             
     D    Tratar                      1                                                             
      *                                                                                             
      * Formatos subarchivo                                                                         
      *                                                                                             
     D                 DS                                                                           
     D  sufData                1     53                                                             
     D    s01Line              2      5                                                             
     D    s01Arti              7     21                                                             
     D    s01Vari             23     25                                                             
     D    s01Mode             27     29                                                             
     D    s02Arti              1     15                                                             
     D    s02Vari             17     19                                                             
     D    s02Mode             21     23                                                             
     D    s02Line             26     28                                                             
     D    sufCant             31     41                                                             
     D    sufUniM             43     44                                                             
     D    sufStuL             46     46                                                             
     D    sufLogE             51     53                                                             
      *                                                                                             
      * estructuras varias                                                                          
      *                                                                                             
     D  s0ampl         DS                                                                           
     D    s0coen               1      1                                                             
     D    s0etod              63     63                                                             
      *                                                                                             
     D  s5ampl         DS                                                                           
     D    s5ncoe               1      2                                                             
      *                                                                                             
     D  ss5ampl        DS                                                                           
     D    ss5ncoe              1      2                                                             
      *                                                                                             
     D  ss5amp2        DS                                                                           
     D    ss5disp             14     21                                                             
      *                                                                                             
     D  zxVal          DS                                                                           
     D    mxCono               1      3  0                                                          
     D    mxDivi               4      6                                                             
     D    mxResto              7    250                                                             
                                                                                                    
      *                                                                                             
      * Parámetros                                                                                  
      *                                                                                             
     D  @pCias         S                   Like(s5cias)                                             
     D  @pDlga         S                   Like(s5dlga)                                             
     D  @pNPCo         S                   Like(s5npco)                                             
     D  @pTPed         S                   Like(s5tped)                                             
     D  @pDatP         S                   Like(s5datp)                                             
     D  @pNoPl         S                   Like(s5nopl)                                             
     D  @pOpci         S              1                                                             
     D  @pErr          S              1                                                             
      *                                                                                             
     D  @peOpt         S              2                                                             
     D  @pePgm         S                   Like(sdsPgm)                                             
     D  @peFmt         S                   Like(Record)                                             
     D  @peFld         S                   Like(Field)                                              
     D  @peErr         S              1                                                             
      *                                                                                             
     D  @peCias        S                   Like(s5cias)                                             
     D  @peDlga        S                   Like(s5dlga)                                             
     D  @peNPCo        S                   Like(s5npco)                                             
     D  @peTPed        S                   Like(s5tped)                                             
     D  @peDatP        S                   Like(s5datp)                                             
     D  @peNoPl        S                   Like(s5nopl)                                             
     D  @peLine        S                   Like(s5line)                                             
     D  @peArti        S                   Like(s5arti)                                             
     D  @peVari        S                   Like(s5vari)                                             
     D  @peMode        S                   Like(s5mode)                                             
     D  @peTCoj        S                   Like(s5tcoj)                                             
     D  @peCant        S                   Like(s5cant)                                             
     D  @peUniM        S                   Like(s5unim)                                             
     D  @peCaSt        S                   Like(s5cant)                                             
     D  @peTcSt        S                   Like(s5tcst)                                             
     D  @peFrre        S                   Like(s5Frre)                                             
     D  @peDt1C        S                   Like(s5dt1c)                                             
     D  @peDt2C        S                   Like(s5dt2c)                                             
     D  @peDt3C        S                   Like(s5dt3c)                                             
     D  @peDt4C        S                   Like(s5dt4c)                                             
     D  @pePrcC        S                   Like(s5prcc)                                             
     D  @peCanC        S                   Like(s5canc)                                             
     D  @peCadC        S                   Like(s5cadc)                                             
     D  @peCauS        S              2                                                             
     D  @peLogE        S                   Like(s5loge)                                             
     D  @peArVM        S                   Like(c3arvp)                                             
     D  @peCom2        S                   Like(c3arvp)                                             
     D  @peCust        S                   Like(s0cust)                                             
     D  @peTDi1        S                   Like(s0tdi1)                                             
     D  @peEDAu        S              3                                                             
     D  @peLogi        S              1  0                                                          
     D  @peOrig        S              1  0                                                          
     D  @peInte        S              1  0                                                          
     D  @peInci        S              3                                                             
     D  @peTNPe        S              1                                                             
     D  @peNRes        S              1                                                             
     D  @peFDDS        S                   Like(s5frep)                                             
     D  @peTPla        S              1                                                             
     D  @peWeek        S              2  0                                                          
     D  @peTipP        S              2                                                             
     D  @peCAud        S              4                                                             
     D  @peFile        S                   Like(sdsPgm)                                             
     D  @peFild        S                   Like(sdsPgm)                                             
     D  @peVal1        S             50                                                             
     D  @peVal2        S             50                                                             
     D  @PeAcc2        S              2                                                             
     D  @pePgMo        S             10                                                             
     D  @peCia2        S                   Like(s5cias)                                             
     D  @peDlg2        S                   Like(s5dlga)                                             
     D  @peNPC2        S                   Like(s5npco)                                             
     D  @peTPe2        S                   Like(s5tped)                                             
     D  @peDat2        S                   Like(s5datp)                                             
     D  @peNoP2        S                   Like(s5nopl)                                             
     D  @peLin2        S                   Like(s5line)                                             
     D  @peErav        S              3                                                             
     D  @peText        S             50                                                             
     D  @peDato        S            300                                                             
     D  @peWAud        S              1  0                                                          
     D  @peJobT        S             18                                                             
     D  @peFin         S              1  0                                                          
     D  @peAlma        S                   Like(m0maga)                                             
     D  @peTipo        S              1                                                             
     D  @peInfo        S              1                                                             
     D  @peResp        S                   Like(m0maga)                                             
     D  @pePrvr        S                   Like(m5prvr)                                             
     D  @peArVP        S                   Like(c3arvp)                                             
     D* @peAlm1        S              5                                                             
     D* @peAlm2        S              5                                                             
     D  @pedPrvr       S                   LIKE(T0PRVR)                                             
     D  @pedArVP       S                   LIKE(T0ARVM)                                             
     D  @peAlm1        S                   LIKE(T0DLGA)                                             
     D  @peAlm2        S                   LIKE(T0DLGA)                                             
     D  @peFPed        S                   Like(s5frep)                                             
     D  @peMonP        S                   Like(s5mone)                                             
     D  @peMone        S                   Like(s5mone)                                             
     D  @peMonB        S                   Like(s5mone)                                             
     D  @peZxCo        S             12  7                                                          
     D  @peClTr        S                   Like(c0cltr)                                             
     D  @pePrec        S                   Like(s5prec)                                             
     D  @peDto1        S                   Like(s5dto1)                                             
     D  @peDto2        S                   Like(s5dto2)                                             
     D  @peDto3        S                   Like(s5dto3)                                             
     D  @peDto4        S                   Like(s5dto4)                                             
     D  @peCadP        S                   Like(s5cadp)                                             
     D  @peUndP        S                   Like(s5undp)                                             
     D  @peTcS1        S                   Like(m5tcs1)                                             
     D  @peTpPr        S              1                                                             
     D  @pePrMo        S                   Like(s5prmo)                                             
     D  @peDivi        S              3                                                             
     D  @peUser        S             10                                                             
     D  @peVal         S            250                                                             
                                                                                                    
      *                                                                                             
      * Variables                                                                                   
      *                                                                                             
     D  File_MSARTI10  S             21                                                             
      *                                                                                             
     D  zxNRR00        S                   Like(sufrcdn) Inz                                        
     D  zxNNN00        S                   Like(sufrcdn) Inz                                        
     D  zxLop00        S                   Like(sufrcdn) Inz                                        
     D  zxCount        S                   Like(sufrcdn) Inz(1)                                     
     D  zxLiPag        S                   Like(sufrcdn) Inz(10)                                    
     D  zxLiPa2        S                   Like(sufrcdn) Inz(10)                                    
     D  zxNupag        S                   Like(sufrcdn)                                            
     D  zxResto        S                   Like(sufrcdn)                                            
     D  zxZero10       S             10A   Inz(*All'0')                                             
     D  zxSemf         S               N                                                            
     D  zxComCar       S               N                                                            
     D  zxAu15         S             15S 0                                                          
     D  zxNum          S                   Like(pxNum)                                              
     D  zxFmt          S                   Like(cccfmt)                                             
     D  zxLine         S                   Like(s5line)                                             
     D  zxArti         S                   Like(s5arti)                                             
     D  zxVari         S                   Like(s5vari)                                             
     D  zxMode         S                   Like(s5mode)                                             
     D  zxErrores      S               N   Inz(*Off)                                                
     D  zxLineaMaxima  S                   Like(s5line)                                             
                                                                                                    
mod01  dcl-s @Prop like(m1prop) inz;                                                                
mod01  dcl-s gUpdated ind inz;  // Per sortit si s'ha actualitzat amb F10                           
       dcl-s gIntro ind inz; // Per controlar si fan Intro amb opcions i no esborrar-les            
      *                                                                                             
      * Formateo numéricos                                                                          
      *                                                                                             
     D  pxNum          S             29  9                                                          
     D  pxAlph         S             29                                                             
     D  pxFldD         S              2  0 Inz(20)                                                  
     D  pxDccd         S              1  0 Inz(2)                                                   
     D  pxFmd1         S                   Like(zzfmd1) Inz                                         
     D  pxEdtC         S                   Like(zzEdtC) Inz('4')                                    
     D  pxNmer         S              1  0 Inz(0)                                                   
     D  pxTipa         S              1    Inz('0')                                                 
                                                                                                    
      *                                                                                             
      * Funciones y Procedimientos                                                                  
      *                                                                                             
     D  Num2AlphaFmt   PR                  Like(pxAlph)                                             
     D    @Num                       20  5              Value                                       
      *                                                                                             
     D  LogisticaOK    PR              N                                                            
     D    @Logistica                       Like(s5loge) Value                                       
      *                                                                                             
     D  CambiarLog     PR             7                                                             
     D    @Logistica                       Like(s5loge) Value                                       
      *                                                                                             
     D  EsOL           PR              N                                                            
     D    @Logistica                       Like(s5loge) Value                                       
     D    @Almacen                         Like(m0maga)       Options(*NoPass)                      
     D    @Msstok                      N                      Options(*NoPass)                      
      *                                                                                             
     D  ExisteMsstok   PR              N                                                            
     D    @Almacen                         Like(m1maga) Value                                       
     D    @Articulo                        Like(m1arti) Value                                       
     D    @Variacion                       Like(m1vari) Value                                       
     D    @Modelo                          Like(m1mode) Value                                       
      *                                                                                             
E7391 * S'eliminen les definicions de prototip, innecessàries                                       
E7391 *     D  ErrExisteArt   PR              N                                                     
E7391 *     D    @Articulo                        Like(s5arti) Value                                
E7391 *     D    @Variacion                       Like(s5vari) Value                                
E7391 *     D    @Modelo                          Like(s5mode) Value                                
E7391 *     D    @ArtPed                      N                Value Options(*NoPass)               
E7391 *                                                                                             
E7391 *     D  ErrExisteArt2  PR              N                                                     
E7391 *     D    @CiaD                            Like(c3cias) Value                                
E7391 *     D    @Articulo                        Like(c3arvp) Value                                
E7391 *                                                                                             
      *                                                                                             
     D  ErrEquEDI      PR              N                                                            
     D    @Almacen                         Like(m1maga) Value                                       
      *                                                                                             
     D  ErrPrecCompra  PR              N                                                            
      *                                                                                             
     D  ValidarFD      PR              N                                                            
     D    @Logistica                       Like(s5loge) Value                                       
     D    @EDAu                       3    Value                                                    
      *                                                                                             
     D  EsServicio     PR              N                                                            
      *                                                                                             
     D  RecalcularPlz  PR                                                                           
     D    @Logistica                       Like(s5loge) Value                                       
     D    @OL                          N                Value                                       
      *                                                                                             
     D  UpdLogAudit    PR                                                                           
     D    @Logistica                       Like(s5loge) Value                                       
     D    @Coenvios                    N                Value Options(*NoPass)                      
      *                                                                                             
     D  Evento         PR                                                                           
     D    @EDAu                       3    Value                                                    
      *                                                                                             
mod01 //elimino definició de prototip intern, innecessari                                           
mod01 //D  LogServM3      PR                                                                        
mod01 //D    @Logistica                       Like(s5loge) Value                                    
      *                                                                                             
     D  Coenvios       PR                                                                           
     D    @Logistica                       Like(s5loge) Value Options(*NoPass)                      
                                                                                                    
       //Tool per virtuals i d'altres                                                              
       dcl-pr pMM1411 extpgm('MM1411');                                                             
           @cias  like(s5cias) const;                                                               
           @maga  like(m0maga) const;                                                               
           @tipo  char(1) const;                                                                    
           @dlga  like(s5dlga) const;                                                               
           @resp  like(@peresp);                                                                    
       end-pr;                                                                                      
                                                                                                    
                                                                                                    
      **************************************************************                                
      * PROGRAMA PRINCIPAL                                         *                                
      **************************************************************                                
      *                                                                                             
     C                   DoW       zxOpt <> 'END'                                                   
     C                   ExSR      S01Main                                                          
     C                   EndDo                                                                      
      *                                                                                             
     C                   Eval      *InLR = *On                                                      
                                                                                                    
                                                                                                    
      **************************************************************                                
      * INICIALIZACIONES                                           *                                
      **************************************************************                                
      *                                                                                             
     C     *InzSR        BegSR                                                                      
      *                                                                                             
     C     *Entry        PList                                                                      
     C                   Parm                    @pCias                                             
     C                   Parm                    @pDlga                                             
     C                   Parm                    @pNPCo                                             
     C                   Parm                    @pTPed                                             
     C                   Parm                    @pDatP                                             
     C                   Parm                    @pNoPl                                             
     C                   Parm                    @pOpci                                             
     C                   Parm                    @pErr                                              
      *                                                                                             
     C     kCodepeR      KList                                                                      
     C                   KFld                    s5cias                                             
     C                   KFld                    s5dlga                                             
     C                   KFld                    s5npco                                             
     C                   KFld                    s5tped                                             
     C                   KFld                    s5datp                                             
     C                   KFld                    s5nopl                                             
      *                                                                                             
     C     kCodepe       KList                                                                      
     C                   KFld                    s5cias                                             
     C                   KFld                    s5dlga                                             
     C                   KFld                    s5npco                                             
     C                   KFld                    s5tped                                             
     C                   KFld                    s5datp                                             
     C                   KFld                    s5nopl                                             
     C                   KFld                    s5line                                             
      *                                                                                             
     C     kCodepe01     KList                                                                      
     C                   KFld                    s5cias                                             
     C                   KFld                    s5dlga                                             
     C                   KFld                    s5npco                                             
     C                   KFld                    s5tped                                             
     C                   KFld                    s5datp                                             
     C                   KFld                    s5nopl                                             
     C                   KFld                    s5arti                                             
     C                   KFld                    s5vari                                             
     C                   KFld                    s5mode                                             
      *                                                                                             
     C     kCodipe       KList                                                                      
     C                   KFld                    s2cias                                             
     C                   KFld                    s2dlga                                             
     C                   KFld                    s2npco                                             
     C                   KFld                    s2tped                                             
     C                   KFld                    s2datp                                             
     C                   KFld                    s2nopl                                             
     C                   KFld                    s2cdir                                             
      *                                                                                             
     C     kCoppec       KList                                                                      
     C                   KFld                    thcias                                             
     C                   KFld                    thdlga                                             
      *                                                                                             
E7391 *     C     kMitmas00     KList                                                               
E7391 *     C                   KFld                    mmcono                                      
E7391 *     C                   KFld                    mmitno                                      
E7391C     KMITBAL00     KLIST                                                                      
E7391C                   KFLD                    MBCONO                                             
E7391C                   KFLD                    MBWHLO                                             
E7391C                   KFLD                    MBITNO                                             
E7391 *                                                                                             
      *                                                                                             
     C     kMsalma05     KList                                                                      
     C                   KFld                    m0cias                                             
     C                   KFld                    m0loge                                             
      *                                                                                             
     C     kMsalma       KList                                                                      
     C                   KFld                    m0cias                                             
     C                   KFld                    m0maga                                             
      *                                                                                             
     C     kMsarti       KList                                                                      
     C                   KFld                    m5arti                                             
     C                   KFld                    m5vari                                             
     C                   KFld                    m5mode                                             
      *                                                                                             
     C     kMsarti00     KList                                                                      
     C                   KFld                    mm5cias                                            
     C                   KFld                    mm5arti                                            
     C                   KFld                    mm5vari                                            
     C                   KFld                    mm5mode                                            
      *                                                                                             
     C     kMscojc       KList                                                                      
     C                   KFld                    ndcias                                             
     C                   KFld                    ndarti                                             
     C                   KFld                    ndvari                                             
     C                   KFld                    ndmode                                             
     C                   KFld                    ndtcoj                                             
      *                                                                                             
     C     kMslogi       KList                                                                      
     C                   KFld                    micias                                             
     C                   KFld                    midlga                                             
     C                   KFld                    milgca                                             
      *                                                                                             
     C     kMsstok       KList                                                                      
     C                   KFld                    m1cias                                             
     C                   KFld                    m1maga                                             
     C                   KFld                    m1arti                                             
     C                   KFld                    m1vari                                             
     C                   KFld                    m1mode                                             
      *                                                                                             
     C     kPmempr       KList                                                                      
     C                   KFld                    p7cias                                             
     C                   KFld                    p7dlga                                             
      *                                                                                             
     C     kPmtabd       KList                                                                      
     C                   KFld                    pecias                                             
     C                   KFld                    pectab                                             
     C                   KFld                    peclta                                             
      *                                                                                             
     C     kPuprov       KList                                                                      
     C                   KFld                    c0cias                                             
     C                   KFld                    c0prvr                                             
      *                                                                                             
     C     kPuprp0       KList                                                                      
     C                   KFld                    c3cias                                             
     C                   KFld                    c3prvr                                             
     C                   KFld                    c3arvm                                             
      *                                                                                             
     C     kUtcom0       KList                                                                      
     C                   KFld                    u0cias                                             
     C                   KFld                    u0tenv                                             
     C                   KFld                    u0clp0                                             
     C                   KFld                    u0clp2                                             
      *                                                                                             
     C     *DtaAra       Define    purLDA        dsLDA                                              
     C                   In        dsLDA                                                            
      *                                                                                             
     C                   Eval      sufopc1 = 'EPC0260'                                              
     C                   Eval      cccctit = 'TED3063'                                              
     C                   Eval      SFLCtl = *On                                                     
     C                   Eval      ErrGrl = *On                                                     
      *                                                                                             
     C                   Eval      s5cias = @pCias                                                  
     C                   Eval      s5dlga = @pDlga                                                  
     C                   Eval      s5npco = @pNPCo                                                  
     C                   Eval      s5tped = @pTPed                                                  
     C                   Eval      s5datp = @pDatP                                                  
     C                   Eval      s5nopl = @pNoPl                                                  
     C     kCodepeR      Chain     cocape                                                           
      *                                                                                             
     C                   If        %Found                                                           
     C                   Eval      sucCust = s0cust                                                 
     C                   Eval      sucDes1 = s0des1                                                 
     C                   EndIf                                                                      
      *                                                                                             
     C                   Eval      sucNpCo = @pNPCo                                                 
      *                                                                                             
     C                   Eval      s2cias = @pCias                                                  
     C                   Eval      s2dlga = @pDlga                                                  
     C                   Eval      s2npco = @pNPCo                                                  
     C                   Eval      s2tped = @pTPed                                                  
     C                   Eval      s2datp = @pDatP                                                  
     C                   Eval      s2nopl = @pNoPl                                                  
     C                   Eval      s2cdir = '0'                                                     
     C     kCodipe       Chain     codipe                                                           
      *                                                                                             
     C                   If        %Found                                                           
     C                   Eval      sucRaoS = s2raos                                                 
     C                   Eval      sucDire = s2dire                                                 
     C                   Eval      sucDir2 = s2dir2                                                 
     C                   Eval      sucPost = s2post                                                 
     C                   Eval      sucPobl = s2pobl                                                 
     C                   EndIf                                                                      
      *                                                                                             
     C                   Eval      p7cias = @pCias                                                  
     C                   Eval      p7dlga = @pDlga                                                  
     C     kPmempr       Chain     pmempr                                                           
      *                                                                                             
     C                   Eval      thcias = @pCias                                                  
E7391 *     C                   Eval      mm5cias = @pCias                                          
     C                   Eval      ndcias = @pCias                                                  
     C                   Eval      m0cias = @pCias                                                  
     C                   Eval      micias = @pCias                                                  
     C                   Eval      midlga = @pDlga                                                  
     C                   Eval      m1cias = @pCias                                                  
     C                   Eval      pecias = @pCias                                                  
     C                   Eval      c0cias = @pCias                                                  
     C                   Eval      c3cias = @pCias                                                  
     C                   Eval      u0cias = @pCias                                                  
     C                   Eval      u0tenv = '5'                                                     
     C                   Eval      u0clp2 = *Blanks                                                 
      *                                                                                             
     C                   Eval      *In50 = (@pOpci='2')                                             
     C                   Eval      *In53 = *In50  And                                               
     C                                     s0coen <> '1'  And  s0etod <> '1'                        
     C                   Eval      cccfmt = '1'                                                     
      *                                                                                             
     C                   EndSR                                                                      
                                                                                                    
                                                                                                    
      **************************************************************                                
      * CONTROL SUBFICHERO                                         *                                
      **************************************************************                                
      *                                                                                             
     C     S01Main       BegSR                                                                      
      *                                                                                             
     C                   DoW       zxOpt1 = 'S01'                                                   
     C     zxOpt2        CasEq     'CLR'         S01Clr                                             
     C     zxOpt2        CasEq     'INZ'         S01Inz                                             
     C     zxOpt2        CasEq     'DSP'         S01Dsp                                             
     C     zxOpt2        CasEq     'CMD'         S01Cmd                                             
     C     zxOpt2        CasEq     'CHK'         S01Chk                                             
     C                   EndCS                                                                      
     C                   EndDo                                                                      
      *                                                                                             
     C                   EndSR                                                                      
                                                                                                    
                                                                                                    
      **************************************************************                                
      * LIMPIEZA SUBFICHERO                                        *                                
      **************************************************************                                
      *                                                                                             
     C     S01Clr        BegSR                                                                      
      *                                                                                             
     C                   Eval      zxOpt2 = 'INZ'                                                   
     C                   MoveA     zxZero10      *In(90)                                            
     C                   Eval      InPos01 = *On                                                    
     C                   Eval      SFLDsp = *Off                                                    
     C                   Eval      SFLCtl = *Off                                                    
     C                   Eval      SFLClr = *On                                                     
     C                   Eval      Wrk51 = (cccfmt='1')                                             
     C                   Write     SufC                                                             
      *                                                                                             
     C                   Eval      SFLDsp = *On                                                     
     C                   Eval      SFLCtl = *On                                                     
     C                   Eval      SFLClr = *Off                                                    
     C                   Clear                   SufRCDN                                            
     C                   Reset                   zxNRR00                                            
     C                   Reset                   zxNNN00                                            
     C                   Eval      zxComCar = *Off                                                  
     C                   Eval      zxFmt = cccfmt                                                   
     C                   MoveA     zxZero10      *In(40)                                            
      *                                                                                             
     C                   If        cccfmt = '1'                                                     
     C     KCodepe       SetLL     codepe                                                           
     C                   Else                                                                       
     C     KCodepe01     SetLL     codepe01                                                         
     C                   Endif                                                                      
      *                                                                                             
     C                   EndSR                                                                      
                                                                                                    
                                                                                                    
      **************************************************************                                
      * INICIALIZACIÓN Y CARGA DEL SUBFICHERO                      *                                
      **************************************************************                                
      *                                                                                             
     C     S01Inz        BegSR                                                                      
      *                                                                                             
     C                   Eval      zxOPt2 = 'DSP'                                                   
      *                                                                                             
      * Parte 1                                                                                     
      *                                                                                             
     C                   Reset                   zxLop00                                            
     C                   Reset                   zxLiPag                                            
     C                   Clear                   psuLine                                            
     C                   Clear                   psuArti                                            
     C                   Clear                   psuVari                                            
     C                   Clear                   psuMode                                            
     C                   Eval      zxNRR00 = zxNNN00                                                
      *                                                                                             
     C                   If        AccRef = *On                                                     
     C                   Reset                   zxNRR00                                            
     C     zxCount       Div       zxLiPag       zxNuPag                                            
     C                   Mvr                     zxResto                                            
     C                   If        zxResto > 0  Or  zxNuPag = 0                                     
     C                   Eval      zxNuPag += 1                                                     
     C                   EndIf                                                                      
     C                   Eval      zxLiPag = zxNuPag * zxLiPag                                      
     C                   Endif                                                  AccRef=*On          
      *                                                                                             
     C                   Reset                   zxNNN00                                            
     C                   Eval      SFLEnd = *Off                                                    
      *                                                                                             
      * Carga del subfichero                                                                        
      *                                                                                             
     C                   DoW       zxLop00 < zxLiPag                                                
      *                                                                                             
     C                   If        cccfmt = '1'                                                     
     C     kCodepeR      ReadE (N) codepe                                                           
     C                   Else                                                                       
     C     kCodepeR      ReadE     codepe01                                                         
     C                   EndIf                                                                      
      *                                                                                             
     C                   If        %EoF                                                             
     C                   Leave                                                                      
     C                   EndIf                                                                      
      *                                                                                             
     C                   Eval      zxNRR00 += 1                                                     
     C                   Eval      zxLop00 += 1                                                     
     C                   Eval      sufOpci = *Blanks                                                
     C                   Eval      sflNxc = *Off                                                    
     C                   ExSR      S01MFP                                                           
     C                   ExSR      SavFK                                                            
     C                   Write     SufD                                                             
      *                                                                                             
     C                   EndDo                                                  zxLop00<zxLiPag     
      *                                                                                             
      * Parte 2                                                                                     
      *                                                                                             
     C                   Eval      zxNNN00 = zxNRR00                                                
     C                   Eval      SufRCDN = zxNRR00                                                
     C                   Eval      AccRef = *On                                                     
     C                   If        %EoF                                                             
     C                   Eval      SFLEnd = *On                                                     
     C                   EndIf                                                                      
      *                                                                                             
     C                   If        zxNRR00 = 0                                                      
     C                   Eval      csrFila = 0                                                      
     C                   Eval      csrColu = 0                                                      
     C                   Eval      SFLDsp = *Off                                                    
     C                   Else                                                                       
     C                   Eval      SFLDsp = *On                                                     
     C                   EndIf                                                                      
      *                                                                                             
     C                   If        zxCount > zxNNN00                                                
     C                   Eval      csrFila = 0                                                      
     C                   Eval      csrColu = 0                                                      
     C                   EndIf                                                                      
      *                                                                                             
     C                   EndSR                                                                      
                                                                                                    
                                                                                                    
      **************************************************************                                
      * VISUALIZACIÓN SUBFICHERO                                   *                                
      **************************************************************                                
      *                                                                                             
     C     S01Dsp        BegSR                                                                      
      *                                                                                             
     C                   Eval      zxOpt2 = 'CMD'                                                   
     C   50              Eval      pppCmd1 = 'CMD7817'                                              
     C  N50              Eval      pppCmd1 = 'CMD7801'                                              
      *                                                                                             
     C                   If        Wrk40 = *Off                                                     
     C                   If        cccfmt = '1'                                                     
     C   53              Eval      sufHed1 = 'HED306A'                                              
     C  N53              Eval      sufHed1 = 'HED306B'                                              
     C                   Else                                                                       
     C   53              Eval      sufHed1 = 'HED306C'                                              
     C  N53              Eval      sufHed1 = 'HED306D'                                              
     C                   EndIf                                                                      
     C                   EndIf                                                                      
      *                                                                                             
     C                   If        AccRef = *Off  And  SFlDsp = *On                                 
     C                   Eval      SufRCDN = zxCount                                                
     C                   EndIf                                                                      
      *                                                                                             
     C                   Clear                   psuLine                                            
     C                   Clear                   psuArti                                            
     C                   Clear                   psuVari                                            
     C                   Clear                   psuMode                                            
     C                   Write     SufP                                                             
     C                   ExFmt     SufC                                                             
      *                                                                                             
     C                   Eval      zxCount = SFLPos1                                                
     C                   Eval      ErrGrl = *Off                                                    
     C                   Eval      MsgEr = *Blanks                                                  
     C                   MoveA     zxZero10      *In(40)                                            
      *                                                                                             
     C                   If        zxFmt <> cccFmt                                                  
      *                                                                                             
     C                   If        Exit = *Off  And  Retro = *Off                                   
      *                                                                                             
     C                   Call      'MMPROM'                                                         
     C                   Parm      cccFmt        @peOpt                                             
     C                   Parm      sdsPgm        @pePgm                                             
     C                   Parm      *Blanks       @peFmt                                             
     C                   Parm      'CFMT'        @peFld                                             
     C                   Parm      'V'           @peErr                                             
      *                                                                                             
     C                   If        @peErr > '0'                                                     
     C                   Eval      ErrGrl = *On                                                     
     C                   Eval      MsgEr = 'MSG0063'                                                
     C                   Eval      Wrk40 = *On                                                      
     C                   Eval      zxOpt2 = 'DSP'                                                   
     C                   Else                                                                       
     C                   Clear                   s5line                                             
     C                   Clear                   s5arti                                             
     C                   Clear                   s5vari                                             
     C                   Clear                   s5mode                                             
     C                   Eval      zxOpt2 = 'CLR'                                                   
     C                   EndIf                                                                      
      *                                                                                             
     C                   EndIf                                                  Exit = *Off         
      *                                                                                             
     C                   EndIf                                                  zxFmt <> cccFmt     
      *                                                                                             
     C                   EndSR                                                                      
                                                                                                    
                                                                                                    
      **************************************************************                                
      * VALIDACIÓN COMANDOS                                        *                                
      **************************************************************                                
      *                                                                                             
     C     S01Cmd        BegSR                                                                      
      *                                                                                             
     C                   Eval      zxOpt2 = 'CHK'                                                   
      *                                                                                             
     C                   If        VldCmdKey = *On                                                  
      *                                                                                             
     C                   Eval      AccRef = *On                                                     
      *                                                                                             
     C                   Select                                                                     
      * F04                                                                                         
     C                   When      Help = *On                                                       
      *                                                                                             
     C                   Eval      zxOpt2 = 'CHK'                                                   
     C     SFlPoCur      Div       256           csrFila                                            
     C                   Mvr                     csrColu                                            
     C                   Eval      AccRef = *Off                                                    
      *                                                                                             
     C                   Select                                                                     
      *                                                                                             
      * Logística global                                                                            
      *                                                                                             
     C                   When      field = 'SUCNLOG'                                                
      *                                                                                             
     C                   Call      'MM0690'                                                         
     C                   Parm      @pCias        @peCias                                            
     C                   Parm      @pDlga        @peDlga                                            
     C                   Parm                    sucnlog                                            
     C                   Parm      '2'           @peErr                                             
      *                                                                                             
      * Logística línea                                                                             
     C                   When      field = 'SUFNLOG'  And  sufIn52 = '1'                            
      *                                                                                             
     C                   Call      'MM0690'                                                         
     C                   Parm      @pCias        @peCias                                            
     C                   Parm      @pDlga        @peDlga                                            
     C                   Parm                    @peLogE                                            
     C                   Parm      '2'           @peErr                                             
      *                                                                                             
     C                   If        @peErr = *Blanks                                                 
     C                   Eval      zxNRR00 = sflPos1 + csrFila - 11                                 
     C     zxNRR00       Chain     sufD                               81                            
     C                   If        Chain = *Off                                                     
     C                   Eval      sufNlog = @peLogE                                                
     C                   Eval      SFlNxc = *On                                                     
     C                   Eval      *In52 = sufIn52                                                  
     C                   Update    SufD                                                             
     C                   Eval      ErrGrl = *On                                                     
     C                   EndIf                                                                      
     C                   EndIf                                                                      
      *                                                                                             
      * Tipo de formato                                                                             
      *                                                                                             
     C                   When      field = 'CCCFMT'                                                 
      *                                                                                             
     C                   Call      'MMPROM'                                                         
     C                   Parm      cccfmt        @peOpt                                             
     C                   Parm      sdsPgm        @pePgm                                             
     C                   Parm      *Blanks       @peFmt                                             
     C                   Parm      'CFMT'        @peFld                                             
     C                   Parm      *Blanks       @peErr                                             
      *                                                                                             
     C                   If        @peErr > '0'                                                     
     C                   Eval      ErrGrl = *On                                                     
     C                   Eval      Wrk40 = *On                                                      
     C                   Eval      MsgEr = 'ADP0304'                                                
     C                   EndIf                                                                      
      *                                                                                             
     C                   If        @peErr = 'A'                                                     
     C                   Eval      ErrGrl = *On                                                     
     C                   EndIf                                                                      
      *                                                                                             
     C                   If        ErrGrl = *Off                                                    
     C                   Eval      cccfmt = @peOpt                                                  
     C                   Clear                   s5line                                             
     C                   Clear                   s5arti                                             
     C                   Clear                   s5vari                                             
     C                   Clear                   s5mode                                             
     C                   Eval      zxOpt2 = 'CLR'                                                   
     C                   EndIf                                                                      
      *                                                                                             
      * Opción                                                                                      
      *                                                                                             
     C                   When      field = 'SUFOPCI'                                                
      *                                                                                             
     C                   Call      'MMPROM'                                                         
     C                   Parm      sufOpci       @peOpt                                             
     C                   PARM      sdsPgm        @pePgm                                             
     C                   PARM      *Blanks       @peFmt                                             
     C                   PARM      'OPCI'        @peFld                                             
     C                   PARM      *Blanks       @peErr                                             
      *                                                                                             
     C                   If        @peErr > '0'                                                     
     C                   Eval      ErrGrl = *On                                                     
     C                   Eval      Wrk41 = *On                                                      
     C                   Eval      MsgEr = 'ADP0304'                                                
     C                   EndIf                                                                      
      *                                                                                             
     C                   If        ErrGrl = *Off                                                    
     C                   Eval      zxNRR00 = sflPos1 + csrFila - 11                                 
     C     zxNRR00       Chain     sufD                               81                            
     C                   If        Chain = *Off                                                     
     C                   Eval      sufOpci = @peOpt                                                 
     C                   Eval      SFlNxc = *On                                                     
     C                   Eval      *In52 = sufIn52                                                  
     C                   Update    SufD                                                             
     C                   Eval      ErrGrl = *On                                                     
     C                   EndIf                                                                      
     C                   EndIf                                                                      
      *                                                                                             
     C                   Other                                                                      
     C                   Eval      ErrGrl = *On                                                     
     C                   Eval      MsgEr = 'ADP0304'                                                
      *                                                                                             
     C                   EndSL                                                                      
      *                                                                                             
      * F03/F12                                                                                     
      *                                                                                             
     C                   When      Exit = *On  Or  Retro = *On                                      
     C                   Eval      zxOpt = 'END'                                                    
      *                                                                                             
      * F10=Confirmar                                                                               
      *                                                                                             
     C                   When      Cmd10 = *On                                                      
      *                                                                                             
mod01                    gUpdated = *off;                                                           
mod01                    if sucNlog <> *blanks; // tenim log en Control                             
     C                   If        LogisticaOK(sucNLog)                                             
     C                   ExSR      CambiarTodas                                                     
     C                   If        zxErrores                                                        
     C                   Eval      MsgEr = 'MSG0088'                                                
     C                   EndIf                                                                      
     C                   Eval      sucNLog = *Blanks                                                
     C                   Eval      zxOpt2 = 'CLR'                                                   
     C                   ExSR      RstFK                                                            
     C                   Else                                                                       
     C                   Eval      MsgEr = 'MMM0109'                                                
     C                   EndIf                                                  LogisticaOK         
      *                                                                                             
     C                   If        MsgEr <> *Blanks                                                 
     C                   Eval      ErrGrl = *On                                                     
     C                   Eval      Wrk42 = *On                                                      
     C                   Eval      csrFila = 9                                                      
     C                   Eval      csrColu = 72                                                     
     C                   EndIf                                                                      
mod01 //                                                                                            
mod01                    else;   //NO tenim log en Control. Mirar les línies                        
mod01                     exsr ChkOpt ;                                                             
mod01                    endif;                                                                     
mod01                    if MsgEr = *blanks and gUpdated;     // sortim del programa                
mod01                      zxOpt = 'END';                    // si hem actualitzat i no tenim er    
mod01                    endif;                                                                     
      *                                                                                             
      * Arriba                                                                                      
      *                                                                                             
     C                   When      RollUp = *On                                                     
      *                                                                                             
     C                   Eval      AccRef = *Off                                                    
     C                   Eval      zxOpt2 = 'INZ'                                                   
     C                   Eval      csrFila = 0                                                      
     C                   Eval      csrColu = 0                                                      
      *                                                                                             
      * Abajo                                                                                       
      *                                                                                             
     C                   When      RollDown = *On                                                   
      *                                                                                             
     C                   Eval      zxSemf = *Off                                                    
     C                   ExSR      RstFK                                                            
     C                   Reset                   zxLop00                                            
     C                   Reset                   zxLiPag                                            
     C                   Eval      zxCount = 1                                                      
      *                                                                                             
     C                   If        Not zxSemf                                                       
     C                   Eval      zxLiPag += 1                                                     
     C                   EndIf                                                                      
      *                                                                                             
     C                   If        cccfmt = '1'                                                     
     C     kCodepe       SetGT     codepe                                                           
     C     kCodepeR      ReadPE(N) codepe                                                           
     C                   Else                                                                       
     C     kCodepe01     SetGT     codepe01                                                         
     C     kCodepeR      ReadPE    codepe01                                                         
     C                   EndIf                                                                      
      *                                                                                             
     C                   DoW       Not %EoF  And  zxLop00 < zxLiPag                                 
     C                   Eval      zxLop00 += 1                                                     
     C                   If        cccfmt = '1'                                                     
     C     kCodepeR      ReadPE(N) codepe                                                           
     C                   Else                                                                       
     C     kCodepeR      ReadPE    codepe01                                                         
     C                   EndIf                                                                      
     C                   EndDo                                                                      
      *                                                                                             
     C                   If        Not zxSemf  And  %EoF  And  zxLop00 = 1                          
     C                   Eval      ErrGrl = *On                                                     
     C                   Eval      MsgEr = 'MSG0114'                                                
     C                   EndIf                                                                      
      *                                                                                             
     C                   Eval      zxComCar = *Off                                                  
     C                   ExSR      SavFK                                                            
     C                   Eval      zxSemf = *Off                                                    
     C                   Eval      AccRef = *Off                                                    
     C                   Eval      zxOpt2 = 'CLR'                                                   
     C                   Eval      csrFila = 0                                                      
     C                   Eval      csrColu = 0                                                      
      *                                                                                             
     C                   EndSl                                                                      
      *                                                                                             
     C                   EndIf                                                  VldCmdKey           
      *                                                                                             
     C                   If        ErrGrl = *On  And  AccRef = *On                                  
     C                   Eval      AccRef = *Off                                                    
     C                   EndIf                                                                      
      *                                                                                             
     C                   EndSR                                                                      
                                                                                                    
                                                                                                    
      **************************************************************                                
      * VALIDACIÓN DEL SUBFICHERO                                  *                                
      **************************************************************                                
      *                                                                                             
     C     S01Chk        BegSR                                                                      
      *                                                                                             
     C                   Eval      AccRef = *On                                                     
      *                                                                                             
     C                   If        cccfmt = '1'                                                     
      *                                                                                             
     C                   If        psuLine > 0                                                      
      *                                                                                             
     C                   Eval      ErrGrl = *Off                                                    
     C                   Eval      csrColu = 0                                                      
     C                   Eval      csrFila = 0                                                      
     C                   Eval      zxCount = 1                                                      
     C                   Eval      s5line = psuLine                                                 
     C                   Eval      zxOpt2 = 'CLR'                                                   
      *                                                                                             
     C                   Else                                                                       
      *                                                                                             
     C                   Eval      zxOpt2 = 'DSP'                                                   
     C                   ExSR      ChkOpt                                                           
      *                                                                                             
     C                   EndIf                                                  psuLine > 0         
      *                                                                                             
     C                   Else                                                   cccfmt = '1'        
      *                                                                                             
     C                   If        psuArti <> *Blanks  Or                                           
     C                             psuVari <> *Blanks  Or                                           
     C                             psuMode <> *Blanks                                               
      *                                                                                             
     C                   Eval      ErrGrl = *Off                                                    
     C                   Eval      csrColu = 0                                                      
     C                   Eval      csrFila = 0                                                      
     C                   Eval      zxCount = 1                                                      
     C                   Eval      s5arti = psuArti                                                 
     C                   Eval      s5vari = psuVari                                                 
     C                   Eval      s5mode = psuMode                                                 
     C                   Eval      zxOpt2 = 'CLR'                                                   
      *                                                                                             
     C                   Else                                                                       
      *                                                                                             
     C                   Eval      zxOpt2 = 'DSP'                                                   
     C                   ExSR      ChkOpt                                                           
      *                                                                                             
     C                   EndIf                                                  psuLine > 0         
      *                                                                                             
     C                   EndIf                                                  cccfmt = '1'        
      *                                                                                             
     C                   If        ErrGrl = *On  And  AccRef = *On                                  
     C                   Eval      AccRef = *Off                                                    
     C                   EndIf                                                                      
      *                                                                                             
     C                   EndSR                                                                      
                                                                                                    
                                                                                                    
      **************************************************************                                
      * GUARDAR CLAVE DE POSICIONAMIENTO DEL PRIMER REGISTRO TRAS  *                                
      * SU LIMPIEZA                                                *                                
      **************************************************************                                
      *                                                                                             
     C     SavFK         BEGSR                                                                      
      *                                                                                             
     C                   If        Not zxComCar                                                     
     C                   Eval      zxLine = s5line                                                  
     C                   Eval      zxArti = s5arti                                                  
     C                   Eval      zxVari = s5vari                                                  
     C                   Eval      zxMode = s5mode                                                  
     C                   Eval      zxComCar = *On                                                   
     C                   EndIf                                                                      
      *                                                                                             
     C                   EndSR                                                                      
                                                                                                    
                                                                                                    
      **************************************************************                                
      * RESTAURAR POSICIONAMIENTO                                  *                                
      **************************************************************                                
      *                                                                                             
     C     RstFK         BegSR                                                                      
     C                   Eval      s5line = zxLine                                                  
     C                   Eval      s5arti = zxArti                                                  
     C                   Eval      s5vari = zxVari                                                  
     C                   Eval      s5mode = zxMode                                                  
     C                   EndSR                                                                      
                                                                                                    
                                                                                                    
      **************************************************************                                
      * TRATAMIENTO DE OPCIONES                                    *                                
      **************************************************************                                
      *                                                                                             
     C     ChkOpt        BegSR                                                                      
      *                                                                                             
     C                   Eval      AccRef = *Off                                                    
     C                   Eval      EoF = *Off                                                       
mod01                    gIntro = *off;                                                             
      *                                                                                             
     C                   If        SFlDsp = *On                                                     
      *                                                                                             
     C                   Do        *HiVal                                                           
     C                   ReadC     SufD                                   82                        
      *                                                                                             
     C                   If        EoF = *On                                                        
     C                   Leave                                                                      
     C                   EndIf                                                                      
      *                                                                                             
     C                   Eval      AccRef = *On                                                     
     C                   Eval      zxOpt2 = 'CLR'                                                   
     C                   Eval      SFlNxc = *Off                                                    
      *                                                                                             
     C                   If        sufOpci = *Blanks  And  sufNLog = *Blanks                        
     C                   GoTo      TNexOpc                                                          
     C                   Else                                                                       
     C                   Eval      zxCount = zxNRR00                                                
     C                   EndIf                                                                      
      *                                                                                             
      * ¿Se ha entrado una opción?                                                                  
      *                                                                                             
mod01C***                If        sufOpci <> *Blanks                                               
mod01                    If  sufOpci <> *Blanks and Cmd10 = *off; //si venim per F10 no ho mirem    
      *                                                                                             
     C                   Call      'MMPROM'                                                         
     C                   Parm      sufOpci       @peOpt                                             
     C                   Parm      sdsPgm        @pePgm                                             
     C                   Parm      *Blanks       @peFmt                                             
     C                   Parm      'OPCI'        @peFld                                             
     C                   Parm      'V'           @peErr                                             
      *                                                                                             
     C                   If        @peErr > '0'                                                     
      *                                                                                             
     C                   Eval      ErrGrl = *On                                                     
     C                   Eval      MsgEr = 'MSG0063'                                                
     C                   Eval      Wrk41 = *On                                                      
      *                                                                                             
     C                   Else                                                                       
      *                                                                                             
     C                   Call      'CO0181'                                                         
     C                   Parm      @pCias        @peCias                                            
     C                   Parm      @pDlga        @peDlga                                            
     C                   Parm      @pNPCo        @peNPCo                                            
     C                   Parm      @pTPed        @peTPed                                            
     C                   Parm      @pDatP        @peDatP                                            
     C                   Parm      @pNoPl        @peNoPl                                            
     C                   Parm      sufLine       @peLine                                            
     C                   Parm      *Blanks       @peArti                                            
     C                   Parm      *Blanks       @peVari                                            
     C                   Parm      *Blanks       @peMode                                            
     C                   Parm      *Blanks       @peTCoj                                            
     C                   Parm      0             @peCant                                            
     C                   Parm      *Blanks       @peUnim                                            
     C                   Parm      0             @peCast                                            
     C                   Parm      *Blanks       @peTcSt                                            
     C                   Parm      0             @peFrre                                            
     C                   Parm      0             @peDt1C                                            
     C                   Parm      0             @peDt2C                                            
     C                   Parm      0             @peDt3C                                            
     C                   Parm      0             @peDt4C                                            
     C                   Parm      0             @pePrcC                                            
     C                   Parm      0             @peCanC                                            
     C                   Parm      0             @peCadC                                            
     C                   Parm      *Blanks       @peCaUs                                            
     C                   Parm      '5'           @peOpt                                             
     C                   Parm      *Blanks       @peErr                                             
      *                                                                                             
     C                   Eval      sufOpci = *Blanks                                                
     C                   Eval      SflNxc = *Off                                                    
      *                                                                                             
     C                   EndIf                                                  @peErr>'0'          
      *                                                                                             
     C                   EndIf                                                  sufOpci             
      *                                                                                             
      * ¿Se ha introducido nueva logística?                                                         
      *                                                                                             
     C                   If        ErrGrl = *Off  And  sufNLog <> *Blanks                           
mod01                      gIntro = *On;   //  per conservar valors                                 
      *                                                                                             
mod01                    sufNlog = SwapLog(s5cias:s5dlga:sufNlog:'R');//si posen Virt ho passem     
     C                   If        sufNlog =  sufLogE                                               
      *                                                                                             
     C                   Eval      sufNLog = *Blanks                                                
     C                   Eval      SflNxc = *Off                                                    
      *                                                                                             
     C                   Else                                                                       
      *                                                                                             
     C                   If        LogisticaOK(sufNLog)                                             
      *                                                                                             
mod01                    If  Cmd10 = *on ; //si venim per F10 no fem                                
     C                   CallP     Coenvios()                                                       
mod01                    endif;                                                                     
      *                                                                                             
     C                   Eval      s5line = sufline                                                 
     C     kCodepe       Chain (N) codepe                                                           
     C                   Eval      MsgEr = CambiarLog(sufNLog)                                      
      *                                                                                             
     C                   Else                                                                       
     C                   Eval      MsgEr = 'MMM0109'                                                
     C                   EndIf                                                 LogisticaOK          
      *                                                                                             
     C                   If        MsgEr = *Blanks                                                  
mod01                    If  Cmd10 = *on ; //si venim per F10 no fem                                
     C                   CallP     Coenvios(sufNLog)                                                
     C                   Eval      sufLogE = sufNLog                                                
     C                   Eval      sufNLog = *Blanks                                                
     C                   Eval      SflNxc = *Off                                                    
mod01                    else;  // no venim per F10, marquem registre com modificat                 
mod01                      SflNxc = *on;                                                            
mod01                    endif;                                                                     
     C                   Else                                                                       
     C                   Eval      ErrGrl = *On                                                     
     C                   Eval      Wrk43 = *On                                                      
     C                   EndIf                                                                      
      *                                                                                             
     C                   EndIf                                                 sufNLog=sufLogE      
      *                                                                                             
     C                   Endif                                                 ErrGrl ...           
      *                                                                                             
     C     TNexOpc       Tag                                                                        
     C                   Eval      *In52 = sufIn52                                                  
     C                   Update    SufD                                                             
      *                                                                                             
     C                   If        ErrGrl = *On                                                     
     C                   Eval      zxOpt2 = 'DSP'                                                   
     C                   Eval      zxCount = zxNRR00                                                
     C                   ExSR      PosCer0                                                          
     C                   Leave                                                                      
     C                   EndIf                                                  ErrGrl              
      *                                                                                             
     C                   ExSR      PosCer0                                                          
      *                                                                                             
     C                   EndDo                                                                      
      *                                                                                             
mod01                    if ErrGrl = *off;                                                          
mod01                      ErrGrl = gIntro;                                                         
                           zxOpt2 = 'DSP' ;                                                         
                           zxCount = zxNRR00 ;                                                      
                           ExSR      PosCer0 ;                                                      
mod01                    endif;                                                                     
     C                   EndIf                                                  SFlDsp = *On        
      *                                                                                             
     C                   If        ErrGrl = *Off                                                    
     C                   ExSR      RstFK                                                            
     C                   EndIf                                                                      
      *                                                                                             
     C                   EndSR                                                                      
                                                                                                    
                                                                                                    
      **************************************************************                                
      * POSICIONAMIENTO CURSOR                                     *                                
      **************************************************************                                
      *                                                                                             
     C     PosCer0       BegSR                                                                      
      *                                                                                             
     C                   If        zxLiPag <> 0                                                     
      *                                                                                             
     C     zxCount       Div       zxLiPa2       zxAu15                                             
     C                   Mvr                     csrFila                                            
      *                                                                                             
     C                   If        csrFila = 0  And  zxAu15 > 0                                     
     C                   Eval      csrFila = zxliPa2                                                
     C                   EndIf                                                                      
      *                                                                                             
     C                   Eval      csrFila += 10                                                    
      *                                                                                             
     C                   EndIf                                                                      
      *                                                                                             
     C                   If        csrFila <= 0                                                     
     C                   Eval      csrFila = 11                                                     
     C                   EndIf                                                                      
      *                                                                                             
     C  N43              Eval      csrColu = 4                                                      
     C   43              Eval      csrColu = 72                                                     
      *                                                                                             
     C                   EndSR                                                                      
                                                                                                    
                                                                                                    
      **************************************************************                                
      * MOVER CAMPOS A SUBFICHERO                                  *                                
      **************************************************************                                
      *                                                                                             
     C     S01MFP        BegSR                                                                      
      *                                                                                             
     C                   Eval      sufOpci = *Blanks                                                
     C                   Eval      SFlNxc = *Off                                                    
     C                   Clear                   sufData                                            
      *                                                                                             
     C                   If        cccfmt = '1'                                                     
     C                   Eval      s01Line = %EditC(s5line:'X')                                     
     C                   Eval      s01arti = s5arti                                                 
     C                   Eval      s01vari = s5vari                                                 
     C                   Eval      s01mode = s5mode                                                 
     C                   Else                                                                       
     C                   Eval      s02Line = %EditC(s5line:'X')                                     
     C                   Eval      s02arti = s5arti                                                 
     C                   Eval      s02vari = s5vari                                                 
     C                   Eval      s02mode = s5mode                                                 
     C                   EndIf                                                                      
      *                                                                                             
     C                   EvalR     sufCant = Num2AlphaFmt(s5cant)                                   
     C                   Eval      sufUniM = s5unim                                                 
     C                   Eval      sufStuL = s5stul                                                 
mod01C***                Eval      sufLoge = s5loge                                                 
mod01                    sufLoge = SwapLog(s5cias:s5dlga:s5loge:'R');                               
      *                                                                                             
     C                   Eval      sufLine = s5line                                                 
E7351C*                  Eval      *In52 = *In53  And  s5stul='0'                                   
E7351c                   eval      *in52=*in53 and (s5stul='0' or s5stul=' ')                       
     C                   Eval      sufIn52 = *In52                                                  
     C                   Eval      sufNLog = *Blanks                                                
      *                                                                                             
     C                   EndSR                                                                      
                                                                                                    
                                                                                                    
      **************************************************************                                
      * CAMBIAR LOGISTICA DE TODAS LAS LÍNEAS                      *                                
      **************************************************************                                
      *                                                                                             
     C     CambiarTodas  BegSR                                                                      
      *                                                                                             
     C                   Clear                   dsCtrlCoen                                         
     C                   Eval      zxErrores = *Off                                                 
      *                                                                                             
     C     kCodepeR      SetLL     codepe                                                           
     C     kCodepeR      ReadE (N) codepe                                                           
      *                                                                                             
mod01                    sucNLog = SwapLog(s0cias:s0dlga:sucNLog:'R');                              
     C                   Dow       Not %Eof                                                         
      *                                                                                             
     C                   If        s0coen <> '3'                                                    
     C                   Eval      dsCtrlCoen(s5line).Coenvio = s5ncoe                              
mod01C**                 Eval      dsCtrlCoen(s5line).Logistica = s5loge                            
mod01                    dsCtrlCoen(s5line).Logistica =                                             
mod01                              SwapLog(s5cias:s5dlga:s5loge:'R');                               
     C                   Eval      dsCtrlCoen(s5line).Tratar = 'N'                                  
     C                   EndIf                                                  s0coen<>'3'         
      *                                                                                             
mod01C**                 If        s5stul = '0'  And  s5loge <> sucNLog                             
mod01                    If  s5stul='0' and                                                         
mod01                       sucNLog<>SwapLog(s5cias:s5dlga:s5loge:'R');                             
     C                   Eval      zxErrores = zxErrores  Or                                        
     C                             CambiarLog(sucNLog)<>*Blanks                                     
     C                   EndIf                                                                      
      *                                                                                             
     C     kCodepeR      ReadE (N) codepe                                                           
     C                   EndDo                                                                      
      *                                                                                             
     C                   Eval      zxLineaMaxima = s5line                                           
     C                   CallP     Coenvios(sucNLog)                                                
      *                                                                                             
     C                   EndSR                                                                      
                                                                                                    
                                                                                                    
      **************************************************************                                
      * PASAR DE NUMÉRICO A ALPHANUMÉRICO FORMATEADO               *                                
      **************************************************************                                
      *                                                                                             
     P Num2AlphaFmt    B                                                                            
     D Num2AlphaFmt    PI                  Like(pxAlph)                                             
     D   @Num                        20  5              Value                                       
      *                                                                                             
     C                   Call      'PRD650'                                                         
     C                   Parm      @Num          pxNum                                              
     C                   Parm      *Blanks       pxAlph                                             
     C                   Parm                    pxFldD                                             
     C                   Parm                    pxDccd                                             
     C                   Parm                    pxFmd1                                             
     C                   Parm                    pxEdtC                                             
     C                   Parm                    pxNmer                                             
     C                   Parm                    pxTipa                                             
      *                                                                                             
     C                   Return    pxAlph                                                           
      *                                                                                             
     P                 E                                                                            
                                                                                                    
                                                                                                    
      **************************************************************                                
      * VALIDAR LOGÍSTICA INTRODUCIDA                              *                                
      **************************************************************                                
      *                                                                                             
     P LogisticaOK     B                                                                            
     D LogisticaOK     PI              N                                                            
     D   @Logistica                        Like(s5loge) Value                                       
      *                                                                                             
     C                   If        @Logistica = *Blanks                                             
     C                   Return    *Off                                                             
     C                   Else                                                                       
     C                   Eval      milgca = @Logistica                                              
     C     kMslogi       Chain     mslogi                                                           
     C                   Return    %Found  And                                                      
     C                             ( mitlgc = *Blanks  Or  mitlgc = '2' )                           
     C                   EndIf                                                                      
      *                                                                                             
     P                 E                                                                            
                                                                                                    
                                                                                                    
      **************************************************************                                
      * CAMBIAR LOGÍSTICA DE UNA LÍNEA, CON LAS RESPECTIVAS        *                                
      * COMPROBACIONES PREVIAS Y RETORNO DEL ERROR A MOSTRAR SI NO *                                
      * ES POSIBLE REALIZAR LA MODIFICACIÓN.                       *                                
      **************************************************************                                
      *                                                                                             
     P CambiarLog      B                                                                            
     D CambiarLog      PI             7                                                             
     D   @Logistica                        Like(s5loge) Value                                       
      *                                                                                             
     D  $Almacen       S                   Like(m0maga) Inz(*Blanks)                                
     D  $Msstok        S               N   Inz(*Off)                                                
     D  $Error         S              7    Inz('ART0001')                                           
     D  $ActualEsOL    S               N   Inz(*Off)                                                
     D  $NuevaEsOL     S               N   Inz(*Off)                                                
      *                                                                                             
      * Obtener datos del artículo                                                                  
      * Se utiliza el lógico sin empresa porque msarti00 resulta más eficiente                      
      * en otra parte del proceso donde se leen otros artículos y no se quiere                      
      * que se ensucien los datos del artículo de la línea, que son necesarios                      
      * en varias partes del proceso de validación y modificación.                                  
      *                                                                                             
     C                   Eval      m5arti = s5arti                                                  
     C                   Eval      m5vari = s5vari                                                  
     C                   Eval      m5mode = s5mode                                                  
     C     kMsarti       SetLL     msarti                                                           
     C     kMsarti       ReadE     msarti                                                           
     C                   DoW       Not %EoF                                                         
     C                   If        m5cias = @pCias                                                  
     C                   Eval      $Error = *Blanks                                                 
     C                   Leave                                                                      
     C                   EndIf                                                                      
     C     kMsarti       ReadE     msarti                                                           
     C                   EndDo                                                                      
      *                                                                                             
     C                   If        $Error <> *Blanks                                                
     C                   Return    $Error                                                           
     C                   EndIf                                                                      
      *                                                                                             
     C                   Eval      @pePrvr = m5prvr                                                 
     C                   Eval      @peArVP = m5arti + m5vari + m5mode                               
     C                   Eval      @peMonP = s5mone                                                 
     C                   Eval      @peTcS1 = m5tcs1                                                 
     C                   Eval      @peClTr = *Blanks                                                
      *                                                                                             
mod01C***                Eval      $ActualEsOL = EsOL(s5loge)                                       
mod01                    $ActualEsOl = EsOl(sufloge); //Validem la logística real                   
      *                                                                                             
      * ¿Se quiere cambiar a OL?                                                                    
      *                                                                                             
     C                   If        EsOL(@Logistica : $Almacen : $Msstok)                            
mod01                      @Prop = m1prop;                                                          
      *                                                                                             
     C                   Eval      $NuevaEsOL = *On                                                 
      *                                                                                             
      * ¿Existe en almacén?                                                                         
      *                                                                                             
     C                   If        $Msstok                                                          
      *                                                                                             
      * ¿No se permiten envíos directos y no hay almacén OL en s5loge?                              
      *                                                                                             
     C                   If        %SubSt(m5ampl:63:1) = '1'  And               m5noed='1'          
     C                             Not $ActualEsOL                                                  
     C                   Return    'MSG0312'                                                        
     C                   EndIf                                                                      
      *                                                                                             
      * ¿Existe en productiva y tiene estado válido?                                                
      *                                                                                             
E7391 *     C                   If        ErrExisteArt(s5arti : s5vari : s5mode : *On )             
E7391C                   IF        ErrExisteArt(S5ARTI:S5VARI:S5MODE:*On:                           
E7391C                                                              $Almacen)                       
     C                   Return    'MSG0311'                                                        
     C                   EndIf                                                                      
      *                                                                                             
      * Verificar componentes si se trata de un kit                                                 
      *                                                                                             
     C                   If        s5tcoj = '4'                                                     
      *                                                                                             
     C                   Eval      ndarti = s5arti                                                  
     C                   Eval      ndvari = s5vari                                                  
     C                   Eval      ndmode = s5mode                                                  
     C                   Eval      ndtcoj = '1'                                                     
     C     kMscojc       Chain     mscojc                                                           
      *                                                                                             
     C                   If        %Found  And  ndbaja < '1'                                        
      *                                                                                             
     C     kMscojc       SetLL     mscojd                                                           
     C     kMscojc       ReadE     mscojd                                                           
      *                                                                                             
     C                   DoW       Not %EoF                                                         
      *                                                                                             
     C                   If        ndbaja < '1'                                                     
     C                   If        ExisteMsstok($Almacen : ndcomp :                                 
     C                                            ndvar2 : ndmod2)                                  
E7391 *     C                   If        ErrExisteArt(ndcomp : ndvar2 : ndmod2)                    
E7391C                   IF        ErrExisteArt(NDCOMP:NDVAR2:NDMOD2:*OFF:                          
E7391C                                                              $Almacen)                       
     C                   Return    'MSG0313'                                                        
     C                   EndIf                                                  ErrExisteArt        
     C                   Else                                                                       
     C                   Return    'PRD0059'                                                        
     C                   EndIf                                                  ExisteMsstok        
     C                   EndIf                                                  ndbaja<'1'          
      *                                                                                             
     C     kMscojc       ReadE     mscojd                                                           
     C                   EndDo                                                                      
      *                                                                                             
     C                   EndIf                                                  %Found(mscojc)      
      *                                                                                             
     C                   EndIf                                                  s5tcoj='4'          
      *                                                                                             
     C                   Else                                                                       
     C                   Return    'MSG0310'                                                        
     C                   EndIf                                                  $Msstok             
      *                                                                                             
     C                   EndIf                                                  EsOL(@Logistica)    
      *                                                                                             
      * No se permiten cambios EN->EN                                                               
      *                                                                                             
     C                   If        Not $ActualEsOL  And  Not $NuevaEsOL                             
     C                   Return    'MSG0314'                                                        
     C                   EndIf                                                                      
      *                                                                                             
      * Logística no tiene asociado ningún almacén activo                                           
      *                                                                                             
     C                   If        $Almacen = *Blanks                                               
     C                   Return    'MSG1127'                                                        
     C                   EndIf                                                                      
      *                                                                                             
      * Validaciones sobre el artículo en el caso de compra                                         
      *                                                                                             
mod01C* del              If        m5siol <> '2'                                                    
mod01                    if   @Prop <> '1' and @Prop <>'2';                                         
      *                                                                                             
     C                   If        m5ppc2 >= '1'                                                    
     C                   Return    'MSG0318'                                    Compra bloqueada    
     C                   EndIf                                                                      
      *                                                                                             
     C                   If        ErrEquEDI($Almacen)                                              
     C                   Return    'MSG0319'                                    No equ. EDI         
     C                   EndIf                                                                      
      *                                                                                             
     C                   If        ErrPrecCompra()                                                  
     C                   Return    'MSG0504'                                                        
     C                   EndIf                                                                      
      *                                                                                             
     C                   EndIf                                                  m5siol<>'2'         
      *                                                                                             
      * Validaciones Fluidra Direct                                                                 
      *                                                                                             
     C                   If        s5tpe4 = '2'  And  $ActualEsOL                                   
mod01C**                 If        ValidarFD(s5loge : '011')                                        
mod01                    if  ValidarFD(sufloge:'011'); //Validem la logística real                  
     C                   Return    '.'                                                              
     C                   EndIf                                                                      
     C                   EndIf                                                                      
      *                                                                                             
      * Procesar cambio si se han pasado todas las validaciones                                     
      *                                                                                             
mod01C****               If        $Error = *Blanks                                                 
mod01                    if  $Error = *Blanks and Cmd10 = *On; //Sols actualitzem quan premen F1    
      *                                                                                             
      * ED->EN ó ED->ED diferentes =>                                                               
      * Basta con controlar que originalmente sea ED, ya que antes de la llamada a                  
      * esta función se controla que la nueva sea diferente a la original                           
      *                                                                                             
     C                   If        $ActualEsOL                                                      
E7218                    SaveLogToEnvVar(s5loge); //Guardem el valor actual de la logística         
E7218                                              // per poder esborrar els registres en EDTRLP    
     C                   CallP     Desreservar                                                      
     C                   CallP     RecalcularPlz(@Logistica : $NuevaEsOL)                           
     C                   CallP     UpdLogAudit(@Logistica)                                          
     C                   CallP     Evento('009')                                                    
E7218                    SaveLogToEnvVar(*blanks); //Guardem el valor actual de la logística        
E7218                                              // per poder esborrar els registres en EDTRLP    
     C                   EndIf                                                  ED->EN/ED difere    
      *                                                                                             
      * EN->ED ó ED->ED diferentes                                                                  
      *                                                                                             
     C                   If        $NuevaEsOL                                                       
mod01C*                  CallP     LogServM3(@Logistica)                                            
mod01                    LogServM3(@Logistica:@Prop);                                               
     C                   CallP     Desreservar                                                      
     C                   CallP     RecalcularPlz(@Logistica : *On)                                  
     C                   CallP     UpdLogAudit(@Logistica : *On)                                    
     C                   CallP     Evento('010')                                                    
     C                   EndIf                                                  EN/ED->ED difere    
mod01                    gUpdated = *on;                                                            
      *                                                                                             
     C                   EndIf                                                  $Error=*Blanks      
      *                                                                                             
     C                   Return    $Error                                                           
      *                                                                                             
     P                 E                                                                            
                                                                                                    
                                                                                                    
      **************************************************************                                
      * VER SI ES OPERADOR LOGÍSTICO                               *                                
      **************************************************************                                
      *                                                                                             
     P EsOL            B                                                                            
     D EsOL            PI              N                                                            
     D   @Logistica                        Like(s5loge) Value                                       
     D   @Almacen                          Like(m0maga)       Options(*NoPass)                      
     D   @Msstok                       N                      Options(*NoPass)                      
      *                                                                                             
     D  $OL            S               N   Inz(*Off)                                                
      *                                                                                             
     C                   Eval      m0loge = @Logistica                                              
     C                   eval      @pcias = s5cias                                                  
     C                   eval      @pealma = @Logistica                                             
     C                   eval      @petipo = '1'                                                    
     C                   eval      @pdlga = s5dlga                                                  
      *                                                                                             
     C                   CALL      'MM1411'                                                         
     C                   PARM                    @PCIAS                                             
     C                   PARM                    @PeALMA                                            
     C                   PARM                    @PeTIPO                                            
     C                   PARM                    @PDLGA                                             
     C                   PARM      *blanks       @PeRESP                                            
     C                   If        @PeRESP<>*Blanks                                                 
     C                   eval      m0maga=@PeRESP                                                   
     C                   Else                                                                       
     C                   eval      m0maga=@PeALMA                                                   
     C                   Endif                                                                      
      *                                                                                             
     C     kMsalma       SetLL     msalma                                                           
     C     kMsalma       ReadE     msalma                                                           
     C*    kMsalma05     SetLL     msalma05                                                         
     C*    kMsalma05     ReadE     msalma05                                                         
      *                                                                                             
     C                   DoW       Not %EoF  And                                                    
     C                             ( %Parms = 1  Or  Not @Msstok )                                  
      *                                                                                             
     C                   If        m0baja < '1'                                                     
      *                                                                                             
     C                   If        %Parms > 1  And  Not $OL                                         
     C                   Eval      @Almacen = m0maga                                                
     C                   EndIf                                                                      
      *                                                                                             
     C                   If        m0tal1 = '8'                                                     
      *                                                                                             
     C                   If        %Parms = 1                                                       
     C                   Return    *On                                                              
     C                   Else                                                                       
     C                   Eval      $OL = *On                                                        
     C                   Eval      @Almacen = m0maga                                                
     C                   Eval      @msstok = ExisteMsstok(m0maga : s5arti :                         
     C                                                    s5vari : s5mode)                          
     C                   EndIf                                                  %Parms=1            
      *                                                                                             
     C                   EndIf                                                  m0tal1='8'          
      *                                                                                             
     C                   EndIf                                                  m0baja<'1'          
      *                                                                                             
     C*    kMsalma05     ReadE     msalma05                                                         
     C     kMsalma       ReadE     msalma                                                           
     C                   EndDo                                                                      
      *                                                                                             
     C                   Return    $OL                                                              
      *                                                                                             
     P                 E                                                                            
                                                                                                    
                                                                                                    
      **************************************************************                                
      * VER SI ARTÍCULO EXISTE EN MSSTOK                           *                                
      **************************************************************                                
      *                                                                                             
     P ExisteMsstok    B                                                                            
     D ExisteMsstok    PI              N                                                            
     D   @Almacen                          Like(m1maga) Value                                       
     D   @Articulo                         Like(m1arti) Value                                       
     D   @Variacion                        Like(m1vari) Value                                       
     D   @Modelo                           Like(m1mode) Value                                       
      *                                                                                             
     C                   Eval      m1maga = @Almacen                                                
     C                   Eval      m1arti = @Articulo                                               
     C                   Eval      m1vari = @Variacion                                              
     C                   Eval      m1mode = @Modelo                                                 
     C     kMsstok       Chain     msstok                                                           
     C                   Return    %Found                                                           
      *                                                                                             
     P                 E                                                                            
                                                                                                    
                                                                                                    
      **************************************************************                                
      * CONTROLAR SI EXISTE ARTÍCULO EN ALMACÉN                    *                                
      **************************************************************                                
      *                                                                                             
     P ErrExisteArt    B                                                                            
     D ErrExisteArt    PI              N                                                            
     D   @Articulo                         Like(s5arti) Value                                       
     D   @Variacion                        Like(s5vari) Value                                       
     D   @Modelo                           Like(s5mode) Value                                       
E7391D   @ArtPed                       N                Value                                       
E7391D   @ALMACEN                          LIKE(M1MAGA) Value                                       
E7391 *     D   @ArtPed                       N                Value Options(*NoPass)               
      *                                                                                             
     D  $CiaD          S                   Like(s5cias)                                             
      *                                                                                             
     C                   Eval      $CiaD = @pCias                                                   
      *                                                                                             
     C                   Eval      c0prvr = m1prvr                                                  
     C                   If        c0prvr = *blanks                                                 
     C                   Eval      c0prvr = m5prvr                                                  
     C                   EndIf                                                                      
     C     kPuprov       Chain     puprov                                                           
      *                                                                                             
     C                   If        %Found                                                           
      *                                                                                             
E7391 *     C                   If        %Parms = 4  And  @ArtPed                                  
E7391C                   IF        @ArtPed                                                          
     C                   Eval      @peMonP = c0mone                                                 
     C                   Eval      @peClTr = c0cltr                                                 
     C                   EndIf                                                                      
      *                                                                                             
     C                   If        %SubSt(c0amp2:1:1) <> '2'                    c0pevt              
E7391 *     C                   Eval      u0clp0 = m1prvr                                           
E7391C                   EVAL      U0CLP0 = C0PRVR                                                  
     C     kUtcom0       Chain     utcom0                                                           
     C                   If        %Found                                                           
     C                   Monitor                                                                    
     C                   Eval      $CiaD = %Int(u0cia1)                                             
     C                   On-Error                                                                   
     C                   EndMon                                                                     
     C                   EndIf                                                                      
     C                   EndIf                                                                      
E7391 * Txapu per IBERSPA: està en M3 però és Legacy                                                
E7391C                   IF        U0CIA1 = '018'                                                   
E7391C                   RETURN    *OFF                                                             
E7391C                   ENDIF                                                                      
      *                                                                                             
     C                   Eval      c3prvr = c0prvr                                                  
     C                   Eval      c3arvm = @Articulo + @Variacion + @Modelo                        
     C     kPuprp0       Chain     puprp0                                                           
      *                                                                                             
     C                   If        %Found                                                           
      *                                                                                             
E7391 *     C                   If        %Parms = 4  And  @ArtPed                                  
E7391C                   If        @ArtPed                                                          
     C                   Eval      @pePrvr = c3prvr                                                 
     C                   If        c3arvp <> *Blanks                                                
     C                   Eval      @peArVP = c3arvp                                                 
     C                   EndIf                                                                      
     C                   If        c3tcst <> *Blanks                                                
     C                   Eval      @peTcS1 = c3tcst                                                 
     C                   EndIf                                                                      
     C                   EndIf                                                                      
      *                                                                                             
     C                   EndIf                                                  %Found(puprp0)      
      *                                                                                             
     C                   If        %Found(puprp0)  And  c3arvp <> *Blanks  And                      
E7391C                             NOT ErrExisteArt2($CiaD : c3arvp:@ALMACEN)                       
E7391 *     C                             Not ErrExisteArt2($CiaD : c3arvp)                         
     C                   Return    *Off                                                             
     C                   Endif                                                                      
      *                                                                                             
E7391 *     C                   Return    ErrExisteArt2($CiaD : c3arvm)                             
E7391C                   RETURN    ErrExisteArt2($CiaD : c3arvm:@ALMACEN)                           
      *                                                                                             
     C                   Else                                                                       
     C                   Return    *On                                                              
     C                   EndIf                                                  %Found(puprov)      
      *                                                                                             
     C                   Return    *Off                                                             
      *                                                                                             
     P                 E                                                                            
      *                                                                                             
      *                                                                                             
     P ErrExisteArt2   B                                                                            
     D ErrExisteArt2   PI              N                                                            
     D   @CiaD                             Like(c3cias) Value                                       
     D   @Articulo                         Like(c3arvp) Value                                       
E7391D   @ALMACEN                          Like(M1MAGA) Value                                       
E7391 *                                                                                             
E7391DCRESP            S                   LIKE(M1MAGA) INZ                                         
      *                                                                                             
     C                   Eval      ppcias = %EditC(@CiaD:'X')                                       
     C     ppcias        Chain     pmlibl                                                           
      *                                                                                             
     C                   If        %Found  And %SubSt(ppbl10:9:1) = 'V'         ¿Productiva M3?     
      *                                                                                             
     C                   Call      'GX0150'                                                         
     C                   Parm      ppcias        @peDivi                                            
     C                   Parm      sdsUsr        @peUser                                            
     C     zxVal         Parm      *Blanks       @peVal                                             
      *                                                                                             
E7391 *     C                   Eval      mmcono = mxCono                                           
E7391 *     C                   Eval      mmitno = @Articulo                                        
E7391 *     C     kMitmas00     Chain     mitmas00                                                  
E7391 *     C                   Return    Not %Found  Or                                            
E7263C*                            mmstat < '20'  Or  mmstat > '50'                                 
E7391 *E7263C                             %char(mmstat)<'20'  Or  %char(mmstat)>'50'                
E7391 *                                                                                             
E7391 * Traduir el codi de magatzem AS a M3                                                         
E7391                    pMM1411(S0CIAS:@ALMACEN:'2':*BLANKS:cresp);                                
E7391C                   IF        CRESP<>*BLANKS                                                   
E7391C                   EVAL      MBWHLO = %TRIM(CRESP)                                            
E7391C                   ELSE                                                                       
E7391C                   EVAL      MBWHLO = @ALMACEN                                                
E7391C                   ENDIF                                                                      
E7391C                   EVAL      MBCONO = MXCONO                                                  
E7391C                   EVAL      MBITNO = @Articulo                                               
E7391C     KMITBAL00     CHAIN     MITBAL00                                                         
E7391C                   RETURN    NOT %FOUND(MITBAL00) OR                                          
E7263C                             %CHAR(MBSTAT)<'20'  OR  %CHAR(MBSTAT)>'50'                       
E7391 *                                                                                             
      *                                                                                             
     C                   Else                                                   ¿Productiva AS?     
      *                                                                                             
     C                   Close (E) msarti10                                                         
     C                   Eval      File_MSARTI10 = 'PURLIBF' + PPCIAS +                             
     C                                             '/MSARTI10'                                      
     C                   Open (E)  msarti10                                                         
      *                                                                                             
     C                   If        %Open(msarti10)                                                  
E7391C                   Eval      mm5cias = @CiaD                                                  
     C                   Eval      mm5arti = %SubSt(@Articulo:1:15)                                 
     C                   Eval      mm5vari = %SubSt(@Articulo:16:3)                                 
     C                   Eval      mm5mode = %SubSt(@Articulo:19:3)                                 
     C     kMsarti00     Chain     msarti10                                                         
     C                   Return    Not %Found  Or  mm5baja = '1'                                    
     C                   Else                                                                       
E7391 *     C                   Return    *On                                                       
E7391C                   RETURN    *OFF                                                             
     C                   EndIf                                                  %Open(msarti10)     
      *                                                                                             
     C                   EndIf                                                  %Found(pmlibl)..    
      *                                                                                             
     P                 E                                                                            
                                                                                                    
                                                                                                    
      **************************************************************                                
      * VALIDAR EQUIVALENCIA EDI                                   *                                
      **************************************************************                                
      *                                                                                             
     P ErrEquEDI       B                                                                            
     D ErrEquEDI       PI              N                                                            
     D   @Almacen                          Like(m1maga) Value                                       
      *                                                                                             
     C                   Eval      m1maga = @Almacen                                                
     C                   Eval      m1arti = s5arti                                                  
     C                   Eval      m1vari = s5vari                                                  
     C                   Eval      m1mode = s5mode                                                  
     C     kMsstok       Chain     msstok                                                           
      *                                                                                             
     C                   If        %Found  And  m1prvr <> *Blanks                                   
      *                                                                                             
     C                   Eval      c0prvr = m1prvr                                                  
     C     kPuprov       Chain     puprov                                                           
      *                                                                                             
     C                   If        %Found  And  %SubSt(c0amp2:1:1) <> '2'                           
      *                                                                                             
     C                   Eval      u0clp0 = m1prvr                                                  
     C     kUtcom0       SetLL     utcom0                                                           
     C                   Return    Not %Equal                                                       
      *                                                                                             
     C                   EndIf                                                  %Found(puprov)..    
      *                                                                                             
     C                   EndIf                                                  %Found(msstok)..    
      *                                                                                             
     C                   Return    *Off                                                             
      *                                                                                             
     P                 E                                                                            
                                                                                                    
                                                                                                    
      **************************************************************                                
      * VALIDAR PRECIO DE COMPRA                                   *                                
      **************************************************************                                
      *                                                                                             
     P ErrPrecCompra   B                                                                            
     D ErrPrecCompra   PI              N                                                            
      *                                                                                             
      ************                                                                                  
                                                                                                    
MOD02C                   Eval      @peTcoj = *Blanks                                                
MOD02C                   Eval      NDCIAS  = S5CIAS                                                 
MOD02C                   Eval      NDARTI  = S5ARTI                                                 
MOD02C                   Eval      NDVARI  = S5VARI                                                 
MOD02C                   Eval      NDMODE  = S5MODE                                                 
MOD02C     KMSCOJC       SETLL     MSCOJC                                                           
MOD02C     KMSCOJC       READE     MSCOJC                                 83                        
MOD02C                   DOW       READ1=*OFF                                                       
MOD02C                   IF        NDTCOJ>='1' AND NDTCOJ<='3'                                      
MOD02C                             AND NDBAJA<'1'                                                   
MOD02C                   EVAL      @PETCOJ=NDTCOJ                                                   
MOD02C                   LEAVE                                                                      
MOD02C                   ELSE                                                                       
MOD02C     KMSCOJC       READE     MSCOJC                                 83                        
MOD02C                   ENDIF                                                                      
MOD02C                   ENDDO                                                                      
      ************                                                                                  
MOD02C*                  If        s5tcoj <> '4'                                                    
MOD02C*                  Eval      @peTCoj = s5tcoj                                                 
MOD02C*                  Else                                                                       
MOD02C*                  Eval      @peTcoj = *Blanks                                                
MOD02C*                  EndIf                                                                      
     C                                                                                              
     C                   Eval      @peArVM = s5arti + s5vari + s5mode                               
      *                                                                                             
     C                   If        %Found(msstok)  And  m1prvr <> *Blanks                           
     C                   Eval      @pePrvr = m1prvr                                                 
     C                   Else                                                                       
     C                   Eval      @pePrvr = m5prvr                                                 
     C                   EndIf                                                                      
      *                                                                                             
      * Precios especiales de compra según cliente                                                  
      *                                                                                             
     C                   If        %Found(pmempr)  And  p7cpp1 = '1'                                
      *                                                                                             
     C                   Call      'PU2601'                                                         
     C                   Parm      s5cias        @peCias                                            
     C                   Parm      s5cust        @peCust                                            
     C                   Parm                    @pePrvr                                            
     C                   Parm                    @peArVM                                            
     C                   Parm                    @peTCoj                                            
     C                   Parm      *Date         @peFPed                                            
     C                   Parm      s5cant        @peCant                                            
     C                   Parm      s5unim        @peUniM                                            
     C                   Parm                    @peMonP                                            
     C                   Parm      *Blanks       @peMonB                                            
     C                   Parm      0             @peZxCo                                            
     C                   Parm                    @peClTr                                            
     C                   Parm      0             @pePrec                                            
     C                   Parm      0             @peDto1                                            
     C                   Parm      0             @peDto2                                            
     C                   Parm      0             @peDto3                                            
     C                   Parm      0             @peDto4                                            
     C                   Parm      *Blanks       @peMone                                            
     C                   Parm      0             @peCadP                                            
     C                   Parm      *Blanks       @peUnDP                                            
     C                   Parm      *Blanks       @peTpPr                                            
     C                   Parm                    @peErr                                             
      *                                                                                             
     C                   If        @peErr < '1' And  @peTpPr <> '5'                                 
     C                   Return    *Off                                                             
     C                   EndIf                                                                      
      *                                                                                             
     C                   EndIf                                                  %Found(pmempr)..    
      *                                                                                             
      * Si no hay precio especial mirar precio normal                                               
      *                                                                                             
     C                   Call      'PU2600'                                                         
     C                   Parm      s5cias        @peCias                                            
     C                   Parm                    @pePrvr                                            
     C                   Parm                    @peArVM                                            
     C                   Parm                    @peTCoj                                            
     C                   Parm      *Date         @peFPed                                            
     C                   Parm      s5cant        @peCant                                            
     C                   Parm      s5unim        @peUniM                                            
     C                   Parm                    @peMonP                                            
     C                   Parm      *Blanks       @peMonB                                            
     C                   Parm      0             @peZxCo                                            
     C                   Parm                    @peClTr                                            
     C                   Parm      0             @pePrec                                            
     C                   Parm      0             @peDto1                                            
     C                   Parm      0             @peDto2                                            
     C                   Parm      0             @peDto3                                            
     C                   Parm      0             @peDto4                                            
     C                   Parm      *Blanks       @peMone                                            
     C                   Parm      0             @peCadP                                            
     C                   Parm      *Blanks       @peUnDP                                            
     C                   Parm                    @peTcS1                                            
     C                   Parm      *Blanks       @peTpPr                                            
     C                   Parm      *Blanks       @pePrMo                                            
     C                   Parm      'F'           @peErr                                             
      *                                                                                             
     C                   Return    @pePrec = 0                                                      
      *                                                                                             
     P                 E                                                                            
                                                                                                    
                                                                                                    
      **************************************************************                                
      * VALIDACIONES FLUIDRA DIRECT                                *                                
      **************************************************************                                
      *                                                                                             
     P ValidarFD       B                                                                            
     D ValidarFD       PI              N                                                            
     D   @Logistica                        Like(s5loge) Value                                       
     D   @EDAu                        3    Value                                                    
      *                                                                                             
     C                   CALL      'ED0051'                                                         
     C                   Parm      s5cias        @peCias                                            
     C                   Parm      s5dlga        @peDlga                                            
     C                   Parm      s5npco        @peNPCo                                            
     C                   Parm      s5tped        @peTPed                                            
     C                   Parm      s5datp        @peDatP                                            
     C                   Parm      s5nopl        @peNoPl                                            
     C                   Parm      s5line        @peLine                                            
     C                   Parm      *Blanks       @peArVM                                            
     C                   Parm      *Blanks       @peCom2                                            
     C                   Parm      s0cust        @peCust                                            
     C                   Parm      s0tdi1        @peTDi1                                            
     C                   Parm      @EDAu         @peEDAu                                            
     C                   Parm      0             @peLogi                                            
     C                   Parm      0             @peOrig                                            
     C                   Parm      1             @peInte                                            
     C                   Parm      *Blanks       @peErr                                             
     C                   Parm      *Blanks       @peInci                                            
     C                   Parm      @Logistica    @peLogE                                            
      *                                                                                             
     C                   Return    @peErr <> *Blanks                                                
      *                                                                                             
     P                 E                                                                            
                                                                                                    
                                                                                                    
      **************************************************************                                
      * VER SI ARTÍCULO ES DE SERVICIOS                            *                                
      **************************************************************                                
      *                                                                                             
     P EsServicio      B                                                                            
     D EsServicio      PI              N                                                            
      *                                                                                             
     C                   Eval      mm5arti = ss5arti                                                
     C                   Eval      mm5vari = ss5vari                                                
     C                   Eval      mm5mode = ss5mode                                                
     C     kMsarti00     Chain     msarti00                                                         
      *                                                                                             
     C                   If        %Found                                                           
     C                   Eval      pectab = 'TIPG'                                                  
     C                   Eval      peclta = mm5tipg                                                 
     C     kPmtabd       Chain     pmtabd                                                           
     C                   Return    %Found  And  pebl61 = '1'                                        
     C                   EndIf                                                  %Found(msarti00)    
      *                                                                                             
     C                   Return    *Off                                                             
      *                                                                                             
     P                 E                                                                            
                                                                                                    
                                                                                                    
      **************************************************************                                
      * DESRESERVAR MATERIALES                                     *                                
      **************************************************************                                
      *                                                                                             
     P Desreservar     B                                                                            
     D Desreservar     PI                                                                           
      *                                                                                             
     C                   Call      'CO2632'                                                         
     C                   Parm      s5cias        @peCias                                            
     C                   Parm      s5dlga        @peDlga                                            
     C                   Parm      *Blanks       @peTNPe                                            
     C                   Parm      s5npco        @peNPCo                                            
     C                   PARM      s5TPed        @PeTped                                            
     C                   PARM      s5DatP        @peDatP                                            
     C                   PARM      s5nopl        @peNoPl                                            
     C                   PARM      s5line        @peLine                                            
     C                   PARM      0             @peCant                                            
     C                   PARM      *Blanks       @peUniM                                            
     C                   PARM      *Blanks       @peArVM                                            
     C                   PARM      *Blanks       @peNRes                                            
     C                   PARM      *Blanks       @peErr                                             
      *                                                                                             
     P                 E                                                                            
                                                                                                    
                                                                                                    
      **************************************************************                                
      * RECALCULAR PLAZOS DE ENTREGA                               *                                
      **************************************************************                                
      *                                                                                             
     P RecalcularPlz   B                                                                            
     D RecalcularPlz   PI                                                                           
     D   @Logistica                        Like(s5loge) Value                                       
     D   @OL                           N                Value                                       
      *                                                                                             
     D  $FePL          S                   Like(s5frep) Inz(0)                                      
     D  $TPla          S                   Like(s5tpla) Inz(*Blanks)                                
     D  $Week          S                   Dim(54) Like(ss5frre)                                    
     D  $Disp          S              8    Dim(54)                                                  
      *                                                                                             
     C     kCodepe       Chain     codepe                                                           
     C                   If        @OL                                                              
     C                   Eval      s5tpe4 =  '2'                                                    
     C                   Else                                                                       
     C                   Eval      s5tpe4 = *Blanks                                                 
     C                   EndIf                                                                      
     C                   Update(E) rcodepe                                                          
      *                                                                                             
      * Sólo se recalcula si S0COEN <> '3'                                                          
      *                                                                                             
     C                   If        s0coen <> '3'                                                    
      *                                                                                             
     C                   If        s5tcoj = '4'                                                     
      *                                                                                             
     C                   Eval      ndarti = s5arti                                                  
     C                   Eval      ndvari = s5vari                                                  
     C                   Eval      ndmode = s5mode                                                  
     C                   Eval      ndtcoj = s5tcoj                                                  
     C     kMscojc       SetLL     mscojd                                                           
     C     kMscojc       ReadE     mscojd                                                           
      *                                                                                             
     C                   DoW       Not %EOF                                                         
      *                                                                                             
     C                   If        ndbaja < '1'                                                     
      *                                                                                             
     C                   Eval      @peCant = s5cant * ndcant                                        
      *                                                                                             
     C                   Call      'CO2610'                                                         
     C                   Parm      s5cias        @peCias                                            
     C                   Parm      s5dlga        @peDlga                                            
     C                   Parm      ndcomp        @peArti                                            
     C                   Parm      ndvar2        @peVari                                            
     C                   Parm      ndmod2        @peMode                                            
     C                   Parm      *Blanks       @peTcoj                                            
     C                   Parm      s5frep        @peFrre                                            
     C                   Parm      0             @peFDDS                                            
     C                   Parm                    @peCant                                            
     C                   Parm      s5unim        @peUniM                                            
     C                   Parm      @Logistica    @peLogE                                            
     C                   Parm      *Blanks       @peTPla                                            
     C                   Parm      '*'           @peErr                                             
     C                   Parm      s5npco        @peNPCo                                            
     C                   Parm      s5tped        @peTPed                                            
     C                   Parm      s5datp        @peDatp                                            
     C                   Parm      s5nopl        @peNoPl                                            
     C                   Parm      s5line        @peLine                                            
      *                                                                                             
     C                   If        @peFrre > $FePl                                                  
     C                   Eval      $FePl = @peFrre                                                  
     C                   Eval      $TPla = @peTPla                                                  
     C                   EndIf                                                                      
      *                                                                                             
     C                   EndIF                                                  ndbaja<'1'          
      *                                                                                             
     C     kMscojc       ReadE     mscojd                                                           
     C                   EndDo                                                                      
      *                                                                                             
     C                   If        $FePl > 0                                                        
     C                   Eval      @peTPla = $TPla                                                  
     C                   EndIf                                                                      
      *                                                                                             
     C                   Else                                                                       
      *                                                                                             
     C                   Call      'CO2610'                                                         
     C                   Parm      s5cias        @peCias                                            
     C                   Parm      s5dlga        @peDlga                                            
     C                   Parm      s5arti        @peArti                                            
     C                   Parm      s5vari        @peVari                                            
     C                   Parm      s5mode        @peMode                                            
     C                   Parm      *Blanks       @peTcoj                                            
     C                   Parm      s5frep        @peFrre                                            
     C                   Parm      0             @peFDDS                                            
     C                   Parm      s5cant        @peCant                                            
     C                   Parm      s5unim        @peUniM                                            
     C                   Parm      @Logistica    @peLogE                                            
     C                   Parm      *Blanks       @peTPla                                            
     C                   Parm      '*'           @peErr                                             
     C                   Parm      s5npco        @peNPCo                                            
     C                   Parm      s5tped        @peTPed                                            
     C                   Parm      s5datp        @peDatp                                            
     C                   Parm      s5nopl        @peNoPl                                            
     C                   Parm      s5line        @peLine                                            
      *                                                                                             
     C                   EndIf                                                  s5tcoj='4'          
      *                                                                                             
     C     kCodepe       Chain     codepe                                                           
     C                   Eval      s5tpla = @peTPla                                                 
     C                   Update(E) rcodepe                                                          
      *                                                                                             
      * Ajustar a semana                                                                            
      *                                                                                             
     C                   Eval      thdlga = s5dlga                                                  
     C     kCoppec       Chain     coppec                                                           
      *                                                                                             
     C                   If        %Found                               And                         
     C                             thtars = '1'  And  s0pped <> '99'    And                         
     C                             (s0coen <= '0'  Or  s0coen = '2')    And                         
     C                             ((thweek >= '1'  And  s0tpe4 <> '2')  Or                         
     C                              (thweek = '2'))                                                 
      *                                                                                             
     C                   Clear                   $Week                                              
      *                                                                                             
     C     kCodepeR      SetLL     codepe02                                                         
     C     kCodepeR      ReadE (N) codepe02                                                         
      *                                                                                             
     C                   DoW       Not %EoF                                                         
      *                                                                                             
     C                   If        ss5stul <> '5'   And                                             
     C                             ss5ncoe <= '00'  And                                             
     C                             Not EsServicio()                                                 
      *                                                                                             
     C                   Call      'MM2707'                                                         
     C                   Parm      ss5cias       @peCias                                            
     C                   Parm      ss5frre       @peFrre                                            
     C                   Parm      0             @peWeek                                            
     C                   Parm      *Blanks       @peErr                                             
      *                                                                                             
     C                   If        $Week(@peWeek) < ss5frre                                         
     C                   Eval      $Week(@peWeek) = ss5frre                                         
     C                   Eval      $Disp(@peWeek) = ss5disp                                         
     C                   EndIf                                                                      
      *                                                                                             
     C                   EndIf                                                                      
      *                                                                                             
     C     kCodepeR      ReadE (N) codepe02                                                         
     C                   EndDo                                                                      
      *                                                                                             
     C     kCodepeR      SetLL     codepe02                                                         
     C     kCodepeR      ReadE     codepe02                                                         
      *                                                                                             
     C                   DoW       Not %EoF                                                         
      *                                                                                             
     C                   If        ss5stul <> '5'   And                                             
     C                             ss5ncoe <= '00'  And                                             
     C                             Not EsServicio()                                                 
      *                                                                                             
     C                   Call      'MM2707'                                                         
     C                   Parm      ss5cias       @peCias                                            
     C                   Parm      ss5frre       @peFrre                                            
     C                   Parm      0             @peWeek                                            
     C                   Parm      *Blanks       @peErr                                             
      *                                                                                             
     C                   If        ss5frre < $Week(@peWeek)                                         
      *                                                                                             
     C                   Eval      ss5Frre = $Week(@peWeek)                                         
     C                   Eval      ss5disp = $Disp(@peWeek)                                         
     C                   Eval      ss5frrr = ss5frre                                                
     C                   Update(E) rcodepe02                                                        
      *                                                                                             
     C                   Call      'CO2616'                                                         
     C                   Parm      ss5cias       @peCias                                            
     C                   Parm      ss5dlga       @peDlga                                            
     C                   Parm      ss5npco       @peNPCo                                            
     C                   Parm      ss5tped       @peTPed                                            
     C                   Parm      ss5datp       @peDatP                                            
     C                   Parm      ss5NoPl       @peNoPl                                            
     C                   Parm      ss5arti       @peArti                                            
     C                   Parm      ss5Vari       @peVari                                            
     C                   Parm      ss5Mode       @peMode                                            
     C                   Parm      ss5line       @peLine                                            
     C                   Parm      '*'           @peErr                                             
     C                   Parm      '12'          @peTipP                                            
      *                                                                                             
     C                   EndIf                                                  ss5frre <           
      *                                                                         $Week(@peWeek)      
     C                   EndIf                                                                      
      *                                                                                             
     C     kCodepeR      ReadE     codepe02                                                         
     C                   EndDo                                                                      
      *                                                                                             
     C                   EndIf                                                  %Found(coppec)..    
      *                                                                                             
     C                   EndIf                                                  s0coen<>'3'         
      *                                                                                             
     P                 E                                                                            
                                                                                                    
                                                                                                    
      **************************************************************                                
      * MODIFICAR LOGÍSTICA Y GRABAR AUDITORIA                     *                                
      **************************************************************                                
      *                                                                                             
     P UpdLogAudit     B                                                                            
     D UpdLogAudit     PI                                                                           
     D   @Logistica                        Like(s5loge) Value                                       
     D   @Coenvios                     N                Value Options(*NoPass)                      
      *                                                                                             
     C                   Call      'UT2725'                                                         
     C                   Parm      s5cias        @peCias                                            
     C                   Parm      s5dlga        @peDlga                                            
     C                   Parm      s5npco        @peNpCo                                            
     C                   Parm      s5tped        @peTPed                                            
     C                   Parm      s5datp        @peDatP                                            
     C                   Parm      s5nopl        @peNoPl                                            
     C                   Parm      s5line        @peLine                                            
     C                   Parm      s0cust        @peCust                                            
     C                   Parm      'CODEPE'      @peFile                                            
     C                   Parm      'S5LOGE'      @peFild                                            
     C                   Parm      'CO51'        @peCAud                                            
     C                   Parm      s5loge        @peVal1                                            
     C                   Parm      @Logistica    @peVal2                                            
     C                   Parm      *Blanks       @peAcc2                                            
     C                   Parm      *Blanks       @peErr                                             
     C                   Parm      sdsPgm        @pePgMo                                            
     C                   Parm      *Blanks       @peArVM                                            
      *                                                                                             
     C     kCodepe       Chain     codepe                                                           
      *                                                                                             
     C                   If        s0coen <> '3'  And                                               
     C                             %Parms = 2  And  @Coenvios                                       
     C                   Eval      dsCtrlCoen(s5line).Logistica = @Logistica                        
     C                   Eval      dsCtrlCoen(s5line).Tratar = 'S'                                  
     C                   EndIf                                                                      
      *                                                                                             
mod01C**                 Eval      s5loge = @Logistica                                              
mod01                    if @Prop<>'1' and @Prop<>'2';                                              
mod01                      s5loge=SwapLog(s5cias:s5dlga:@Logistica:'V');                            
mod01                    else;                                                                      
mod01                      s5loge=@Logistica;                                                       
mod01                    endif;                                                                     
     C                   Update(E) rcodepe                                                          
      *                                                                                             
     P                 E                                                                            
                                                                                                    
                                                                                                    
      **************************************************************                                
      * EJECUTAR EVENTO                                            *                                
      **************************************************************                                
      *                                                                                             
     P Evento          B                                                                            
     D Evento          PI                                                                           
     D   @EDAu                        3    Value                                                    
      *                                                                                             
     C                   If        @EDAu ='010'                                                     
      *                                                                                             
     C                   Call      'ED0100'                                                         
     C                   Parm      s5cias        @peCias                                            
     C                   Parm      s5dlga        @peDlga                                            
     C                   Parm      s5npco        @peNPCo                                            
     C                   Parm      s5tped        @peTped                                            
     C                   Parm      s5datp        @peDatp                                            
     C                   Parm      s5nopl        @peNoPl                                            
     C                   Parm      s5line        @peLine                                            
     C                   Parm      0             @peCia2                                            
     C                   Parm      *Blanks       @peDlg2                                            
     C                   Parm      *Blanks       @peNPC2                                            
     C                   Parm      *Blanks       @peTPe2                                            
     C                   Parm      0             @peDat2                                            
     C                   Parm      0             @peNoP2                                            
     C                   Parm      0             @peLin2                                            
     C                   Parm      0             @peLogi                                            
     C                   Parm      0             @peOrig                                            
     C                   Parm      @EDAu         @peEDAu                                            
     C                   Parm      *Blanks       @peErav                                            
     C                   Parm      *Blanks       @peText                                            
     C                   Parm      *Blanks       @peDato                                            
     C                   Parm      1             @peWAud                                            
     C                   Parm      s5cant        @peCant                                            
      *                                                                                             
     C                   EndIf                                                  @EDAu='010'         
      *                                                                                             
      * Sincronizar con pedido de compras cuando sea necesario                                      
      *                                                                                             
     C                   Call      'ED0015'                                                         
     C                   Parm      s5cias        @peCias                                            
     C                   Parm      s5dlga        @peDlga                                            
     C                   Parm      s5npco        @peNPCo                                            
     C                   Parm      s5tped        @peTped                                            
     C                   Parm      s5datp        @peDatp                                            
     C                   Parm      s5nopl        @peNoPl                                            
     C                   Parm      s5line        @peLine                                            
     C                   Parm      @EDAu         @peEDAu                                            
     C                   Parm      *Blanks       @peJobT                                            
     C                   Parm      0             @peFin                                             
      *                                                                                             
      * Envío cabecera                                                                              
      *                                                                                             
     C                   Call      'ED0015'                                                         
     C                   Parm                    @peCias                                            
     C                   Parm                    @peDlga                                            
     C                   Parm                    @peNPCo                                            
     C                   Parm                    @peTped                                            
     C                   Parm                    @peDatp                                            
     C                   Parm                    @peNoPl                                            
     C                   Parm                    @peLine                                            
     C                   Parm                    @peEDAu                                            
     C                   Parm                    @peJobT                                            
     C                   Parm      1             @peFin                                             
      *                                                                                             
     P                 E                                                                            
                                                                                                    
                                                                                                    
      **************************************************************                                
      * LOGISTICA DE SERVICIO DE M3                                *                                
      **************************************************************                                
      *                                                                                             
     P LogServM3       B                                                                            
     D LogServM3       PI                                                                           
     D   @Logistica                        Like(s5loge) Value                                       
mod01d   @Prop                             like(m1Prop) value                                       
      *                                                                                             
     C                   Eval      @peAlma = @Logistica                                             
      *                                                                                             
mod01C*                  If        m5siol <> '2'                                                    
      *                                                                                             
mod01C*                  Eval      pectab = 'INO2'                                                  
mod01C*                  Eval      peclta = 'MAGV' + @Logistica                                     
mod01C*    kPmTabd       Chain     pmtabd                                                           
      *                                                                                             
mod01C*                  If        %Found                                                           
mod01C*                  Eval      @peAlma = pedesc                                                 
mod01C*                  EndIf                                                  %Found(pmtabd)      
      *                                                                                             
mod01C*                  EndIf                                                  m5siol<>'2'         
      *                                                                                             
mod01                    if      @Prop= '1' or  @Prop= '2';                                         
mod01                      return;                                                                  
mod01                    endif;                                                                     
mod01                    setll (s5cias:@Logistica) msalma05;                                        
mod01                    reade (s5cias:@Logistica) msalma05;                                        
mod01                    if not %eof(msalma05);                                                     
mod01                      @peAlma = m0maga;                                                        
mod01                    endif;                                                                     
mod01                                                                                               
     C                   Call      'MM1411'                                                         
     C                   Parm      s5cias        @peCias                                            
     C                   Parm                    @peAlma                                            
     C                   Parm      '2'           @peTipo                                            
     C                   Parm      s5dlga        @peDlga                                            
     C                   Parm                    @peResp                                            
      *                                                                                             
     C                   If        @peResp <> *Blanks                                               
     C                   Eval      @peAlm1 = @peResp                                                
mod01C**                 Else                                                                       
mod01C**                 Eval      @peAlm1 = @Logistica                                             
     C                   EndIf                                                                      
      *                                                                                             
     C                   eval      @pedprvr=@pePrvr                                                 
     C                   eval      @PEdARVP=@peArVP                                                 
      *                                                                                             
      *                                                                                             
     C*                  Call      'ED2530'                                                         
     C*                  Parm      s5cias        @peCias                                            
     C*                  Parm                    @pePrvr                                            
     C*                  Parm                    @peArVP                                            
     C*                  Parm                    @peAlm1                                            
     C*                  Parm                    @peAlm2                                            
     C*                  Parm                    @peInfo                                            
     C                   Call      'ED2530'                                                         
     C                   Parm      s5cias        @peCias                                            
     C                   Parm                    @pedprvr                                           
     C                   Parm                    @PEdARVP                                           
     C                   Parm                    @peAlm1                                            
     C                   Parm                    @peAlm2                                            
     C                   Parm                    @peInfo                                            
      *                                                                                             
     C                   If        @peInfo = 'A'  Or  @peInfo = 'P'                                 
     C     kCodepe       Chain     codepe                                                           
     C                   Eval      s5ncoe = '00'                                                    
     C                   Update(E) rcodepe                                                          
     C                   EndIf                                                  @peInfo             
      *                                                                                             
     P                 E                                                                            
                                                                                                    
                                                                                                    
      **************************************************************                                
      * GESTIÓN DE CAMBIOS EN COENVÍOS                             *                                
      **************************************************************                                
      *                                                                                             
     P Coenvios        B                                                                            
     D Coenvios        PI                                                                           
     D   @Logistica                        Like(s5loge) Value Options(*NoPass)                      
      *                                                                                             
     D  $i             S              4  0                                                          
     D  $CoenvioUnico  S               N                                                            
     D  $LMod          S              4  0 Inz(0)                                                   
     D  $MaxCoenvio    S              2    Inz(*Blanks)                                             
     D  $NuevoCoenvio  S              2                                                             
      *                                                                                             
      * Sin @Logistica => Se inicializa el control de coenvíos.                                     
      * Con @Logistica => Hay que asignar coenvío a la nueva logística.                             
      *                                                                                             
      * Sólo se aplica cuando S0COEN <> '3'                                                         
      *                                                                                             
     C                   If        s0coen <> '3'                                                    
      *                                                                                             
     C                   If        %Parms = 0                                   ¿Inicializar?       
      *                                                                                             
     C                   Clear                   dsCtrlCoen                                         
     C     kCodepeR      SetLL     codepe                                                           
     C     kCodepeR      ReadE (N) codepe                                                           
     C                   DoW       Not %EoF                                                         
     C                   Eval      dsCtrlCoen(s5line).Coenvio = s5ncoe                              
     C                   Eval      dsCtrlCoen(s5line).Logistica = s5loge                            
     C                   Eval      dsCtrlCoen(s5line).Tratar = 'N'                                  
     C     kCodepeR      ReadE (N) codepe                                                           
     C                   EndDo                                                                      
      *                                                                                             
     C                   Eval      zxLineaMaxima = s5line                                           
      *                                                                                             
     C                   Else                                                   ¿Proceso?           
      *                                                                                             
      * Se han modificado todas las líneas => Salir sin cambios                                     
      *                                                                                             
     C                   If        %LookUp('N' : dsCtrlCoen(*).Tratar) = 0                          
     C                   Return                                                                     
     C                   EndIf                                                                      
      *                                                                                             
      * Recorrer las líneas modificadas a tratar                                                    
      *                                                                                             
     C                   DoU       $LMod = 0                                                        
      *                                                                                             
     C                   Eval      $NuevoCoenvio = *Blanks                                          
     C                   Eval      $LMod = %LookUp('S' :                                            
     C                                             dsCtrlCoen(*).Tratar :                           
     C                                             $LMod+1)                                         
      *                                                                                             
     C                   If        $LMod > 0                                                        
      *                                                                                             
      * Búsqueda para determinar:                                                                   
      *  - Si la línea a tratar comparte coenvío con cualquier otra.                                
      *  - Coenvío de la primera línea con la que comparte logística.                               
      *  - Cuál es el máximo coenvío de entre las líneas que no deben tratarse.                     
      *                                                                                             
     C                   Eval      $CoenvioUnico = *On                                              
      *                                                                                             
     C                   For       $i = 1 To zxLineaMaxima                                          
      *                                                                                             
     C                   If        dsCtrlCoen($i) <> *Blanks                                        
      *                                                                                             
     C                   If        $CoenvioUnico  And  $i <> $LMod  And                             
     C                             dsCtrlCoen($i).Coenvio =                                         
     C                             dsCtrlCoen($LMod).Coenvio                                        
     C                   Eval      $CoenvioUnico = *Off                                             
     C                   EndIf                                                  No único            
      *                                                                                             
     C                   If        $NuevoCoenvio = *Blanks  And                                     
     C                             $i <> $LMod  And                                                 
     C                             dsCtrlCoen($i).Logistica = @Logistica                            
     C                   Eval      $NuevoCoenvio = dsCtrlCoen($i).Coenvio                           
     C                   If        Not $CoenvioUnico                                                
     C                   Leave                                                                      
     C                   EndIf                                                  Not $CoenvioUnic    
     C                   ElseIf    dsCtrlCoen($i).Tratar = 'N'  And                                 
     C                             dsCtrlCoen($i).Coenvio > $MaxCoenvio                             
     C                   Eval      $MaxCoenvio = dsCtrlCoen($i).Coenvio                             
     C                   EndIf                                                  Cálc. Coenvíos      
      *                                                                                             
     C                   EndIf                                                  Con datos           
      *                                                                                             
     C                   EndFor                                                 $i                  
      *                                                                                             
      * La línea a tratar es la única de su coenvío => No cambiar e ir a la siguiente.              
      *                                                                                             
     C                   If        Not $CoenvioUnico                                                
      *                                                                                             
      * No se encontró línea con igual logística => Obtener coenvío nuevo.                          
      *                                                                                             
     C                   If        $NuevoCoenvio = *Blanks                                          
     C                   Monitor                                                                    
     C                   EvalR     $NuevoCoenvio=%EditC(%Int($MaxCoenvio)+1:'X')                    
     C                   On-Error                                                                   
     C                   Eval      $NuevoCoenvio = '00'                                             
     C                   EndMon                                                                     
     C                   EndIf                                                                      
      *                                                                                             
      * Modificar coenvío de la línea, si corresponde                                               
      *                                                                                             
     C                   If        $NuevoCoenvio <> *Blanks  And                                    
     C                             $NuevoCoenvio <> dsCtrlCoen($LMod).Coenvio                       
     C                   Eval      s5line = $LMod                                                   
     C     kCodepe       Chain     codepe                                                           
     C                   Eval      s5ncoe = $NuevoCoenvio                                           
     C                   Update(E) rcodepe                                                          
     C                   EndIf                                                  $NuevoCoenvio       
      *                                                                                             
     C                   EndIf                                                  $LMod>0             
      *                                                                                             
     C                   EndIf                                                  Not $CoenvioUnic    
      *                                                                                             
     C                   EndDo                                                  $LMod=0             
      *                                                                                             
     C                   EndIf                                                  @Inz                
      *                                                                                             
     C                   EndIf                                                  s0coen <> '3'       
      *                                                                                             
     C                   Return                                                                     
      *                                                                                             
     P                 E                                                                            
                                                                                                    
      //----------------------------------------------------------------------------------------    
      // SwapLog: Logístiques Virtuals a Reals i a l'inrevés                                       
         dcl-proc SwapLog;                                                                          
         dcl-pi *n like(s5loge);                                                                    
           pCias like(s5cias) const;       // Cias                                                  
           pDlga like(s5dlga) const;       // Delega                                                
           pLoge   like(s5loge) const;       // Logística, sempre logística                         
           pRV  char(1) const;             // Direcció: a Real, a Virtual                           
         end-pi;                                                                                    
         dcl-s  zLoge like(m0loge) inz;                                                             
         dcl-s  ztipo char(1) inz;                                                                  
         dcl-s  zMaga like (m0maga) inz;                                                            
         dcl-s xRetorn like(s5loge) inz;                                                            
         dcl-s cResp like(m0maga) inz;                                                              
         dcl-c kV const('V');                                                                       
         dcl-c kR const('R');                                                                       
                                                                                                    
         select;                                                                                    
         when pRV = kV;  // Volem recuperar logística virtual... han passat un maga Real            
           zMaga = pLoge  ;                                                                         
           ztipo = *blanks;                                                                         
         when pRV = kR;  // Volem logística Real... han passat logística virtual                    
           zMaga = pLoge  ;                                                                         
           ztipo = '1'    ;                                                                         
         endsl;                                                                                     
                                                                                                    
         pMM1411(pCias:zMaga:ztipo:pDlga:cresp);                                                    
                                                                                                    
         select;                                                                                    
         when pRV = kV;  // Volem recuperar logística virtual... han passat un maga Real            
           xRetorn = %trim(cresp) ;                                                                 
         when pRV = kR;  // Volem logística Real... han passat logística virtual                    
           zMaga   = cresp;                                                                         
           // Cerquem la logística Real del maga rebut                                              
           chain (pCias:zMaga) msalma;                                                              
           if %found(msalma);                                                                       
             xRetorn = m0loge;                                                                      
           endif;                                                                                   
           if xRetorn = *blanks;                                                                    
             xRetorn = pLoge;                                                                       
           endif;                                                                                   
         endsl;                                                                                     
                                                                                                    
         return xRetorn;                                                                            
                                                                                                    
         end-proc;                                                                                  
E7218 // SaveLogToEnvVar(s5loge)                                                                    
E7218  dcl-proc SaveLogToEnvVar;                                                                    
E7218   dcl-pi *n;                                                                                  
E7218     pLoge like(s5loge) value;                                                                 
E7218   end-pi;                                                                                     
E7218   dcl-pr putenv int(10) extproc('putenv');                                                    
E7218     *n pointer value options(*string:*trim);                                                  
E7218   end-pr;                                                                                     
E7218   // Si ens han cridat estem en una modificació de línia que passa de ED a NO ED i és Kit     
E7218   // En aquest cas guardarem la logística que teniem ja que, en el cas de Kits de compra,     
E7218   // programa ED0015 no pot trobar-lo en PUPRCJ ja que hem modificat la logística del CODE    
E7218   // Variable d'Entorn   ED0015_LOGOLD                                                        
E7218                                                                                               
E7218   putenv('ED0015_LOGOLD=' + pLoge) ;                                                          
E7218                                                                                               
E7218  end-proc;                                                                                    
