      **************************************************************                                
      * APLICACIÓ: MÒDUL DE COMPRES                                *                                
      **************************************************************                                
      * TITOL: ED3061  © Fluidra                                   *                                
      * DATA CREACIO:  xx/yy/2022                                  *                                
      * FUNCIO DEL PROGRAMA: Desglose de Entregas por Origen exped *                                
      *                                                            *                                
      * DOCUMENTACIO:                                              *                                
      *                                                            *                                
      * ZXOPT1 = NOM DEL PROCÉS                                    *                                
      *        - SN = SUBFITXER N.          N=[01,02,...,99]       *                                
      *        - N TAMBÉ EQUIVAL AL NÚMERO DE FORMAT DEL SFL       *                                
      *          I COINCIDEIX AMB EL Nº DE LÒGIC (ESSENT N=00 EL   *                                
      *          FITXER FÍSIC)                                     *                                
      * ZXOPT2 = RUTINA DINTRE DEL PROCÉS                          *                                
      *        - 'INZ'= INICILITZAR                                *                                
      *        - 'DSP'= VISUALITZA DE PANTALLA                     *                                
      *        - 'CHK'= VALIDACIÓ DE LA PANTALLA                   *                                
      *        - 'CLR'= NETEJA DEL SFL                             *                                
      *        - 'UPD"= ACTUALITZACIONS DELS FITXERS               *                                
      *                                                            *                                
      * ZXNNN00= Últim nº de registre carregat en subarxiu         *                                
      * ZXNRR00= Numerador de registres de subarxiu                *                                
      * ZXCOUNT= ZXNRR00 del 1er registre de la últ. pag.          *                                
      *          que visualizaba el usuario                        *                                
      * ZXLOP00= Numerador de registres en carrega de pantalla     *                                
      * SUFRCDN= SFLRCDNBR del subarxiu                            *                                
      * PREFIXE DE CAMP: CCC- (CAMP COMÚ DE CAPÇALERA: CAMP QUE EL *                                
      *        SEU CONTINGUT NO VARIA EN LES ALTRES CAPÇALERES DE  *                                
      *        L'APLICACIÓ. P.EX.: NOM DEL PGM O DEL TREBALL)      *                                
      *                                                            *                                
      * CS_(NOM): COMMON SUBRUTINE (COL·LOCADES FINAL PGM)        *                                 
      * @PE(NOM) : PARAMETRES D'EXPORTACIÓ                         *                                
GP551 //****************************************************************************************    
IT244* Fecha Inicio: 30/05/2022          Marca: IT244 (ITOM-244B) *                                
IT244*       Autor : Manuel Alonso                                *                                
IT244* Descripción : Se copia ED0061 a nuevo ED3061 y se hacen    *                                
IT244*               modificaciones para decisión DOM por         *                                
IT244*               disponibilidad (versión 3).                  *                                
IT244*               También se resuelven errores encontrados en  *                                
IT244*               el ED0061 original.                          *                                
IT244**************************************************************                                
mod01 * correccions varies 2208xx                                                                   
mod02 * s'elimina bucle ed0050w, ja que NO serveix per DOOM3                                        
mod03 * Correccions varies 221010: SIOL, ED0051, reduir crides i accessos OL2-216                   
NAP45**************************************************************                                
NAP45* DATA DE MODIFICACIÓ: 03/06/2022  MARCA: NAP45              *                                
NAP45* AUTOR:        Raul Fernández                               *                                
NAP45* DOCUMENTACIÓ: Coger Coenvío por defecto de dlga= ' '       *                                
NAP45**************************************************************                                
E7391* DATA DE MODIFICACIÓ: 03/06/2022  MARCA: E7391                                               
E7391* AUTOR:        MMontana                                                                      
E7391* DOCUMENTACIÓ: Afegir validació del status de l'article/magatzem en M3                       
E7391*  Tota la codificació s'ha realitzat en format RPG de 1994                                   
E7391* RPG IV, a.k.a. RPGLE was released in 1994 as part of the V3R2 release of OS/400             
E7391******************************************************************************************    
      *                                                                                             
     H DATEDIT(*YMD/) OPTION(*NODEBUGIO:*SRCSTMT)                                                   
      *                                                                                             
IT244FED3061FM  CF   E             WORKSTN INFDS(SFLDS)                                             
     F                                     SFILE(SUFD:ZXNRR00)                                      
FQ943F                                     USROPN                                                   
     FCODEPE26  IF   E           K DISK    RENAME(RCODEPE:R26)                                      
     FED0050W   UF   E           K DISK                                                             
     FCOCAPE    UF   E           K DISK                                                             
     FCODEPE    UF   E           K DISK                                                             
     FCOCLIN    IF   E           K DISK                                                             
     FCOCAIM    IF   E           K DISK                                                             
     FMSDIV0    IF   E           K DISK                                                             
     FMSIVAS    IF   E           K DISK                                                             
     FPMUNAL    IF   E           K DISK                                                             
     FMSTSCA    IF   E           K DISK                                                             
     FMSARTI00  IF   E           K DISK                                                             
     FMSALMA    IF   E           K DISK                                                             
IT228FMSALMA08  IF   E           K DISK    rename(rmsalma:rmsalma08) usropn                         
     FMSLOGI    IF   E           K DISK                                                             
     FCODIPE    IF   E           K DISK                                                             
     FMSPAIS    IF   E           K DISK                                                             
     FMSSGGA    IF   E           K DISK                                                             
     FPMTABD    IF   E           K DISK                                                             
     FEDPARM    IF   E           K DISK                                                             
C1078FMSALMA05  IF   E           K DISK    PREFIX(M_)                                               
C1078F                                     RENAME(RMSALMA:RMSALMA05)                                
C2561FPMEMPR    IF   E           K DISK                                                             
mod01  dcl-f msstok keyed usage(*input);                                                            
E7391FUTCOM0    IF   E           K DISK    USROPN                                                   
E7391FMITBAL00  IF   E           K DISK    USROPN                                                   
E7391FPUPRP0    IF   E           K DISK    USROPN                                                   
E7391FMSCOJD    IF   E           K DISK    USROPN                                                   
E7391FPMLIBL    IF   E           K DISK    USROPN                                                   
                                                                                                    
      * ESTRUCTURA DE LA INFDS                                                                      
     D                SDS                                                                           
     D  SDSPGM                 1     10                                                             
     D    CCCPGM                     10    OVERLAY(SDSPGM)                                          
     D  SDSSTATUS             11     15S 0                                                          
     D  SDSCODERR             91    170                                                             
     D  SDSJOB               244    253                                                             
     D    CCCJOB                     10    OVERLAY(SDSJOB)                                          
     D  SDSUSR               254    263                                                             
     D  SDSJNBR              264    269                                                             
IT228D  @PEALMA        S                   LIKE(M0MAGA)                                             
IT228D  @PETIPO        S                   LIKE(M0BAJA)                                             
IT228D  @PERESP        S                   LIKE(M0MAGA)                                             
                                                                                                    
      * AREA DE DADES D'INFORMACIÓ ARXIU                                                            
     D  SFLDS          DS                                                                           
     D    SFLPOCUR           370    371B 0                                                          
     D    SFLPOS1            378    379B 0                                                          
     D    SFLRCD         *RECORD                                                                    
                                                                                                    
      * PLANTILLA D'INDICADORS DEL PROGRAMA (ELS RESERVATS NO SURTEN)                               
      * ELS DE TREBALL ES PODEN REDENOMINAR MITJANÇANT OVERLAY                                      
     D  INDICADORS   E DS                  BASED(INDICADORP)                                        
     D                                     EXTNAME(INDDS:RIND0199)                                  
     D     INPOS01   E                     EXTFLD(SETL01)                                           
     D     INPOS02   E                     EXTFLD(SETL02)                                           
     D     VLDCMDKEY E                     EXTFLD(WRK74)                                            
     D     ROLLDOWN  E                     EXTFLD(WRK77)                                            
     D  INDICADORP     S               *   INZ(%ADDR(*IN))                                          
                                                                                                    
     D  CO2540       E DS                  EXTNAME(CO2540DS)                                        
     D     X5CIAS    E                     EXTFLD(X1CIAS)                                           
     D     X5DLGA    E                     EXTFLD(X1DLGA)                                           
     D     X5NPCO    E                     EXTFLD(X1NPCO)                                           
     D     X5DATP    E                     EXTFLD(X1DATP)                                           
     D     X5TPED    E                     EXTFLD(X1TPED)                                           
     D     X5NOPL    E                     EXTFLD(X1NOPL)                                           
     D     X5ASTE    E                     EXTFLD(X1ASTE)                                           
                                                                                                    
     D    @PECIAS2     S              3                                                             
     D  JOLINE         S              3  0                                                          
                                                                                                    
     D Z1COMA          DS          2000                                                             
                                                                                                    
     D                 DS                                                                           
     D  JOTRAT                 1     18                                                             
     D   ZXJNBR                1      6                                                             
     D   ZXDATA                7     12                                                             
     D   ZXHORA               13     18  0                                                          
                                                                                                    
     D  C              S              1A   DIM(1) CTDATA PERRCD(1)                                  
                                                                                                    
      * CONTROL DEL FLUXE DEL PROGRAMA AMB INICIALITZACIÓ DE POSIC. INICIAL                         
     D                 DS                                                                           
     D  ZXOPT                  1      6    INZ('S01CLR')                                            
     D    ZXOPT1               1      3                                                             
     D    ZXOPT2               4      6                                                             
                                                                                                    
      * ESTRUCTURA DE DADES PELS DIFERENTS FORMATS DE SUBARXIU                                      
      * W1DATA -> S01D                                                                              
     D                 DS                                                                           
IT244D  W1DATA                 1     74                                                             
     D    S01TPE4              1      1                                                             
mod01d    s01colcod            2      2                                                             
     D    S01LOGE              3      5                                                             
     D    S01DESL              7     19                                                             
     D    S01QLIN             21     23                                                             
     D    S01PLIN             25     30                                                             
     D    S01NETO             32     41                                                             
     D    S01IMAR             43     52                                                             
     D    S01VOL              54     62                                                             
mod01D**  S01IVOL             64     74                                                             
mod01d    s01ivol             63     73                                                             
mod01d    s01colres           74     74                                                             
                                                                                                    
      *IMPORT/EXPORT PARÀMETRES                                                                     
                                                                                                    
     D    @PCIAS       S                   LIKE(S5CIAS)                                             
     D    @PDLGA       S                   LIKE(S5DLGA)                                             
     D    @PNPCO       S                   LIKE(S5NPCO)                                             
     D    @PTPED       S                   LIKE(S5TPED)                                             
     D    @PDATP       S                   LIKE(S5DATP)                                             
     D    @PNOPL       S                   LIKE(S5NOPL)                                             
     D    @PMONV       S                   LIKE(S5MONE)                                             
     D    @PTFHV       S              1                                                             
     D    @PERRO       S              1                                                             
     D    @PDTOE       S                   LIKE(S5DTO1)                                             
     D    ZXERRO       S              1                                                             
     D                                                                                              
     D  @PECIAS        S                   LIKE(S5CIAS)                                             
     D  @PEDLGA        S                   LIKE(S5DLGA)                                             
     D  @PEARTI        S                   LIKE(S5ARTI)                                             
     D  @PEMODE        S                   LIKE(S5MODE)                                             
     D  @PEVARI        S                   LIKE(S5VARI)                                             
     D  @PECAST        S                   LIKE(S5CANT)                                             
     D  @PEUNST        S                   LIKE(S5UNIM)                                             
     D  @PEUSER        S                   LIKE(S5PANT)                                             
     D  @PEIMPR        S                   LIKE(S5PANT)                                             
     D  @PETCOJ        S              1                                                             
     D  @PEPBRU        S                   LIKE(MOPBRU)                                             
     D  @PEUPES        S                   LIKE(MOUPSO)                                             
     D  @PEVOLU        S                   LIKE(MOVOLU)                                             
     D  @PEUVOL        S                   LIKE(MOUVOL)                                             
     D  @PEUMED        S                   LIKE(MOUMEL)                                             
     D  @PETPAL        S              1                                                             
     D  @PETCT1        S              2                                                             
     D  @PEVTC1        S              1                                                             
     D  @PENBUL        S              6  0                                                          
     D  @PEPBRE        S                   LIKE(MOPBRU)                                             
     D  @PEVOLB        S                   LIKE(MOVOLU)                                             
     D  @PELINE        S                   LIKE(S5LINE)                                             
     D  @PEFIN         S              1  0                                                          
      *                                                                                             
     D  @FDCIAS        S                   LIKE(S5CIAS)                                             
     D  @FDDLGA        S              5                                                             
     D  @FDNPCO        S             10                                                             
     D  @FDTPED        S              2                                                             
     D  @FDDATP        S                   LIKE(S5DATP)                                             
     D  @FDNOPL        S                   LIKE(S5NOPL)                                             
     D  @FDLINE        S              3p 0                                                          
     D  @FDARV1        S             25                                                             
     D  @FDCOM2        S             25                                                             
     D  @FDCUST        S                   LIKE(S0CUST)                                             
     D  @FDTDI1        S                   LIKE(S0TDI1)                                             
     D  @FDEDAU        S              3                                                             
     D  @FDLOGI        S              1  0                                                          
     D  @FDORIG        S              1  0                                                          
     D  @FDINTE        S              1  0                                                          
     D  @FDERRO        S              1                                                             
     D  @FDINCI        S              3                                                             
     D  @FDCIA2        S                   LIKE(S5CIAS)                                             
     D  @FDDLG2        S              5                                                             
     D  @FDNPC2        S             10                                                             
     D  @FDTPE2        S              2                                                             
     D  @FDDAT2        S                   LIKE(S5DATP)                                             
     D  @FDNOP2        S                   LIKE(S5NOPL)                                             
     D  @FDLIN2        S                   LIKE(S5LINE)                                             
     D  @FDERAV        S              3                                                             
     D  @FDTEXT        S             50                                                             
     D  @FDDATO        S            300                                                             
     D  @FDWAUD        S              1  0                                                          
     D  @FDCANT        S                   LIKE(S5CANT)                                             
IT244 *                                                                                             
IT244D  @FDLOGE        S                   LIKE(S5LOGE)                                             
IT244D  @FDP           S               N                                                            
IT244D  @FDCAMBIO      S             15  9                                                          
IT244D  @FDARTPOR      S                   LIKE(S5ARTI)                                             
IT244D  @FDSEGCOS      S              1                                                             
      *                                                                                             
     D    ZXSHOW       S              1  0                                                          
      *                                                                                             
     D* AREA DE DADES LOCAL I INICIALITZACIO DE VALORS COMUNS                                       
     D  DSLDA        E DS                  EXTNAME(PURLDADS)                                        
     D    CCCDEEM                    30    OVERLAY(ZZDEEM)                                          
                                                                                                    
     D* SERIES A UTILITZAR EN PROGRAMA                                                              
     DSDE              S              1A   DIM(10)                                                  
     DSSSECPA          S              1A   DIM(10)                                                  
C2561D COE_LOGA        S                   DIM(100) LIKE(S5LOGE)                                    
C2561D COE_LOGM        S                   DIM(100) LIKE(S5LOGE)                                    
C2561D COE_NCOA        S                   DIM(100) LIKE(S5NCOE)                                    
C2561D COE_NCOM        S                   DIM(100) LIKE(S5NCOE)                                    
                                                                                                    
     D* DEFINICIO DE CAMPS DE TREBALL                                                               
     D  ZXNRR00        S                   LIKE(SUFRCDN)INZ                                         
     D  ZXPUEXP        S                   LIKE(SUFRCDN)INZ                                         
     D  ZXNNN00        S                   LIKE(SUFRCDN)INZ                                         
     D  ZXLOP00        S                   LIKE(SUFRCDN)INZ                                         
     D  ZXCOUNT        S                   LIKE(SUFRCDN)INZ(1)                                      
     D  ZXSEMF         S              1                                                             
     D  ZXAU15         S             15  0                                                          
     D  ZXTLIN         S              3  0                                                          
     D  ZXOLIN         S              3  0                                                          
C2561D  I2             S              5S 0                                                          
C2561D  I3             S              5S 0                                                          
C2561D  IDCOE          S              3  0                                                          
C2561D  ZXCOEN         S              1A   INZ                                                      
C2561D  ZXNCOM         S              1A   INZ('0')                                                 
C2561D  ZXNCOE         S              2  0                                                          
C2561D  ZXSERV         S                   LIKE(PEBL61)                                             
C2561D  ZXLOGE         S                   LIKE(S5LOGE) INZ                                         
NAP45D  ZXOCOE         S              1                                                             
                                                                                                    
     D* Los Campos que vienen a continuacion guardan los valores                                    
     D* de la primera clave con que se cargo el subarchivo y a partir de                            
     D* los cuales se realizara cualquier accion de refrescar segun                                 
     D* ACCREF 1=SI 0=NO                                                                            
     D  ZXTPE4_1       S                   LIKE(S5TPE4) INZ                                         
     D  ZXLOGE_1       S                   LIKE(S5LOGE) INZ                                         
      *                                                                                             
     D    @PEOPT       S              2                                                             
     D    @PEPGM       S                   LIKE(SDSPGM) INZ                                         
     D    @PEFMT       S                   LIKE(RECORD) INZ                                         
     D    @PEFLD       S                   LIKE(FIELD)  INZ                                         
     D    @PEERR       S              1                 INZ                                         
      *                                                                                             
     D    CCCFMT       S              1                 INZ('1')                                    
     D    ZXFMT        S              1                 INZ('1')                                    
      *                                                                                             
      * El valor ZXCOMCAR marcara cuando se deben guardar los valores                               
      * de primera clave anteriores                                                                 
     D  ZXCOMCAR       S              1  0                                                          
      * Campos de uso para trabajar con la API QCMDEXC                                              
     D  ZXQCMD         S            150                                                             
     D  ZXLOGC         S             15  5 INZ(150)                                                 
      * El valor ZXLIPAG tiene el numero de registros a cargar despues de                           
      * un Clear de subfichero                                                                      
     D  ZXLIPAG        S                   LIKE(SUFRCDN)INZ(8)                                      
     D  ZXLIPA2        S                   LIKE(SUFRCDN)INZ(8)                                      
      * Definicion de posición del cursor en subarchivo                                             
     D  ZXLINEA        S              3  0                                                          
     D  ZXCOLU         S              3  0                                                          
      * DEFINICIÓ DEL POSICIONAMENT DEL CURSOR EL EL SFL                                            
     D                 DS                                                                           
     D  ZXPOSCUR               1      4  2                                                          
     D    ZXPOSX               1      2  0                                                          
     D    ZXPOSY               3      4  0                                                          
                                                                                                    
     D  ZXRUSIOL       S                   LIKE(M5SIOL) INZ                                         
     D  ZXRUTPE4       S                   LIKE(S5TPE4) INZ                                         
     D  ZXRULOGE       S                   LIKE(S5LOGE) INZ                                         
                                                                                                    
     D  ZXVNET         S             17  5                                                          
     D  ZXVIVA         S             17  5                                                          
     D  ZXVTOT         S             17  5                                                          
IT244D  ZXVOL          S             17  5                                                          
     D  ZXIVOL         S             17  5                                                          
     D  ZXICOS         S             17  5                                                          
     D  ZXIMAR         S             17  5                                                          
     D  ZXMVOL         S             17  5                                                          
     D  ZXVNETCO       S             17  5                                                          
     D  ZXVIVACO       S             17  5                                                          
     D  ZXVTOTCO       S             17  5                                                          
IT244D  ZXVOLCO        S             17  5                                                          
     D  ZXIVOLCO       S             17  5                                                          
     D  ZXICOSCO       S             17  5                                                          
     D  ZXIMARCO       S             17  5                                                          
     D  ZXVNETA        S             13                                                             
     D  ZXVIVAA        S             11                                                             
     D  ZXVTOTA        S             13                                                             
IT244D  ZXVOLA         S             17  5                                                          
     D  ZXIVOLA        S             17  5                                                          
     D  ZXICOSA        S             17  5                                                          
     D  ZXIMARA        S             17  5                                                          
     D  ZXMVOLA        S             17  5                                                          
     D  XZCANT         S                   LIKE(S5CANT)                                             
IT244D  XZCANT2        S                   LIKE(S5CANT)                                             
     D  XZAUXI         S             29  9                                                          
     D  XZAUXI1        S             29  9                                                          
     D    XZARTI       S                   LIKE(S5ARTI)                                             
     D    XZVARI       S                   LIKE(S5VARI)                                             
     D    XZMODE       S                   LIKE(S5MODE)                                             
     D    XZCIAS       S                   LIKE(S5CIAS)                                             
     D    XZUNIM       S                   LIKE(S5UNIM)                                             
     D    XZMONE       S                   LIKE(S5MONC)                                             
     D    XZUNDP       S                   LIKE(S5UNDC)                                             
     D    ZXMONV       S                   LIKE(S0MONE)                                             
     D  ZXDTO11        S                   LIKE(S0DTO1)                                             
     D  ZXDTO21        S                   LIKE(S0DTO2)                                             
     D  ZXDTO31        S                   LIKE(S0DTO3)                                             
     D  ZXDTO41        S                   LIKE(S0DTO4)                                             
     D  ZXCAMC         S                   LIKE(S0CAMB) INZ                                         
     D  ZXCMPC         S                   LIKE(S0CMPR) INZ                                         
     D    ZXTIVC       S              1                                                             
     D  ZXHLONG        S             20  5                                                          
     D  ZXCOCAMB       S             15  9                                                          
     D  ZXCOCAM2       S             15  9                                                          
     D    @PCMCOCO     S             20  9                                                          
     D    @PCMCCCO     S             20  9                                                          
     D  @PMON1         S                   LIKE(MBMONE)                                             
     D  @PMON2         S                   LIKE(MBMONE)                                             
     D  @PDATA         S                   LIKE(S0FRRR)                                             
     D  @PHORA         S                   LIKE(S0HORA)                                             
                                                                                                    
     D  ZXIPOR         S             15  5                                                          
     D  ZXARTPOR       S                   LIKE(S5ARTI)                                             
IT244D  ZXCTRLNOED     S               N   INZ(*OFF)                                                
mod03   dcl-s bTouche    ind  inz(*off); // indicador si han modificat línies (1D/4D)               
E7391DXBWHLO           S                   LIKE(MBWHLO)                                             
E7391DM3_ARTI          S                   LIKE(S5ARTI)                                             
E7391DM3_VARI          S                   LIKE(S5VARI)                                             
E7391DM3_MODE          S                   LIKE(S5MODE)                                             
E7391DM3_PRVR          S                   LIKE(M1PRVR)                                             
     D                 DS                                                                           
     D  ZXBL65A                1      5                                                             
     D    ZXTTA2               1      1                                                             
     D    ZXTTA3               2      2                                                             
     D                 DS                                                                           
     D  ZXBL62A                1     10                                                             
     D    ZXPORC               1      7                                                             
     D                 DS                                                                           
     D  ZXBL63A                1     10                                                             
     D    ZXPOR0               1      7                                                             
     D                 DS                                                                           
     D  ZXBL62B                1     10                                                             
     D    ZXTIVA               1      2                                                             
     D    ZXCCON               3      4                                                             
     D    ZXMONG               5      7                                                             
     D                 DS                                                                           
     D  ZXBL65I                1      5                                                             
     D    ZXPABI               1      1                                                             
     D                 DS                                                                           
     D  ZXBL65TIVA             1      5                                                             
     D    ZXTVO2               1      2                                                             
     D                 DS                                                                           
     D  ZXBL64                 1     10                                                             
NAP45*                                                                                             
NAP45D  S0AMP4         DS                                                                           
NAP45D    S0TCOE               1      1                                                             
NAP45*                                                                                             
C2561D  P7AMPL         DS                                                                           
C2561D    P7OCOE              93     93                                                             
C2561                                                                                               
C2561D  S0AMPL         DS                                                                           
C2561D    S0COEN               1      1                                                             
C2561                                                                                               
C2561D  S5AMPL         DS                                                                           
C2561D    S5NCOE               1      2                                                             
IT244                                                                                               
IT244D  M5AMPL         DS                                                                           
IT244D    M5NOED              63     63                                                             
IT244                                                                                               
IT244D  S0AMP2         DS                                                                           
IT244D    S0CEVT              96     96                                                             
                                                                                                    
     D  @PVAN          S             10  0                                                          
     D  @PVAA          S             10                                                             
     D  @PFMI          S              7                                                             
     D  @PFMF          S              7                                                             
     D  @PSEP          S              7                                                             
                                                                                                    
      * VALOR NUMÈRIC                                                                               
     D   PXNUM         S             29  9                                                          
      * VALOR ALFANUMÈRIC                                                                           
     D   PXALPH        S             29                                                             
      * LONGITUD TOTAL DEL CAMP (Nº CARÀCTERS INCLÒS CODI EDICIÓ)                                   
     D   PXFLDD        S              2  0 INZ(20)                                                  
      * Nº DE DECIMALS DEL CAMP                                                                     
     D  PXDCCD         S              1  0                                                          
      * TIPUS DE FORMAT DECIMAL (.,)                                                                
     D  PXFMD1         S                   LIKE(ZZFMD1)INZ                                          
      * CODI D'EDICIÓ (4,M,Q,Z)                                                                     
     D  PXEDTC         S                   LIKE(ZZEDTC)INZ('4')                                     
      * RETORN CODI D'ERROR                                                                         
     D  PXNMER         S              1  0 INZ(0)                                                   
      * TIPUS D'AJUST DECIMAL (0=MIG 1=PER SOBRE 2=PER SOTA)                                        
IT244D  PXTIPA         S              1    INZ('0')                                                 
                                                                                                    
      * Definicion de algunas constantes                                                            
     D  ZXZERO10       S             10A   INZ(*ALL'0')                                             
IT228 *     D  ZXLOGOL        S                   LIKE(MILGCA)                                      
IT228d  T_logol        s                   like(m0logs) dim(10) inz                                 
IT228d  i2OL           s              2  0 inz                                                      
IT228D  ZXLOGOL        S                   LIKE(MILGCA)                                             
      *                                                                                             
07111                                                                                               
07111D  T3AMPL         DS                                                                           
07111D     T3OPL1              1      3                                                             
X1708D  T3ADOM                14     14                                                             
     D                                                                                              
CR528D  ZXINCI         S              3                                                             
mod01  dcl-c cRGr const(X'21');    // Reverse Green                                                 
mod01  dcl-c cNGr const(X'20');    // Normal Green                                                  
mod03  dcl-s sLogNoEdDFT like(s5loge) inz; //Logística NO ED per defecte. Pels 4D                   
mod03  dcl-s sLogSiEdDFT like(s5loge) inz; //Logística ED per defecte. Pels 1D propi                
mod03  dcl-s sLogViEdDFT like(s5loge) inz; //Logística Virtual per defecte. Pels 1D NO propi        
mod03  dcl-s sMagLogSiEd like(m0maga) inz; //Magatzem de la Logística ED per defecte                
F-2OL /free                                                                                         
        dcl-s pPointer pointer;                                                                     
        dcl-s pDsPgmOL pointer;                                                                     
        dcl-ds DsPgmOL based(pDsPgmOL);                                                             
              zoldl like(M0MAGA);                                                                   
              loEdl like(M0LOGE) ;                                                                  
              loSdl like(M0LOGS) ;                                                                  
              zolem like(M0MAGA);                                                                   
              loEem like(M0LOGE) ;                                                                  
              loSem like(M0LOGS) ;                                                                  
              zolgc like(M0MAGA);                                                                   
              loEgc like(M0LOGE) ;                                                                  
              loSgc like(M0LOGS) ;                                                                  
              zolgm like(M0MAGA);                                                                   
              loEgm like(M0LOGE) ;                                                                  
              loSgm like(M0LOGS) ;                                                                  
              zolgt like(M0MAGA);                                                                   
              loEgt like(M0LOGE) ;                                                                  
              loSgt like(M0LOGS) ;                                                                  
        end-ds;                                                                                     
        dcl-pr pgmOL   extpgm('MM1410');                                                            
           xCIAS   like(@PECIAS) const;   // cia                                                    
           xDLGA   like(@PEDLGA) const;   // delega                                                 
           xptr    pointer       ;        // pointer                                                
        end-pr;                                                                                     
F-2OL /end-free                                                                                     
       dcl-s cresp like(@peresp);                                                                   
mod01  dcl-pr pMM1411 extpgm('MM1411');                                                             
mod01      @cias  like(s5cias) const;                                                               
mod01      @maga  like(m0maga) const;                                                               
mod01      @tipo  char(1) const;                                                                    
mod01      @dlga  like(s0dlga) const;                                                               
mod01      @resp  like(@peresp);                                                                    
mod01  end-pr;                                                                                      
      **************************************************************                                
      * RUTINA PRINCIPAL DEL PGM : DISTRIBUCIÓ DEL PAS PELS 2 SFL  *                                
      *------------------------------------------------------------*                                
     C     ZXOPT1        DOWNE     'END'                                                            
     C     ZXOPT1        CASEQ     'S01'         S01MAIN                        FMT. PER ARTICLE    
     C                   ENDCS                                                                      
     C                   ENDDO                                                                      
C2561 *                                                                                             
C2561 * Asignar número de coenvío por logística si así lo define el                                 
C2561 * parámetro de empresa                                                                        
mod02           if bTouche and S0COEN='2';                                                          
C2561C                   EXSR      CS_COENVIO                                                       
mod02           endif;                                                                              
C2561 *                                                                                             
     C                   SETON                                        LR                            
      **************************************************************                                
      * SUBRUTINA INICIAL. DEFINICIO DE TOTS ELS PARÀMETRES        *                                
      * GENERALS DEL PROGRAMA.                                     *                                
      *------------------------------------------------------------*                                
     C     *INZSR        BEGSR                                                                      
      *                                                                                             
      * DEFINICIO DE LES KLIST DEL PGM                                                              
E7391 *                                                                                             
E7391C     KMSCOJD       KLIST                                                                      
E7391C                   KFLD                    NDCIAS                                             
E7391C                   KFLD                    NDARTI                                             
E7391C                   KFLD                    NDVARI                                             
E7391C                   KFLD                    NDMODE                                             
E7391C                   KFLD                    NDTCOJ                                             
E7391C                   KFLD                    NDCOMP                                             
E7391C                   KFLD                    NDVAR2                                             
E7391C                   KFLD                    NDMOD2                                             
E7391C                   KFLD                    NDTCO2                                             
E7391 *                                                                                             
E7391C     KMSCOJD0      KLIST                                                                      
E7391C                   KFLD                    NDCIAS                                             
E7391C                   KFLD                    NDARTI                                             
E7391C                   KFLD                    NDVARI                                             
E7391C                   KFLD                    NDMODE                                             
E7391C                   KFLD                    NDTCOJ                                             
E7391 *                                                                                             
E7391C     KMSSTOK       KLIST                                                                      
E7391C                   KFLD                    M1CIAS                                             
E7391C                   KFLD                    M1MAGA                                             
E7391C                   KFLD                    M1ARTI                                             
E7391C                   KFLD                    M1VARI                                             
E7391C                   KFLD                    M1MODE                                             
E7391 *                                                                                             
E7391C     KUTCOM0       KLIST                                                                      
E7391C                   KFLD                    U0CIAS                                             
E7391C                   KFLD                    U0TENV                                             
E7391C                   KFLD                    U0CLP0                                             
E7391C                   KFLD                    U0CLP2                                             
E7391 *                                                                                             
E7391C     KPUPRP0       KLIST                                                                      
E7391C                   KFLD                    C3CIAS                                             
E7391C                   KFLD                    C3PRVR                                             
E7391C                   KFLD                    C3ARVM                                             
E7391C                   KFLD                    C3TCOJ                                             
E7391 *                                                                                             
E7391C     KMITBAL00     KLIST                                                                      
E7391C                   KFLD                    MBCONO                                             
E7391C                   KFLD                    MBWHLO                                             
E7391C                   KFLD                    MBITNO                                             
      *                                                                                             
     C     KCOCAPE       KLIST                                                                      
     C                   KFLD                    S0CIAS                                             
     C                   KFLD                    S0DLGA                                             
     C                   KFLD                    S0NPCO                                             
     C                   KFLD                    S0TPED                                             
     C                   KFLD                    S0DATP                                             
     C                   KFLD                    S0NOPL                                             
      *                                                                                             
     C     KCODEPE       KLIST                                                                      
     C                   KFLD                    S5CIAS                                             
     C                   KFLD                    S5DLGA                                             
     C                   KFLD                    S5NPCO                                             
     C                   KFLD                    S5TPED                                             
     C                   KFLD                    S5DATP                                             
     C                   KFLD                    S5NOPL                                             
     C                   KFLD                    S5LINE                                             
                                                                                                    
     C     KCODEPE26     KLIST                                                                      
     C                   KFLD                    S5CIAS                                             
     C                   KFLD                    S5DLGA                                             
     C                   KFLD                    S5NPCO                                             
     C                   KFLD                    S5TPED                                             
     C                   KFLD                    S5DATP                                             
     C                   KFLD                    S5NOPL                                             
      *                                                                                             
     C     KCODEPE260    KLIST                                                                      
     C                   KFLD                    S5CIAS                                             
     C                   KFLD                    S5DLGA                                             
     C                   KFLD                    S5NPCO                                             
     C                   KFLD                    S5TPED                                             
     C                   KFLD                    S5DATP                                             
     C                   KFLD                    S5NOPL                                             
     C                   KFLD                    S5TPE4                                             
     C                   KFLD                    S5LOGE                                             
                                                                                                    
     C     KCOCLIN       KLIST                                                                      
     C                   KFLD                    S0CIAS                                             
     C                   KFLD                    S0CUST                                             
                                                                                                    
     C     KMSDIV0       KLIST                                                                      
     C                   KFLD                    MBCIAS                                             
     C                   KFLD                    MBMONE                                             
                                                                                                    
     C     KCOCAIM       KLIST                                                                      
     C                   KFLD                    SYCIAS                                             
     C                   KFLD                    SYDLGA                                             
     C                   KFLD                    SYNPCO                                             
     C                   KFLD                    SYTPED                                             
     C                   KFLD                    SYDATP                                             
     C                   KFLD                    SYNOPL                                             
      *                                                                                             
     C     KMSIVAS       KLIST                                                                      
     C                   KFLD                    MVCIAS                                             
     C                   KFLD                    MVTIVA                                             
     C                   KFLD                    MVPABI                                             
     C                   KFLD                    MVFLCD                                             
                                                                                                    
     C     KMSIVAS0      KLIST                                                                      
     C                   KFLD                    MVCIAS                                             
     C                   KFLD                    MVTIVA                                             
     C                   KFLD                    MVPABI                                             
                                                                                                    
     C     KPMUNAL       KLIST                                                                      
     C                   KFLD                    @PCIAS                                             
     C                   KFLD                    P6ARTI                                             
     C                   KFLD                    P6VARI                                             
     C                   KFLD                    P6MODE                                             
     C                   KFLD                    P6UNIM                                             
                                                                                                    
     C     KMSARTI00     KLIST                                                                      
     C                   KFLD                    @PCIAS                                             
     C                   KFLD                    S5ARTI                                             
     C                   KFLD                    S5VARI                                             
     C                   KFLD                    S5MODE                                             
                                                                                                    
     C     KMSLOGI       KLIST                                                                      
     C                   KFLD                    MICIAS                                             
     C                   KFLD                    MIDLGA                                             
     C                   KFLD                    MILGCA                                             
                                                                                                    
     C     KCODIPE       KLIST                                                                      
     C                   KFLD                    S2CIAS                                             
     C                   KFLD                    S2DLGA                                             
     C                   KFLD                    S2NPCO                                             
     C                   KFLD                    S2TPED                                             
     C                   KFLD                    S2DATP                                             
     C                   KFLD                    S2NOPL                                             
     C                   KFLD                    S2CDIR                                             
                                                                                                    
     C     KMSPAIS       KLIST                                                                      
     C                   KFLD                    MECIAS                                             
     C                   KFLD                    MEPAIS                                             
                                                                                                    
     C     KMSSGGA       KLIST                                                                      
     C                   KFLD                    MMCIAS                                             
     C                   KFLD                    MMUSER                                             
                                                                                                    
     C     KPMTABD       KLIST                                                                      
     C                   KFLD                    PECIAS                                             
     C                   KFLD                    PECTAB                                             
     C                   KFLD                    PECLTA                                             
      *                                                                                             
     C     KEDPARM       KLIST                                                                      
     C                   KFLD                    T3CIAS                                             
     C                   KFLD                    T3DLGA                                             
C1078                                                                                               
C1078C     KMSALMA05     KLIST                                                                      
C1078C                   KFLD                    M_M0CIAS                                           
C1078C                   KFLD                    M_M0LOGE                                           
IT228C     KMSALMA       KLIST                                                                      
IT228C                   KFLD                    M_M0CIAS                                           
IT228C                   KFLD                    M_M0LOGE                                           
C2561 *                                                                                             
C2561C     KPMEMPR       KLIST                                                                      
C2561C                   KFLD                    P7CIAS                                             
C2561C                   KFLD                    P7DLGA                                             
      *                                                                                             
      * ENTRADA DE PARÀMETRES                                                                       
      *                                                                                             
     C     *ENTRY        PLIST                                                                      
     C                   PARM                    @PCIAS                                             
     C                   PARM                    @PDLGA                                             
     C                   PARM                    @PNPCO                                             
     C                   PARM                    @PTPED                                             
     C                   PARM                    @PDATP                                             
     C                   PARM                    @PNOPL                                             
     C                   PARM                    @PMONV                                             
     C                   PARM                    @PTFHV                                             
     C                   PARM                    @PERRO                                             
      *                                                                                             
     C                   EVAL      ZXERRO=@PERRO                                                    
     C                   EVAL      @PERRO=*BLANKS                                                   
      *                                                                                             
      * ZXERRO='1'   Hay que confirmar o cancelar el pedido                                         
      * ZXERRO<'1'   El pedido ya está confirmado                                                   
      *                                                                                             
     C     *DTAARA       DEFINE    PURLDA        DSLDA                                              
     C                   IN        DSLDA                                                            
                                                                                                    
     C* CAPÇALERES D'OPCIONS DEL SFL  (CODIS D'ARXIU DE MISSATGES)                                  
IT244C                   EVAL      SUFOPC1='OED3061'                                                
     C***                EVAL      SUFOPC2=*BLANKS                                                  
     C* TITOLS DE PANTALLES (CODIS D'ARXIU DE MISSATGES)                                            
     C                   EVAL      CCCCTIT='TED0061'                                                
     C* ACTIVEM EL SFLDSPCTL                                                                        
     C                   EVAL      SFLCTL=*ON                                                       
      *                                                                                             
      * Inicializar Campos                                                                          
      *                                                                                             
C1078C                   EVAL      M_M0CIAS=@PCIAS                                                  
     C                   EVAL      S0CIAS=@PCIAS                                                    
     C                   EVAL      S0DLGA=@PDLGA                                                    
     C                   EVAL      S0NPCO=@PNPCO                                                    
     C                   EVAL      S0TPED=@PTPED                                                    
     C                   EVAL      S0DATP=@PDATP                                                    
     C                   EVAL      S0NOPL=@PNOPL                                                    
     C                   EVAL      S5CIAS=@PCIAS                                                    
     C                   EVAL      S5DLGA=@PDLGA                                                    
     C                   EVAL      S5NPCO=@PNPCO                                                    
     C                   EVAL      S5TPED=@PTPED                                                    
     C                   EVAL      S5DATP=@PDATP                                                    
     C                   EVAL      S5NOPL=@PNOPL                                                    
     C                   EVAL      MBCIAS=@PCIAS                                                    
     C                   EVAL      MVCIAS=@PCIAS                                                    
     C                   EVAL      T3CIAS=@PCIAS                                                    
     C                   EVAL      T3DLGA=@PDLGA                                                    
07111C     KEDPARM       CHAIN     EDPARM                                                           
      *                                                                                             
      * Datos de Cabecera                                                                           
      * Este programa no actúa si estoy confirmando y no hay ED                                     
      * SI ESTOY CONFIRMANDO ZXERRO='1'                                                             
      *                                                                                             
     C                   EXSR      CS_CABINZ                                                        
      *                                                                                             
     C                   IF        %FOUND(COCAPE)                                                   
     C                             AND ZXERRO='1'                                                   
     C                             OR  %FOUND(COCAPE)                                               
     C                             AND ZXERRO<>'1'                                                  
      *                                                                                             
      * Comprobar si hay alguna entrega directa en caso de que estemos                              
      * confirmando si no no hace falta                                                             
      *                                                                                             
     C                   EVAL      ZXSHOW=0                                                         
CR528C                   EVAL      ZXINCI=*BLANKS                                                   
mod03 //                                                                                            
mod03 // Recuperem les logístiques per defecte una sola vegada ja que NO depenen dels articles      
mod03 //                                                                                            
mod03                    exsr GetLogDft;                                                            
mod02C*delete begin                                                                                 
mod02C*                  IF        ZXERRO='1'                                                       
mod02C*    KCOCAPE       SETLL     ED0050W                                                          
mod02C*    KCOCAPE       READE(N)  ED0050W                                                          
mod02C*                  DOW       NOT %EOF(ED0050W)                                                
mod02C*                                                                                             
mod02C* Se guarda la incidencia por si sólo se lee una línea                                        
mod02C*                                                                                             
mod02C*                  EVAL      ZXINCI=T2INCI                                                    
mod02C*                                                                                             
mod02C* Si no se ha llegado al importe mínimo saco mensaje                                          
mod02C*                  IF        T2VA09=1                                                         
mod02C*                  EVAL      *in67=*on                                                        
mod02C*                  ENDIF                                                                      
mod02C*                                                                                             
mod02C*                  IF        T2ENTD=1                                                         
mod02C*                            Or T2LOGU<>*BLANKS                                               
mod02C*                  EVAL      ZXSHOW=1                                                         
mod02C*                  LEAVE                                                                      
mod02C*                  ENDIF                                                                      
mod02C*    KCOCAPE       READE(N)  ED0050W                                                          
mod02C*                  ENDDO                                                                      
mod02C*                  ELSE                                                                       
     C                   EVAL      ZXSHOW=1                                                         
mod02C*                  ENDIF                                                                      
FQ943 *                                                                                             
FQ943C                   CALL      'RTVTIJ'                                                         
FQ943C                   PARM      *BLANKS       @PTIPJ            1                                
FQ943C                   IF        @PTIPJ>='1'                                                      
IT244C                   OPEN      ED3061FM                                                         
FQ943C                   ELSE                                                                       
FQ943C                   EVAL      ZXSHOW=0                                                         
FQ943C                   ENDIF                                                                      
FQ943 *                                                                                             
     C                                                                                              
      *                                                                                             
     C                   IF        ZXSHOW=1                                                         
      *                                                                                             
     C                   EVAL      ZXOPT='S01CLR'                                                   
     C                   EXSR      CS_LOGOL                                                         
     C                   EXSR      CS_ALTSIOL                                                       
      *                                                                                             
      * Recuperación de la dirección de recepción de pedido                                         
      *                                                                                             
     C                   EVAL      S2CIAS=@PCIAS                                                    
     C                   EVAL      S2DLGA=@PDLGA                                                    
     C                   EVAL      S2NPCO=@PNPCO                                                    
     C                   EVAL      S2TPED=@PTPED                                                    
     C                   EVAL      S2DATP=@PDATP                                                    
     C                   EVAL      S2NOPL=@PNOPL                                                    
     C                   EVAL      S2CDIR='1'                                                       
     C     *NOKEY        CLEAR     *ALL          RCODIPE                                            
     C     KCODIPE       CHAIN     CODIPE                                                           
     C                   IF        %FOUND(CODIPE)                                                   
     C                   EVAL      SUCDIR1=S2DIRE                                                   
     C                   EVAL      SUCDIR2=S2DIR2                                                   
     C                   EVAL      SUCDIR3=S2POBL                                                   
     C                   EVAL      SUCDIR4=S2POST                                                   
      *                                                                                             
     C                   EVAL      MECIAS=S2CIAS                                                    
     C                   EVAL      MEPAIS=S2PAIS                                                    
     C     KMSPAIS       CHAIN     MSPAIS                                                           
     C                   IF        %FOUND(MSPAIS)                                                   
     C                   EVAL      SUCDIR4=S2POST+' '+MEDE30                                        
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
      *                                                                                             
      * Recalcular Importes para evitar errores                                                     
      *                                                                                             
     C                   EXSR      CS_RECALIM                                                       
     C                   EXSR      CS_CABSEG                                                        
      *                                                                                             
      * Parámetros de usuario                                                                       
      *                                                                                             
     C                   EVAL      MMCIAS=@PCIAS                                                    
     C                   EVAL      MMUSER=SDSUSR                                                    
     C     KMSSGGA       CHAIN     MSSGGA                                                           
      *                                                                                             
     C                   EXSR      FD_BASE                                                          
      *                                                                                             
     C                   EVAL      ERRGRL=*ON                                                       
      *                                                                                             
     C                   ELSE                                                                       
CR528 *                                                                                             
CR528 * No hay Fluidra direct, si sólo hay una línea y tiene                                        
CR528 * la incidencia 019, artículo bloqueado compras, anula la                                     
CR528 * confirmación del pedido o el alta de línea en ped.confirmado                                
CR528 *                                                                                             
CR528C                   IF        ZXINCI='019'                                                     
CR528C                   EXSR      CS_BLOQCOM                                                       
CR528C                   EVAL      ZXOPT='END'                                                      
CR528C                   GOTO      TMAIN                                                            
CR528C                   ENDIF                                                                      
CR528 *                                                                                             
     C                   IF        S0TPE4='2'                                                       
FQ943C                             AND @PTIPJ='1'                                                   
     C                   EXFMT     W13                                                              
     C                   ENDIF                                                                      
     C                   EVAL      ZXOPT='END'                                                      
     C                   ENDIF                                                                      
      *                                                                                             
     C                   ELSE                                                                       
     C                   EVAL      ZXOPT='END'                                                      
     C                   ENDIF                                                                      
      *                                                                                             
CR528C     TMAIN         ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA CONTROL DEL SFL S01                              *                                
      *------------------------------------------------------------*                                
     C     S01MAIN       BEGSR                                                                      
     C                   DOW       ZXOPT1='S01'                                                     
     C     ZXOPT2        CASEQ     'CLR'         S01CLR                                             
     C     ZXOPT2        CASEQ     'INZ'         S01INZ                                             
     C     ZXOPT2        CASEQ     'DSP'         S01DSP                                             
     C     ZXOPT2        CASEQ     'CMD'         S01CMD                                             
     C     ZXOPT2        CASEQ     'CHK'         S01CHK                                             
     C                   ENDCS                                                                      
     C                   ENDDO                                                                      
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA INICIALITZACIÓ I CARREGA DEL SFL                 *                                
      *------------------------------------------------------------*                                
     C     S01INZ        BEGSR                                                                      
     C                   EVAL      ZXOPT2='DSP'                                                     
     C                   EXSR      CS_SFLIN1                                                        
                                                                                                    
     C                   EVAL      ZXPUEXP=0                                                        
     C                   EVAL      ZXRUSIOL=*BLANKS                                                 
     C                   EVAL      ZXRUTPE4=*BLANKS                                                 
     C                   EVAL      ZXRULOGE=*BLANKS                                                 
     C                   EVAL      ZXOLIN=0                                                         
     C                   EVAL      ZXVNETCO=0                                                       
     C                   EVAL      ZXVIVACO=0                                                       
     C                   EVAL      ZXVTOTCO=0                                                       
     C                   EVAL      ZXVOLCO=0                                                        
     C                   EVAL      ZXIVOLCO=0                                                       
     C                   EVAL      ZXICOSCO=0                                                       
     C                   EVAL      ZXIMARCO=0                                                       
      *                                                                                             
     C                   DOW       ZXLOP00 < ZXLIPAG                                                
     C     KCODEPE26     READE     CODEPE26                               82                        
     C                   IF        EOF=*ON                                                          
     C                   LEAVE                                                                      
     C                   ENDIF                                                                      
CR528 *                                                                                             
CR528 * La incidencia 019, artículo bloqueado compras, anula la                                     
CR528 * confirmación del pedido o el alta de línea en ped.confirmado                                
CR528 *                                                                                             
CR528C     KCODEPE       CHAIN     ED0050W                                                          
CR528C                   IF        %FOUND(ED0050W)                                                  
CR528C                             AND T2INCI='019'                                                 
CR528C                   EXSR      CS_BLOQCOM                                                       
CR528C                   EVAL      ZXOPT='END'                                                      
CR528C                   GOTO      S01INZT                                                          
CR528C                   ENDIF                                                                      
      *                                                                                             
      * Omitir artículo de portes tipo APE                                                          
      *                                                                                             
     C                   IF        S5ARTI<>ZXARTPOR                                                 
      *                                                                                             
     C     KMSARTI00     CHAIN     MSARTI00                                                         
      *                                                                                             
      * GRABO DETALLE CUANDO ROMPA TIPO O LOGÍSTICA                                                 
      *                                                                                             
     C                   IF        ZXRUTPE4<>S5TPE4 AND ZXRULOGE<>*BLANKS                           
     C                             OR ZXRULOGE<>S5LOGE AND ZXRULOGE<>*BLANKS                        
     C                   EVAL      ZXNRR00=ZXNRR00 + 1                                              
     C                   EVAL      ZXLOP00=ZXLOP00 + 1                                              
IT228 *     C                   IF        ZXRULOGE<>ZXLOGOL AND ZXRUSIOL<>'2'                       
IT228c                   if        (%lookup(ZXRULOGE:T_logol)=0)                                    
IT228c                             and zxrusiol<>'2'                                                
     C                   EVAL      ZXPUEXP=ZXPUEXP+ 1                                               
     C                   ENDIF                                                                      
     C                   EXSR      CS_MOVFP                                                         
     C                   EXSR      CS_SAVFK                                                         
     C                   WRITE     SUFD                                                             
     C                   EVAL      ZXOLIN=0                                                         
     C                   EVAL      ZXVNETCO=0                                                       
     C                   EVAL      ZXVIVACO=0                                                       
     C                   EVAL      ZXVTOTCO=0                                                       
     C                   EVAL      ZXVOLCO=0                                                        
     C                   EVAL      ZXIVOLCO=0                                                       
     C                   EVAL      ZXICOSCO=0                                                       
     C                   EVAL      ZXIMARCO=0                                                       
     C                   ENDIF                                                                      
      *                                                                                             
      *                                                                                             
     C                   EXSR      CS_VALLIN                                                        
     C                   EVAL      ZXVNETCO=ZXVNETCO+ZXVNET                                         
     C                   EVAL      ZXVIVACO=ZXVIVACO+ZXVIVA                                         
     C                   EVAL      ZXVTOTCO=ZXVTOTCO+ZXVTOT                                         
     C                   EVAL(H)   ZXVOLCO=ZXVOLCO+ZXVOL                                            
IT244C                   EVAL      ZXICOSCO += XZCANT2 * M5COSM                                     
IT244C                   EVAL      ZXIMARCO = ZXVNETCO*ZXCOCAMB - ZXICOSCO                          
     C                   IF        ZXVOLCO<>0                                                       
     C                   EVAL(H)   ZXIVOLCO=ZXIMARCO/ZXVOLCO                                        
     C                   ENDIF                                                                      
     C                   EVAL      ZXRUSIOL=M5SIOL                                                  
     C                   EVAL      ZXRUTPE4=S5TPE4                                                  
     C                   EVAL      ZXRULOGE=S5LOGE                                                  
     C                   EVAL      ZXOLIN=ZXOLIN+1                                                  
      *                                                                                             
     C                   ENDIF                                                                      
      *                                                                                             
      *                                                                                             
     C                   ENDDO                                                                      
      *                                                                                             
      * EL ÚLTIMO                                                                                   
      *                                                                                             
     C                   IF        ZXLOP00 < ZXLIPAG                                                
     C                   IF        ZXRULOGE<>*BLANKS                                                
     C                   EVAL      ZXNRR00=ZXNRR00 + 1                                              
     C                   EVAL      ZXLOP00=ZXLOP00 + 1                                              
IT228 *     C                   IF        ZXRULOGE<>ZXLOGOL AND ZXRUSIOL<>'2'                       
IT228c                   if        (%lookup(ZXRULOGE:T_logol)=0)                                    
IT228c                             and zxrusiol<>'2'                                                
     C                   EVAL      ZXPUEXP=ZXPUEXP+ 1                                               
     C                   ENDIF                                                                      
     C                   EXSR      CS_MOVFP                                                         
     C                   EXSR      CS_SAVFK                                                         
     C                   WRITE     SUFD                                                             
     C                   EVAL      ZXOLIN=0                                                         
     C                   EVAL      ZXVNETCO=0                                                       
     C                   EVAL      ZXVIVACO=0                                                       
     C                   EVAL      ZXVTOTCO=0                                                       
     C                   EVAL      ZXVOLCO=0                                                        
     C                   EVAL      ZXIVOLCO=0                                                       
     C                   EVAL      ZXICOSCO=0                                                       
     C                   EVAL      ZXIMARCO=0                                                       
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
                                                                                                    
     C                   EXSR      CS_SFLIN2                                                        
     C     S01INZT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VISUALITZACIÓ SFL                                *                                
      *------------------------------------------------------------*                                
     C     S01DSP        BEGSR                                                                      
     C                   EVAL      ZXOPT2='CMD'                                                     
     C                   IF        ZXERRO='1'                                                       
     C                   EVAL      PPPCMD1='CMD7817'                                                
     C                   ELSE                                                                       
     C                   EVAL      PPPCMD1='CMD3031'                                                
     C                   ENDIF                                                                      
IT244C                   EVAL      SUFHED1='HED3061'                                                
                                                                                                    
     C                   EXSR      CS_SFLDSP                                                        
                                                                                                    
     C     S01DSPT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VALIDACIÓ DELS CMD'S                             *                                
      *------------------------------------------------------------*                                
     C     S01CMD        BEGSR                                                                      
     C                   EVAL      ZXOPT2='CHK'                                                     
     C                   EXSR      CS_SFLCMD                                                        
     C     S01CMDT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VALIDACIÓ DEL SFL: FORMAT SFL I OPCIONS          *                                
      *------------------------------------------------------------*                                
     C     S01CHK        BEGSR                                                                      
     C                   EVAL      ZXOPT2='DSP'                                                     
                                                                                                    
      * SUBRUTINA COMÚ DE VALIDACIÓ DEL SFL                                                         
     C                   EXSR      CS_SFLCHK                                                        
                                                                                                    
     C     S01CHKT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA DE NETEJA DEL SFL                                *                                
      *------------------------------------------------------------*                                
     C     S01CLR        BEGSR                                                                      
     C                   EVAL      ZXOPT='S01INZ'                                                   
     C                   MOVEA     ZXZERO10      *IN(90)                                            
     C                   EVAL      INPOS01=*ON                                                      
     C                   EXSR      CS_SFLCLR                                                        
     C     KCODEPE26     SETLL     CODEPE26                                                         
     C     S01CLRT       ENDSR                                                                      
      **************************************************************                                
      * COMMON SUBRUTINE (CS_) :                                  *                                 
      * SUBRUTINA DE NETEJA DEL SFL                                *                                
      *------------------------------------------------------------*                                
     C     CS_SFLCLR     BEGSR                                                                      
     C                   EVAL      SFLDSP=*OFF                                                      
     C                   EVAL      SFLCTL=*OFF                                                      
     C                   EVAL      SFLCLR=*ON                                                       
     C                   WRITE     SUFC                                                             
     C                   EVAL      SFLDSP=*ON                                                       
     C                   EVAL      SFLCTL=*ON                                                       
     C                   EVAL      SFLCLR=*OFF                                                      
     C                   CLEAR                   SUFRCDN                        SFLRCDNBR           
     C                   RESET                   ZXNRR00                        ULT.NRR             
     C                   RESET                   ZXNNN00                        ULT.NRR             
      * Inicialitza la variable que indica inici de carrega de subarxiu                             
     C                   EVAL      ZXCOMCAR=0                                                       
     C                   MOVEA     ZXZERO10      *IN(40)                                            
     C                   MOVEA     ZXZERO10      *IN(50)                                            
     C     SFLCLRT       ENDSR                                                                      
      **************************************************************                                
      * COMMON SUBRUTINE (CS_) :                                  *                                 
      * SUBRUTINA INICIALITZACIÓ DEL SFL (1º PART)                 *                                
      *------------------------------------------------------------*                                
     C     CS_SFLIN1     BEGSR                                                                      
     C                   RESET                   ZXLOP00                                            
     C                   RESET                   ZXLIPAG                                            
     C                   EVAL      ZXNRR00=ZXNNN00                                                  
     C                   IF        ACCREF=*ON                                                       
     C                   RESET                   ZXNRR00                                            
     C                   EVAL      ZXLIPAG=ZXCOUNT+ZXLIPAG-1                                        
     C                   ENDIF                                                                      
     C                   RESET                   ZXNNN00                        ULT.NRR             
     C                   EVAL      SFLEND=*OFF                                                      
     C                   EVAL      EOF=*OFF                                                         
     C     SFLIN1T       ENDSR                                                                      
      **************************************************************                                
      * COMMON SUBRUTINE (CS_) :                                  *                                 
      * SUBRUTINA DE MOURE CAMPS                                   *                                
      *------------------------------------------------------------*                                
     C     CS_MOVFP      BEGSR                                                                      
     C                   SELECT                                                                     
     C                   WHEN      ZXOPT1='S01'                                                     
     C                   EVAL      SUFOPCI=*BLANKS                                                  
     C                   EVAL      SFLNXC=*OFF                                                      
     C                   EXSR      S01MFP                                                           
     C                   ENDSL                                                                      
     C                   ENDSR                                                                      
      **************************************************************                                
      * COMMON SUBRUTINE (CS_) :                                  *                                 
      * GUARDO LA CLAU DE POSICIONAMENT DEL PRIMER REGISTRE DESPRES*                                
      * DE LA NETEJA DEL SUBARXIU                                  *                                
      *------------------------------------------------------------*                                
     C     CS_SAVFK      BEGSR                                                                      
     C                   IF        ZXCOMCAR=0                                                       
                                                                                                    
     C                   EVAL      ZXTPE4_1=S5TPE4                                                  
     C                   EVAL      ZXLOGE_1=S5LOGE                                                  
     C                   EVAL      ZXCOMCAR=1                                                       
                                                                                                    
     C                   ENDIF                                                                      
     C     CS_SAVFKT     ENDSR                                                                      
      **************************************************************                                
      * COMMON SUBRUTINE (CS_) :                                  *                                 
      * SUBRUTINA INICIALITZACIÓ DEL SFL  (2ª PART)                *                                
      *------------------------------------------------------------*                                
     C     CS_SFLIN2     BEGSR                                                                      
     C                   EVAL      ZXNNN00=ZXNRR00                                                  
     C                   EVAL      SUFRCDN=ZXNRR00                                                  
     C                   EVAL      ACCREF=*ON                                   SFLRCDNBR           
     C                   IF        EOF=*ON                                                          
     C                   EVAL      SFLEND=*ON                                                       
     C                   ENDIF                                                                      
                                                                                                    
     C                   IF        ZXNRR00=0                                                        
     C                   EVAL      SFLDSP=*OFF                                                      
     C                   ELSE                                                                       
     C                   EVAL      SFLDSP=*ON                                                       
     C                   ENDIF                                                                      
                                                                                                    
     C     SFLIN2T       ENDSR                                                                      
      **************************************************************                                
      * COMMON SUBRUTINE (CS_) :                                  *                                 
      * SUBRUTINA VALIDACIÓ DELS CMD'S                             *                                
      *------------------------------------------------------------*                                
     C     CS_SFLCMD     BEGSR                                                                      
     C                   IF        VLDCMDKEY=*OFF                                                   
     C                   GOTO      SFLCMDT                                                          
     C                   ENDIF                                                                      
                                                                                                    
     C                   EVAL      ACCREF=*ON                                                       
     C                   EXSR      CS_SECCMD                                                        
     C     ERRGRL        CABEQ     *ON           SFLCMDT                                            
     C                   SELECT                                                                     
      * F04=AJUDA DE PANTALLA                                                                       
     C                   WHEN      HELP=*ON                                                         
     C                   EVAL      ZXOPT2='DSP'                                                     
     C                   EXSR      CS_POSCUR                                                        
     C                   EVAL      ACCREF=*OFF                                                      
      *                                                                                             
     C                   IF        FIELD='CCCFMT'                                                   
     C                   EVAL      @PEFMT=*BLANKS                                                   
     C                   EVAL      @PEFLD=*BLANKS                                                   
     C                   EVAL      @PEFLD='CFMT'                                                    
     C                   ENDIF                                                                      
     C                   IF        FIELD='SUFOPCI'                                                  
     C                   EVAL      @PEFMT=*BLANKS                                                   
     C                   EVAL      @PEFLD=*BLANKS                                                   
     C                   EVAL      @PEFLD='OPCI'                                                    
     C                   ENDIF                                                                      
     C                   CALL      'MMPROM'                                     Query-Aut-F4   X    
     C                   PARM      *BLANKS       @PEOPT                         PARM Qry-F4         
     C                   PARM      SDSPGM        @PEPGM                         PARM Qry-F4         
     C                   PARM                    @PEFMT                         PARM Qry-F4         
     C                   PARM                    @PEFLD                         PARM Qry-F4         
     C                   PARM      *BLANKS       @PEERR                         PARM Qry-F4         
      * Si el dato no tiene soporte F4 avisamos                                                     
     C                   IF        @PEERR>'0'                                                       
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      WRK40=*ON                                                        
     C                   EVAL      MSGER='ADP0304'                                                  
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           HELPT                                              
      * Si no han realizado ninguna selección no tocamos nada                                       
     C                   IF        @PEERR='A'                                                       
     C                   EVAL      ERRGRL=*ON                                                       
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           HELPT                                              
     C                   IF        FIELD='CCCFMT'                                                   
     C                   EVAL      CCCFMT=@PEOPT                                                    
     C                   ENDIF                                                                      
     C                   IF        FIELD='SUFOPCI'                                                  
    C                   EVAL      ZXNRR00=SFLPOS1+(CSRFILA-13)                                     
     C     ZXNRR00       CHAIN     SUFD                               81                            
     C                   IF        CHAIN=*OFF                                                       
     C                   EVAL      SUFOPCI=@PEOPT                                                   
     C                   EVAL      SFLNXC=*ON                                                       
     C                   UPDATE    SUFD                                                             
     C                   EVAL      ERRGRL=*ON                                                       
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
     C     HELPT         TAG                                                                        
      * F03=SORTIR DEL PROGRAMA                                                                     
     C                   WHEN      EXIT=*ON                                                         
     C                   IF        ZXERRO='1'                                                       
     C                   EXSR      CS_CANCELAR                                                      
     C                   ENDIF                                                                      
     C                   EVAL      ZXOPT1='END'                                                     
      * F12=CANCELAR                                                                                
     C                   WHEN      RETRO=*ON                                                        
     C                   IF        ZXERRO='1'                                                       
     C                   EXSR      CS_CANCELAR                                                      
     C                   ENDIF                                                                      
     C                   EVAL      ZXOPT1='END'                                                     
      * F10=Confirmar                                                                               
     C                   WHEN      *IN10=*ON                                                        
      *                                                                                             
      * Validar los puntos de expedición no superen el parámetro                                    
      * al confirmar                                                                                
      *                                                                                             
     C                   IF        ZXERRO='1'                                                       
07111C*    KEDPARM       CHAIN     EDPARM                                                           
     C                   IF        NOT %FOUND(EDPARM)                                               
     C                             OR ZXPUEXP>T3PEXP                                                
FQ798C                             OR T3BAJA='1'                                                    
X1078C                   IF        T3ADOM<>'1'                                                      
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      WRK40=*ON                                                        
     C                   EVAL      MSGER='ERR3042'                                                  
     C                   EVAL      ZXOPT2='DSP'                                                     
X1078C                   ENDIF                                                                      
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           SFLCMDT                                            
     C                   ENDIF                                                                      
     C                   EVAL      ZXOPT1='END'                                                     
      *                                                                                             
      * PAGINAR                                                                                     
     C                   WHEN      ROLLUP=*ON                                                       
     C                   EVAL      ACCREF=*OFF                                                      
     C                   EVAL      ZXOPT2='INZ'                                                     
      * PAGINAR                                                                                     
     C                   WHEN      ROLLDOWN=*ON                                                     
     C                   EVAL      ZXSEMF=*BLANKS                                                   
     C                   EXSR      CS_RSTFK                                                         
     C                   EXSR      CS_ROLLDOWN                                                      
     C                   EVAL      ACCREF=*OFF                                                      
     C                   EVAL      ZXOPT2='CLR'                                                     
     C                   ENDSL                                                                      
                                                                                                    
     C     SFLCMDT       TAG                                                                        
     C                   IF        ERRGRL=*ON AND ACCREF=*ON                                        
     C                   EVAL      ACCREF=*OFF                                                      
     C                   ENDIF                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VALIDACIÓ DELS CMD'S                             *                                
      *------------------------------------------------------------*                                
     C     CS_SECCMD     BEGSR                                                                      
      * Validacion de seguridad teclas de función                                                   
     C                   EVAL      @PEFLD=*BLANKS                                                   
     C                   EVAL      @PEOPT=*BLANKS                                                   
     C                   EVAL      @PEFMT=*BLANKS                                                   
     C                   EVAL      @PEFLD='OPCI'                                                    
     C                   EVAL      @PEPGM=*BLANKS                                                   
     C                   EVAL      @PEPGM=SDSPGM                                                    
     C                   IF        CREATE=*ON                                                       
     C                   EVAL      @PEOPT='1 '                                                      
     C                   ENDIF                                                                      
     C                   EXSR      CS_SECMDOP                                                       
     C     ERRGRL        CABEQ     *ON           SECCMDT                                            
     C     SECCMDT       ENDSR                                                                      
      **************************************************************                                
      * COMMON SUBRUTINE (CS_) :                                  *                                 
      * SUBRUTINA VALIDACIÓ DEL SFL: FORMAT SFL I OPCIONS          *                                
      *------------------------------------------------------------*                                
     C     CS_SFLCHK     BEGSR                                                                      
     C                   EVAL      ACCREF=*ON                                                       
      *                                                                                             
     C                   EXSR      CS_CHKOPT                                                        
     C     ERRGRL        CABEQ     *ON           SFLCHKT                                            
      *                                                                                             
     C     SFLCHKT       TAG                                                                        
     C                   IF        ERRGRL=*ON AND ACCREF=*ON                                        
     C                   EVAL      ACCREF=*OFF                                                      
     C                   ENDIF                                                                      
      *                                                                                             
     C                   ENDSR                                                                      
      **************************************************************                                
      * COMMON SUBRUTINE (CS_) :                                  *                                 
      * SUBRUTINA DE 1er REGISTRE DE PANTALLA DE SUBARXIUS         *                                
      *------------------------------------------------------------*                                
     C     CS_RSTFK      BEGSR                                                                      
     C                   EVAL      S5TPE4=ZXTPE4_1                                                  
     C                   EVAL      S5LOGE=ZXLOGE_1                                                  
     C     RSTFKT        ENDSR                                                                      
      **************************************************************                                
      * COMMON SUBRUTINE (CS_) :                                  *                                 
      * SUBRUTINA DE NETEJA DE CAMPS DE POSIBLES CLAUS             *                                
      *------------------------------------------------------------*                                
     C     CS_CLRK       BEGSR                                                                      
     C                   CLEAR                   S5TPE4                                             
     C                   CLEAR                   S5LOGE                                             
     C     CLRKT         ENDSR                                                                      
      **************************************************************                                
      * COMMON SUBRUTINE (CS_) :                                  *                                 
      * SUBRUTINA DE TRATAMIENTO DE OPCIONES EN SUBARCHIVO         *                                
      *------------------------------------------------------------*                                
     C     CS_CHKOPT     BEGSR                                                                      
      *                                                                                             
      * Validacion clase de subarchivo                                                              
      *                                                                                             
     C                   EVAL      @PEFLD=*BLANKS                                                   
     C                   EVAL      @PEOPT=*BLANKS                                                   
     C                   EVAL      @PEFMT=*BLANKS                                                   
     C                   EVAL      @PEFLD='CFMT'                                                    
     C                   EVAL      @PEOPT=CCCFMT                                                    
     C                   CALL      'MMPROM'                                     Query-Aut-F4   X    
     C                   PARM                    @PEOPT                         PARM Qry-F4         
     C                   PARM      SDSPGM        @PEPGM                         PARM Qry-F4         
     C                   PARM                    @PEFMT                         PARM Qry-F4         
     C                   PARM                    @PEFLD                         PARM Qry-F4         
     C                   PARM      'V'           @PEERR                         PARM Qry-F4         
      *                                                                                             
     C                   IF        @PEERR>'0'                                                       
     C                   EVAL      ZXFMT=CCCFMT                                                     
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      WRK40=*ON                                                        
     C                   EVAL      MSGER='ASG1003'                                                  
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           CHKOPTT                                            
      *                                                                                             
      * VALIDACIO DE LES OPCIONS DE DETALL DEL SFL                                                  
      *                                                                                             
     C                   EVAL      ACCREF=*OFF                                                      
     C                   EVAL      EOF=*OFF                                                         
     C                   IF        SFLDSP=*ON                                                       
      *                                                                                             
     C                   DO        *HIVAL                                                           
     C                   READC     SUFD                                   82                        
     C                   IF        EOF=*ON                                                          
     C                   LEAVE                                                                      
     C                   ENDIF                                                                      
     C                   EVAL      ACCREF=*ON                                                       
     C                   EVAL      ZXOPT2='CLR'                                                     
      * Validacion opciones de subarchivo                                                           
     C                   EVAL      SFLNXC=*OFF                                                      
     C                   IF        SUFOPCI=*BLANKS                                                  
     C                   GOTO      TNEXOPC                                                          
     C                   ELSE                                                                       
     C                   EVAL      ZXCOUNT=ZXNRR00                                                  
     C                   ENDIF                                                                      
      *                                                                                             
     C                   EVAL      @PEFLD=*BLANKS                                                   
     C                   EVAL      @PEFMT=*BLANKS                                                   
     C                   EVAL      @PEFLD='OPCI'                                                    
     C                   EVAL      @PEOPT=SUFOPCI                                                   
     C                   EVAL      @PEPGM=SDSPGM                                                    
     C                   EXSR      CS_SECMDOP                                                       
     C                   IF        ERRGRL=*ON                                                       
     C                   EVAL      WRK41=*ON                                                        
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TNEXOPC                                            
      *                                                                                             
      * Seguridad por usuario y en comercial                                                        
      *                                                                                             
IT244C                   IF        MML016<>'1' AND                                                  
     C                             @PEOPT='1D'                                                      
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      WRK41=*ON                                                        
     C                   EVAL      SFLNXC=*ON                                                       
     C                   EVAL      MSGER='MSG0208'                                                  
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TNEXOPC                                            
      *                                                                                             
     C                   IF        MML016<>'1' AND @PEOPT='4D'                                      
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      WRK41=*ON                                                        
     C                   EVAL      SFLNXC=*ON                                                       
     C                   EVAL      MSGER='MSG0208'                                                  
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TNEXOPC                                            
      *                                                                                             
     C                   IF        (@PEOPT='1D' OR @PEOPT='4D')                                     
     C                             AND (S0PPED='99' OR ZZALOL='1')                                  
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      WRK41=*ON                                                        
     C                   EVAL      SFLNXC=*ON                                                       
     C                   EVAL      MSGER='MSG0064'                                                  
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TNEXOPC                                            
      *                                                                                             
     C                   IF        @PEOPT='1D' AND SUFTPE4='2'                                      
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      WRK41=*ON                                                        
     C                   EVAL      SFLNXC=*ON                                                       
     C                   EVAL      MSGER='MSG0064'                                                  
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TNEXOPC                                            
      *                                                                                             
     C                   IF        @PEOPT='4D' AND SUFTPE4<>'2'                                     
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      WRK41=*ON                                                        
     C                   EVAL      SFLNXC=*ON                                                       
     C                   EVAL      MSGER='MSG0064'                                                  
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TNEXOPC                                            
      *                                                                                             
     C                   IF        @PEOPT='1D'                                                      
mod03 *     C                   EVAL      @FDEDAU='010'                                             
mod03                    @fdedau = '403';                                                           
     C                   EXSR      FD_VALIDA                                                        
     C                   IF        @FDERRO='1'                                                      
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      WRK41=*ON                                                        
     C                   EVAL      SFLNXC=*ON                                                       
E7391C                   IF        MSGER=*BLANKS                                                    
     C                   EVAL      MSGER='MSG0064'                                                  
E7391C                   ENDIF                                                                      
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TNEXOPC                                            
      *                                                                                             
     C                   IF        @PEOPT='4D'                                                      
     C                   EVAL      @FDEDAU='009'                                                    
14040C                   IF        ZXERRO<'1'                                                       
mod03 *     C                   EXSR      FD_VALIDA                                                 
mod03 *     C                   IF        @FDERRO='1'                                               
mod03 *     C                   EVAL      ERRGRL=*ON                                                
mod03 *     C                   EVAL      WRK41=*ON                                                 
mod03 *     C                   EVAL      SFLNXC=*ON                                                
mod03 *     C                   EVAL      MSGER='MSG0064'                                           
mod02 *     C                   ENDIF                                                               
14040C                   ENDIF                                                                      
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TNEXOPC                                            
      *                                                                                             
      * Ejecutar                                                                                    
      *                                                                                             
     C                   SELECT                                                                     
      *                                                                                             
      * Poner toda la logística seleccionada como ED                                                
      *                                                                                             
     C                   WHEN      @PEOPT='1D'                                                      
IT244C                   IF        S0CEVT <> '1'                                                    
IT244C                   CLEAR                   W16                                                
IT244C                   EVAL      PPPCMD1 = 'CMD2113'                                              
IT244C                   EVAL      W16CUST = S0CUST                                                 
IT244C                   EVAL      W16DES1 = S0DES1                                                 
IT244C                   EXFMT     W16                                                              
IT244C                   IF        *IN12  OR  W16SINO <> '1'                                        
IT244C                   GOTO      TNEXOPC                                                          
IT244C                   ENDIF                                                                      
IT244C                   ENDIF                                                                      
     C                   EXSR      CS_LOGENED                                                       
     C                   EVAL      ZXOPT='S01CLR'                                                   
     C                   EVAL      SUFOPCI=*BLANKS                                                  
     C                   EVAL      SFLNXC=*OFF                                                      
      *                                                                                             
      * Poner toda la logística seleccionada como EN                                                
      *                                                                                             
     C                   WHEN      @PEOPT='4D'                                                      
     C                   EXSR      CS_LOGEDEN                                                       
     C                   EVAL      ZXOPT='S01CLR'                                                   
     C                   EVAL      SUFOPCI=*BLANKS                                                  
     C                   EVAL      SFLNXC=*OFF                                                      
IT244 *                                                                                             
IT244 * Detalle Punto Expedición                                                                    
IT244 *                                                                                             
IT244C                   WHEN      @PEOPT='15'                                                      
IT244C                   EVAL      @FDP = (S01DESL = '*P')                                          
IT244C                   CALL      'ED3062'                                                         
IT244C*mmn               PARM      S01LOGE       @FDLOGE                                            
IT244C                   PARM      SUFLOGE       @FDLOGE                                            
IT244C                   PARM                    @FDP                                               
IT244C                   PARM      SUFDLGA       @FDDLGA                                            
IT244C                   PARM      SUCNPCO       @FDNPCO                                            
IT244C                   PARM      SUFTPED       @FDTPED                                            
IT244C                   PARM      SUFDATP       @FDDATP                                            
IT244C                   PARM      SUFNOPL       @FDNOPL                                            
IT244C                   PARM      SUCCUST       @FDCUST                                            
IT244C                   PARM      ZXCOCAMB      @FDCAMBIO                                          
IT244C                   PARM      ZXARTPOR      @FDARTPOR                                          
IT244C                   PARM      ZZNPG2        @FDSEGCOS                                          
IT244C                   EVAL      ZXOPT='S01CLR'                                                   
IT244C                   EVAL      SUFOPCI=*BLANKS                                                  
IT244C                   EVAL      SFLNXC=*OFF                                                      
      *                                                                                             
     C                   ENDSL                                                                      
      *                                                                                             
     C     TNEXOPC       TAG                                                                        
     C                   UPDATE    SUFD                                                             
     C                   IF        ERRGRL=*ON                                                       
     C                   EVAL      ZXOPT2='DSP'                                                     
     C                   EVAL      ZXCOUNT=ZXNRR00                                                  
     C                   EXSR      CS_POSCER0                                                       
     C                   LEAVE                                                                      
     C                   ENDIF                                                                      
     C                   ENDDO                                                                      
      *                                                                                             
      * Si existen errores entonces mantengo la posicion del primer error                           
      * y muestro pantalla                                                                          
      *                                                                                             
     C                   ENDIF                                                                      
      *                                                                                             
     C                   IF        ERRGRL=*OFF                                                      
     C                   EXSR      CS_RSTFK                                                         
     C                   EXSR      CS_POSCER0                                                       
     C                   ENDIF                                                                      
      *                                                                                             
     C     CHKOPTT       ENDSR                                                                      
      **************************************************************                                
      * COMMON SUBRUTINE (CS_) :                                  *                                 
      * SUBRUTINA DE POSICIONAMENT DEL CURSOR                      *                                
      *------------------------------------------------------------*                                
     C     CS_POSCUR     BEGSR                                                                      
      * OBTENIM LA POSICIO DEL CURSOR                                                               
     C     SFLPOCUR      DIV       256           CSRFILA                                            
     C                   MVR                     CSRCOLU                                            
     C                   EVAL      ZXLINEA=CSRFILA                                                  
     C                   EVAL      ZXCOLU=CSRCOLU                                                   
     C                   ENDSR                                                                      
      **************************************************************                                
      * COMMON SUBRUTINE (CS_) :                                  *                                 
      * SUBRUTINA DE POSICIONAMENT DEL CURSOR                      *                                
      *------------------------------------------------------------*                                
     C     CS_POSCER0    BEGSR                                                                      
     C* Línea de subarchivo donde se posiciona cursor si error en opción                            
     C                   IF        ZXLIPAG<>0                                                       
     C     ZXCOUNT       DIV       ZXLIPA2       ZXAU15                                             
     C                   MVR                     CSRFILA                                            
     C                   IF        CSRFILA=0 AND ZXAU15>0                                           
     C                   EVAL      CSRFILA=ZXLIPA2                                                  
     C                   ENDIF                                                                      
     C                   EVAL      CSRFILA=CSRFILA+13-1                                             
     C                   ENDIF                                                                      
     C                   EVAL      CSRCOLU=4                                                        
     C                   IF        CSRFILA<=0                                                       
     C                   EVAL      CSRFILA=0                                                        
     C                   EVAL      CSRCOLU=0                                                        
     C                   ENDIF                                                                      
      *                                                                                             
     C                   ENDSR                                                                      
      **************************************************************                                
      * COMMON SUBRUTINE (CS_) :                                  *                                 
      * SUBRUTINA VISUALITZACIÓ SFL                                *                                
      *------------------------------------------------------------*                                
     C     CS_SFLDSP     BEGSR                                                                      
     C                   EVAL      ZXOPT2='CMD'                                                     
      * Posicionament en el subarxiu si no s'ha realitzat cap acció                                 
     C                   IF        ACCREF=*OFF AND SFLDSP=*ON                                       
     C                   EVAL      SUFRCDN=ZXCOUNT                                                  
     C                   ENDIF                                                                      
                                                                                                    
     C                   WRITE     SUFP                                                             
     C                   EXFMT     SUFC                                                             
     C* Guardem el nº de registre que es visualitza actualment per no                               
     C* canviar de pàgina si no fan res                                                             
     C                   EVAL      ZXCOUNT=SFLPOS1                                                  
     C                   EVAL      ERRGRL=*OFF                                                      
     C                   EVAL      MSGER=*BLANKS                                                    
     C                   MOVEA     ZXZERO10      *IN(40)                                            
     C                   MOVEA     ZXZERO10      *IN(50)                                            
     C     SFLDSPT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA PER MOURE CAMPS AL SFL                           *                                
      *------------------------------------------------------------*                                
     C     S01MFP        BEGSR                                                                      
     C                   EVAL      SUFOPCI=*BLANKS                                                  
     C                   EVAL      SFLNXC=*OFF                                                      
     C                   EVAL      S01TPE4=ZXRUTPE4                                                 
mod01                    s01colcod = *blanks;                                                       
mod01                    s01colres = *blanks;                                                       
                                                                                                    
     C                   EVAL      S01DESL=*BLANKS                                                  
     C                   EVAL      MICIAS=@PCIAS                                                    
     C                   EVAL      MIDLGA=*BLANKS                                                   
      **                                                                                            
     C                   IF        S01TPE4='2'                                                      
mod01                      s01colcod = cRGr;                                                        
mod01                      s01colres = cNGr;                                                        
IT228c                   if        (%lookup(ZXRULOGE:T_logol)>0)                                    
IT228C                   EVAL      ZXLOGOL=ZXRULOGE                                                 
IT228C                   EVAL      M_M0LOGE=ZXRULOGE                                                
IT228C                   ELSE                                                                       
IT228C*_call al MM1411_________                                                                     
IT228C                   EXSR      LOG_VIRTUAL                                                      
IT228C                   EVAL      M_M0LOGE=@PERESP                                                 
IT228C                   EVAL      ZXLOGOL=@PERESP                                                  
IT228C                   endif                                                                      
     C                   EVAL      S01LOGE=ZXLOGOL                                                  
     C                   EVAL      MILGCA=ZXLOGOL                                                   
IT228C                   EVAL      M_M0LOGE=ZXRULOGE                                                
C2557C     KMSALMA05     CHAIN     MSALMA05                                                         
C2557C                   IF        %FOUND AND M_M0TAL1='7'                                          
C2557C                   EVAL      S01LOGE=ZXRULOGE                                                 
C2557C                   EVAL      MILGCA=ZXRULOGE                                                  
C2557C                   ENDIF                                                                      
     C                   ELSE                                                                       
     C                   EVAL      S01LOGE=ZXRULOGE                                                 
     C                   EVAL      MILGCA=ZXRULOGE                                                  
     C                   ENDIF                                                                      
     C     KMSLOGI       CHAIN     MSLOGI                                                           
     C                   IF        %FOUND(MSLOGI)                                                   
     C                   EVAL      S01DESL=MIDESC                                                   
     C                   ENDIF                                                                      
IT228 *     C                   IF        ZXRULOGE=ZXLOGOL AND ZXRUSIOL='2'                         
IT228c                   if        (%lookup(zxruloge:T_logol)>0)                                    
IT228c                             and zxrusiol='2'                                                 
     C                   MOVEL(P)  '*P'          S01DESL                                            
     C                   ENDIF                                                                      
      *                                                                                             
      * Cantidad de Líneas del Origen de la expedición y % sobre total                              
      *                                                                                             
     C                   EVAL      PXALPH=*BLANKS                                                   
     C                   EVAL      PXNUM=ZXOLIN                                                     
     C                   CALL      'PRD650'                                                         
     C                   PARM                    PXNUM                          CAMP NUMÈRIC        
     C                   PARM                    PXALPH                         CAMP ALFANUMÈRIC    
     C                   PARM                    PXFLDD                         Nº CARACT. VISUA    
     C                   PARM      0             PXDCCD                         Nº DECIMALS         
     C                   PARM                    PXFMD1                         AJUST DECIMAL (.    
     C                   PARM      'Z'           PXEDTC                         CODI EDICIO(4,M,    
     C                   PARM                    PXNMER                         RETORN ERROR        
     C                   PARM                    PXTIPA                         TIPO AJUSTE (0,1    
     C                   MOVE      PXALPH        S01QLIN                                            
      *                                                                                             
     C                   IF        ZXOLIN=ZXTLIN                                                    
     C                   EVAL      PXNUM=100                                                        
     C                   ELSE                                                                       
     C                   IF        ZXTLIN<>0                                                        
     C                   EVAL      PXNUM=(ZXOLIN*100)/ZXTLIN                                        
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
     C                   EVAL      PXALPH=*BLANKS                                                   
     C                   CALL      'PRD650'                                                         
     C                   PARM                    PXNUM                          CAMP NUMÈRIC        
     C                   PARM                    PXALPH                         CAMP ALFANUMÈRIC    
     C                   PARM                    PXFLDD                         Nº CARACT. VISUA    
     C                   PARM      2             PXDCCD                         Nº DECIMALS         
     C                   PARM                    PXFMD1                         AJUST DECIMAL (.    
     C                   PARM      '4'           PXEDTC                         CODI EDICIO(4,M,    
     C                   PARM                    PXNMER                         RETORN ERROR        
     C                   PARM                    PXTIPA                         TIPO AJUSTE (0,1    
     C                   MOVE      PXALPH        S01PLIN                                            
      *                                                                                             
     C                   EVAL      PXALPH=*BLANKS                                                   
     C                   EVAL      PXNUM=ZXVNETCO*ZXCOCAMB                                          
     C                   EVAL      ZXVTOTCO=PXNUM                                                   
     C                   CALL      'PRD650'                                                         
     C                   PARM                    PXNUM                          CAMP NUMÈRIC        
     C                   PARM                    PXALPH                         CAMP ALFANUMÈRIC    
     C                   PARM                    PXFLDD                         Nº CARACT. VISUA    
     C                   PARM      2             PXDCCD                         Nº PXDCCDLS         
     C                   PARM                    PXFMD1                         AJUST DECIMAL (.    
     C                   PARM                    PXEDTC                         CODI EDICIO(4,M,    
     C                   PARM                    PXNMER                         RETORN ERROR        
     C                   PARM                    PXTIPA                         TIPO AJUSTE (0,1    
     C                   MOVE      PXALPH        S01NETO                                            
                                                                                                    
     C                   EVAL      PXALPH=*BLANKS                                                   
     C                   EVAL      PXNUM=ZXVIVACO*ZXCOCAMB                                          
     C                   EVAL      ZXVTOTCO=ZXVTOTCO+PXNUM                                          
     C                   CALL      'PRD650'                                                         
     C                   PARM                    PXNUM                          CAMP NUMÈRIC        
     C                   PARM                    PXALPH                         CAMP ALFANUMÈRIC    
     C                   PARM                    PXFLDD                         Nº CARACT. VISUA    
     C                   PARM      2             PXDCCD                         Nº DECIMALS         
     C                   PARM                    PXFMD1                         AJUST DECIMAL (.    
     C                   PARM                    PXEDTC                         CODI EDICIO(4,M,    
     C                   PARM                    PXNMER                         RETORN ERROR        
     C                   PARM                    PXTIPA                         TIPO AJUSTE (0,1    
     C********           MOVE      PXALPH        S01IVA                                             
                                                                                                    
     C                   EVAL      PXALPH=*BLANKS                                                   
     C                   EVAL      PXNUM=ZXVTOTCO                                                   
     C                   CALL      'PRD650'                                                         
     C                   PARM                    PXNUM                          CAMP NUMÈRIC        
     C                   PARM                    PXALPH                         CAMP ALFANUMÈRIC    
     C                   PARM                    PXFLDD                         Nº CARACT. VISUA    
     C                   PARM      2             PXDCCD                         Nº DECIMALS         
     C                   PARM                    PXFMD1                         AJUST DECIMAL (.    
     C                   PARM                    PXEDTC                         CODI EDICIO(4,M,    
     C                   PARM                    PXNMER                         RETORN ERROR        
     C                   PARM                    PXTIPA                         TIPO AJUSTE (0,1    
     C*******            MOVE      PXALPH        S01TOT                                             
                                                                                                    
     C                   EVAL      PXALPH=*BLANKS                                                   
     C                   EVAL      PXNUM=ZXVOLCO                                                    
     C                   CALL      'PRD650'                                                         
     C                   PARM                    PXNUM                          CAMP NUMÈRIC        
     C                   PARM                    PXALPH                         CAMP ALFANUMÈRIC    
     C                   PARM                    PXFLDD                         Nº CARACT. VISUA    
     C                   PARM      3             PXDCCD                         Nº DECIMALS         
     C                   PARM                    PXFMD1                         AJUST DECIMAL (.    
     C                   PARM                    PXEDTC                         CODI EDICIO(4,M,    
     C                   PARM                    PXNMER                         RETORN ERROR        
     C                   PARM                    PXTIPA                         TIPO AJUSTE (0,1    
     C                   MOVE      PXALPH        S01VOL                                             
                                                                                                    
     C                   EVAL      PXALPH=*BLANKS                                                   
     C                   EVAL      PXNUM=ZXIVOLCO                                                   
     C                   CALL      'PRD650'                                                         
     C                   PARM                    PXNUM                          CAMP NUMÈRIC        
     C                   PARM                    PXALPH                         CAMP ALFANUMÈRIC    
     C                   PARM                    PXFLDD                         Nº CARACT. VISUA    
     C                   PARM      2             PXDCCD                         Nº DECIMALS         
     C                   PARM                    PXFMD1                         AJUST DECIMAL (.    
     C                   PARM                    PXEDTC                         CODI EDICIO(4,M,    
     C                   PARM                    PXNMER                         RETORN ERROR        
     C                   PARM                    PXTIPA                         TIPO AJUSTE (0,1    
     C                   MOVE      PXALPH        S01IVOL                                            
                                                                                                    
     C                   EVAL      PXALPH=*BLANKS                                                   
     C                   EVAL      PXNUM=ZXIMARCO                                                   
     C                   CALL      'PRD650'                                                         
     C                   PARM                    PXNUM                          CAMP NUMÈRIC        
     C                   PARM                    PXALPH                         CAMP ALFANUMÈRIC    
     C                   PARM                    PXFLDD                         Nº CARACT. VISUA    
     C                   PARM      2             PXDCCD                         Nº DECIMALS         
     C                   PARM                    PXFMD1                         AJUST DECIMAL (.    
     C                   PARM                    PXEDTC                         CODI EDICIO(4,M,    
     C                   PARM                    PXNMER                         RETORN ERROR        
     C                   PARM                    PXTIPA                         TIPO AJUSTE (0,1    
     C                   MOVE      PXALPH        S01IMAR                                            
                                                                                                    
     C                   EVAL      PXDCCD=2                                                         
     C                   EVAL      PXEDTC='4'                                                       
                                                                                                    
     C                   EXSR      CS_DETSEG                                                        
                                                                                                    
     C                   EXSR      CS_KEYPF                                                         
     C                   EVAL      SUFDATA=W1DATA                                                   
IT244C                   EVAL      SUFDLGA = S0DLGA                                                 
IT244C                   EVAL      SUFTPED = S0TPED                                                 
IT244C                   EVAL      SUFDATP = S0DATP                                                 
IT244C                   EVAL      SUFNOPL = S0NOPL                                                 
     C     S01MFPT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA QUE GUARDA LAS CLAVES DE TODOS TIPOS DE SFL      *                                
      *------------------------------------------------------------*                                
     C     CS_KEYPF      BEGSR                                                                      
     C                   EVAL      SUFTPE4=ZXRUTPE4                                                 
     C                   EVAL      SUFLOGE=ZXRULOGE                                                 
     C                   ENDSR                                                                      
      **************************************************************                                
      * Busca nueva situación del SFL.                             *                                
      *------------------------------------------------------------*                                
     C     CS_ROLLDOWN   BEGSR                                                                      
                                                                                                    
     C                   RESET                   ZXLOP00                                            
     C                   RESET                   ZXLIPAG                                            
     C                   EVAL      ZXCOUNT=1                                                        
                                                                                                    
     C                   IF        ZXSEMF=*BLANKS                                                   
     C                   EVAL      ZXLIPAG=ZXLIPAG+1                                                
     C                   ENDIF                                                                      
                                                                                                    
     C     KCODEPE26     SETGT     CODEPE26                                                         
                                                                                                    
     C                   DOW       ZXLOP00 < ZXLIPAG                                                
     C     KCODEPE26     READPE    CODEPE26                               82                        
                                                                                                    
     C                   IF        EOF=*ON                                                          
     C                   LEAVE                                                                      
     C                   ENDIF                                                                      
     C                   EVAL      ZXLOP00=ZXLOP00+1                                                
     C     TNEXDOWN      TAG                                                                        
     C                   ENDDO                                                                      
     C                                                                                              
     C                   IF        ZXSEMF=*BLANKS AND                                               
     C                             EOF=*ON        AND                                               
     C                             ZXLOP00=1                                                        
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='MSG0114'                                                  
     C                   ENDIF                                                                      
     C                   EVAL      ZXCOMCAR=0                                                       
     C                   EXSR      CS_SAVFK                                                         
     C                   EVAL      ZXSEMF=*BLANKS                                                   
                                                                                                    
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA QUE BUSCA DATOS DE CABECERA                      *                                
      *------------------------------------------------------------*                                
     C     CS_CABINZ     BEGSR                                                                      
      *                                                                                             
     C                   EVAL      SUCNPCO=@PNPCO                                                   
     C     KCOCAPE       CHAIN(N)  COCAPE                                                           
      *                                                                                             
     C                   EVAL      ZXMONV=ZZMONE                                                    
     C                   EVAL      ZXCOCAMB=1                                                       
     C                   EXSR      CS_ZXCOCAM                                                       
      *                                                                                             
      * Guardo si tiene artículo de portes tipo APE                                                 
      *                                                                                             
     C                   EVAL      ZXARTPOR=*BLANKS                                                 
     C                   EVAL      PECIAS=@PCIAS                                                    
     C                   EVAL      PECTAB='PORT'                                                    
     C                   EVAL      PECLTA='ARTICULO'                                                
     C     KPMTABD       CHAIN     PMTABD                                                           
     C                   IF        %FOUND(PMTABD)                                                   
     C                   EVAL      ZXARTPOR=PEDESC                                                  
     C                   ENDIF                                                                      
      *                                                                                             
      * Miro si tiene portes con cálculo APE                                                        
      *                                                                                             
     C                   EVAL      SUCIPOR=*BLANKS                                                  
     C                   EVAL      ZXIPOR=0                                                         
     C                   EVAL      ZXTLIN=0                                                         
     C                   EVAL      S5LINE=0                                                         
     C     KCODEPE       SETLL     CODEPE                                                           
     C     KCOCAPE       READE(N)  CODEPE                                                           
     C                   DOW       NOT %EOF(CODEPE)                                                 
     C****               IF        S5ARTI=ZXARTPOR AND S5STUL<'5'                                   
     C                   IF        S5ARTI=ZXARTPOR                                                  
     C                   EXSR      CS_VALLIN                                                        
     C                   EVAL      ZXIPOR=ZXIPOR+ZXVNET                                             
     C                   ENDIF                                                                      
     C                   IF        S5ARTI<>ZXARTPOR                                                 
     C                   EVAL      ZXTLIN=ZXTLIN+1                                                  
     C                   ENDIF                                                                      
     C     KCOCAPE       READE(N)  CODEPE                                                           
     C                   ENDDO                                                                      
     C                   EVAL      *IN66=*OFF                                                       
     C                   IF        ZXIPOR<>0                                                        
     C                   EVAL      *IN66=*ON                                                        
     C                   EVAL      PXALPH=*BLANKS                                                   
     C                   EVAL      PXNUM=ZXIPOR*ZXCOCAMB                                            
     C                   EVAL      ZXIPOR=PXNUM                                                     
     C                   CALL      'PRD650'                                                         
     C                   PARM                    PXNUM                          CAMP NUMÈRIC        
     C                   PARM                    PXALPH                         CAMP ALFANUMÈRIC    
     C                   PARM                    PXFLDD                         Nº CARACT. VISUA    
     C                   PARM      2             PXDCCD                         Nº DECIMALS         
     C                   PARM                    PXFMD1                         AJUST DECIMAL (.    
     C                   PARM                    PXEDTC                         CODI EDICIO(4,M,    
     C                   PARM                    PXNMER                         RETORN ERROR        
     C                   PARM                    PXTIPA                         TIPO AJUSTE (0,1    
     C                   MOVE      PXALPH        SUCIPOR                                            
     C                   ENDIF                                                                      
      *                                                                                             
      * Resto de datos de cabecera                                                                  
      *                                                                                             
     C                   EVAL      SUCCUST=S0CUST                                                   
     C     KCOCLIN       CHAIN     COCLIN                                                           
     C                   EVAL      SUCCUSTD=S0DES1                                                  
      *                                                                                             
     C                   EXSR      CS_CMDCIM                                                        
     C                   EXSR      CS_VOLUPED                                                       
      *                                                                                             
     C                   MOVE      ZXVNETA       SUCNETO                                            
     C******             MOVE      ZXVIVAA       SUCIVA                                             
     C******             MOVE      ZXVTOTA       SUCTOT                                             
                                                                                                    
     C                   EVAL      SUCMONE=ZZMONE                                                   
     C                   EVAL      SUCUVOL=ZZUVOL                                                   
     C                   EVAL      SUCUVON=ZZUVOL                                                   
     C                   EVAL      SUCUVOM=ZZUVOL                                                   
      *                                                                                             
     C                   ENDSR                                                                      
      **************************************************************                                
      * Calcula importes para todas las vistas                     *                                
      *------------------------------------------------------------*                                
     C     CS_CMDCIM     BEGSR                                                                      
                                                                                                    
     C                   EVAL      SYCIAS=S0CIAS                                                    
     C                   EVAL      SYDLGA=S0DLGA                                                    
     C                   EVAL      SYNPCO=S0NPCO                                                    
     C                   EVAL      SYTPED=S0TPED                                                    
     C                   EVAL      SYDATP=S0DATP                                                    
     C                   EVAL      SYNOPL=S0NOPL                                                    
                                                                                                    
     C                   EVAL      ZXVNET=0                                                         
     C                   EVAL      ZXVIVA=0                                                         
     C                   EVAL      ZXVTOT=0                                                         
                                                                                                    
     C     KCOCAIM       SETLL     COCAIM                                                           
     C     KCOCAIM       READE     COCAIM                                 84                        
     C                   DOW       READ2=*OFF                                                       
     C                   EVAL      ZXVNET=ZXVNET+SYBIMP                                             
     C                   EVAL      ZXVIVA=ZXVIVA+SYIIV1+SYIIV2                                      
     C                   EXSR      CS_ZXCOCA2                                                       
     C     KCOCAIM       READE     COCAIM                                 84                        
     C                   ENDDO                                                                      
      * Le quito los portes tipo APE                                                                
     C                   EVAL      ZXVNET=ZXVNET-ZXIPOR                                             
      * Los descuentos a utilizar serán los previstos salvo que exista precio confirmado            
     C                   EVAL      ZXDTO11=S0DTO1                                                   
     C                   EVAL      ZXDTO21=S0DTO2                                                   
     C                   EVAL      ZXDTO31=S0DTO3                                                   
     C                   EVAL      ZXDTO41=S0DTO4                                                   
     C                   IF        S0CAMC<>0                                                        
     C                   EVAL      ZXDTO11=S0DT1C                                                   
     C                   EVAL      ZXDTO21=S0DT1C                                                   
     C                   EVAL      ZXDTO31=S0DT1C                                                   
     C                   EVAL      ZXDTO41=S0DT1C                                                   
     C                   ENDIF                                                                      
      * Trato los dtos sobre pedido                                                                 
     C                   EVAL      XZAUXI=ZXVNET                                                    
      * DTO1                                                                                        
     C                   EVAL      XZAUXI1=XZAUXI*ZXDTO11                                           
     C     XZAUXI1       DIV(H)    100           XZAUXI1                                            
     C                   EVAL      XZAUXI=XZAUXI-XZAUXI1                                            
      * DTO2                                                                                        
     C                   EVAL      XZAUXI1=XZAUXI *ZXDTO21                                          
     C     XZAUXI1       DIV(H)    100           XZAUXI1                                            
     C                   EVAL      XZAUXI =XZAUXI -XZAUXI1                                          
      * DTO3                                                                                        
     C                   EVAL      XZAUXI1=XZAUXI *ZXDTO31                                          
     C     XZAUXI1       DIV(H)    100           XZAUXI1                                            
     C                   EVAL      XZAUXI =XZAUXI -XZAUXI1                                          
      * DTO4                                                                                        
     C                   EVAL      XZAUXI1=XZAUXI *ZXDTO41                                          
     C     XZAUXI1       DIV(H)    100           XZAUXI1                                            
     C                   EVAL      XZAUXI =XZAUXI -XZAUXI1                                          
                                                                                                    
     C                   EVAL(H)   ZXVNET=XZAUXI                                                    
                                                                                                    
     C                   EVAL      XZAUXI=ZXVIVA                                                    
      * DTO1                                                                                        
     C                   EVAL      XZAUXI1=XZAUXI*ZXDTO11                                           
     C     XZAUXI1       DIV(H)    100           XZAUXI1                                            
     C                   EVAL      XZAUXI=XZAUXI-XZAUXI1                                            
      * DTO2                                                                                        
     C                   EVAL      XZAUXI1=XZAUXI *ZXDTO21                                          
     C     XZAUXI1       DIV(H)    100           XZAUXI1                                            
     C                   EVAL      XZAUXI =XZAUXI -XZAUXI1                                          
      * DTO3                                                                                        
     C                   EVAL      XZAUXI1=XZAUXI *ZXDTO31                                          
     C     XZAUXI1       DIV(H)    100           XZAUXI1                                            
     C                   EVAL      XZAUXI =XZAUXI -XZAUXI1                                          
      * DTO4                                                                                        
     C                   EVAL      XZAUXI1=XZAUXI *ZXDTO41                                          
     C     XZAUXI1       DIV(H)    100           XZAUXI1                                            
     C                   EVAL      XZAUXI =XZAUXI -XZAUXI1                                          
                                                                                                    
     C                   EVAL(H)   ZXVIVA=XZAUXI                                                    
      * Decimales de la moneda                                                                      
     C                   EVAL      MBMONE=ZXMONV                                                    
     C     KMSDIV0       CHAIN     MSDIV0                             81                            
                                                                                                    
     C                   EVAL      PXALPH=*BLANKS                                                   
     C                   EVAL      PXNUM=ZXVNET*ZXCOCAMB                                            
     C                   EVAL      ZXVTOT=PXNUM                                                     
     C                   CALL      'PRD650'                                                         
     C                   PARM                    PXNUM                          CAMP NUMÈRIC        
     C                   PARM                    PXALPH                         CAMP ALFANUMÈRIC    
     C                   PARM                    PXFLDD                         Nº CARACT. VISUA    
     C                   PARM      2             PXDCCD                         Nº DECIMALS         
     C                   PARM                    PXFMD1                         AJUST DECIMAL (.    
     C                   PARM                    PXEDTC                         CODI EDICIO(4,M,    
     C                   PARM                    PXNMER                         RETORN ERROR        
     C                   PARM                    PXTIPA                         TIPO AJUSTE (0,1    
     C                   MOVE      PXALPH        ZXVNETA                                            
                                                                                                    
     C                   EVAL      PXALPH=*BLANKS                                                   
     C                   EVAL      PXNUM=ZXVIVA*ZXCOCAMB                                            
     C                   EVAL      ZXVTOT=ZXVTOT+PXNUM                                              
     C                   CALL      'PRD650'                                                         
     C                   PARM                    PXNUM                          CAMP NUMÈRIC        
     C                   PARM                    PXALPH                         CAMP ALFANUMÈRIC    
     C                   PARM                    PXFLDD                         Nº CARACT. VISUA    
     C                   PARM      2             PXDCCD                         Nº DECIMALS         
     C                   PARM                    PXFMD1                         AJUST DECIMAL (.    
     C                   PARM                    PXEDTC                         CODI EDICIO(4,M,    
     C                   PARM                    PXNMER                         RETORN ERROR        
     C                   PARM                    PXTIPA                         TIPO AJUSTE (0,1    
     C                   MOVE      PXALPH        ZXVIVAA                                            
                                                                                                    
     C                   EVAL      PXALPH=*BLANKS                                                   
     C                   EVAL      PXNUM=ZXVTOT                                                     
     C                   CALL      'PRD650'                                                         
     C                   PARM                    PXNUM                          CAMP NUMÈRIC        
     C                   PARM                    PXALPH                         CAMP ALFANUMÈRIC    
     C                   PARM                    PXFLDD                         Nº CARACT. VISUA    
     C                   PARM      2             PXDCCD                         Nº DECIMALS         
     C                   PARM                    PXFMD1                         AJUST DECIMAL (.    
     C                   PARM                    PXEDTC                         CODI EDICIO(4,M,    
     C                   PARM                    PXNMER                         RETORN ERROR        
     C                   PARM                    PXTIPA                         TIPO AJUSTE (0,1    
     C                   MOVE      PXALPH        ZXVTOTA                                            
                                                                                                    
     C                   EVAL      PXDCCD=2                                                         
     C                   EVAL      PXEDTC='4'                                                       
     C                   ENDSR                                                                      
      **************************************************************                                
      * Calcula Volumen/Coste Total del Pedido                     *                                
      *------------------------------------------------------------*                                
     C     CS_VOLUPED    BEGSR                                                                      
      *                                                                                             
     C     KCODEPE26     SETLL     CODEPE26                                                         
     C     KCODEPE26     READE     CODEPE26                                                         
     C                   DOW       NOT %EOF(CODEPE26)                                               
      *                                                                                             
      * Omitir artículo de portes tipo APE                                                          
      *                                                                                             
     C                   IF        S5ARTI<>ZXARTPOR                                                 
      *                                                                                             
     C                   EVAL      XZCANT=S5CANT                                                    
     C                   IF        S5CANC<>0                                                        
     C                   EVAL      XZCANT=S5CANC                                                    
     C                   ENDIF                                                                      
IT244C                   EVAL      XZCANT2 = XZCANT                                                 
      *                                                                                             
     C                   CALL      'MM2686'                                                         
     C                   PARM      S5CIAS        @PECIAS                                            
     C                   PARM      S5ARTI        @PEARTI                                            
     C                   PARM      S5VARI        @PEVARI                                            
     C                   PARM      S5MODE        @PEMODE                                            
     C                   PARM      S5TCOJ        @PETCOJ                                            
     C                   PARM      XZCANT        @PECAST                                            
     C                   PARM      S5UNIM        @PEUNST                                            
     C                   PARM      0             @PEPBRE                                            
     C                   PARM      *BLANKS       @PEUPES                                            
     C                   PARM      0             @PEVOLB                                            
     C                   PARM      *BLANKS       @PEUVOL                                            
     C                   PARM      ZZUMED        @PEUMED                                            
     C                   PARM      0             @PENBUL                                            
     C                   PARM      *BLANKS       @PETPAL                                            
     C                   PARM      *BLANKS       @PETCT1                                            
     C                   PARM      *BLANKS       @PEVTC1                                            
     C                   PARM      *BLANKS       @PEERR                                             
                                                                                                    
     C                   EVAL(H)   ZXVOLA=ZXVOLA+@PEVOLB                                            
     C     KMSARTI00     CHAIN     MSARTI00                                                         
IT244C                   EVAL      ZXICOSA += M5COSM * XZCANT2                                      
      *                                                                                             
     C                   ENDIF                                                                      
      *                                                                                             
     C     KCODEPE26     READE     CODEPE26                                                         
     C                   ENDDO                                                                      
                                                                                                    
     C                   EVAL      PXALPH=*BLANKS                                                   
     C                   EVAL      PXNUM=ZXVOLA                                                     
     C                   CALL      'PRD650'                                                         
     C                   PARM                    PXNUM                          CAMP NUMÈRIC        
     C                   PARM                    PXALPH                         CAMP ALFANUMÈRIC    
     C                   PARM                    PXFLDD                         Nº CARACT. VISUA    
     C                   PARM      2             PXDCCD                         Nº DECIMALS         
     C                   PARM                    PXFMD1                         AJUST DECIMAL (.    
     C                   PARM                    PXEDTC                         CODI EDICIO(4,M,    
     C                   PARM                    PXNMER                         RETORN ERROR        
     C                   PARM                    PXTIPA                         TIPO AJUSTE (0,1    
     C                   MOVE      PXALPH        SUCVOL                                             
                                                                                                    
     C                   EVAL      ZXIVOLA=0                                                        
     C                   IF        ZXVOLA<>0                                                        
     C                   EVAL      ZXVNET=ZXVNET*ZXCOCAMB                                           
     C                   EVAL(H)   ZXIVOLA=(ZXVNET/ZXVOLA)                                          
     C                   ENDIF                                                                      
     C                   EVAL      ZXMVOLA=0                                                        
     C                   EVAL      ZXIMARA=ZXVNET-ZXICOSA                                           
     C                   IF        ZXVOLA<>0                                                        
     C                   EVAL(H)   ZXMVOLA=(ZXIMARA/ZXVOLA)                                         
     C                   ENDIF                                                                      
     C                   EVAL      SUCPMAR=0                                                        
     C                   IF        ZXIMARA<>0 AND ZXVNET<>0                                         
     C                   EVAL(H)   ZXHLONG=(ZXIMARA*100)/ZXVNET                                     
     C                   IF        ZXHLONG<-999,99                                                  
     C                   EVAL      SUCPMAR=-999,99                                                  
     C                   ELSE                                                                       
     C                   IF        ZXHLONG>999,99                                                   
     C                   EVAL      SUCPMAR=999,99                                                   
     C                   ELSE                                                                       
     C                   EVAL(H)   SUCPMAR=ZXHLONG                                                  
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
      *                                                                                             
     C                   EVAL      PXALPH=*BLANKS                                                   
     C                   EVAL      PXNUM=ZXIVOLA                                                    
     C                   CALL      'PRD650'                                                         
     C                   PARM                    PXNUM                          CAMP NUMÈRIC        
     C                   PARM                    PXALPH                         CAMP ALFANUMÈRIC    
     C                   PARM                    PXFLDD                         Nº CARACT. VISUA    
     C                   PARM      2             PXDCCD                         Nº DECIMALS         
     C                   PARM                    PXFMD1                         AJUST DECIMAL (.    
     C                   PARM                    PXEDTC                         CODI EDICIO(4,M,    
     C                   PARM                    PXNMER                         RETORN ERROR        
     C                   PARM                    PXTIPA                         TIPO AJUSTE (0,1    
     C                   MOVE      PXALPH        SUCIVOL                                            
      *                                                                                             
     C                   EVAL      PXALPH=*BLANKS                                                   
     C                   EVAL      PXNUM=ZXICOSA                                                    
     C                   CALL      'PRD650'                                                         
     C                   PARM                    PXNUM                          CAMP NUMÈRIC        
     C                   PARM                    PXALPH                         CAMP ALFANUMÈRIC    
     C                   PARM                    PXFLDD                         Nº CARACT. VISUA    
     C                   PARM      2             PXDCCD                         Nº DECIMALS         
     C                   PARM                    PXFMD1                         AJUST DECIMAL (.    
     C                   PARM                    PXEDTC                         CODI EDICIO(4,M,    
     C                   PARM                    PXNMER                         RETORN ERROR        
     C                   PARM                    PXTIPA                         TIPO AJUSTE (0,1    
     C                   MOVE      PXALPH        SUCICOS                                            
      *                                                                                             
     C                   EVAL      PXALPH=*BLANKS                                                   
     C                   EVAL      PXNUM=ZXIMARA                                                    
     C                   CALL      'PRD650'                                                         
     C                   PARM                    PXNUM                          CAMP NUMÈRIC        
     C                   PARM                    PXALPH                         CAMP ALFANUMÈRIC    
     C                   PARM                    PXFLDD                         Nº CARACT. VISUA    
     C                   PARM      2             PXDCCD                         Nº DECIMALS         
     C                   PARM                    PXFMD1                         AJUST DECIMAL (.    
     C                   PARM                    PXEDTC                         CODI EDICIO(4,M,    
     C                   PARM                    PXNMER                         RETORN ERROR        
     C                   PARM                    PXTIPA                         TIPO AJUSTE (0,1    
     C                   MOVE      PXALPH        SUCIMAR                                            
      *                                                                                             
     C                   EVAL      PXALPH=*BLANKS                                                   
     C                   EVAL      PXNUM=ZXMVOLA                                                    
     C                   CALL      'PRD650'                                                         
     C                   PARM                    PXNUM                          CAMP NUMÈRIC        
     C                   PARM                    PXALPH                         CAMP ALFANUMÈRIC    
     C                   PARM                    PXFLDD                         Nº CARACT. VISUA    
     C                   PARM      2             PXDCCD                         Nº DECIMALS         
     C                   PARM                    PXFMD1                         AJUST DECIMAL (.    
     C                   PARM                    PXEDTC                         CODI EDICIO(4,M,    
     C                   PARM                    PXNMER                         RETORN ERROR        
     C                   PARM                    PXTIPA                         TIPO AJUSTE (0,1    
     C                   MOVE      PXALPH        SUCMVOL                                            
      *                                                                                             
     C                   ENDSR                                                                      
      **************************************************************                                
      * Calcula importes de 1 Línea                                *                                
      *------------------------------------------------------------*                                
     C     CS_VALLIN     BEGSR                                                                      
     C                   EVAL      ZXVNET=0                                                         
     C                   EVAL      ZXVIVA=0                                                         
     C                   EVAL      ZXVTOT=0                                                         
      *                                                                                             
      * Movemos campos a campos de trabaja                                                          
      *                                                                                             
     C                   EVAL      XZCANT=S5CANT                                                    
     C                   IF        S5CANC<>0                                                        
     C                   EVAL      XZCANT=S5CANC                                                    
     C                   ENDIF                                                                      
IT244C                   EVAL      XZCANT2 = XZCANT                                                 
     C                   EVAL      XZUNIM=S5UNIM                                                    
                                                                                                    
      * Buscamos en PMUNAL UNIDADES ALTERNATIVAS                                                    
                                                                                                    
     C                   EVAL      XZCOFU=1                                                         
     C                   IF        XZUNIM<>XZUNDP                                                   
     C                   EVAL      XZCIAS=@PCIAS                                                    
     C                   EVAL      XZARTI=S5ARTI                                                    
     C                   EVAL      XZVARI=S5VARI                                                    
     C                   EVAL      XZMODE=S5MODE                                                    
     C                   EVAL      ZXCA10=XZCANT                                                    
     C                   EVAL      ZXCA11=XZCANT                                                    
     C                   EVAL      ZXUN10=XZUNIM                                                    
     C                   EVAL      ZXUN11=XZUNDP                                                    
     C* CAMBIO de unidades                                                                          
     C/COPY *LIBL/QSRDSRC,SRD021                                                                    
     C                   EVAL      XZCANT=ZXCA11                                                    
     C                   ENDIF                                                                      
      * Decimales de la moneda                                                                      
     C                   EVAL      MBMONE=ZXMONV                                                    
     C     KMSDIV0       CHAIN     MSDIV0                             81                            
      * Buscamos en % de IVA según fecha del pedido                                                 
                                                                                                    
     C                   EVAL      MVTIVA=S5TIVA                                                    
     C                   EVAL      MVPABI=ZXPABI                                                    
     C                   EVAL      MVFLCD=S0FREP                                                    
     C                   IF        S0FRRE>0                                                         
     C                   EVAL      MVFLCD=S0FRRE                                                    
     C                   ENDIF                                                                      
     C     KMSIVAS       SETGT     MSIVAS                                                           
     C     KMSIVAS0      READPE    MSIVAS                                 83                        
     C                   SELECT                                                                     
     C                   WHEN      ZXTIVC=' '                                                       
     C                   EVAL      MVPIV2=*ZEROS                                                    
     C                   WHEN      ZXTIVC='0'                                                       
     C                   EVAL      MVPIV1=*ZEROS                                                    
     C                   EVAL      MVPIV2=*ZEROS                                                    
     C                   ENDSL                                                                      
      *                                                                                             
      * Calculamos los totales de línea en la moneda de la línea                                    
      * después de aplicados los dtos.                                                              
      *                                                                                             
     C                   Z-ADD     0             ZXVALOR          25 5                              
     C                   Z-ADD     0             ZXHELP1          25 5                              
     C                   Z-ADD     0             ZXHELP2          25 5                              
      *                                                                                             
     C                   EVAL      ZXVALOR=(S5PREC*XZCANT)                                          
      *                                                                                             
      * POR DESCUENTO CONFIRMADO O NORMAL                                                           
      *                                                                                             
     C                   if        S5DT1C<>0                                                        
     C                   eval      zxhelp2=zxvalor*(S5DT1C/100)                                     
     C                   eval      zxvalor=zxvalor-zxhelp2                                          
     C                   else                                                                       
     C                   if        S5DTO1<>0                                                        
     C                   eval      zxhelp2=zxvalor*(S5DTO1/100)                                     
     C                   eval      zxvalor=zxvalor-zxhelp2                                          
     C                   endif                                                                      
     C                   endif                                                                      
      *                                                                                             
     C                   if        S5DT2C<>0                                                        
     C                   eval      zxhelp2=zxvalor*(S5DT2C/100)                                     
     C                   eval      zxvalor=zxvalor-zxhelp2                                          
     C                   else                                                                       
     C                   if        S5DTO2<>0                                                        
     C                   eval      zxhelp2=zxvalor*(S5DTO2/100)                                     
     C                   eval      zxvalor=zxvalor-zxhelp2                                          
     C                   endif                                                                      
     C                   endif                                                                      
      *                                                                                             
     C                   if        S5DT3C<>0                                                        
     C                   eval      zxhelp2=zxvalor*(S5DT3C/100)                                     
     C                   eval      zxvalor=zxvalor-zxhelp2                                          
     C                   else                                                                       
     C                   if        S5DTO3<>0                                                        
     C                   eval      zxhelp2=zxvalor*(S5DTO3/100)                                     
     C                   eval      zxvalor=zxvalor-zxhelp2                                          
     C                   endif                                                                      
     C                   endif                                                                      
      *                                                                                             
     C                   if        S5DT4C<>0                                                        
     C                   eval      zxhelp2=zxvalor*(S5DT4C/100)                                     
     C                   eval      zxvalor=zxvalor-zxhelp2                                          
     C                   else                                                                       
     C                   if        S5DTO4<>0                                                        
     C                   eval      zxhelp2=zxvalor*(S5DTO4/100)                                     
     C                   eval      zxvalor=zxvalor-zxhelp2                                          
     C                   endif                                                                      
     C                   endif                                                                      
     C                   EVAL      XZAUXI=ZXVALOR                                                   
      *                                                                                             
     C                   EVAL      XZDECI=MBDECI                                                    
     C                   EVAL      XZAJUD=MBAJUD                                                    
     C* AJUSTE Y DECIMALES                                                                          
     C/COPY *LIBL/QSRDSRC,SRD001                                                                    
     C                   Z-ADD     XZAUXI        ZXVNET                                             
      * Calculamos el IVA                                                                           
     C                   EVAL      XZAUXI=ZXVNET*MVPIV1                                             
     C     XZAUXI        DIV(H)    100           XZAUXI                                             
     C* AJUSTE Y DECIMALES                                                                          
     C/COPY *LIBL/QSRDSRC,SRD001                                                                    
     C                   Z-ADD     XZAUXI        ZXIIV1           17 5                              
      * Calculamos el Recargo de equivalencia                                                       
     C                   EVAL      XZAUXI=ZXVNET*MVPIV2                                             
     C     XZAUXI        DIV(H)    100           XZAUXI                                             
     C* AJUSTE Y DECIMALES                                                                          
     C/COPY *LIBL/QSRDSRC,SRD001                                                                    
     C                   Z-ADD     XZAUXI        ZXIIV2           17 5                              
                                                                                                    
      * Omitimos BASE o IVA segun tipo de IVA                                                       
                                                                                                    
     C                   IF        MVOMTB>='1'                                                      
     C                   EVAL      ZXVNET=ZXVNET-ZXVNET                                             
     C                   ENDIF                                                                      
     C                   IF        MVOMTI>='1'                                                      
     C                   EVAL      ZXIIV1=ZXIIV1-ZXIIV1                                             
     C                   EVAL      ZXIIV2=ZXIIV2-ZXIIV2                                             
     C                   ENDIF                                                                      
     C                   EVAL      PXEDTC='4'                                                       
                                                                                                    
     C                   EVAL      ZXVIVA=ZXIIV1+ZXIIV2                                             
     C                   EVAL      ZXVTOT=ZXVNET+ZXVIVA                                             
      *                                                                                             
      * VOLUMEN DE LA LÍNEA                                                                         
      *                                                                                             
     C                   CALL      'MM2686'                                                         
     C                   PARM      S5CIAS        @PECIAS                                            
     C                   PARM      S5ARTI        @PEARTI                                            
     C                   PARM      S5VARI        @PEVARI                                            
     C                   PARM      S5MODE        @PEMODE                                            
     C                   PARM      S5TCOJ        @PETCOJ                                            
     C                   PARM      XZCANT        @PECAST                                            
     C                   PARM      S5UNIM        @PEUNST                                            
     C                   PARM      0             @PEPBRE                                            
     C                   PARM      *BLANKS       @PEUPES                                            
     C                   PARM      0             @PEVOLB                                            
     C                   PARM      *BLANKS       @PEUVOL                                            
     C                   PARM      ZZUMED        @PEUMED                                            
     C                   PARM      0             @PENBUL                                            
     C                   PARM      *BLANKS       @PETPAL                                            
     C                   PARM      *BLANKS       @PETCT1                                            
     C                   PARM      *BLANKS       @PEVTC1                                            
     C                   PARM      *BLANKS       @PEERR                                             
                                                                                                    
     C                   EVAL(H)   ZXVOL=@PEVOLB                                                    
     C                   EVAL      ZXIVOL=0                                                         
IT244C                   EVAL(H)   ZXIMAR = ZXVNET*ZXCOCAMB - M5COSM*XZCANT2                        
     C                   IF        ZXVOL<>0                                                         
     C                   EVAL(H)   ZXIVOL=(ZXIMAR/ZXVOL)                                            
     C                   ENDIF                                                                      
      *                                                                                             
     C                   ENDSR                                                                      
      * Búsqueda del cambio para moneda de visualización según SETUP.                               
      **************************************************************                                
      * SUBRUTINA CLACULO DE COEFICIENTE DE CAMBIO                   *                              
      *------------------------------------------------------------*                                
     C     CS_ZXCOCAM    BEGSR                                                                      
     C                   EVAL      @PDATA=S0FPED                                                    
     C                   TIME                    @PHORA                                             
     C                   IF        @PDATA=*ZEROS                                                    
     C                   EVAL      @PDATA=ZZDATS                                                    
     C                   ENDIF                                                                      
      * Busco el primer cambio existente al comenzar Enero a las 12 horas                           
      * si se desean cambios en el momento de entrada                                               
     C                   IF        @PTFHV='1'                                                       
     C                   EVAL      @PDATA=S0FRRR                                                    
     C                   ENDIF                                                                      
                                                                                                    
     C                   IF        @PDATA=*ZEROS                                                    
     C                   EVAL      @PDATA=*DATE                                                     
     C                   ENDIF                                                                      
                                                                                                    
     C                   EVAL      ZXCAMC=S0CAMB                                                    
     C                   EVAL      ZXCMPC=S0CMPR                                                    
     C                   IF        S0CAMC<>0                                                        
     C                   EVAL      ZXCAMC=S0CAMC                                                    
     C                   EVAL      ZXCMPC=S0CMPC                                                    
     C                   ENDIF                                                                      
                                                                                                    
     C                   EVAL      ZXCOCAMB=1                                                       
     C                   IF        S0MONE<>ZXMONV                                                   
     C                   CALL      'MM2555'                                                         
     C                   PARM                    @PCIAS                         PARM Qry-F4         
     C                   PARM      S0MONE        @PMON1                         PARM Qry-F4         
     C                   PARM      ZXMONV        @PMON2                         PARM Qry-F4         
     C                   PARM                    @PDATA                         PARM Qry-F4         
     C                   PARM                    @PHORA                         PARM Qry-F4         
     C                   PARM      0             @PCMCOCO                                           
     C                   PARM      0             @PCMCCCO                                           
     C                   PARM      *BLANKS       @PEERR                         PARM Qry-F4         
     C                   EVAL      ZXCOCAMB=@PCMCCCO                                                
     C                   ENDIF                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA CLACULO DE COEFICIENTE DE CAMBIO                   *                              
      *------------------------------------------------------------*                                
     C     CS_ZXCOCA2    BEGSR                                                                      
     C                   EVAL      @PDATA=S0FPED                                                    
     C                   TIME                    @PHORA                                             
     C                   IF        @PDATA=*ZEROS                                                    
     C                   EVAL      @PDATA=ZZDATS                                                    
     C                   ENDIF                                                                      
      * Busco el primer cambio existente al comenzar Enero a las 12 horas                           
      * si se desean cambios en el momento de entrada                                               
     C                   IF        @PTFHV='1'                                                       
     C                   EVAL      @PDATA=S0FRRR                                                    
     C                   ENDIF                                                                      
                                                                                                    
     C                   IF        @PDATA=*ZEROS                                                    
     C                   EVAL      @PDATA=*DATE                                                     
     C                   ENDIF                                                                      
                                                                                                    
     C                   EVAL      ZXCAMC=S0CAMB                                                    
     C                   EVAL      ZXCMPC=S0CMPR                                                    
     C                   IF        S0CAMC<>0                                                        
     C                   EVAL      ZXCAMC=S0CAMC                                                    
     C                   EVAL      ZXCMPC=S0CMPC                                                    
     C                   ENDIF                                                                      
                                                                                                    
     C                   EVAL      ZXCOCAM2=1                                                       
     C                   IF        SYCOMO<>S0MONE                                                   
     C                   CALL      'MM2555'                                                         
     C                   PARM                    @PCIAS                         PARM Qry-F4         
     C                   PARM      SYCOMO        @PMON1                         PARM Qry-F4         
     C                   PARM      S0MONE        @PMON2                         PARM Qry-F4         
     C                   PARM                    @PDATA                         PARM Qry-F4         
     C                   PARM                    @PHORA                         PARM Qry-F4         
     C                   PARM      0             @PCMCOCO                                           
     C                   PARM      0             @PCMCCCO                                           
     C                   PARM      *BLANKS       @PEERR                         PARM Qry-F4         
     C                   EVAL      ZXCOCAM2=@PCMCCCO                                                
     C                   ENDIF                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **************************************************************                                
      * Comprobación de Seguridad en Costes                        *                                
      *------------------------------------------------------------*                                
     C     CS_CABSEG     BEGSR                                                                      
      *                                                                                             
     C                   IF        ZZNPG2>='1'                                                      
     C                   MOVE      *ALL'*'       SUCICOS                                            
     C                   MOVE      *ALL'*'       SUCIMAR                                            
     C                   EVAL      SUCPMAR=0                                                        
     C                   MOVE      *ALL'*'       SUCMVOL                                            
     C                   ENDIF                                                                      
      *                                                                                             
     C                   ENDSR                                                                      
      **************************************************************                                
      * Comprobación de Seguridad en Costes                        *                                
      *------------------------------------------------------------*                                
     C     CS_DETSEG     BEGSR                                                                      
      *                                                                                             
     C                   IF        ZZNPG2>='1'                                                      
     C                   MOVE      *ALL'*'       S01IMAR                                            
     C                   MOVE      *ALL'*'       S01IVOL                                            
     C                   ENDIF                                                                      
      *                                                                                             
     C                   ENDSR                                                                      
      **************************************************************                                
      * Recalcular Importes (En interactivo)                       *                                
      *------------------------------------------------------------*                                
     C     CS_RECALIM    BEGSR                                                                      
      *                                                                                             
     C                   MOVE      SDSJNBR       ZXJNBR                                             
     C                   MOVE      UDATE         ZXDATA                                             
     C                   TIME                    ZXHORA                                             
      *                                                                                             
     C                   CLEAR                   Z1COMA                                             
     C     DSLDA         CAT(P)    Z1COMA:0      Z1COMA                                             
     C                   Z-ADD     86            JOLINE                                             
     C                   CALL      'PRD935'                                                         
     C                   PARM                    JOTRAT                                             
     C                   PARM                    JOLINE                                             
     C                   PARM                    Z1COMA                                             
      *                                                                                             
     C                   MOVE      @PCIAS        @PECIAS2                                           
     C                   EVAL      X5CIAS=S0CIAS                                                    
     C                   EVAL      X5DLGA=S0DLGA                                                    
     C                   EVAL      X5NPCO=S0NPCO                                                    
     C                   EVAL      X5DATP=S0DATP                                                    
     C                   EVAL      X5TPED=S0TPED                                                    
     C                   EVAL      X5NOPL=S0NOPL                                                    
     C                   CLEAR                   Z1COMA                                             
     C     CO2540        CAT       Z1COMA:0      Z1COMA                                             
     C                   EVAL      JOLINE=88                                                        
     C                   CALL      'PRD935'                                                         
     C                   PARM                    JOTRAT                                             
     C                   PARM                    JOLINE                                             
     C                   PARM                    Z1COMA                                             
      *                                                                                             
     C                   Z-ADD     150           ZXLOGC           15 5                              
     C                   MOVE      *BLANKS       ZXQCMD                                             
     C     ZXQCMD        CAT       'CALL (':0    ZXQCMD                                             
     C     ZXQCMD        CAT       'PRDGJ8':0    ZXQCMD                                             
     C     ZXQCMD        CAT       'CL)':0       ZXQCMD                                             
     C     ZXQCMD        CAT       'PARM(':1     ZXQCMD                                             
     C     ZXQCMD        CAT       C(1):0        ZXQCMD                                             
     C     ZXQCMD        CAT       JOTRAT:0      ZXQCMD                                             
     C     ZXQCMD        CAT       C(1):0        ZXQCMD                                             
     C     ZXQCMD        CAT       C(1):1        ZXQCMD                                             
     C     ZXQCMD        CAT       'CO2540':0    ZXQCMD                                             
     C     ZXQCMD        CAT       C(1):0        ZXQCMD                                             
     C     ZXQCMD        CAT       C(1):1        ZXQCMD                                             
     C     ZXQCMD        CAT       C(1):1        ZXQCMD                                             
     C     ZXQCMD        CAT       ')':0         ZXQCMD                                             
      *                                                                                             
     C                   CALL      'QCMDEXC'                                                        
     C                   PARM                    ZXQCMD                                             
     C                   PARM                    ZXLOGC                                             
      *                                                                                             
     C                   ENDSR                                                                      
      **************************************************************                                
      * GUARDA LOGISTICA DEL OL                                    *                                
      *------------------------------------------------------------*                                
     C     CS_LOGOL      BEGSR                                                                      
      *                                                                                             
IT228 *     C     @PCIAS        SETLL     MSALMA                                                    
IT228 *     C     @PCIAS        READE     MSALMA                                                    
IT228 *     C                   DOW       NOT %EOF(MSALMA)                                          
IT228 *     C                   IF        M0TAL1='8' AND M0BAJA<>'1'                                
IT228 *     C                   EVAL      ZXLOGOL=M0LOGS                                            
IT228 *     C                   LEAVE                                                               
IT228 *     C                   ENDIF                                                               
IT228 *     C     @PCIAS        READE     MSALMA                                 84                 
IT228 *     C                   ENDDO                                                               
IT228 *  Add - Begin                                                                                
               i2ol = *zero;                                                                        
               open msalma08;                                                                       
               setll (@pcias:'8') msalma08;                                                         
               reade (@pcias:'8') msalma08;                                                         
               dow not %eof(msalma08);                                                              
                 if m0tal1 = '8' and m0baja<>'1' and i2ol < %elem(T_logol);                         
                   i2ol +=1;                                                                        
                   T_logol(i2ol) = m0logs;                                                          
                 endif;                                                                             
                 reade (@pcias:'8') msalma08;                                                       
               enddo;                                                                               
               close msalma08;                                                                      
IT228 *  Add - End                                                                                  
      *                                                                                             
     C                   ENDSR                                                                      
      **************************************************************                                
      * Quieren cancelar la composición y la confirmación          *                                
      *------------------------------------------------------------*                                
     C     CS_CANCELAR   BEGSR                                                                      
      *                                                                                             
      * Enseñamos pantalla para confirmar la cancelación                                            
      * Si cancelan, no confirmo el pedido y quito todas las ED                                     
C1579 * (Se quitarán las ED siempre que no sean de Poolweb)                                         
C1579 *                                                                                             
     C                   EVAL      W12SINO='0'                                                      
     C                   EXFMT     W12                                                              
      *                                                                                             
     C                   IF        W12SINO='0'                                                      
     C                   EVAL      @PERRO='1'                                                       
      *                                                                                             
      // MMN.- S'elimina tot aquest codi ja que s'està treballant amb fitxers en QTEMP...           
      // mod01DEL-begin                                                                             
     C*    KCOCAPE       CHAIN     COCAPE                                                           
     C*                  IF        %FOUND(COCAPE)                                                   
C1579 *                                                                                             
IT244C*                  IF        S0TPE4='2'                                                       
     C*                  EVAL      S0TPE4=*BLANKS                                                   
     C*                  ENDIF                                                                      
     C*                  EVAL      S0STCO='10'                                                      
     C*                  UPDATE    RCOCAPE                                                          
     C*                  ENDIF                                                                      
      *                                                                                             
     C*                  EVAL      S5LINE=0                                                         
     C*    KCODEPE       SETLL     CODEPE                                                           
     C*    KCOCAPE       READE     CODEPE                                                           
     C*                  DOW       NOT %EOF(CODEPE)                                                 
     C*    KMSARTI00     CHAIN     MSARTI00                                                         
     C*                  IF        S5TPE4='2'                                                       
     C*                            OR M5SIOL='2'                                                    
IT244C*                  IF        S5TPE4='2'                                                       
     C*                  EVAL      S5TPE4=*BLANKS                                                   
     C*                  ENDIF                                                                      
     C*                  IF        M5SIOL='2'                                                       
     C*                  EVAL      S5LOGE=S0LOGE                                                    
C1078C*                  UPDATE    RCODEPE                                                          
     C*                  ENDIF                                                                      
C1078C*                  UPDATE    RCODEPE                                                          
     C*                  ENDIF                                                                      
     C*    KCOCAPE       READE     CODEPE                                                           
     C*                  ENDDO                                                                      
      // MMN.- S'elimina tot aquest codi ja que s'està treballant amb fitxers en QTEMP...           
      // mod01DEL-END                                                                               
      *                                                                                             
      * Evento de cancelación                                                                       
      *                                                                                             
     C                   EVAL      @FDEDAU='021'                                                    
     C                   EXSR      CS_TRAZA                                                         
      *                                                                                             
     C                   ENDIF                                                                      
      *                                                                                             
     C                   ENDSR                                                                      
      **************************************************************                                
      * Cambiar logística de EN a ED                               *                                
      *------------------------------------------------------------*                                
     C     CS_LOGENED    BEGSR                                                                      
      *                                                                                             
      * Si el pedido está confirmado debo generar trazabilidad y                                    
      * actualizar, sino, sólo actualizar                                                           
      *                                                                                             
     C                   EVAL      S5LINE=0                                                         
     C     KCODEPE       SETLL     CODEPE                                                           
     C     KCOCAPE       READE     CODEPE                                                           
     C                   DOW       NOT %EOF(CODEPE)                                                 
     C                   IF        S5ARTI<>ZXARTPOR                                                 
     C                             AND S5TPE4<>'2'                                                  
     C                             AND S5LOGE=SUFLOGE                                               
IT244C                   EVAL      ZXCTRLNOED = *ON                                                 
07111C                   EXSR      CS_LEECARLOG                                                     
IT244C     ZXCTRLNOED    CABEQ     *ON           TCODEPE                                            
      *                                                                                             
     C                   EVAL      S5TPE4='2'                                                       
     C                   UPDATE    RCODEPE                                                          
mod03                    bTouche=*on;                                                               
      *                                                                                             
      * Sólo actualizo trazabilidad si el pedido ya esta confirmado                                 
      *                                                                                             
     C                   IF        S0STCO>'19'                                                      
     C                   EVAL      @FDEDAU='010'                                                    
     C                   EXSR      CS_TRAZA                                                         
     C                   EXSR      CS_SINCRO                                                        
     C                   ENDIF                                                                      
      *                                                                                             
     C     KCODEPE       CHAIN     ED0050W                                                          
     C                   IF        %FOUND(ED0050W)                                                  
     C                   EVAL      T2FORZ=1                                                         
     C                   EVAL      T2ENTD=1                                                         
     C                   EVAL      T2ENED=1                                                         
     C                   EVAL      T2EDEN=0                                                         
     C                   UPDATE    RED0050W                                                         
     C                   ENDIF                                                                      
      *                                                                                             
     C                   ENDIF                                                                      
IT244C     TCODEPE       TAG                                                                        
IT244C                   EVAL      ZXCTRLNOED = *OFF                                                
     C     KCOCAPE       READE     CODEPE                                                           
     C                   ENDDO                                                                      
      *                                                                                             
     C                   ENDSR                                                                      
      **************************************************************                                
      * Cambiar logística de ED a EN                               *                                
      *------------------------------------------------------------*                                
     C     CS_LOGEDEN    BEGSR                                                                      
     C                   Z-ADD     0             ZXOLINED          3 0                              
     C                   EVAL      S5LINE=0                                                         
     C     KCODEPE       SETLL     CODEPE                                                           
     C     KCOCAPE       READE     CODEPE                                                           
     C                   DOW       NOT %EOF(CODEPE)                                                 
     C                   IF        S5ARTI<>ZXARTPOR                                                 
     C                             AND S5TPE4='2'                                                   
      *                                                                                             
     C                   IF        S5LOGE=SUFLOGE                                                   
07111C                   EXSR      CS_LEECARLOG                                                     
      *                                                                                             
     C                   EVAL      S5TPE4=*BLANKS                                                   
     C                   UPDATE    RCODEPE                                                          
mod03                    bTouche=*on;                                                               
      *                                                                                             
     C                   IF        S0STCO>'19'                                                      
     C                   EXSR      CS_SINCRO                                                        
     C                   ELSE                                                                       
      *                                                                                             
     C     KCODEPE       CHAIN     ED0050W                                                          
     C                   IF        %FOUND(ED0050W)                                                  
     C                   EVAL      T2FORZ=0                                                         
     C                   EVAL      T2ENTD=0                                                         
     C                   EVAL      T2EDEN=1                                                         
     C                   EVAL      T2ENED=0                                                         
     C                   UPDATE    RED0050W                                                         
     C                   ENDIF                                                                      
      *                                                                                             
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
      *                                                                                             
      * Sólo que encuntre una linea marco como que hay ED                                           
      *                                                                                             
     C                   IF        S5TPE4='2'                                                       
     C                   EVAL      ZXOLINED=1                                                       
     C                   ENDIF                                                                      
      *                                                                                             
     C     KCOCAPE       READE     CODEPE                                                           
     C                   ENDDO                                                                      
      *                                                                                             
      * Si ya no hay líneas ED cambio cabecera a Normal                                             
      *                                                                                             
     C                   IF        ZXOLINED=0                                                       
     C     KCOCAPE       CHAIN     COCAPE                                                           
     C                   IF        %FOUND(COCAPE)                                                   
     C                   IF        S0TPE4='2'                                                       
     C                   EVAL      S0TPE4=*BLANKS                                                   
     C                   ENDIF                                                                      
     C                   UPDATE    RCOCAPE                                                          
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
      *                                                                                             
     C                   ENDSR                                                                      
      **************************************************************                                
      * Validaciones fluidra direct                                *                                
      **************************************************************                                
     C     FD_VALIDA     BEGSR                                                                      
E7391 *                                                                                             
E7391C                   OPEN      UTCOM0                                                           
E7391C                   OPEN      MITBAL00                                                         
E7391C                   OPEN      PUPRP0                                                           
E7391C                   OPEN      PMLIBL                                                           
E7391C                   OPEN      MSCOJD                                                           
E7391 *                                                                                             
E7391 * 'Traduir' magatzem a codi M3                                                                
E7391C                   EVAL      PECIAS=S5CIAS                                                    
E7391C                   EVAL      PECTAB='INO2'                                                    
E7391C                   EVAL      PECLTA='MAGA'+sLogViEdDFT                                        
E7391C     KPMTABD       CHAIN     PMTABD                                                           
E7391C                   IF        %FOUND(PMTABD)                                                   
E7391C                   EVAL      XBWHLO=%TRIM(PEDESC)                                             
E7391C                   ELSE                                                                       
E7391C                   EVAL      XBWHLO=*BLANKS                                                   
E7391C                   ENDIF                                                                      
E7391 *                                                                                             
     C                   EVAL      S5LINE=0                                                         
     C     KCODEPE       SETLL     CODEPE                                                           
     C     KCOCAPE       READE     CODEPE                                                           
     C                   DOW       NOT %EOF(CODEPE)                                                 
     C                   IF        S5ARTI<>ZXARTPOR                                                 
      *                                                                                             
mod03 *     C                   IF        @FDEDAU='010'                                             
mod03 *     C                             AND S5TPE4<>'2'                                           
mod03 *     C                             AND S5LOGE=SUFLOGE                                        
mod03 *     C                             OR @FDEDAU='009'                                          
mod03 *     C                             AND S5TPE4='2'                                            
mod03 *     C                             AND S5LOGE=SUFLOGE                                        
      *                                                                                             
mod03      if %trim(s5tpe4)<>'2' and s5loge=sufloge;                                                
mod03        clear rmsstok;                                                                         
mod03        chain (s5cias:sMagLogSiEd:s5arti:s5vari:s5mode) msstok;                                
E7391C                   IF        NOT %FOUND(MSSTOK)                                               
E7391C                   EVAL      @FDERRO='1'                                                      
E7391C                   LEAVE                                                                      
E7391C                   ENDIF                                                                      
mod03        if m1prop<>'1' and m1prop<>'2';  // article NO propi, cerquem virtual                  
mod03          @fdloge = sLogViEdDFT;                                                               
mod03        else;                                                                                  
mod03          @fdloge = sLogSiEdDFT;                                                               
mod03        endif;                                                                                 
     C                   CALL      'ED0051'                                                         
     C                   PARM      S5CIAS        @FDCIAS                                            
     C                   PARM      S5DLGA        @FDDLGA                                            
     C                   PARM      S5NPCO        @FDNPCO                                            
     C                   PARM      S5TPED        @FDTPED                                            
     C                   PARM      S5DATP        @FDDATP                                            
     C                   PARM      S5NOPL        @FDNOPL                                            
     C                   PARM      S5LINE        @FDLINE                                            
     C                   PARM      *BLANKS       @FDARV1                                            
     C                   PARM      *BLANKS       @FDCOM2                                            
     C                   PARM      S0CUST        @FDCUST                                            
     C                   PARM      S0TDI1        @FDTDI1                                            
     C                   PARM                    @FDEDAU                                            
     C                   PARM      0             @FDLOGI                                            
     C                   PARM                    @FDORIG                                            
     C                   PARM      1             @FDINTE                                            
     C                   PARM      *BLANKS       @FDERRO                                            
     C                   PARM      *BLANKS       @FDINCI                                            
mod03c                   parm                    @fdloge                                            
E7391 *                                                                                             
E7391C                   IF        @FDERRO<>'1' AND M1PROP<>'1' AND M1PROP<>'2'                     
E7391C                   EXSR      VALIDA_M3                                                        
E7391C                   ENDIF                                                                      
E7391 *                                                                                             
     C                   IF        @FDERRO='1'                                                      
     C                   LEAVE                                                                      
     C                   ENDIF                                                                      
      *                                                                                             
     C                   ENDIF                                                                      
      *                                                                                             
     C                   ENDIF                                                                      
     C     KCOCAPE       READE     CODEPE                                                           
     C                   ENDDO                                                                      
E7391 *                                                                                             
E7391C                   CLOSE     UTCOM0                                                           
E7391C                   CLOSE     MITBAL00                                                         
E7391C                   CLOSE     PUPRP0                                                           
E7391C                   CLOSE     PMLIBL                                                           
E7391C                   CLOSE     MSCOJD                                                           
E7391 *                                                                                             
      *                                                                                             
     C                   ENDSR                                                                      
      **************************************************************                                
      * Guardar Traza                                              *                                
      *------------------------------------------------------------*                                
     C     CS_TRAZA      BEGSR                                                                      
      *                                                                                             
     C                   EVAL      @FDCIAS=S5CIAS                                                   
     C                   EVAL      @FDDLGA=S5DLGA                                                   
     C                   EVAL      @FDNPCO=S5NPCO                                                   
     C                   EVAL      @FDTPED=S5TPED                                                   
     C                   EVAL      @FDDATP=S5DATP                                                   
     C                   EVAL      @FDNOPL=S5NOPL                                                   
     C                   EVAL      @FDLINE=S5LINE                                                   
     C                   EVAL      @FDCIA2=0                                                        
     C                   EVAL      @FDDLG2=*BLANKS                                                  
     C                   EVAL      @FDNPC2=*BLANKS                                                  
     C                   EVAL      @FDTPE2=*BLANKS                                                  
     C                   EVAL      @FDDAT2=0                                                        
     C                   EVAL      @FDNOP2=0                                                        
     C                   EVAL      @FDLIN2=0                                                        
     C                   EVAL      @FDCUST=S0CUST                                                   
     C                   EVAL      @FDTDI1=S0TDI1                                                   
     C                   EVAL      @FDLOGI=0                                                        
     C                   EVAL      @FDERAV=*BLANKS                                                  
     C                   EVAL      @FDTEXT=*BLANKS                                                  
     C                   EVAL      @FDDATO=*BLANKS                                                  
     C                   EVAL      @FDWAUD=1                                                        
     C                   EVAL      @FDCANT=S5CANT                                                   
      *                                                                                             
      * Ejecutar                                                                                    
      *                                                                                             
     C                   CALL      'ED0100'                                                         
     C                   PARM                    @FDCIAS                                            
     C                   PARM                    @FDDLGA                                            
     C                   PARM                    @FDNPCO                                            
     C                   PARM                    @FDTPED                                            
     C                   PARM                    @FDDATP                                            
     C                   PARM                    @FDNOPL                                            
     C                   PARM                    @FDLINE                                            
     C                   PARM                    @FDCIA2                                            
     C                   PARM                    @FDDLG2                                            
     C                   PARM                    @FDNPC2                                            
     C                   PARM                    @FDTPE2                                            
     C                   PARM                    @FDDAT2                                            
     C                   PARM                    @FDNOP2                                            
     C                   PARM                    @FDLIN2                                            
     C                   PARM                    @FDLOGI                                            
     C                   PARM                    @FDORIG                                            
     C                   PARM                    @FDEDAU                                            
     C                   PARM                    @FDERAV                                            
     C                   PARM                    @FDTEXT                                            
     C                   PARM                    @FDDATO                                            
     C                   PARM                    @FDWAUD                                            
     C                   PARM                    @FDCANT                                            
      *                                                                                             
     C                   ENDSR                                                                      
      **************************************************************                                
      * Sincronizar ventas y compras                               *                                
      *------------------------------------------------------------*                                
     C     CS_SINCRO     BEGSR                                                                      
      *                                                                                             
     C                   CALL      'ED0015'                                                         
     C                   PARM                    @PCIAS                                             
     C                   PARM                    @PDLGA                                             
     C                   PARM                    @PNPCO                                             
     C                   PARM                    @PTPED                                             
     C                   PARM                    @PDATP                                             
     C                   PARM                    @PNOPL                                             
     C                   PARM      S5LINE        @PELINE                                            
     C                   PARM                    @FDEDAU           3                                
     C                   PARM      *BLANKS       @PEJOBT          18                                
     C                   PARM      0             @PEFIN                                             
      *                                                                                             
     C                   ENDSR                                                                      
      **************************************************************                                
      * Rutina Base para Fluidra direct                            *                                
      **************************************************************                                
     C     FD_BASE       BEGSR                                                                      
      *                                                                                             
      * Determinar el tipo de empresa en la que estoy                                               
      *                                                                                             
     C                   SELECT                                                                     
      * Comercial                                                                                   
     C                   WHEN      S0PPED<>'99' AND ZZALOL<'1'                                      
     C                   EVAL      @FDORIG=0                                                        
      * Productiva                                                                                  
     C                   WHEN      S0PPED='99' AND ZZALOL<'1'                                       
     C                   EVAL      @FDORIG=2                                                        
      * Trace                                                                                       
     C                   WHEN      ZZALOL='1'                                                       
     C                   EVAL      @FDORIG=3                                                        
      *                                                                                             
     C                   ENDSL                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      *                                                                                             
      **************************************************************                                
      * Altera temporalmente la logística si SIOL=2 y no es OL                                      
      *------------------------------------------------------------*                                
     C     CS_ALTSIOL    BEGSR                                                                      
      *                                                                                             
     C                   EVAL      S5LINE=0                                                         
     C     KCODEPE       SETLL     CODEPE                                                           
     C     KCOCAPE       READE     CODEPE                                                           
     C                   DOW       NOT %EOF(CODEPE)                                                 
     C                   IF        S5ARTI<>ZXARTPOR                                                 
     C     KMSARTI00     CHAIN     MSARTI00                                                         
     C     KCODEPE       CHAIN     ED0050W                                                          
     C                   IF        M5SIOL='2'                                                       
     C                             AND T2ENTD=1                                                     
     C                   EVAL      S5TPE4='2'                                                       
C1078C                   EVAL      M_M0LOGE=S5LOGE                                                  
C1078C     KMSALMA05     CHAIN     MSALMA05                                                         
IT228C*                  IF        %FOUND AND M_M0TAL1<>'7'                                         
C1078C                   IF        %FOUND AND M_M0TAL1<>'7'                                         
IT228c                   IF            (%lookup(S5LOGE:T_logol)>0)                                  
IT228C***                EVAL      S5LOGE=ZXLOGOL                                                   
IT228c*                                                                                             
IT228c                   ELSE                                                                       
IT228C*_call al MM1411_________                                                                     
IT228C                   EXSR      LOG_VIRTUAL                                                      
IT228C*_si recuperamos valor accedemos a MSALMA                                                     
IT228C                   IF        @PERESP <> *BLANKS                                               
IT228C*    KMSALMA       CHAIN     MSALMA                                                           
IT228C*                  IF        %FOUND AND M0TAL1='8' AND M0BAJA<>'1'                            
IT228C*                  EVAL      M0MAGA = @PERESP                                                 
IT228C*                  EVAL      @qmaga = M0MAGA                                                  
IT228C                   EVAL      ZXLOGOL=@PERESP                                                  
IT228c*                  endif                                                                      
IT228c                   else                                                                       
IT228c***                CALL MM1410                                                                
IT228C**                 EVAL      ZXLOGOL=S5LOGE                                                   
IT228 /free                                                                                         
         callp PgmOL(@PCIAS:@PDLGA:pPointer);                                                       
         pDsPgmOl = pPointer;                                                                       
         if zoldl<>*blanks;                                                                         
         zxLOGOL = zoldl;                                                                           
         else;                                                                                      
         zxLOGOL = zolem;                                                                           
         endif;                                                                                     
IT228 /end-free                                                                                     
IT228c                   endif                                                                      
IT228c                   endif                                                                      
IT228c*                                                                                             
C1078C                   ENDIF                                                                      
     C                   ENDIF                                                                      
     C                   UPDATE    RCODEPE                                                          
     C                   ENDIF                                                                      
     C     KCOCAPE       READE     CODEPE                                                           
     C                   ENDDO                                                                      
      *                                                                                             
     C                   ENDSR                                                                      
07111                                                                                               
07111 **************************************************************                                
07111 * LEEMOS CARACTERÍSTICAS DE LA LOGÍSTICA A CAMBIAR                                            
07111 *------------------------------------------------------------*                                
07111C     CS_LEECARLOG  BEGSR                                                                      
C1078C** mod01           EVAL      M_M0LOGE=S5LOGE       // Aquest accés sols el necessitem per     
C1078C** mod01     KMSALMA05     CHAIN     MSALMA05      // Aquest accés sols el necessitem per     
07111C                   EVAL      M5ARTI=S5ARTI                                                    
07111C                   EVAL      M5VARI=S5VARI                                                    
07111C                   EVAL      M5MODE=S5MODE                                                    
07111C     KMSARTI00     CHAIN     MSARTI00                                                         
IT244 *                                                                                             
IT244C                   IF        ZXCTRLNOED   AND  M5NOED = '1'                                   
IT244C                   EVAL      PPPCMD1 = 'CMD7805'                                              
IT244C                   EVAL      W17ARTI = M5ARTI                                                 
IT244C                   EVAL      W17VARI = M5VARI                                                 
IT244C                   EVAL      W17MODE = M5MODE                                                 
IT244C                   EVAL      W17DES1 = M5DES1                                                 
IT244C                   EXFMT     W17                                                              
IT244C                   LEAVESR                                                                    
IT244C                   ENDIF                                                                      
IT244 *                                                                                             
IT244C                   EVAL      ZXCTRLNOED = *OFF                                                
IT244 *                                                                                             
IT228C*                  IF        S5TPE4='2' AND S5LOGE=ZXLOGOL                                    
IT228C                   IF        S5TPE4='2'                                                       
mod03 *IT228C** mod01                     and (%lookup(S5LOGE:T_logol)>0)                           
mod03 *07111C** mod01                     AND M5SIOL='2'                                            
mod03 *07111C                   IF        T3OPL1<>*BLANKS                                           
mod03 *07111C                   EVAL      S5LOGE=T3OPL1                                             
mod03 *07111C                   ELSE                                                                
mod03 *07111C                   EVAL      S5LOGE=S0LOGE                                             
mod03 *07111C                   ENDIF                                                               
mod03                      s5loge = sLogNoEdDFT;                                                    
07111C                   ENDIF                                                                      
IT228C*                  IF        S5TPE4=' ' AND S5LOGE<>ZXLOGOL                                   
IT228C** mod01           IF        S5TPE4=' '                                                       
IT228C** mod01                     and (%lookup(S5LOGE:T_logol)=0)                                  
07111C** mod01                     AND M5SIOL='2'                                                   
                                                                                                    
mod01  if s5tpe4 = *blanks;                                                                         
                                                                                                    
mod03 //         callp PgmOL(@PCIAS:@PDLGA:pPointer);  // recuperem OL x dft                        
mod03 //         pDsPgmOl = pPointer;                                                               
mod03 //         if zoldl<>*blanks;                                                                 
mod03 //           S5LOGE = zoldl;                                                                  
mod03 //         else;                                                                              
mod03 //           S5LOGE = zolem;                                                                  
mod03 //         endif;                                                                             
mod03    s5loge = sLogSiEdDFT;                                                                      
mod01    // hem de cercar si article propi                                                          
mod03 //mod01    clear rmsalma05;                                                                   
mod01    clear rmsstok;                                                                             
mod03 //mod01    chain (s5cias:s5loge) msalma05;                                                    
mod03 //mod01                                                                                       
mod03    chain (s5cias:sMagLogSiEd:s5arti:s5vari:s5mode) msstok;                                    
mod01    if m1prop<>'1' and m1prop<>'2';  // article NO propi, cerquem virtual                      
mod03 //mod01      pMM1411(s0cias:m_m0maga:*blanks:s0dlga:cresp);                                   
mod03 //mod01      if cresp <> *blanks;                                                             
mod03 //mod01        s5loge = %trim(cresp);                                                         
mod03 //mod01      endif;                                                                           
mod03    s5loge = sLogViEdDFT;                                                                      
mod01    endif;                                                                                     
mod01  endif;                                                                                       
IT228C*                  EVAL      S5LOGE=ZXLOGOL                                                   
07111C** mod01           ENDIF                                                                      
07111C                   ENDSR                                                                      
CR528 **************************************************************                                
CR528 * No se permite línea FD con bloqueo de compras              *                                
CR528 *------------------------------------------------------------*                                
CR528C     CS_BLOQCOM    BEGSR                                                                      
CR528 *                                                                                             
CR528 * ZXERRO='1'   Hay que confirmar o cancelar el pedido                                         
CR528 * ZXERRO<'1'   El pedido ya está confirmado                                                   
CR528 *                                                                                             
CR528 * Si estamos en modo confirmación pedido, lo hacemos sin más                                  
CR528 *                                                                                             
CR528C                   IF        ZXERRO='1'                                                       
CR528C                   EVAL      @PERRO='1'                                                       
CR528 *                                                                                             
CR528C     KCOCAPE       CHAIN     COCAPE                                                           
CR528C                   IF        %FOUND(COCAPE)                                                   
CR528C                   IF        S0TPE4='2'                                                       
CR528C                   EVAL      S0TPE4=*BLANKS                                                   
CR528C                   ENDIF                                                                      
CR528C                   EVAL      S0STCO='10'                                                      
CR528C                   UPDATE    RCOCAPE                                                          
CR528C                   ENDIF                                                                      
CR528 *                                                                                             
CR528C                   EVAL      S5LINE=0                                                         
CR528C     KCODEPE       SETLL     CODEPE                                                           
CR528C     KCOCAPE       READE     CODEPE                                                           
CR528C                   DOW       NOT %EOF(CODEPE)                                                 
CR528C     KMSARTI00     CHAIN     MSARTI00                                                         
CR528C                   IF        S5TPE4='2'                                                       
CR528C                             OR M5SIOL='2'                                                    
CR528C                   IF        S5TPE4='2'                                                       
CR528C                   EVAL      S5TPE4=*BLANKS                                                   
CR528C                   ENDIF                                                                      
CR528C                   IF        M5SIOL='2'                                                       
CR528C                   EVAL      S5LOGE=S0LOGE                                                    
CR528C                   ENDIF                                                                      
CR528 * En este caso quitamos siempre FD de la línea                                                
CR528C                   UPDATE    RCODEPE                                                          
CR528C                   ENDIF                                                                      
CR528C     KCOCAPE       READE     CODEPE                                                           
CR528C                   ENDDO                                                                      
CR528 *                                                                                             
CR528 * Evento de cancelación                                                                       
CR528 *                                                                                             
CR528C                   EVAL      @FDEDAU='021'                                                    
CR528C                   EXSR      CS_TRAZA                                                         
CR528 *                                                                                             
CR528 * Si el pedido ya está confirmado, está línea no la permitimos entrar                         
CR528 *                                                                                             
CR528C                   ELSE                                                                       
CR528 * Pendiente programar                                                                         
CR528C                   ENDIF                                                                      
CR528C                   ENDSR                                                                      
C2561 ******************************************************************                            
C2561 * ASIGNAR Nº COENVIO POR LOGISTICA SI ASÍ SE INDICA POR EMPRESA                               
C2561 **********************************************************************                        
C2561C     CS_COENVIO    BEGSR                                                                      
C2561 *                                                                                             
C2561 * Si la empresa tiene definido coenvio parcial (coenvío según                                 
C2561 * logística) asignaremos los coenvíos de esta manera                                          
C2561 * (Siempre que no sea aplicable el DOM)                                                       
C2561 *                                                                                             
mod03 * Sols vindrém si han modificat i el coenvio = 2                                              
mod03 *NAP45* Recuperar coenvío del cliente, si es distinto de blanco                              
mod03 *NAP45C                   if        S0TCOE <> ' '                                             
mod03 *NAP45C                   eval      zxocoe = S0Tcoe                                           
mod03 *NAP45C                   else                                                                
mod03 *NAP45* Recuperar coenvío por defecto de delegación central                                  
mod03 *NAP45C                   EVAL      P7CIAS=@PCIAS                                             
mod03 *NAP45C                   EVAL      P7DLGA=' '                                                
mod03 *NAP45C     KPMEMPR       CHAIN     PMEMPR                                                    
mod03 *NAP45C                   if        %found                                                    
mod03 *NAP45C                   eval      zxocoe = p7ocoe                                           
mod03 *NAP45C                   endif                                                               
mod03 *NAP45C                   endif                                                               
C2561C                   EVAL      P7CIAS=@PCIAS                                                    
C2561C                   EVAL      P7DLGA=@PDLGA                                                    
C2561C     KPMEMPR       CHAIN     PMEMPR                                                           
C2561 *                                                                                             
GP551 *C2561C                   IF        P7OCOE='2' AND T3ADOM<>'1'                                
GP551 // Add-Begin                                                                                  
      //S'amplia la condició per tal que NO passi si                                                
      //            - tenim DOOM activat                                                            
      //            - i ED forçat                                                                   
      //ja que DOOM s'encarrega d'assignar els coenvios quan la passa a FD.                         
      //Bàsicament aquesta modificació és per GRE, ja que tenen DOOM i no ED forçat.                
      //                                                                                            
      // NAP45           if  P7OCOE='2' and not (T3ADOM='1' and T3EDFO<>'1');                       
mod03 //                 if  (ZXOCOE='2' or ZXOCOE='3') and             //NAP45                    
mod03 //                     not (T3ADOM='1' and T3EDFO<>'1');          //NAP45                    
mod03 // Eliminem aquestes condicions ja que la comanda està en V3 (aquest pgm és V3)               
mod03 // i sols arribarem aquí si han modificat (1D/4D) i tenim S0COEN=2                            
GP551 // Add-END                                                                                    
C2561 *                                                                                             
C2561 * Buscamos pedido en COCAPE y actualizamos Coenvío                                            
C2561C                   EVAL      S0CIAS=@PCIAS                                                    
C2561C                   EVAL      S0DLGA=@PDLGA                                                    
C2561C                   EVAL      S0NPCO=@PNPCO                                                    
C2561C                   EVAL      S0TPED=@PTPED                                                    
C2561C                   EVAL      S0DATP=@PDATP                                                    
C2561C                   EVAL      S0NOPL=@PNOPL                                                    
C2561C     KCOCAPE       CHAIN     COCAPE                                                           
NAP45C                   IF        S0COEN<>'3'                                                      
C2561C                   EVAL      ZXCOEN=S0COEN                                                    
NAP45C                   ENDIF                                                                      
C2561C***                EVAL      S0COEN='2'   mmn: se omite forzado coenvio para doom3            
C2561C***                UPDATE    RCOCAPE       ya que este valor ya está calculado                
C2561 *                                                                                             
C2561 * Avisamos que se va a asignar coenvío por logística:                                         
C2561 *                                                                                             
C2561 * Si el pedido tiene numeros de coenvío manuales (ZXCOEN='2')                                 
C2561 * damos la opción de mantenerlos (W14)                                                        
C2561 * F10=Reasignación automática número coenvío por logística                                    
C2561 * F12=Respetar numeración manual donde exista y asignación                                    
C2561 *     automática por logística al resto.                                                      
C2561 *                                                                                             
C2561 * Si no hay coenvíos manuales se avisa en ventana que se van a                                
C2561 * asignar de forma automática (W15)                                                           
C2561 *                                                                                             
C2561C                   EVAL      *IN10=*OFF                                                       
C2561C                   EVAL      *IN12=*OFF                                                       
C2561 *                                                                                             
NAP45 *C2561             IF        @PTIPJ='1' AND ZXCOEN='2'                                        
mod03 *NAP45C                   IF        @PTIPJ='1' AND (ZXCOEN='2' OR ZXCOEN='3')                 
mod03                    if  zxcoen='9'; // mai entrarem. Sempre recalcularem                       
C2561C                   DOW       NOT *IN10 AND NOT *IN12                                          
C2561C                   EXFMT     W14                                                              
C2561 *                                                                                             
C2561C                   SELECT                                                                     
C2561C                   WHEN      *IN10                                                            
C2561C                   EXSR      CS_COEN_AUT                                                      
C2561C                   WHEN      *IN12                                                            
C2561C                   EXSR      CS_COEN_MAN                                                      
C2561C                   ENDSL                                                                      
C2561C                   ENDDO                                                                      
C2561 *                                                                                             
C2561 * Si el proceso es por batch o no han entrado parciales se                                    
C2561 * asignarán por logística automáticamente.                                                    
C2561 *                                                                                             
C2561C                   ELSE                                                                       
mod03 *C2561C                   IF        @PTIPJ='1'                                                
mod03 *C2561C                   EXFMT     W15                                                       
mod03 *C2561C                   ENDIF                                                               
C2561C                   EXSR      CS_COEN_AUT                                                      
C2561C                   ENDIF                                                                      
C2561 *                                                                                             
mod03 *C2561C                   ENDIF                                                               
C2561 *                                                                                             
C2561C                   ENDSR                                                                      
C2561 **********************************************************************                        
C2561 * ASIGNACION DE COENVIOS AUTOMATICOS POR LOGISTICA              *                             
C2561 **********************************************************************                        
C2561C     CS_COEN_AUT   BEGSR                                                                      
C2561 *                                                                                             
C2561 * Se asignarán de forma automática todos los números de coenvío                               
C2561 * por logísticas independientemente de los que hayan entrado de                               
C2561 * forma manual.                                                                               
C2561 *                                                                                             
C2561 * ASIGNAMOS COENVIOS en CODEPE                                                                
C2561 *                                                                                             
C2561C                   CLEAR                   COE_LOGA                                           
C2561C                   EVAL      IDCOE=1                                                          
C2561C                   EVAL      S5CIAS=@PCIAS                                                    
C2561C                   EVAL      S5DLGA=@PDLGA                                                    
C2561C                   EVAL      S5NPCO=@PNPCO                                                    
C2561C                   EVAL      S5TPED=@PTPED                                                    
C2561C                   EVAL      S5DATP=@PDATP                                                    
C2561C                   EVAL      S5NOPL=@PNOPL                                                    
C2561C     KCOCAPE       SETLL     CODEPE                                                           
C2561C     KCOCAPE       READE     CODEPE                                                           
C2561 *                                                                                             
C2561C                   DOW       NOT%EOF(CODEPE)                                                  
C2561C                   EXSR      CS_SERVICIO                                                      
C2561 *                                                                                             
C2561C                   IF        ZXSERV<>'1'                                                      
NAP45C*                  select                                                                     
NAP45C*                  when      ZXOCOE='2'                                                       
C2561C                   EVAL      S5NCOE='00'                                                      
C2561C                   EVAL      I2=1                                                             
C2561 *                                                                                             
C2561 * NUMERAMOS COENVIO SEGÚN LOGÍSTICA SALIDA                                                    
C2561 * Todas las logísticas FD (0OL, FD,...) han de llevar el mismo                                
C2561 * número de coenvío                                                                           
C2561 *                                                                                             
C2561C                   IF        S5TPE4='2'                                                       
C2561C                   EVAL      ZXLOGE='FDX'                                                     
C2561C                   ELSE                                                                       
C2561C                   EVAL      ZXLOGE=S5LOGE                                                    
C2561C                   ENDIF                                                                      
C2561 *                                                                                             
C2561C     ZXLOGE        LOOKUP    COE_LOGA(I2)                           81                        
C2561C                   IF        NOT%FOUND                                                        
C2561C                   EVAL      ZXNCOE=IDCOE                                                     
C2561C                   MOVE      ZXNCOE        S5NCOE                                             
C2561C                   EVAL      COE_LOGA(IDCOE)=ZXLOGE                                           
C2561C                   EVAL      IDCOE=IDCOE+1                                                    
C2561C                   ELSE                                                                       
C2561C                   EVAL      ZXNCOE=I2                                                        
C2561C                   MOVE      ZXNCOE        S5NCOE                                             
C2561C                   ENDIF                                                                      
C2561C                   ENDIF                                                                      
C2561 *                                                                                             
NAP45* Coenvío 3 llevará siempre blancos.                                                          
NAP45C                   if        ZXOCOE='3'                                                       
NAP45C                   EVAL      S5NCOE='  '                                                      
NAP45C                   endif                                                                      
C2561C                   UPDATE    RCODEPE                                                          
C2561 *                                                                                             
C2561C     KCOCAPE       READE     CODEPE                                                           
C2561C                   ENDDO                                                                      
C2561 *                                                                                             
C2561C                   ENDSR                                                                      
C2561 **********************************************************************                        
C2561 * ASIGNACION DE COENVIOS PARCIALES POR LOGÍSTICA                *                             
C2561 **********************************************************************                        
C2561C     CS_COEN_MAN   BEGSR                                                                      
C2561 *                                                                                             
C2561 * Se conservarán los números de coenvío que han entrado de forma                              
C2561 * manual y se asignarán automáticamente por logística los que han                             
C2561 * dejado en blanco.                                                                           
C2561 *                                                                                             
C2561 * Si han optado por mantener los coenvios entrados, los guardamos                             
C2561 * primero en una serie para no repetirlos luego en la asignación                              
C2561 * automática por logística de los que han dejado en blanco                                    
C2561 *                                                                                             
C2561C                   CLEAR                   COE_LOGM                                           
C2561C                   CLEAR                   COE_NCOM                                           
C2561C                   EVAL      I3=1                                                             
C2561C                   EVAL      S5CIAS=@PCIAS                                                    
C2561C                   EVAL      S5DLGA=@PDLGA                                                    
C2561C                   EVAL      S5NPCO=@PNPCO                                                    
C2561C                   EVAL      S5TPED=@PTPED                                                    
C2561C                   EVAL      S5DATP=@PDATP                                                    
C2561C                   EVAL      S5NOPL=@PNOPL                                                    
C2561C     KCOCAPE       SETLL     CODEPE                                                           
C2561C     KCOCAPE       READE     CODEPE                                                           
C2561 *                                                                                             
C2561C                   DOW       NOT%EOF(CODEPE)                                                  
C2561C                   IF        S5NCOE<>*BLANKS AND S5NCOE<>'00'                                 
C2561C     S5NCOE        LOOKUP    COE_NCOM(I3)                           81                        
C2561C                   IF        NOT%FOUND                                                        
C2561C                   EVAL      COE_NCOM(I3)=S5NCOE                                              
C2561C                   EVAL      COE_LOGM(I3)=S5LOGE                                              
C2561C                   EVAL      I3+=1                                                            
C2561C                   ENDIF                                                                      
C2561C                   ENDIF                                                                      
C2561C     KCOCAPE       READE     CODEPE                                                           
C2561C                   ENDDO                                                                      
C2561 *                                                                                             
C2561 * Ahora asignaremos automáticamente por logísticas los números                                
C2561 * de coenvío que han dejado en blanco si es el caso                                           
C2561 *                                                                                             
C2561 * ASIGNAMOS COENVIOS en CODEPE                                                                
C2561 *                                                                                             
C2561C                   CLEAR                   COE_LOGA                                           
C2561C                   EVAL      IDCOE=1                                                          
C2561C                   EVAL      S5CIAS=@PCIAS                                                    
C2561C                   EVAL      S5DLGA=@PDLGA                                                    
C2561C                   EVAL      S5NPCO=@PNPCO                                                    
C2561C                   EVAL      S5TPED=@PTPED                                                    
C2561C                   EVAL      S5DATP=@PDATP                                                    
C2561C                   EVAL      S5NOPL=@PNOPL                                                    
C2561C     KCOCAPE       SETLL     CODEPE                                                           
C2561C     KCOCAPE       READE     CODEPE                                                           
C2561 *                                                                                             
C2561C                   DOW       NOT%EOF(CODEPE)                                                  
C2561C                   EXSR      CS_SERVICIO                                                      
C2561 *                                                                                             
C2561C                   IF        (ZXSERV<>'1' AND S5NCOE=*BLANKS) OR                              
C2561C                             (ZXSERV<>'1' AND S5NCOE='00'   )                                 
C2561C                   EVAL      S5NCOE='00'                                                      
C2561C                   EVAL      I2=1                                                             
C2561 *                                                                                             
C2561 * NUMERAMOS COENVIO SEGÚN LOGÍSTICA SALIDA                                                    
C2561 * Todas las logísticas FD (0OL, FD,...) han de llevar el mismo                                
C2561 * número de coenvío                                                                           
C2561 *                                                                                             
C2561C                   IF        S5TPE4='2'                                                       
C2561C                   EVAL      ZXLOGE='FDX'                                                     
C2561C                   ELSE                                                                       
C2561C                   EVAL      ZXLOGE=S5LOGE                                                    
C2561C                   ENDIF                                                                      
C2561 *                                                                                             
C2561C     ZXLOGE        LOOKUP    COE_LOGA(I2)                           81                        
C2561 *                                                                                             
C2561C                   IF        NOT%FOUND                                                        
C2561C                   EVAL      ZXNCOM='0'                                                       
C2561 *                                                                                             
C2561 * Si ya se había entrado de forma manual se busca el siguiente                                
C2561 *                                                                                             
C2561C                   DOW       ZXNCOM='0'                                                       
C2561C                   EVAL      ZXNCOE=IDCOE                                                     
C2561C                   MOVE      ZXNCOE        S5NCOE                                             
C2561C     S5NCOE        LOOKUP    COE_NCOM(I2)                           81                        
C2561C                   IF        NOT%FOUND                                                        
C2561C                   EVAL      COE_LOGA(IDCOE)=ZXLOGE                                           
C2561C                   EVAL      IDCOE=IDCOE+1                                                    
C2561C                   EVAL      ZXNCOM='1'                                                       
C2561C                   ELSE                                                                       
C2561C                   EVAL      IDCOE=IDCOE+1                                                    
C2561C                   ENDIF                                                                      
C2561C                   ENDDO                                                                      
C2561 *                                                                                             
C2561C                   ELSE                                                                       
C2561C                   EVAL      ZXNCOE=I2                                                        
C2561C                   MOVE      ZXNCOE        S5NCOE                                             
C2561C                   ENDIF                                                                      
C2561C                   ENDIF                                                                      
NAP45* Coenvío 3 llevará siempre blancos.                                                          
NAP45C                   if        ZXOCOE='3'                                                       
NAP45C                   EVAL      S5NCOE='  '                                                      
NAP45C                   endif                                                                      
C2561 *                                                                                             
C2561C                   UPDATE    RCODEPE                                                          
C2561 *                                                                                             
C2561C     KCOCAPE       READE     CODEPE                                                           
C2561C                   ENDDO                                                                      
C2561 *                                                                                             
C2561C                   ENDSR                                                                      
C2561 **********************************************************************                        
C2561 * MIRAR SI ES UN ARTICULO DE SERVICIO                           *                             
C2561 **********************************************************************                        
C2561C     CS_SERVICIO   BEGSR                                                                      
C2561C                   EVAL      ZXSERV = *BLANKS                                                 
C2561 * Comprobar si el artículo es de servicio                                                     
C2561C     KMSARTI00     CHAIN     MSARTI00                                                         
C2561C                   IF        %FOUND(MSARTI00)                                                 
C2561C                   EVAL      PECIAS = S5CIAS                                                  
C2561C                   EVAL      PECTAB = 'TIPG'                                                  
C2561C                   EVAL      PECLTA = *BLANKS                                                 
C2561C                   EVAL      PECLTA = M5TIPG                                                  
C2561C     KPMTABD       CHAIN     PMTABD                                                           
C2561C                   IF        %FOUND(PMTABD)                                                   
C2561C                   EVAL      ZXSERV = PEBL61                                                  
C2561C                   ELSE                                                                       
C2561C                   EVAL      ZXSERV = *BLANKS                                                 
C2561C                   ENDIF                                                                      
C2561C                   ENDIF                                                                      
C2561C                   ENDSR                                                                      
E7391 ******************************************************************************************    
E7391 * MIRAR STATUS D'AQUEST ARTICLE / MAGATZEM EN M3, validar per component                       
E7391 ******************************************************************************************    
E7391C     VALIDA_M3     BEGSR                                                                      
E7391 *                                                                                             
E7391C                   IF        S5TCOJ='4'                                   i1--------------    
E7391 * Bucle per components                                                                        
E7391C                   EVAL      NDCIAS=S5CIAS                                                    
E7391C                   EVAL      NDARTI=S5ARTI                                                    
E7391C                   EVAL      NDVARI=S5VARI                                                    
E7391C                   EVAL      NDMODE=S5MODE                                                    
E7391C                   EVAL      NDTCOJ=S5TCOJ                                                    
E7391C                   EVAL      NDCOMP=*BLANKS                                                   
E7391C                   EVAL      NDVAR2=*BLANKS                                                   
E7391C                   EVAL      NDMOD2=*BLANKS                                                   
E7391C                   EVAL      NDTCO2=*BLANKS                                                   
E7391C     KMSCOJD       SETLL     MSCOJD                                                           
E7391C     KMSCOJD0      READE     MSCOJD                                                           
E7391C                   DOW       NOT %EOF(MSCOJD)                             d1-------------¬    
E7391C                   EVAL      M1CIAS=S5CIAS                                               |    
E7391C                   EVAL      M1MAGA=sMagLogSiEd                                          |    
E7391C                   EVAL      M1ARTI=NDCOMP                                               |    
E7391C                   EVAL      M1VARI=NDVAR2                                               |    
E7391C                   EVAL      M1MODE=NDMOD2                                               |    
E7391C     KMSSTOK       CHAIN     MSSTOK                                                      |    
E7391C                   IF        %FOUND(MSSTOK) AND                           i2----------¬  |    
E7391C                             M1PROP<>'1' OR M1PROP<>'2'                               |  |    
E7391 * Article NO propi, necessitem proveïdor                                              |  |    
E7391C                   IF        M1PRVR=*BLANKS                               i3-------¬  |  |    
E7391 * NO tenim proveïdor en MSSTOK, el recuperem del MSARTI                            |  |  |    
E7391C                   EVAL      M5ARTI=NDCOMP                                         |  |  |    
E7391C                   EVAL      M5VARI=NDVAR2                                         |  |  |    
E7391C                   EVAL      M5MODE=NDMOD2                                         |  |  |    
E7391C     KMSARTI00     CHAIN     MSARTI00                                              |  |  |    
E7391C                   IF        %FOUND(MSARTI00)                             i4----¬  |  |  |    
E7391C                   EVAL      M3_PRVR=M5PRVR                                     |  |  |  |    
E7391C                   ENDIF                                                  ei4----  |  |  |    
E7391C                   ELSE                                                   xi3------+  |  |    
E7391C                   EVAL      M3_PRVR=M1PRVR                                        |  |  |    
E7391C                   ENDIF                                                  ei3-------  |  |    
E7391C                   IF        M3_PRVR <> *BLANKS                           i5-------¬  |  |    
E7391C                   EVAL      M3_ARTI=S5ARTI                                        |  |  |    
E7391C                   EVAL      M3_VARI=S5VARI                                        |  |  |    
E7391C                   EVAL      M3_MODE=S5MODE                                        |  |  |    
E7391C                   EVAL      M3_PRVR=M1PRVR                                        |  |  |    
E7391C                   EXSR      VALIDA_STS_M3                                         |  |  |    
E7391C                   IF        @FDERRO='1'                                  i6----¬  |  |  |    
E7391C                   LEAVESR                                                      |  |  |  |    
E7391C                   ENDIF                                                  ei6----  |  |  |    
E7391C                   ELSE                                                   xi5------+  |  |    
E7391C                   EVAL      @FDERRO='1'                                           |  |  |    
E7391C                   EVAL      MSGER='DOO0050'                                       |  |  |    
E7391C                   LEAVESR                                                         |  |  |    
E7391C                   ENDIF                                                  ei5-------  |  |    
E7391C                   ENDIF                                                  ei2----------  |    
E7391C     KMSCOJD       READE     MSCOJD                                                      |    
E7391C                   ENDDO                                                  ed1-------------    
E7391 *                                                                                             
E7391C                   ELSE                                                   xi1-------------    
E7391C                   EVAL      M3_ARTI=S5ARTI                                                   
E7391C                   EVAL      M3_VARI=S5VARI                                                   
E7391C                   EVAL      M3_MODE=S5MODE                                                   
E7391C                   EVAL      M3_PRVR=M1PRVR                                                   
E7391C                   EXSR      VALIDA_STS_M3                                                    
E7391C                   ENDIF                                                  ei1-------------    
E7391 *                                                                                             
E7391C                   ENDSR                                                                      
E7391 ******************************************************************************************    
E7391 * MIRAR STATUS D'AQUEST ARTICLE / MAGATZEM EN M3                                              
E7391 *                                                                                             
E7391 * Input:  M3_ARTI, M3_VARI, M3_MODE, M3_PRVR                                                  
E7391 ******************************************************************************************    
E7391C     VALIDA_STS_M3 BEGSR                                                                      
E7391 * Ja tenim la lectura del MSSTOk                                                              
E7391C                   EVAL      MSGER = *BLANKS                                                  
E7391 *                                                                                             
E7391 * 1er Verificar que aquest proveïdor el tenim en M3                                           
E7391 *  Cerquem la Cia d'aquest proveïdor en UTCOM                                                 
E7391C                   EVAL      U0CIAS=S5CIAS                                                    
E7391C                   EVAL      U0TENV='5'                                                       
E7391C                   EVAL      U0CLP0=M3_PRVR                                                   
E7391C                   EVAL      U0CLP2=*BLANKS                                                   
E7391C     KUTCOM0       CHAIN     UTCOM0                                                           
E7391C                   IF        %FOUND(UTCOM0) AND U0BAJA<>'0'                                   
E7391C                   IF        %TRIM(U0CIA1)='018'                          TXAPU IBERSPA JA    
E7391C                   LEAVESR                                                 ESTA EN LEGACY     
E7391C                   ENDIF                                                                      
E7391 *  Mirem que l'empresa estigui en M3                                                          
E7391C                   EVAL      PPCIAS=U0CIA1                                                    
E7391C     PPCIAS        CHAIN     PMLIBL                                                           
E7391C                   IF        %FOUND(PMLIBL)                                                   
E7391C                   IF        %SUBST(PPBL10:9:1)='V'                                           
E7391C                   EVAL      PPCIAS=PPCIAS                                ES CORRECTE         
E7391C                   ENDIF                                                                      
E7391C                   ELSE                                                                       
E7391C                   EVAL      @FDERRO='1'                                                      
E7391C                   EVAL      MSGER='DOO0051'                                                  
E7391C                   LEAVESR                                                                    
E7391C                   ENDIF                                                                      
E7391C                   ELSE                                                                       
E7391C                   EVAL      @FDERRO='1'                                                      
E7391C                   EVAL      MSGER='DOO0052'                                                  
E7391C                   LEAVESR                                                                    
E7391C                   ENDIF                                                                      
E7391 * En aquest punt el proveïdor està en M3                                                      
E7391 * 2on.- Cerquem el ITNO d'aquest proveïdor                                                    
E7391C                   EVAL      C3CIAS=S5CIAS                                                    
E7391C                   EVAL      C3PRVR=M3_PRVR                                                   
E7391C                   EVAL      C3ARVM=M3_ARTI+M3_VARI+M3_MODE                                   
E7391C                   EVAL      C3TCOJ=*BLANKS                                                   
E7391C     KPUPRP0       CHAIN     PUPRP0                                                           
E7391C                   IF        %FOUND(PUPRP0) AND C3ARVP<>*BLANKS                               
E7391C                   EVAL      MBITNO = C3ARVP                                                  
E7391C                   ELSE                                                                       
E7391C                   EVAL      MBITNO = M3_ARTI+M3_VARI+M3_MODE                                 
E7391C                   ENDIF                                                                      
E7391 * 3er.- Finalment accedim al mitbal per validar stat                                          
E7391C                   EVAL      MBCONO = 100                                                     
E7391C                   EVAL      MBWHLO = XBWHLO                                                  
E7391C     KMITBAL00     CHAIN     MITBAL00                                                         
E7391C                   IF        %FOUND(MITBAL00) AND                                             
E7391C                             MBSTAT>='20' AND MBSTAT<'80'                                     
E7391C                   EVAL      PPCIAS=PPCIAS                                ES CORRECTE         
E7391C                   ELSE                                                                       
E7391C                   EVAL      @FDERRO='1'                                                      
E7391C                   EVAL      MSGER='DOO0053'                                                  
E7391C                   LEAVESR                                                                    
E7391C                   ENDIF                                                                      
E7391 *                                                                                             
E7391C                   ENDSR                                                                      
IT228 **************************************************************                                
IT228 * RECALCULAR LOGISTICA VIRTUAL                               *                                
IT228 *------------------------------------------------------------*                                
IT228 *                                                                                             
IT228C     LOG_VIRTUAL   BEGSR                                                                      
IT228 *                                                                                             
IT228 * Obtener logística virtual                                                                   
IT228 *                                                                                             
IT228C                   CALL      'MM1411'                                                         
IT228C                   PARM                    s5CIAS                                             
IT228C*                  PARM      S5LOGE        @PEALMA                                            
IT228C                   PARM      ZXRULOGE      @PEALMA                                            
IT228C                   PARM      '1'           @PETIPO                                            
IT228C                   PARM                    s5DLGA                                             
IT228C                   PARM                    @PERESP                                            
IT228 *                                                                                             
IT228C                   IF        @PERESP <> *BLANKS                                               
IT228C                   EVAL      M0MAGA = @PERESP                                                 
IT228C                   ELSE                                                                       
IT228 /free                                                                                         
         callp PgmOL(@PCIAS:@PDLGA:pPointer);                                                       
         pDsPgmOl = pPointer;                                                                       
         if zoldl<>*blanks;                                                                         
         zxLOGOL = zoldl;                                                                           
         else;                                                                                      
         zxLOGOL = zolem;                                                                           
         endif;                                                                                     
IT228 /end-free                                                                                     
IT228C                   EVAL      M0MAGA = ZXLOGOL                                                 
IT228C                   EVAL      @PERESP= ZXLOGOL                                                 
IT228C                   ENDIF                                                                      
IT228C                   ENDSR                                                                      
IT228 *                                                                                             
mod03 //////////////////////////////////////////////////////////////////////////////////////////    
mod03    begsr GetLogDft;                                                                           
mod03                                                                                               
mod03    //Logística No ED per defecte                                                              
mod03      if t3opl1<>*blanks;                                                                      
mod03        sLogNoEdDFT = t3opl1;                                                                  
mod03      else;                                                                                    
mod03        sLogNoEdDFT = s0loge;                                                                  
mod03      endif;                                                                                   
mod03                                                                                               
mod03    //Logística Si ED per defecte                                                              
mod03    callp PgmOL(@PCIAS:@PDLGA:pPointer);  // recuperem OL x dft                                
mod03    pDsPgmOl = pPointer;                                                                       
mod03    if zoldl<>*blanks;                                                                         
mod03      sLogSiEdDFT = zoldl;                                                                     
mod03    else;                                                                                      
mod03      sLogSiEdDFT = zolem;                                                                     
mod03    endif;                                                                                     
mod03                                                                                               
mod03    //Logística virtual per defecte                                                            
mod03    clear rmsalma05;                                                                           
mod03    chain (s0cias:sLogSiEdDFT) msalma05;                                                       
mod03    sMagLogSiEd = m_m0maga;                                                                    
mod03    pMM1411(s0cias:m_m0maga:*blanks:s0dlga:cresp);                                             
mod03    if cresp <> *blanks;                                                                       
mod03      sLogViEdDFT = %trim(cresp);                                                              
mod03    endif;                                                                                     
mod03                                                                                               
mod03    endsr;                                                                                     
mod03 //////////////////////////////////////////////////////////////////////////////////////////    
                                                                                                    
     C* validación de opciones                                                                      
      ******************************************************************************************    
     C* validación de opciones                                                                      
      ******************************************************************************************    
     C/COPY *LIBL/QSRDSRC,SRD030                                                                    
** CTDATA C                                                                                         
'                                                                                                   
