     A          R RGXEQAR                   PFILE(GXEQAR)                                           
     A          K Q1PROP                                                                            
     A          K Q1ARES                                                                            
     A          K Q1CIAS                                                                            
