      **************************************************************                                
      * APLICACIÓ: MÒDUL DE COMPRES                                *                                
      **************************************************************                                
      * TITOL: MM0006  © AQUAPOINT S.A.                           *                                 
      * DATA CREACIO:  04/08/1997    AUTOR: DPTO. INFORMATICA      *                                
      * FUNCIO DEL PROGRAMA: MANTENIMENT D'magatzems               *                                
      * (DSP/CRT/DLT/CPY/CHG)                                      *                                
      * DOCUMENTACIO:                                              *                                
      *                                                            *                                
      * ZXOPT1 = NOM DEL PROCÉS                                    *                                
      *        - PN = FORMAT DE PANTALLA N.(N=[01,02,...,99])      *                                
      *        - WN = WINDOWS N.(N=[01,02,...,99])                 *                                
      * ZXOPT2 = RUTINA DINTRE DEL PROCÉS                          *                                
      *        - 'INZ'= INICILITZAR                                *                                
      *        - 'DSP'= VISUALITZAR LA PANTALLA                    *                                
      *        - 'CMD'= VALIDACIÓ DE LES TECLES DE FUNCIÓ          *                                
      *        - 'CHK'= VALIDACIÓ DE LA PANTALLA                   *                                
      *        - 'CLR'= NETEJA LA PANTALLA                         *                                
      *        - 'UPD'= ACTUALITZACIONS DELS FITXERS               *                                
      *                                                            *                                
      **************************************************************                                
      * DATA DE MODIFICACIÓ: 05/08/1997  MARCA: DDMMA              *                                
      * AUTOR:  Joan Soriano                                       *                                
      * DOCUMENTACIÓ:                                              *                                
      *                                                            *                                
      **************************************************************                                
      * DATA DE MODIFICACIÓ: 09/05/2005  MARCA: 09055              *                                
      * AUTOR: Lluís Campo                                         *                                
      * DOCUMENTACIÓ: No borrar MSALMA marcar baja lógica          *                                
      **************************************************************                                
MOVEX * Modificación: MOVEX                                        *                                
MOVEX *        Autor: Carlos del Valle                             *                                
MOVEX * Fecha Inicio: Octubre 2006                                 *                                
MOVEX *  Descripción: Información de Dimensiones Movex             *                                
MOVEX **************************************************************                                
      * DATA DE MODIFICACIÓ: 26/11/2007  MARCA: 26117              *                                
      * AUTOR: TL                                                  *                                
      * DOCUMENTACIÓ: ALMACEN DE TRANSITO S/N Y CÓDIGO             *                                
      **************************************************************                                
21048 * DATA DE MODIFICACIÓ: 21/04/2008  MARCA: 21048              *                                
21048 * AUTOR: J.CAMPILLO                                          *                                
21048 * DOCUMENTACIÓ: Si @popci=2 y la empresa tiene activado el   *                                
21048 *               parámetro actualizar costes recalculo inven- *                                
21048 *               tario permanente, no dejamos modificar el    *                                
21048 *               campo de 'considerar inventario permanente'  *                                
      **************************************************************                                
30119 * DATA DE MODIFICACIÓ: 30/11/2009  MARCA: 30119              *                                
30119 * AUTOR: X.BOU                                               *                                
30119 * DOCUMENTACIÓ: GESTION DE ALMACENES DE PRESTAMOS            *                                
30119 **************************************************************                                
FQ876**************************************************************                                
FQ876* Modificación: FQ186||FQ844||FQ876                          *                                
FQ876*        Autor: Albert López (ALOPEZ) || JMARTINEZP          *                                
FQ876* Fecha Inicio: 09/12/2008 || 26/03/2012                     *                                
FQ876*  Descripción: Definició de magatzem SGA i zona de producció*                                
FQ876*               per defecte.|| definició fluxe TPV/NCD       *                                
FQ876**************************************************************                                
      * DATA DE MODIFICACIÓ: 19/01/2012  MARCA: FQ876              *                                
      * AUTOR: JMARTINEZP                                          *                                
      * DOCUMENTACIÓ: control salida pantalla MN0035               *                                
      **************************************************************                                
C1078 * DATA DE MODIFICACIÓ: 19/01/2012  MARCA: C1078              *                                
C1078 * AUTOR: JMARTINEZP                                          *                                
C1078 * DOCUMENTACIÓ: DOM                                          *                                
C1078 **************************************************************                                
      * DATA DE MODIFICACIÓ: 02/10/2014  MARCA: C1631                                               
      * AUTOR: JMARTINEZP                                                                           
      * DOCUMENTACIÓ: ESTANDARIZAR EDICOM                                                           
      **************************************************************                                
C2165 * DATA DE MODIFICACIÓ: 26/11/2014  MARCA: C2165              *                                
C2165 * AUTOR: Javier Arbide                                       *                                
C2165 * DOCUMENTACIÓ: Different adresses for the same warehouse    *                                
C2165 *               Añadir llamada al mantenimiento de direcc.   *                                
C2165 *               de almacén y grabar dirección almacén en     *                                
C2165 *               fichero CODIMA                               *                                
C2165 **************************************************************                                
C2294* Modificación: C2294          Change Request: CR2294        *                                
C2294*        Autor: X.Bou                                        *                                
C2294* Fecha Inicio: 11/11/2014                                   *                                
C2294*  Descripción: - Estandarizar Gestion de transportista      *                                
C2294*         optimo  (CR204 para empresas portuguesas)          *                                
C2294**************************************************************                                
C2557 * DATA DE MODIFICACIÓ: 03/03/2015  MARCA: C2557              *                                
C2557 * AUTOR: Javier Arbide                                       *                                
C2557 * DOCUMENTACIÓ: DOM-Modificaciones asignación FD             *                                
C2557 *               Si stock minimo=0 que actúe igualmente       *                                
C2557 *               Cálculo del stock disponible en Red Fluidra  *                                
C2557 *               restando el % sobre el stock mínimo          *                                
C2557 **************************************************************                                
C4137 * DATA DE MODIFICACIÓ: 18/10/2017  MARCA: C4137              *                                
C4137 * AUTOR:  TL                                                 *                                
C4137 * DOCUMENTACIÓ: ACEPTAR PROVEEDOR AUN SIN QUE SEA TIPO DE    *                                
C4137 *               ALMACEN 2 O 7                                *                                
C4137 **************************************************************                                
C4406 * Data de Modificació: 07/05/2018  Marca: C4406              *                                
C4406 * Autor: Jordi Montesinos                                    *                                
C4406 * Documentació: Fluidra Direct con UNISTRAL Recambios        *                                
C4406 **************************************************************                                
E5659* Modificación: E5659          Change Request: FSD-53205     *                                
E5659*        Autor: Enric                                        *                                
E5659* Fecha Inicio: 20/07/2020                                   *                                
E5659*  Descripción: El campo "Considerar rotación" debe ser 1    *                                
E5659*               por defecto en creación almacén.             *                                
E5659**************************************************************                                
IT226* DATA DE MODIFICACIÓ: 19/11/22021    MARCA: IT226 (ITOM226) *                                
IT226* AUTOR:        Manuel Alonso                                *                                
IT226* DOCUMENTACIÓ: Se debe poder informar proveedor para los    *                                
IT226*               almacenes OL (tipo 8).                       *                                
IT226**************************************************************                                
F-2OL **************************************************************                                
IT244 * DATA DE MODIFICACIÓ: 24/05/2022  MARCA: IT244              *                                
IT244 * AUTOR: David Grau                                          *                                
IT244 * DOCUMENTACIÓ: 2ª FASE 2OL                                  *                                
IT244 **************************************************************                                
                                                                                                    
                                                                                                    
     H DATEDIT(*YMD/)                                                                               
                                                                                                    
     H OPTION(*NODEBUGIO:*SRCSTMT)                                                                  
     FMM0006FM  CF   E             WORKSTN INFDS(FMTDS)                                             
     FMSALMA    UF A E           K DISK    INFDS(FMFDS) INFSR(*PSSR)                                
     FMSPAIS    IF   E           K DISK                                                             
     FMSZPAI    IF   E           K DISK                                                             
     FCOZZON    IF   E           K DISK                                                             
     FCOZSUB    IF   E           K DISK                                                             
     FMSUBIC    IF   E           K DISK                                                             
     FMSUBI1    IF   E           K DISK                                                             
     FMSSZON    IF   E           K DISK                                                             
     FPMTABD    IF   E           K DISK                                                             
     FPUPROV    IF   E           K DISK                                                             
     FPMSETP    IF   E           K DISK                                                             
C1078F*SLOGI    UF   E           K DISK                                                             
C1078FMSLOGI    UF A E           K DISK                                                             
     FMSLOAD02  UF   E           K DISK    PREFIX(MI_)                                              
     FMSCPOS    IF   E           K DISK                                                             
     FMSUBIC06  IF   E           K DISK    RENAME(RMSUBIC:RMSUBIC06)                                
MOVEXF*AXCODIGO  IF   E           K DISK                                                            
MOVEXF*                                    USROPN                                                   
MOVEXFFCHACC00  IF   E           K DISK                                                             
21048FPMEMPR    IF   E           K DISK                                                             
C2165FCODIMA    UF A E           K DISK                                                             
C2294FMSTRTA    IF   E           K DISK                                                             
C1078F*SLOAD    IF   E           K DISK    PREFIX(XL_)                                              
C1078FMSLOAD    IF A E           K DISK    PREFIX(XL_)                                              
30119F                                     RENAME(RMSLOAD:RMSLOAD1)                                 
30119FMSALMA00  IF   E           K DISK    PREFIX(XA_)                                              
30119F                                     RENAME(RMSALMA:RMSALMA1)                                 
C1078FEDPAR3    UF A E           K DISK                                                             
C1078FCOCAPEA8  IF   E           K DISK                                                             
C1078FCODEPE    IF   E           K DISK                                                             
C1078FGXSTO02   UF A E           K DISK                                                             
C1078FMSARTI00  IF   E           K DISK                                                             
C1078FMSSTO0    IF   E           K DISK                                                             
C1078FGMPRO303  IF   E           K DISK                                                             
C1078FCOCLP007  IF   E           K DISK                                                             
C1078FMSSTOK    IF   E           K DISK                                                             
C1078FMSALMA05  IF   E           K DISK    RENAME(RMSALMA:RMSALMA05)                                
C1078F                                     PREFIX(F_)                                               
                                                                                                    
     D* AREA DE DADES DE PROGRAMA I INICIALITZACIO DE VALORS COMUNS                                 
     D                SDS                                                                           
     D  SDSPGM                 1     10                                                             
     D    CCCPGM                     10    OVERLAY(SDSPGM)                                          
     D  SDSJOB               244    253                                                             
     D    CCCJOB                     10    OVERLAY(SDSJOB)                                          
     D  SDSUSR               254    263                                                             
     D  SDSJNBR              264    269                                                             
                                                                                                    
     D* AREA DE DADES D'INFORMACIÓ ARXIU                                                            
     D  FMTDS          DS                                                                           
     D    FMTPOCUR           370    371B 0                                                          
     D    FMTPOS             378    379B 0                                                          
     D    FMTRCD         *RECORD                                                                    
     D  FMFDS          DS                                                                           
     D    FMFFILE        *FILE                                                                      
     D    FMFSTS         *STATUS                                                                    
                                                                                                    
     D* AREA DE DADES LOCAL I INICIALITZACIO DE VALORS COMUNS                                       
     D  DSLDA        E DS                  EXTNAME(PURLDADS)                                        
     D    CCCDEEM                    30    OVERLAY(ZZDEEM)                                          
                                                                                                    
     D* AREA DE PARAMETRES DE PROGRAMA                                                              
     D MM0005        E DS                  EXTNAME(MM0005DS)                                        
     D* CONTROL DEL FLUXE DEL PROGRAMA                                                              
     D                 DS                                                                           
     D  ZXOPT                  1      6                                                             
     D    ZXOPT1               1      3                                                             
     D    ZXOPT2               4      6                                                             
     D                 DS                                                                           
     D  ZXUBIC                 1     12                                                             
     D    ZXFILA1              1      3                                                             
     D    ZXCOLU1              4      6                                                             
     D    ZXNIVE1              7      9                                                             
     D    ZXLADO1             10     10                                                             
     D* Descomposicion de FIELD para tomar la parte del diccionario                                 
     D                 DS                                                                           
     D  FIELD                  1     10                                                             
     D    ZXFMTO               1      3                                                             
     D    ZXFIE4               4      7                                                             
     D* SERIES A UTILITZAR EN PROGRAMA                                                              
     DSSSECPA          S              1A   DIM(10)                                                  
      * PLANTILLA D'INDICADORS DEL PROGRAMA (ELS RESERVATS NO SURTEN)                               
     D  INDICADORS   E DS                  BASED(INDICADORP)                                        
     D                                     EXTNAME(INDDS:RIND0199)                                  
     D    INDCHG                      1    OVERLAY(WRK25)                                           
     D    INDCPY                      1    OVERLAY(WRK26)                                           
     D    INDDLT                      1    OVERLAY(WRK27)                                           
     D    INDDSP                      1    OVERLAY(WRK28)                                           
     D    INDCRT                      1    OVERLAY(WRK29)                                           
     D    INDPROT                     1    OVERLAY(SETL00)                                          
     D  INDICADORP     S               *   INZ(%ADDR(*IN))                                          
                                                                                                    
     D                 DS                                                                           
     D  ZXPOSCUR               1      4  2                                                          
     D    ZXPOSX               1      2  0                                                          
     D    ZXPOSY               3      4  0                                                          
     D                 DS                                                                           
     D  ZXBL63                 1     15                                                             
     D    ZXPUBI2              1      1                                                             
     D    ZXPENT               2      2                                                             
     D    ZXUBIA               3      3                                                             
     D    ZXPCPL               4      4                                                             
     D    ZXPSAL               5      5                                                             
     D    ZXUBEX               6      6                                                             
     D    ZXTZUB               7      7                                                             
     D    ZXCUBC               8      8                                                             
     D    ZXTCST               9     11                                                             
      * Definicion de algunas constantes                                                            
     D  ZXZERO10       C                   '0000000000'                                             
      *IMPORTACIÓ DE PARÀMETRES                                                                     
                                                                                                    
     D    @PEOPT       S              2                                                             
     D    @PEPGM       S                   LIKE(SDSPGM) INZ                                         
     D    @PEFMT       S                   LIKE(RECORD) INZ                                         
     D    @PEFLD       S                   LIKE(FIELD)  INZ                                         
     D    @PEERR       S              1                 INZ                                         
                                                                                                    
     D  @PCIAS         S                   LIKE(M0CIAS)                                             
     D  @PMAGA         S                   LIKE(M0MAGA)                                             
     D  @PTDIR         S                   LIKE(M0TDIR)                                             
     D  @POPCI         S              2                                                             
     D  @PERRO         S              1                                                             
     D  @PCLTA         S             10    INZ                                                      
     D  @PCTAB         S             10    INZ                                                      
     D  @PFILE         S             10                                                             
     D  @PPGM          S             10                                                             
     D  @PECIAS        S                   LIKE(M0CIAS)                                             
     D  @PEDLGA        S                   LIKE(M0DLGA)                                             
     D  @PELGCA        S                   LIKE(M0LOGE)                                             
     D  @PEMAGA        S                   LIKE(M0MAGA)                                             
     D  @PETLGC        S              1                                                             
                                                                                                    
     D* DEFINICIO DE CAMPS DE TREBALL                                                               
     D  ZXTDIR         S                   LIKE(M0TDIR)                                             
     D  ZXPUBI         S                   LIKE(M0PUBI)                                             
     D  ZXTAL10        S                   LIKE(M0TAL1)                                             
26117D  ZXTAL1         S                   LIKE(M0TAL1)                                             
     D  Z_P            S              2  0 INZ(1)                                                   
     D  ZXPTRETORN     S              6A   INZ                                                      
                                                                                                    
      * DEFINICIO DE CAMPS DE PARÀMETRES PER CALL (SENSE IMPORT/EXPORT)                             
      * PARÀMETRES PEL PRD650 I CAMPS DE TREBALL ASSOCIATS                                          
      * VALOR NUMÈRIC                                                                               
     D   PXNUM         S             29  9                                                          
      * VALOR ALFANUMÈRIC                                                                           
     D   PXALPH        S             29                                                             
      * LONGITUD TOTAL DEL CAMP (Nº CARÀCTERS INCLÒS CODI EDICIÓ)                                   
     D   PXFLDD        S              2  0 INZ(20)                                                  
      * Nº DE DECIMALS DEL CAMP                                                                     
     D  PXDCCD         S              1  0                                                          
      * TIPUS DE FORMAT DECIMAL (.,)                                                                
     D  PXFMD1         S                   LIKE(ZZFMD1)INZ                                          
      * CODI D'EDICIÓ (4,M,Q,Z)                                                                     
     D  PXEDTC         S                   LIKE(ZZEDTC)INZ('4')                                     
      * RETORN CODI D'ERROR                                                                         
     D  PXNMER         S              1  0 INZ(0)                                                   
      * TIPUS D'AJUST DECIMAL (0=MIG 1=PER SOBRE 2=PER SOTA)                                        
     D  PXTIPA         S                   LIKE(ZZAJUD)                                             
MOVEX *                                                                                             
MOVEX * Entorno de Movex                                                                            
MOVEX *                                                                                             
MOVEXD  ZXVAL          DS                                                                           
MOVEXD    MXCONO               1      3                                                             
MOVEXD    MXDIVI               4      6                                                             
MOVEXD    MXIDIO               7      8                                                             
MOVEXD    MXMONE               9     11                                                             
MOVEXD    MXRESTO             12    250                                                             
MOVEX *                                                                                             
MOVEXD    @PECONOA     S              3                                                             
MOVEXD    @PEDIVI      S              3                                                             
MOVEXD    @PEUSER      S             10                                                             
MOVEXD    @PEVAL       S            250                                                             
MOVEXD    @PEAITP      S              1  0                                                          
26117D* CAMP LLARG PER EVITAR AMPLIACIÓ FITXER                                                      
26117D  M0AMPL         DS                                                                           
26117D    M0UTTR               1      1                                                             
26117D    M0MATR               2      6                                                             
FQ876d    m0ASGA              17     17                                                             
FQ876d    m0ZPrd              18     20                                                             
     D    M0NPPC              21     21                                                             
30119D    M0LOGI              22     24                                                             
FQ876D    M0MN35              25     25                                                             
FQ876D    M0FTPV              26     30                                                             
C1631D    M0EANA              44     58                                                             
C2294D    M0TPDF              31     33                                                             
                                                                                                    
C1078D  @PEOPCI        S              2                                                             
C1078D  ZXMAXLIN       S              6  0                                                          
C1078                                                                                               
C1078D  ZXFISO         S               D   DATFMT(*ISO)                                             
C1078D  ZXDIAS         S              8S 0                                                          
C1078D  ZXFMAX         S              8  0                                                          
C1078D  ZXSDIS         S                   LIKE(M1SACT)                                             
C1078D  ZXRFLU         S              1                                                             
C1078D                                                                                              
IT244D  nP7EDV3        S               N                                                            
      **************************************************************                                
      * RUTINA PRINCIPAL DEL PGM : DISTRIBUCIÓ DEL PAS PELS FMTS   *                                
      *------------------------------------------------------------*                                
     C     ZXOPT1        DOWNE     'END'                                                            
     C     ZXOPT1        CASEQ     'P10'         P10MAIN                                            
     C     ZXOPT1        CASEQ     'P2A'         P2AMAIN                                            
     C     ZXOPT1        CASEQ     'P2B'         P2BMAIN                                            
     C     ZXOPT1        CASEQ     'P30'         P30MAIN                                            
     C     ZXOPT1        CASEQ     'P40'         P40MAIN                                            
C1078C     ZXOPT1        CASEQ     'P5A'         P5AMAIN                                            
     C                   CAS                     PANNEXT                                            
     C                   ENDCS                                                                      
     C                   ENDDO                                                                      
     C                   SETON                                        LR                            
      **************************************************************                                
      * SUBRUTINA INICIAL                                          *                                
      *------------------------------------------------------------*                                
     C     *INZSR        BEGSR                                                                      
                                                                                                    
      * DEFINICIO DE LES KLIST DEL PGM                                                              
     C     KMSALMA       KLIST                                                                      
     C                   KFLD                    M0CIAS                                             
     C                   KFLD                    M0MAGA                                             
C2165C     KCODIMA       KLIST                                                                      
C2165C                   KFLD                    C2CIAS                                             
C2165C                   KFLD                    C2MAGA                                             
C2165C                   KFLD                    C2TDIR                                             
                                                                                                    
                                                                                                    
C2294C     KMSTRTA       KLIST                                                                      
C2294C                   KFLD                    N1CIAS                                             
C2294C                   KFLD                    N1TTTA                                             
                                                                                                    
     C     KMSPAIS       KLIST                                                                      
     C                   KFLD                    MECIAS                                             
     C                   KFLD                    MEPAIS                                             
                                                                                                    
     C     KMSZPAI       KLIST                                                                      
     C                   KFLD                    N4CIAS                                             
     C                   KFLD                    N4PAIS                                             
     C                   KFLD                    N4ZOPA                                             
                                                                                                    
     C     KCOZZON       KLIST                                                                      
     C                   KFLD                    TQCIAS                                             
     C                   KFLD                    TQZONC                                             
                                                                                                    
     C     KCOZSUB       KLIST                                                                      
     C                   KFLD                    TSCIAS                                             
     C                   KFLD                    TSZONC                                             
     C                   KFLD                    TSSUPC                                             
                                                                                                    
     C     KMSUBIC       KLIST                                                                      
     C                   KFLD                    M3CIAS                                             
     C                   KFLD                    M3MAGA                                             
                                                                                                    
     C     KMSUBI10      KLIST                                                                      
     C                   KFLD                    M4CIAS                                             
     C                   KFLD                    M4MAGA                                             
     C                   KFLD                    M4UBIC                                             
                                                                                                    
     C     KMSUBI100     KLIST                                                                      
     C                   KFLD                    M4CIAS                                             
     C                   KFLD                    M4MAGA                                             
                                                                                                    
     C     KMSUBIC060    KLIST                                                                      
     C                   KFLD                    M3CIAS                                             
     C                   KFLD                    M3MAGA                                             
     C                   KFLD                    M3ZUBC                                             
                                                                                                    
     C     KMSSZON       KLIST                                                                      
     C                   KFLD                    N5CIAS                                             
     C                   KFLD                    N5PAIS                                             
     C                   KFLD                    N5ZOPA                                             
     C                   KFLD                    N5SUPA                                             
                                                                                                    
     C     KPUPROV       KLIST                                                                      
     C                   KFLD                    C0CIAS                                             
     C                   KFLD                    C0PRVR                                             
                                                                                                    
     C     KPMTABD       KLIST                                                                      
     C                   KFLD                    PECIAS                                             
     C                   KFLD                    PECTAB                                             
     C                   KFLD                    PECLTA                                             
                                                                                                    
     C     KMSSETP       KLIST                                                                      
     C                   KFLD                    PICIAS                                             
     C                   KFLD                    PIPROG                                             
     C                   KFLD                    PIUSU1                                             
                                                                                                    
     C     KMSCPOS       KLIST                                                                      
     C                   KFLD                    N3CIAS                                             
     C                   KFLD                    N3PAIS                                             
     C                   KFLD                    N3POST                                             
                                                                                                    
     C     KMSLOGI       KLIST                                                                      
     C                   KFLD                    MICIAS                                             
     C                   KFLD                    MIDLGA                                             
     C                   KFLD                    MILGCA                                             
30119C     KMSLOAD       KLIST                                                                      
30119C                   KFLD                    XL_MICIAS                                          
30119C                   KFLD                    XL_MIDLGA                                          
30119C                   KFLD                    XL_MILGCA                                          
                                                                                                    
     C     KMSLOAD020    KLIST                                                                      
     C                   KFLD                    MICIAS                                             
     C                   KFLD                    MI_MIMAGA                                          
                                                                                                    
30119C     KMSALMA00     KLIST                                                                      
30119C                   KFLD                    XA_M0CIAS                                          
30119C                   KFLD                    XA_M0MAGA                                          
                                                                                                    
MOVEXC*    KAXCODIGO     KLIST                                                                      
MOVEXC*                  KFLD                    EMPRESA                                            
MOVEXC*                  KFLD                    AUXTIP                                             
MOVEXC*                  KFLD                    AUXCOD                                             
MOVEX *                                                                                             
MOVEX * Claves de Movex                                                                             
MOVEX *                                                                                             
MOVEXC     KFCHACC00     KLIST                                                                      
MOVEXC                   KFLD                    EACONO                                             
MOVEXC                   KFLD                    EADIVI                                             
MOVEXC                   KFLD                    EAAITP                                             
MOVEXC                   KFLD                    EAAITM                                             
                                                                                                    
21048C     KPMEMC        KLIST                                                                      
21048C                   KFLD                    ZZCIAS                                             
21048C                   KFLD                    ZZDLGA                                             
C1078                                                                                               
C1078                                                                                               
IT244C     KPMEMPR       KLIST                                                                      
IT244C                   KFLD                    P7CIAS                                             
IT244C                   KFLD                    P7DLGA                                             
C1078                                                                                               
C1078C     KEDPAR3       KLIST                                                                      
C1078C                   KFLD                    T5CIAS                                             
C1078C                   KFLD                    T5MAGA                                             
                                                                                                    
C1078                                                                                               
C1078C     KCODEPE       KLIST                                                                      
C1078C                   KFLD                    S5CIAS                                             
C1078C                   KFLD                    S5DLGA                                             
C1078C                   KFLD                    S5NPCO                                             
C1078C                   KFLD                    S5TPED                                             
C1078C                   KFLD                    S5DATP                                             
C1078C                   KFLD                    S5NOPL                                             
C1078                                                                                               
C1078C     KMSSTO0       KLIST                                                                      
C1078C                   KFLD                    M1CIAS                                             
C1078C                   KFLD                    M1MAGA                                             
C1078C                                                                                              
C1078C     KMSSTOK       KLIST                                                                      
C1078C                   KFLD                    M1CIAS                                             
C1078C                   KFLD                    M1MAGA                                             
C1078C                   KFLD                    M1ARTI                                             
C1078C                   KFLD                    M1VARI                                             
C1078C                   KFLD                    M1MODE                                             
C1078                                                                                               
C1078C     KGXSTO0       KLIST                                                                      
C1078C                   KFLD                    G1CIAO                                             
C1078C                   KFLD                    G1MAGO                                             
C1078                                                                                               
C1078C     KGXSTO002     KLIST                                                                      
C1078C                   KFLD                    G1CIAO                                             
C1078C                   KFLD                    G1MAGO                                             
C1078C                   KFLD                    G1ARTO                                             
C1078C                   KFLD                    G1VARO                                             
C1078C                   KFLD                    G1MODO                                             
C1078C                   KFLD                    G1CALO                                             
                                                                                                    
C1078                                                                                               
C1078C     KMSALMA05     KLIST                                                                      
C1078C                   KFLD                    F_M0CIAS                                           
C1078C                   KFLD                    F_M0LOGE                                           
C1078                                                                                               
C1078C     KMSARTI00     KLIST                                                                      
C1078C                   KFLD                    M5CIAS                                             
C1078C                   KFLD                    M5ARTI                                             
C1078C                   KFLD                    M5VARI                                             
C1078C                   KFLD                    M5MODE                                             
C1078 *                                                                                             
C1078C     KGMPRO303     KLIST                                                                      
C1078C                   KFLD                    P3CIAR                                             
C1078C                   KFLD                    P3ARVL                                             
C1078 *                                                                                             
C1078C     KCOCLP007     KLIST                                                                      
C1078C                   KFLD                    S3CIAS                                             
C1078C                   KFLD                    S3ARVM                                             
                                                                                                    
     C     *DTAARA       DEFINE    PURLDA        DSLDA                                              
     C                   IN        DSLDA                                                            
MOVEXC*                  IF        ZZCTBP=' '                                                       
MOVEXC*                  OPEN      AXCODIGO                                                         
MOVEXC*                  ENDIF                                                                      
MOVEX *                                                                                             
MOVEX * Establecer Entorno de Trabajo Movex                                                         
MOVEX *                                                                                             
MOVEXC                   MOVEL     ZZCIAS        @PEDIVI                                            
MOVEXC                   CALL      'GX0150'                                                         
MOVEXC                   PARM                    @PEDIVI                                            
MOVEXC                   PARM      SDSUSR        @PEUSER                                            
MOVEXC                   PARM      *BLANKS       @PEVAL                                             
MOVEXC                   EVAL      ZXVAL=@PEVAL                                                     
MOVEX *                                                                                             
MOVEXC                   MOVE      MXCONO        @PECONOA                                           
MOVEXC                   MOVE      MXDIVI        @PEDIVI                                            
MOVEX *                                                                                             
      * Entrada de parámetros                                                                       
     C     *ENTRY        PLIST                                                                      
     C                   PARM                    @PCIAS                                             
     C                   PARM                    @PMAGA                                             
     C                   PARM                    @POPCI                                             
     C                   PARM                    @PERRO                                             
     C* TITOLS DE PANTALLES (CODIS D'ARXIU DE MISSATGES)                                            
     C                   EVAL      CCCCTIT='TM00005'                                                
      * BUSQUEDA DE PARAMETROS DE SETUP                                                             
     C                   EVAL      PXFMD1=ZZFMD1                                                    
     C                   EVAL      PICIAS=ZZCIAS                                                    
     C                   EVAL      PIPROG='MM0005    '                                              
     C                   EVAL      PIUSU1=ZZUSUA                                                    
     C     KMSSETP       CHAIN     PMSETP                             81                            
     C                   CLEAR                   MM0005                                             
     C     PIDATR        CAT       MM0005:0      MM0005                                             
     C                   MOVEA     MÑSECP        SSSECPA                                            
     C                   IF        MÑSECP=*BLANKS OR @POPCI='1 ' OR                                 
     C                             @POPCI=' 1' OR @POPCI='3 ' OR                                    
     C                             @POPCI=' 3' OR @POPCI='1B'                                       
     C                   EVAL      SSSECPA(1)='A'                                                   
     C                   EVAL      SSSECPA(2)='B'                                                   
     C                   ENDIF                                                                      
                                                                                                    
     C                   EVAL      M0CIAS=@PCIAS                                                    
     C                   EVAL      M0MAGA=@PMAGA                                                    
     C                   EVAL      MICIAS=@PCIAS                                                    
     C                   EVAL      MI_MIMAGA=@PMAGA                                                 
C2294C                   EVAL      N1CIAS=@PCIAS                                                    
     C                   EVAL      M4CIAS=@PCIAS                                                    
     C                   EVAL      M4MAGA=@PMAGA                                                    
     C                   EVAL      M3CIAS=@PCIAS                                                    
     C                   EVAL      M3MAGA=@PMAGA                                                    
C1078                                                                                               
C1078C                   EVAL      T5CIAS=@PCIAS                                                    
C1078C                   EVAL      T5MAGA=@PMAGA                                                    
C1078                                                                                               
                                                                                                    
IT244C                   EVAL      P7CIAS=@PCIAS                                                    
IT244C                   EVAL      P7DLGA=*BLANKS                                                   
IT244C     KPMEMPR       CHAIN     PMEMPR                                                           
IT244C                   if        %found                                                           
IT244C                   Eval      nP7EDV3 = (%SubST(p7amp2:11:1)='1')                              
IT244C                   ENDIF                                                                      
      * ENS POSICIONEM EN EL FORMAT DE PANT. SEGONS NECESSITAT.                                     
      * POR DEFECTO IREMOS A LA 2ª PANTALLA                                                         
     C                   EVAL      INDCHG=*ON                                                       
     C                   EVAL      ZXOPT='P2ACLR'                                                   
     C                   IF        SSSECPA(1)<>*BLANKS                                              
     C                   EVAL      ZXOPT='P2'                                                       
     C     ZXOPT         CAT       SSSECPA(1):0  ZXOPT                                              
     C     ZXOPT         CAT       'CLR':0       ZXOPT                                              
     C                   ENDIF                                                                      
                                                                                                    
     C                   SELECT                                                                     
      * CRT                                                                                         
     C                   WHEN      @POPCI=' 1' OR @POPCI='1 '                                       
     C                   EVAL      ZXOPT='P10CLR'                                                   
     C                   EVAL      INDCRT=*ON                                                       
                                                                                                    
     C                   WHEN      @POPCI='1B'                                                      
     C                   EVAL      ZXOPT='P2ACLR'                                                   
     C                   EVAL      INDCRT=*ON                                                       
      * CPY                                                                                         
     C                   WHEN      @POPCI=' 3' OR @POPCI='3 '                                       
     C                   EVAL      ZXOPT='P30CLR'                                                   
     C                   EVAL      INDCPY=*ON                                                       
      * DLT                                                                                         
     C                   WHEN      @POPCI=' 4' OR @POPCI='4 '                                       
     C                   EVAL      ZXOPT='P40CLR'                                                   
     C                   EVAL      INDDLT=*ON                                                       
      * DSP                                                                                         
     C                   WHEN      @POPCI=' 5' OR @POPCI='5 '                                       
     C                   EVAL      INDDSP=*ON                                                       
     C                   EVAL      INDPROT=*ON                                                      
C1078 * PARAMETROS DOM                                                                              
C1078                                                                                               
C1078C                   WHEN      @POPCI='PA'                                                      
C1078C                   EVAL      ZXOPT='P5ACLR'                                                   
C1078C                   MOVE      @PCIAS        @PCIAA            3                                
C1078C                   CALL      'DO0060'                                                         
C1078C                   PARM                    @PCIAA                                             
C1078C                   PARM                    @PMAGA                                             
C1078C                   PARM                    @PERRO                                             
     C                   ENDSL                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA CONTROL DEL FMT P10                              *                                
      *------------------------------------------------------------*                                
     C     P10MAIN       BEGSR                                                                      
     C                   DOW       ZXOPT1='P10'                                                     
     C     ZXOPT2        CASEQ     'CLR'         P10CLR                                             
     C     ZXOPT2        CASEQ     'INZ'         P10INZ                                             
     C     ZXOPT2        CASEQ     'DSP'         P10DSP                                             
     C     ZXOPT2        CASEQ     'CMD'         P10CMD                                             
     C     ZXOPT2        CASEQ     'CHK'         P10CHK                                             
     C     ZXOPT2        CASEQ     'UPD'         P10UPD                                             
     C                   ENDCS                                                                      
     C                   ENDDO                                                                      
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA INICIALITZACIÓ DEL FMT P10                       *                                
      *------------------------------------------------------------*                                
     C     P10CLR        BEGSR                                                                      
      * ENS ENCARREGUEM QUE EL PROPER PAS SIGUI VISUALITZAR P10                                     
     C                   EVAL      ZXOPT2='INZ'                                                     
     C                   MOVEA     ZXZERO10      *IN(30)                                            
     C                   MOVEA     ZXZERO10      *IN(40)                                            
     C                   MOVEA     ZXZERO10      *IN(50)                                            
     C                   MOVEA     ZXZERO10      *IN(60)                                            
     C                   EVAL      CSRFILA=0                                                        
     C                   EVAL      CSRCOLU=0                                                        
     C                   RESET                   Z_P                                                
     C     P10CLRT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA INICIALITZACIÓ DEL FMT P10                       *                                
      *------------------------------------------------------------*                                
     C     P10INZ        BEGSR                                                                      
      * ENS ENCARREGUEM QUE EL PROPER PAS SIGUI VISUALITZAR P10                                     
     C                   EVAL      ZXOPT2='DSP'                                                     
     C     P10INZT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VISUALITZACIÓ DEL FMT P10                        *                                
      *------------------------------------------------------------*                                
     C     P10DSP        BEGSR                                                                      
      * ENS ENCARREGUEM QUE EL PROPER PAS SIGUI COMPROVAR ENTRADA CMD                               
     C                   EVAL      ZXOPT2='CMD'                                                     
     C                   EVAL      PPPCMD1='CMD7801'                                                
     C                   EXFMT     P10                                                              
     C                   MOVEA     ZXZERO10      *IN(30)                                            
     C                   MOVEA     ZXZERO10      *IN(40)                                            
     C                   MOVEA     ZXZERO10      *IN(50)                                            
     C                   MOVEA     ZXZERO10      *IN(60)                                            
     C                   EVAL      ERRGRL=*OFF                                                      
     C                   EVAL      MSGER=*BLANKS                                                    
     C     P10DSPT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VALIDACIÓ DELS CAMPS DEL FMT P10                 *                                
      *------------------------------------------------------------*                                
     C     P10CMD        BEGSR                                                                      
     C                   EVAL      ZXOPT2='CHK'                                                     
      *VALIDACIONES TECLAS DE FUNCION                                                               
     C                   SELECT                                                                     
      * FINALITZAR EL PROGRAMA                                                                      
     C                   WHEN      EXIT=*ON                                                         
     C                   EVAL      ZXOPT1='END'                                                     
      * SOL·LICITUD AJUDA D'ARTICLES                                                                
     C                   WHEN      HELP=*ON                                                         
     C                   EVAL      ZXOPT2='DSP'                                                     
     C                   EXSR      CS_POCUR2                                                        
                                                                                                    
     C                   WHEN      RETRO=*ON                                                        
     C                   EVAL      ZXOPT1='END'                                                     
     C                   ENDSL                                                                      
                                                                                                    
     C     P10CMDT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VALIDACIÓ DELS CAMPS DEL FMT P10                 *                                
      *------------------------------------------------------------*                                
     C     P10CHK        BEGSR                                                                      
     C                   EVAL      ZXOPT2='UPD'                                                     
      * Si el almacén es blanco no continuamos                                                      
     C                   IF        P10MAGA=*BLANKS                                                  
     C                   EVAL      ERRGRL=*ON                                                       
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP10CHK                                            
      * El almacén no puede existir                                                                 
     C                   EVAL      M0MAGA=P10MAGA                                                   
     C     KMSALMA       CHAIN (N) MSALMA                             81                            
     C                   IF        CHAIN=*OFF                                                       
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='ASG1028'                                                  
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP10CHK                                            
                                                                                                    
     C     TP10CHK       TAG                                                                        
     C                   IF        ERRGRL=*ON                                                       
     C                   EVAL      ZXOPT2='DSP'                                                     
     C                   ENDIF                                                                      
                                                                                                    
     C     P10CHKT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA DE ACTUALIZACION DATOS DE  P10                   *                                
      *------------------------------------------------------------*                                
     C     P10UPD        BEGSR                                                                      
      * PASA A LAS PANTALLAS P2X                                                                    
     C                   EVAL      ZXOPT='P2ACLR'                                                   
     C                   EVAL      M0MAGA=P10MAGA                                                   
     C     P10UPDT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA CONTROL DEL FMT P2A                              *                                
      *------------------------------------------------------------*                                
     C     P2AMAIN       BEGSR                                                                      
     C                   EVAL      ZXOPT1='P2A'                                                     
     C                   DOW       ZXOPT1='P2A'                                                     
     C     ZXOPT2        CASEQ     'CLR'         P2ACLR                                             
     C     ZXOPT2        CASEQ     'INZ'         P2AINZ                                             
     C     ZXOPT2        CASEQ     'DSP'         P2ADSP                                             
     C     ZXOPT2        CASEQ     'CMD'         P2ACMD                                             
     C     ZXOPT2        CASEQ     'CHK'         P2ACHK                                             
     C     ZXOPT2        CASEQ     'UPD'         P2AUPD                                             
     C                   ENDCS                                                                      
     C                   ENDDO                                                                      
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA LIMPIEZA  DE P2A                                 *                                
      *------------------------------------------------------------*                                
     C     P2ACLR        BEGSR                                                                      
     C                   EVAL      ZXOPT2='INZ'                                                     
     C                   MOVEA     ZXZERO10      *IN(30)                                            
     C                   MOVEA     ZXZERO10      *IN(40)                                            
     C                   MOVEA     ZXZERO10      *IN(50)                                            
     C                   MOVEA     ZXZERO10      *IN(60)                                            
     C                   MOVE      *BLANKS       MSGER                                              
     C                   EVAL      CSRFILA=0                                                        
     C                   EVAL      CSRCOLU=0                                                        
     C     P2ACLRT       ENDSR                                                                      
      *                                                                                             
      **************************************************************                                
      * SUBRUTINA INICIALITZACIÓ DEL FMT P2A                       *                                
      *------------------------------------------------------------*                                
     C     P2AINZ        BEGSR                                                                      
      *                                                                                             
     C                   EVAL      ZXOPT2='DSP'                                                     
     C     *NOKEY        CLEAR     *ALL          RMSALMA                                            
C1078C                   IF        INDDSP=*OFF                                                      
     C     KMSALMA       CHAIN     MSALMA                             81                            
C1078C                   ELSE                                                                       
C1078C     KMSALMA       CHAIN(N)  MSALMA                             81                            
C1078C                   ENDIF                                                                      
     C                   EXSR      P2AMFP                                                           
      * En el caso de altas se pasan los valores por defecto de PURLDA                              
     C                   IF        INDCRT=*ON                                                       
C2165C                   EVAL      *IN88=*OFF                                                       
     C                   EVAL      P2APAIS=ZZPAIS                                                   
C2165C                   ELSE                                                                       
C2165C                   EVAL      *IN88=*ON                                                        
     C                   ENDIF                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA PASAR DE FICHERO A PANTALLA P2A                  *                                
      *------------------------------------------------------------*                                
     C     P2AMFP        BEGSR                                                                      
      *                                                                                             
     C                   EVAL      P2AMAGA=M0MAGA                                                   
     C                   EVAL      P2ADES1=M0DES1                                                   
MOVEXC*                  EVAL      P2AAUXC=M0AUXC                                                   
MOVEXC                   EVAL      P2AAIT2=M0AIT2                                                   
MOVEXC                   EVAL      P2AAIT3=M0AIT3                                                   
MOVEXC                   EVAL      P2AAIT4=M0AIT4                                                   
MOVEXC                   EVAL      P2AAIT5=M0AIT5                                                   
MOVEXC                   EVAL      P2AAIT6=M0AIT6                                                   
MOVEXC                   EVAL      P2AAIT7=M0AIT7                                                   
     C                   EVAL      ZXPUBI=M0PUBI                                                    
     C                   EVAL      P2ADLGA=M0DLGA                                                   
     C                   EVAL      P2ACL10=M0CL10                                                   
     C                   EVAL      P2APAIS=M0PAIS                                                   
     C                   EVAL      P2AZOPA=M0ZOPA                                                   
     C                   EVAL      P2ASUPA=M0SUPA                                                   
     C                   EVAL      P2AZONC=M0ZONC                                                   
     C                   EVAL      P2ASUPC=M0SUPC                                                   
     C                   EVAL      P2ADIRE=M0DIRE                                                   
     C                   EVAL      P2ADIR1=M0DIR1                                                   
     C                   EVAL      P2ADIR2=M0DIR2                                                   
     C                   EVAL      P2APOST=M0POST                                                   
     C                   EVAL      P2APEGE=M0PEGE                                                   
     C                   EVAL      P2ATLEX=M0TLEX                                                   
     C                   EVAL      P2ATFAX=M0TFAX                                                   
     C                   EVAL      P2ATELE=M0TELE                                                   
     C                   EVAL      P2AEMAI=M0EMAI                                                   
     C                   EVAL      P2ATEL2=M0TEL2                                                   
     C                   EVAL      P2ATAL1=M0TAL1                                                   
     C                   EVAL      ZXTAL10=M0TAL1                                                   
26117C                   EVAL      ZXTAL1=M0TAL1                                                    
     C                   EVAL      P2ATAL2=M0TAL2                                                   
     C                   EVAL      P2ATAL3=M0TAL3                                                   
     C                   EVAL      P2APRVR=M0PRVR                                                   
     C                   EVAL      P2ATDIR=M0TDIR                                                   
     C                   EVAL      P2ALOGE=M0LOGE                                                   
     C                   EVAL      P2ALOGS=M0LOGS                                                   
     C                   EVAL      P2APRSV=M0PRSV                                                   
     C                   EVAL      P2APRES=M0PRES                                                   
     C                   EVAL      ZXTDIR=M0TDIR                                                    
30119C                   EVAL      P2ALOGI=M0LOGI                                                   
                                                                                                    
     C                   EVAL      PXALPH=*BLANKS                                                   
     C                   EVAL      PXNUM=M0NUBB                                                     
     C                   CALL      'PRD650'                                                         
     C                   PARM                    PXNUM                                              
     C                   PARM                    PXALPH                                             
     C                   PARM                    PXFLDD                                             
     C                   PARM      0             PXDCCD                                             
     C                   PARM                    PXFMD1                                             
     C                   PARM                    PXEDTC                                             
     C                   PARM                    PXNMER                                             
     C                   PARM                    PXTIPA                                             
     C                   MOVE      PXALPH        P2ANUBB                                            
C1631C                   EVAL      P2AEANA=M0EANA                                                   
                                                                                                    
      * PARA EL CASO DE COPIAS CAMBIAREMOS LA CABECERA                                              
     C                   IF        INDCPY=*ON                                                       
     C                   EVAL      ZXTDIR=*BLANKS                                                   
     C                   EVAL      P2AMAGA=P3CMAGA                                                  
     C     *NOKEY        CLEAR     *ALL          RMSALMA                                            
     C                   ENDIF                                                                      
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VISUALITZACIÓ DEL FMT P2A                        *                                
      *------------------------------------------------------------*                                
     C     P2ADSP        BEGSR                                                                      
      * ENS ENCARREGUEM QUE EL PROPER PAS SIGUI COMPROVAR ENTRADA CMD                               
     C                   EVAL      ZXOPT2='CMD'                                                     
     C                   EVAL      PPPCMD1='CMD7801'                                                
     C                   EXFMT     P2A                                                              
     C                   MOVEA     ZXZERO10      *IN(30)                                            
     C                   MOVEA     ZXZERO10      *IN(40)                                            
     C                   MOVEA     ZXZERO10      *IN(50)                                            
     C                   MOVEA     ZXZERO10      *IN(60)                                            
     C                   EVAL      ERRGRL=*OFF                                                      
     C                   EVAL      MSGER=*BLANKS                                                    
     C                   EVAL      CSRFILA=*ZEROS                                                   
     C                   EVAL      CSRCOLU=*ZEROS                                                   
     C     P2ADSPT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VALIDACIÓ DELS CMDS DEL FMT P2A                 *                                 
      *------------------------------------------------------------*                                
     C     P2ACMD        BEGSR                                                                      
     C                   EVAL      ZXOPT2='CHK'                                                     
      *VALIDACIONES TECLAS DE FUNCION                                                               
     C                   SELECT                                                                     
      * FINALITZAR EL PROGRAMA                                                                      
     C                   WHEN      EXIT=*ON                                                         
     C                   EVAL      ZXOPT1='END'                                                     
      * SOL·LICITUD AJUDA D'ARTICLES                                                                
     C                   WHEN      HELP=*ON                                                         
     C                   EVAL      ZXOPT2='DSP'                                                     
     C                   EXSR      CS_POCUR2                                                        
     C                   EXSR      P2AF4                                                            
      * RETROCESO PANTALLA                                                                          
     C                   WHEN      RETRO=*ON                                                        
     C                   EVAL      Z_P=Z_P-1                                                        
     C                   IF        Z_P<=0                                                           
     C                   EVAL      ZXOPT='END'                                                      
     C                   ELSE                                                                       
     C                   EVAL      ZXOPT1='P2 '                                                     
     C                   MOVE      SSSECPA(Z_P)  ZXOPT1                                             
     C                   EVAL      ZXOPT2='DSP'                                                     
     C                   ENDIF                                                                      
     C                   ENDSL                                                                      
                                                                                                    
     C     TP2ACMD       TAG                                                                        
     C                   IF        ERRGRL=*ON                                                       
     C                   EVAL      ZXOPT2='DSP'                                                     
     C                   ENDIF                                                                      
                                                                                                    
     C     P2ACMDT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA DE AYUDA EN CAMPOS DEL   FMT P2A                 *                                
      *------------------------------------------------------------*                                
     C     P2AF4         BEGSR                                                                      
     C* No se permite acceso a consulta si estamos en opcion de visualizar                          
     C                   IF        INDDSP=*ON                                                       
     C                   EVAL      ERRGRL=*ON                                                       
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           P2AF4T                                             
     C* F4 PARA VALORES QUE UNICAMENTE SE ACCEDE POR PROMPT SEGUN REFERENCIA                        
     C* DEL DICCIONARIO                                                                             
     C                   EVAL      @PEFLD=*BLANKS                                                   
     C                   EVAL      @PEFMT=*BLANKS                                                   
                                                                                                    
     C                   IF        FIELD='P2ATAL1'                                                  
     C                   IF        FIELD='P2ATAL1'                                                  
     C                   EVAL      @PEFLD=ZXFIE4                                                    
     C                   ELSE                                                                       
     C                   EVAL      @PEFLD='SINO'                                                    
     C                   ENDIF                                                                      
                                                                                                    
     C                   CALL      'MMPROM'                                                         
     C                   PARM      *BLANKS       @PEOPT                                             
     C                   PARM      *BLANKS       @PEPGM                                             
     C                   PARM                    @PEFMT                                             
     C                   PARM                    @PEFLD                                             
     C                   PARM      *BLANKS       @PEERR                                             
                                                                                                    
     C                   IF        @PEERR>'0'                                                       
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='ADP0304'                                                  
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           P2AF4T                                             
      * Si no han realizado ninguna selección no tocamos nada                                       
     C                   IF        @PEERR='A'                                                       
     C                   EVAL      ERRGRL=*ON                                                       
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           P2AF4T                                             
      *                                                                                             
     C                   IF        FIELD='P2ATAL1'                                                  
     C                   EVAL      P2ATAL1=@PEOPT                                                   
     C                   ENDIF                                                                      
                                                                                                    
     C                   GOTO      P2AF4T                                                           
     C                   ENDIF                                                                      
      * Ayudas de logisticas                                                                        
     C                   IF        FIELD='P2ALOGE'                                                  
     C                   CALL      'MM0690'                                                         
     C                   PARM                    @PCIAS                                             
     C                   PARM                    ZZDLGA                                             
     C                   PARM                    P2ALOGE                                            
     C                   PARM      '1'           @PEERR                                             
     C                   GOTO      P2AF4T                                                           
     C                   ENDIF                                                                      
                                                                                                    
     C                   IF        FIELD='P2ALOGS'                                                  
     C                   CALL      'MM0690'                                                         
     C                   PARM                    @PCIAS                                             
     C                   PARM                    ZZDLGA                                             
     C                   PARM                    P2ALOGS                                            
     C                   PARM      '2'           @PEERR                                             
     C                   GOTO      P2AF4T                                                           
     C                   ENDIF                                                                      
      * Ayudas en tablas                                                                            
     C                   IF        FIELD='P2ATAL2' OR FIELD='P2ADLGA'                               
     C                             OR FIELD='P2ATA01'                                               
     C                   EVAL      @PCLTA=*BLANKS                                                   
     C                   EVAL      @PCTAB=*BLANKS                                                   
     C                   EVAL      @PCTAB=ZXFIE4                                                    
     C                   IF        FIELD='P2ATAL2'                                                  
     C                   EVAL      @PCLTA=P2ATAL2                                                   
     C                   ENDIF                                                                      
                                                                                                    
     C                   IF        FIELD='P2ADLGA'                                                  
     C                   EVAL      @PCLTA=P2ADLGA                                                   
     C                   ENDIF                                                                      
                                                                                                    
     C                   CALL      'MMTABL'                                                         
     C                   PARM                    @PCLTA                                             
     C                   PARM                    @PCTAB                                             
     C                   PARM                    @PCIAS                                             
     C                   PARM                    @PEERR                                             
                                                                                                    
     C                   IF        @PEERR>'0'                                                       
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='ADP0304'                                                  
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           P2AF4T                                             
      * Si no han realizado ninguna selección no tocamos nada                                       
     C                   IF        @PEERR='A'                                                       
     C                   EVAL      ERRGRL=*ON                                                       
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           P2AF4T                                             
      *                                                                                             
     C                   IF        FIELD='P2ATAL2'                                                  
     C                   EVAL      P2ATAL2=@PCLTA                                                   
     C                   ENDIF                                                                      
                                                                                                    
     C                   IF        FIELD='P2ADLGA'                                                  
     C                   EVAL      P2ADLGA=@PCLTA                                                   
     C                   ENDIF                                                                      
                                                                                                    
     C                   GOTO      P2AF4T                                                           
     C                   ENDIF                                                                      
                                                                                                    
MOVEXC*                  IF        FIELD='P2AAUXC'                                                  
MOVEXC*                  IF        ZZCTBP=' '                                                       
MOVEXC*                  CALL      'HC0620'                                                         
MOVEXC*                  PARM      @PCIAS        EMPRESA                                            
MOVEXC*                  PARM      '01'          AUXTIP                                             
MOVEXC*                  PARM      P2AAUXC       AUXCOD                                             
MOVEXC*                  PARM      *BLANKS       @PERRO                                             
MOVEXC*                  EVAL      P2AAUXC=AUXCOD                                                   
MOVEXC*                  ENDIF                                                                      
MOVEXC*                  GOTO      P2AF4T                                                           
MOVEXC*                  ENDIF                                                                      
MOVEXC                   IF        FIELD='P2AAIT2'                                                  
MOVEXC                   CALL      'GX0610'                                                         
MOVEXC                   PARM      MXCONO        @PECONOA                                           
MOVEXC                   PARM      MXDIVI        @PEDIVI                                            
MOVEXC                   PARM      2             @PEAITP                                            
MOVEXC                   PARM                    P2AAIT2                                            
MOVEXC                   GOTO      P2AF4T                                                           
MOVEXC                   ENDIF                                                                      
MOVEX *                                                                                             
MOVEXC                   IF        FIELD='P2AAIT3'                                                  
MOVEXC                   CALL      'GX0610'                                                         
MOVEXC                   PARM      MXCONO        @PECONOA                                           
MOVEXC                   PARM      MXDIVI        @PEDIVI                                            
MOVEXC                   PARM      3             @PEAITP                                            
MOVEXC                   PARM                    P2AAIT3                                            
MOVEXC                   GOTO      P2AF4T                                                           
MOVEXC                   ENDIF                                                                      
MOVEX *                                                                                             
MOVEXC                   IF        FIELD='P2AAIT4'                                                  
MOVEXC                   CALL      'GX0610'                                                         
MOVEXC                   PARM      MXCONO        @PECONOA                                           
MOVEXC                   PARM      MXDIVI        @PEDIVI                                            
MOVEXC                   PARM      4             @PEAITP                                            
MOVEXC                   PARM                    P2AAIT4                                            
MOVEXC                   GOTO      P2AF4T                                                           
MOVEXC                   ENDIF                                                                      
MOVEX *                                                                                             
MOVEXC                   IF        FIELD='P2AAIT5'                                                  
MOVEXC                   CALL      'GX0610'                                                         
MOVEXC                   PARM      MXCONO        @PECONOA                                           
MOVEXC                   PARM      MXDIVI        @PEDIVI                                            
MOVEXC                   PARM      3             @PEAITP                                            
MOVEXC                   PARM                    P2AAIT5                                            
MOVEXC                   GOTO      P2AF4T                                                           
MOVEXC                   ENDIF                                                                      
MOVEX *                                                                                             
MOVEXC                   IF        FIELD='P2AAIT6'                                                  
MOVEXC                   CALL      'GX0610'                                                         
MOVEXC                   PARM      MXCONO        @PECONOA                                           
MOVEXC                   PARM      MXDIVI        @PEDIVI                                            
MOVEXC                   PARM      3             @PEAITP                                            
MOVEXC                   PARM                    P2AAIT6                                            
MOVEXC                   GOTO      P2AF4T                                                           
MOVEXC                   ENDIF                                                                      
MOVEX *                                                                                             
MOVEXC                   IF        FIELD='P2AAIT7'                                                  
MOVEXC                   CALL      'GX0610'                                                         
MOVEXC                   PARM      MXCONO        @PECONOA                                           
MOVEXC                   PARM      MXDIVI        @PEDIVI                                            
MOVEXC                   PARM      3             @PEAITP                                            
MOVEXC                   PARM                    P2AAIT7                                            
MOVEXC                   GOTO      P2AF4T                                                           
MOVEXC                   ENDIF                                                                      
                                                                                                    
     C                   IF        FIELD='P2APAIS'                                                  
     C                   CALL      'MM0615'                                                         
     C                   PARM                    @PCIAS                                             
     C                   PARM                    P2APAIS                                            
     C                   PARM      *BLANKS       @PERRO                                             
     C                   GOTO      P2AF4T                                                           
     C                   ENDIF                                                                      
                                                                                                    
     C                   IF        FIELD='P2APOST'                                                  
     C                   CALL      'MM0630'                                                         
     C                   PARM                    @PCIAS                                             
     C                   PARM                    P2APAIS                                            
     C                   PARM                    P2APOST                                            
     C                   PARM      *BLANKS       @PERRO                                             
     C                   GOTO      P2AF4T                                                           
     C                   ENDIF                                                                      
                                                                                                    
     C                   IF        FIELD='P2AZOPA'                                                  
     C                   CALL      'MM0620'                                                         
     C                   PARM                    @PCIAS                                             
     C                   PARM                    P2APAIS                                            
     C                   PARM                    P2AZOPA                                            
     C                   PARM      *BLANKS       @PERRO                                             
     C                   GOTO      P2AF4T                                                           
     C                   ENDIF                                                                      
                                                                                                    
     C                   IF        FIELD='P2ASUPA'                                                  
     C                   CALL      'MM0625'                                                         
     C                   PARM                    @PCIAS                                             
     C                   PARM                    P2APAIS                                            
     C                   PARM                    P2AZOPA                                            
     C                   PARM                    P2ASUPA                                            
     C                   PARM      *BLANKS       @PERRO                                             
     C                   GOTO      P2AF4T                                                           
     C                   ENDIF                                                                      
                                                                                                    
     C                   IF        FIELD='P2AZONC'                                                  
     C                   CALL      'CM0665'                                                         
     C                   PARM                    @PCIAS                                             
     C                   PARM                    P2AZONC                                            
     C                   PARM      *BLANKS       @PERRO                                             
     C                   GOTO      P2AF4T                                                           
     C                   ENDIF                                                                      
                                                                                                    
     C                   IF        FIELD='P2ASUPC'                                                  
     C                   CALL      'CM0670'                                                         
     C                   PARM                    @PCIAS                                             
     C                   PARM                    P2AZONC                                            
     C                   PARM                    P2ASUPC                                            
     C                   PARM      *BLANKS       @PERRO                                             
     C                   GOTO      P2AF4T                                                           
     C                   ENDIF                                                                      
                                                                                                    
      * SI NO TIENE F4 SOPORTADO DOY ERROR                                                          
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='ADP0304'                                                  
     C     ERRGRL        CABEQ     *ON           P2AF4T                                             
                                                                                                    
     C     P2AF4T        ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VALIDACIÓ DELS CAMPS DEL FMT P2A                 *                                
      *------------------------------------------------------------*                                
     C     P2ACHK        BEGSR                                                                      
     C                   EVAL      ZXOPT2='UPD'                                                     
      * La descripcion no puede ser blancos                                                         
     C                   IF        P2ADES1=*BLANKS                                                  
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='ASG1003'                                                  
     C                   EVAL      WRK30=*ON                                                        
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP2ACHK                                            
      * La direccion  no puede ser blancos                                                          
                                                                                                    
     C                   IF        P2ADIRE=*BLANKS                                                  
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='ASG1003'                                                  
     C                   EVAL      WRK31=*ON                                                        
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP2ACHK                                            
      * el pais debe existir en el fichero de paises                                                
     C                   EVAL      MECIAS=@PCIAS                                                    
     C                   EVAL      MEPAIS=P2APAIS                                                   
     C     KMSPAIS       CHAIN     MSPAIS                             81                            
     C                   IF        CHAIN=*ON OR MEBAJA>'0'                                          
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='ASG1003'                                                  
     C                   EVAL      WRK35=*ON                                                        
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP2ACHK                                            
      * La poblacion  no puede ser blancos Y SI LO ES, EL CODIGO POSTAL                             
      * NO PUEDE SER BLANCOS                                                                        
     C                   IF        P2ADIR2=*BLANKS AND P2APOST=*BLANKS                              
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='ASG1003'                                                  
     C                   EVAL      WRK33=*ON                                                        
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP2ACHK                                            
MOVEX * Validacion de tipo de AUXILIAR                                                              
MOVEXC*                  IF        P2AAUXC<>*BLANKS                                                 
MOVEXC*                  IF        ZZCTBP=' '                                                       
MOVEXC*                                                                                             
MOVEXC*                  MOVE      @PCIAS        EMPRESA                                            
MOVEXC*                  EVAL      AUXTIP='01'                                                      
MOVEXC*                  EVAL      AUXCOD=P2AAUXC                                                   
MOVEXC*    KAXCODIGO     CHAIN     AXCODIGO                           81                            
MOVEXC*                  IF        CHAIN=*ON                                                        
MOVEXC*                  EVAL      ERRGRL=*ON                                                       
MOVEXC*                  EVAL      MSGER='MMM0232'                                                  
MOVEXC*                  EVAL      WRK66=*ON                                                        
MOVEXC*                  ENDIF                                                                      
MOVEXC*    ERRGRL        CABEQ     *ON           TP2ACHK                                            
MOVEXC*                  ENDIF                                                                      
MOVEXC*                                                                                             
MOVEXC*                  ENDIF                                                                      
MOVEX *                                                                                             
MOVEX * Validar las 6 Dimensiones (1º con DIVI y luego general)                                     
MOVEX * No son Obligatorias                                                                         
MOVEX *                                                                                             
MOVEXC                   IF        P2AAIT2<>*BLANKS                                                 
MOVEXC                   MOVEL     MXCONO        EACONO                                             
MOVEXC                   MOVEL     MXDIVI        EADIVI                                             
MOVEXC                   MOVE      2             EAAITP                                             
MOVEXC                   MOVEL     P2AAIT2       EAAITM                                             
MOVEXC     KFCHACC00     CHAIN     FCHACC00                                                         
MOVEXC                   IF        NOT %FOUND(FCHACC00)                                             
MOVEXC                   MOVEL     *BLANKS       EADIVI                                             
MOVEXC     KFCHACC00     CHAIN     FCHACC00                                                         
MOVEXC                   IF        NOT %FOUND(FCHACC00)                                             
MOVEXC                   EVAL      ERRGRL=*ON                                                       
MOVEXC                   EVAL      MSGER='ERR3030'                                                  
MOVEXC                   EVAL      WRK62=*ON                                                        
MOVEXC                   ENDIF                                                                      
MOVEXC                   ENDIF                                                                      
MOVEXC     ERRGRL        CABEQ     *ON           TP2ACHK                                            
MOVEXC                   ENDIF                                                                      
MOVEX *                                                                                             
MOVEXC                   IF        P2AAIT3<>*BLANKS                                                 
MOVEXC                   MOVEL     MXCONO        EACONO                                             
MOVEXC                   MOVEL     MXDIVI        EADIVI                                             
MOVEXC                   MOVE      3             EAAITP                                             
MOVEXC                   MOVEL     P2AAIT3       EAAITM                                             
MOVEXC     KFCHACC00     CHAIN     FCHACC00                                                         
MOVEXC                   IF        NOT %FOUND(FCHACC00)                                             
MOVEXC                   MOVEL     *BLANKS       EADIVI                                             
MOVEXC     KFCHACC00     CHAIN     FCHACC00                                                         
MOVEXC                   IF        NOT %FOUND(FCHACC00)                                             
MOVEXC                   EVAL      ERRGRL=*ON                                                       
MOVEXC                   EVAL      MSGER='ERR3030'                                                  
MOVEXC                   EVAL      WRK63=*ON                                                        
MOVEXC                   ENDIF                                                                      
MOVEXC                   ENDIF                                                                      
MOVEXC     ERRGRL        CABEQ     *ON           TP2ACHK                                            
MOVEXC                   ENDIF                                                                      
MOVEX *                                                                                             
MOVEXC                   IF        P2AAIT4<>*BLANKS                                                 
MOVEXC                   MOVEL     MXCONO        EACONO                                             
MOVEXC                   MOVEL     MXDIVI        EADIVI                                             
MOVEXC                   MOVE      4             EAAITP                                             
MOVEXC                   MOVEL     P2AAIT4       EAAITM                                             
MOVEXC     KFCHACC00     CHAIN     FCHACC00                                                         
MOVEXC                   IF        NOT %FOUND(FCHACC00)                                             
MOVEXC                   MOVEL     *BLANKS       EADIVI                                             
MOVEXC     KFCHACC00     CHAIN     FCHACC00                                                         
MOVEXC                   IF        NOT %FOUND(FCHACC00)                                             
MOVEXC                   EVAL      ERRGRL=*ON                                                       
MOVEXC                   EVAL      MSGER='ERR3030'                                                  
MOVEXC                   EVAL      WRK64=*ON                                                        
MOVEXC                   ENDIF                                                                      
MOVEXC                   ENDIF                                                                      
MOVEXC     ERRGRL        CABEQ     *ON           TP2ACHK                                            
MOVEXC                   ENDIF                                                                      
MOVEX *                                                                                             
MOVEXC                   IF        P2AAIT5<>*BLANKS                                                 
MOVEXC                   MOVEL     MXCONO        EACONO                                             
MOVEXC                   MOVEL     MXDIVI        EADIVI                                             
MOVEXC                   MOVE      3             EAAITP                                             
MOVEXC                   MOVEL     P2AAIT5       EAAITM                                             
MOVEXC     KFCHACC00     CHAIN     FCHACC00                                                         
MOVEXC                   IF        NOT %FOUND(FCHACC00)                                             
MOVEXC                   MOVEL     *BLANKS       EADIVI                                             
MOVEXC     KFCHACC00     CHAIN     FCHACC00                                                         
MOVEXC                   IF        NOT %FOUND(FCHACC00)                                             
MOVEXC                   EVAL      ERRGRL=*ON                                                       
MOVEXC                   EVAL      MSGER='ERR3030'                                                  
MOVEXC                   EVAL      *IN65=*ON                                                        
MOVEXC                   ENDIF                                                                      
MOVEXC                   ENDIF                                                                      
MOVEXC     ERRGRL        CABEQ     *ON           TP2ACHK                                            
MOVEXC                   ENDIF                                                                      
MOVEX *                                                                                             
MOVEXC                   IF        P2AAIT6<>*BLANKS                                                 
MOVEXC                   MOVEL     MXCONO        EACONO                                             
MOVEXC                   MOVEL     MXDIVI        EADIVI                                             
MOVEXC                   MOVE      3             EAAITP                                             
MOVEXC                   MOVEL     P2AAIT6       EAAITM                                             
MOVEXC     KFCHACC00     CHAIN     FCHACC00                                                         
MOVEXC                   IF        NOT %FOUND(FCHACC00)                                             
MOVEXC                   MOVEL     *BLANKS       EADIVI                                             
MOVEXC     KFCHACC00     CHAIN     FCHACC00                                                         
MOVEXC                   IF        NOT %FOUND(FCHACC00)                                             
MOVEXC                   EVAL      ERRGRL=*ON                                                       
MOVEXC                   EVAL      MSGER='ERR3030'                                                  
MOVEXC                   EVAL      WRK66=*ON                                                        
MOVEXC                   ENDIF                                                                      
MOVEXC                   ENDIF                                                                      
MOVEXC     ERRGRL        CABEQ     *ON           TP2ACHK                                            
MOVEXC                   ENDIF                                                                      
MOVEX *                                                                                             
MOVEXC                   IF        P2AAIT7<>*BLANKS                                                 
MOVEXC                   MOVEL     MXCONO        EACONO                                             
MOVEXC                   MOVEL     MXDIVI        EADIVI                                             
MOVEXC                   MOVE      3             EAAITP                                             
MOVEXC                   MOVEL     P2AAIT7       EAAITM                                             
MOVEXC     KFCHACC00     CHAIN     FCHACC00                                                         
MOVEXC                   IF        NOT %FOUND(FCHACC00)                                             
MOVEXC                   MOVEL     *BLANKS       EADIVI                                             
MOVEXC     KFCHACC00     CHAIN     FCHACC00                                                         
MOVEXC                   IF        NOT %FOUND(FCHACC00)                                             
MOVEXC                   EVAL      ERRGRL=*ON                                                       
MOVEXC                   EVAL      MSGER='ERR3030'                                                  
MOVEXC                   EVAL      WRK67=*ON                                                        
MOVEXC                   ENDIF                                                                      
MOVEXC                   ENDIF                                                                      
MOVEXC     ERRGRL        CABEQ     *ON           TP2ACHK                                            
MOVEXC                   ENDIF                                                                      
MOVEX *                                                                                             
      * Validación del Código postal                                                                
      *                                                                                             
     C                   EVAL      N3PAIS=MEPAIS                                                    
     C                   EVAL      N3CIAS=@PCIAS                                                    
     C                   EVAL      N3POST=P2APOST                                                   
      *                                                                                             
     C     KMSCPOS       CHAIN     MSCPOS                             81                            
      * Si solo se valida y se avisa                                                                
     C                   IF        CHAIN=*ON  OR N3BAJA>'0'                                         
     C                   EVAL      WRK34=*ON                                                        
                                                                                                    
     C                   IF        MEVPOS='1'                                                       
     C                   EXFMT     W01                                                              
     C                   SELECT                                                                     
     C                   WHEN      RETRO=*ON                                                        
     C                   EVAL      ERRGRL=*ON                                                       
     C                   GOTO      TP2ACHK                                                          
     C                   ENDSL                                                                      
     C                   ENDIF                                                                      
                                                                                                    
      * Si se valida y no permite                                                                   
     C                   IF        MEVPOS='2'                                                       
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='ASG1004'                                                  
     C                   ENDIF                                                                      
                                                                                                    
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP2ACHK                                            
                                                                                                    
      * LA ZONA DEL PAIS SOLO SE VALIDA SI NO ES BLANCOS                                            
     C                   IF        P2AZOPA<>*BLANKS                                                 
     C                   EVAL      N4CIAS=@PCIAS                                                    
     C                   EVAL      N4PAIS=P2APAIS                                                   
     C                   EVAL      N4ZOPA=P2AZOPA                                                   
     C     KMSZPAI       CHAIN     MSZPAI                             81                            
     C                   IF        CHAIN=*ON OR N4BAJA>'0'                                          
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='MMM0001'                                                  
     C                   EVAL      WRK56=*ON                                                        
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP2ACHK                                            
                                                                                                    
      * LA SUBZONA DEL PAIS SOLO SE VALIDA SI NO ES BLANCOS                                         
     C                   IF        P2ASUPA<>*BLANKS                                                 
     C                   EVAL      N5CIAS=@PCIAS                                                    
     C                   EVAL      N5PAIS=P2APAIS                                                   
     C                   EVAL      N5ZOPA=P2AZOPA                                                   
     C                   EVAL      N5SUPA=P2ASUPA                                                   
     C     KMSSZON       CHAIN     MSSZON                             81                            
     C                   IF        CHAIN=*ON OR N5BAJA>'0'                                          
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='MMM0002'                                                  
     C                   EVAL      WRK36=*ON                                                        
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP2ACHK                                            
      * LA ZONA COMERCIAL ES OBLIGATORIA                                                            
     C                   EVAL      TQCIAS=@PCIAS                                                    
     C                   EVAL      TQZONC=P2AZONC                                                   
     C     KCOZZON       CHAIN     COZZON                             81                            
     C                   IF        CHAIN=*ON OR TQBAJA>'0'                                          
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='MMM0001'                                                  
     C                   EVAL      WRK62=*ON                                                        
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP2ACHK                                            
                                                                                                    
      * LA SUBZONA COMERCIAL ES OBLIGATORIA                                                         
     C                   EVAL      TSCIAS=@PCIAS                                                    
     C                   EVAL      TSZONC=P2AZONC                                                   
     C                   EVAL      TSSUPC=P2ASUPC                                                   
     C     KCOZSUB       CHAIN     COZSUB                             81                            
     C                   IF        CHAIN=*ON OR TSBAJA>'0'                                          
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='MMM0001'                                                  
     C                   EVAL      WRK63=*ON                                                        
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP2ACHK                                            
      * Validacion del tipo de almacen                                                              
     C                   EVAL      @PEOPT=*BLANKS                                                   
     C                   EVAL      @PEOPT=P2ATAL1                                                   
     C                   CALL      'MMPROM'                                                         
     C                   PARM                    @PEOPT                                             
     C                   PARM      *BLANKS       @PEPGM                                             
     C                   PARM      *BLANKS       @PEFMT                                             
     C                   PARM      'TAL1      '  @PEFLD                                             
     C                   PARM      'V'           @PEERR                                             
                                                                                                    
     C                   IF        @PEERR>'0'                                                       
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='MMM0220'                                                  
     C                   EVAL      WRK44=*ON                                                        
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP2ACHK                                            
      * Los almacenes virtuales OL no pueden tener ubicaciones                                      
     C                   IF        P2ATAL1='8' AND M0PUBI>='1'                                      
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='MMM0301'                                                  
     C                   EVAL      WRK57=*ON                                                        
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP2ACHK                                            
      * Los almacenes virtuales OL deben ser compatibles con ZZEPP6>=1                              
     C*                  IF        P2ATAL1='8' AND ZZEPP6<='0'                                      
     C*                  EVAL      ERRGRL=*ON                                                       
     C*                  EVAL      MSGER='MSG0174'                                                  
     C*                  EVAL      WRK57=*ON                                                        
     C*                  ENDIF                                                                      
     C*    ERRGRL        CABEQ     *ON           TP2ACHK                                            
      * Validacion del código de dirección si almacén o parkin interno                              
     C                   IF        P2ATAL1<='1' AND P2ATDIR=*BLANKS                                 
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='ASG1003'                                                  
     C                   EVAL      WRK60=*ON                                                        
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP2ACHK                                            
      * Los almacenes de transito y proveedor no puede tener ubicaciones                            
     C*                  IF        P2ATAL1>'1' AND M0PUBI>='1'                                      
     C*                  EVAL      ERRGRL=*ON                                                       
     C*                  EVAL      MSGER='MMM0301'                                                  
     C*                  EVAL      WRK60=*ON                                                        
     C*                  ENDIF                                                                      
     C*    ERRGRL        CABEQ     *ON           TP2ACHK                                            
      * Validación de logísticas                                                                    
      * Puesto que existe una incongruencia ya que la logística necesita del alm                    
      * este caso se da de alta el almacén validando la logística, se deja que p                    
      * y copias la validación se omita y se cree el registro en logísticas al f                    
     C                   IF        P2ALOGE=*BLANKS                                                  
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      WRK34=*ON                                                        
     C                   EVAL      MSGER='ADP0130'                                                  
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP2ACHK                                            
                                                                                                    
     C                   IF        INDCRT<>*ON AND INDCPY<>*ON                                      
     C                   EVAL      MIDLGA=P2ADLGA                                                   
     C                   EVAL      MILGCA=P2ALOGE                                                   
     C     KMSLOGI       CHAIN(N)  MSLOGI                             81                            
     C                   IF        (CHAIN=*ON) OR (MITLGC<>' ' AND                                  
     C                             MITLGC<>'1')                                                     
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      WRK34=*ON                                                        
     C                   EVAL      MSGER='MMM0108'                                                  
     C                   ENDIF                                                                      
C1078 *                                                                                             
C1078C                   IF        INDDSP=*OFF                                                      
C1078C                   EXSR      CS_CRTLOG                                                        
C1078C                   ENDIF                                                                      
C1078 *                                                                                             
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP2ACHK                                            
                                                                                                    
     C                   IF        P2ALOGS=*BLANKS                                                  
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      WRK35=*ON                                                        
     C                   EVAL      MSGER='ADP0130'                                                  
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP2ACHK                                            
                                                                                                    
     C                   IF        INDCRT<>*ON AND INDCPY<>*ON                                      
     C                   EVAL      MIDLGA=P2ADLGA                                                   
     C                   EVAL      MILGCA=P2ALOGS                                                   
     C     KMSLOGI       CHAIN(N)  MSLOGI                             81                            
     C                   IF        (CHAIN=*ON) OR (MITLGC<>' ' AND                                  
     C                             MITLGC<>'2')                                                     
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      WRK35=*ON                                                        
     C                   EVAL      MSGER='MMM0109'                                                  
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP2ACHK                                            
30119 *                                                                                             
30119 * Comprobar Logistica Asociada: Si es almacen de tipo '2', debe informarse                    
30119 * , ser valida y diferente a las logisticas de entrada y salida.                              
30119 * Si el almacen no es de tipo '2', no debe informarse.                                        
30119 *                                                                                             
30119C                   IF        P2ATAL1='2'                                                      
30119 *                                                                                             
30119C                   IF        P2ALOGI=*BLANKS                                                  
30119C                   EVAL      ERRGRL=*ON                                                       
30119C                   EVAL      WRK48=*ON                                                        
30119C                   EVAL      MSGER='MMM0401'                                                  
30119C                   ENDIF                                                                      
30119C     ERRGRL        CABEQ     *ON           TP2ACHK                                            
30119                                                                                               
30119C                   EVAL      MIDLGA=P2ADLGA                                                   
30119C                   EVAL      MILGCA=P2ALOGI                                                   
30119C     KMSLOGI       CHAIN(N)  MSLOGI                             81                            
30119C                   IF        (CHAIN=*ON) OR (MITLGC<>' ' AND                                  
30119C                             MITLGC<>'2')                                                     
30119C                   EVAL      ERRGRL=*ON                                                       
30119C                   EVAL      WRK48=*ON                                                        
30119C                   EVAL      MSGER='MMM0109'                                                  
30119C                   ENDIF                                                                      
30119C     ERRGRL        CABEQ     *ON           TP2ACHK                                            
30119 *                                                                                             
30119 * COMPROBAR QUE LA LOGISTICA ASOCIADA NO SEA A SU VEZ UN ALMACEN                              
30119 * DE TIPO '2'                                                                                 
30119 *                                                                                             
30119C                   EVAL      XL_MICIAS=@PCIAS                                                 
30119C                   EVAL      XL_MIDLGA=P2ADLGA                                                
30119C                   EVAL      XL_MILGCA=P2ALOGI                                                
30119C     KMSLOAD       CHAIN     MSLOAD                             81                            
30119C                   EVAL      XA_M0CIAS=XL_MICIAS                                              
30119C                   EVAL      XA_M0MAGA=XL_MIMAGA                                              
30119C     KMSALMA00     CHAIN     MSALMA00                           81                            
30119C                   IF        CHAIN=*ON OR XA_M0TAL1='8'                                       
30119C                             OR XA_M0TAL1='2'                                                 
30119C                             OR (CHAIN=*OFF AND XA_M0BAJA>='1')                               
30119C                   EVAL      ERRGRL=*ON                                                       
30119C                   EVAL      WRK48=*ON                                                        
30119C                   EVAL      MSGER='MMM0404'                                                  
30119C                   ENDIF                                                                      
30119C     ERRGRL        CABEQ     *ON           TP2ACHK                                            
30119 *                                                                                             
30119C                   IF        P2ALOGI=P2ALOGE OR P2ALOGI=P2ALOGS                               
30119C                   EVAL      ERRGRL=*ON                                                       
30119C                   EVAL      WRK48=*ON                                                        
30119C                   EVAL      MSGER='MMM0402'                                                  
30119C                   ENDIF                                                                      
30119C     ERRGRL        CABEQ     *ON           TP2ACHK                                            
30119 *                                                                                             
30119C                   ELSE                                                                       
30119 *                                                                                             
30119C                   IF        P2ALOGI<>*BLANKS                                                 
30119C                   EVAL      ERRGRL=*ON                                                       
30119C                   EVAL      WRK48=*ON                                                        
30119C                   EVAL      MSGER='MMM0400'                                                  
30119C                   ENDIF                                                                      
30119C     ERRGRL        CABEQ     *ON           TP2ACHK                                            
30119 *                                                                                             
30119C                   ENDIF                                                                      
30119 *                                                                                             
      * Si cambian la dirección o la ponen nueva validaremos que no exista dicha                    
     C                   IF        ZXTDIR<>P2ATDIR                                                  
     C                   CALL      'MM2596'                                                         
     C                   PARM                    @PCIAS                                             
     C                   PARM      P2ATDIR       @PTDIR                                             
     C                   PARM      *BLANKS       @PEERR                                             
     C                   IF        @PEERR>'0'                                                       
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='MSG0006'                                                  
     C                   EVAL      WRK60=*ON                                                        
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP2ACHK                                            
                                                                                                    
      * Validacion de la 2° CLASIFICACION                                                           
     C                   EVAL      PECIAS=@PCIAS                                                    
     C                   EVAL      PECTAB='TAL2      '                                              
     C                   EVAL      PECLTA=*BLANKS                                                   
     C                   EVAL      PECLTA=P2ATAL2                                                   
     C     KPMTABD       CHAIN     PMTABD                             81                            
     C                   IF        CHAIN=*ON OR PEBAJA='1'                                          
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='ASG1003'                                                  
     C                   EVAL      WRK52=*ON                                                        
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP2ACHK                                            
                                                                                                    
      * SOLO SE ACEPTA CODIGO DE PROVEEDOR SI ES EXTERNO                                            
C4137 *                  IF        P2ATAL1='2'                                                      
C4137 *  C1078C                             OR P2ATAL1='7'                                          
C4406c                   IF        P2ATAL1='2'                                                      
C4406c                                      OR P2ATAL1='7'                                          
IT226C                             OR  (P2ATAL1 = '8'                                               
IT226C                             AND  P2APRVR <> *blanks)                                         
C4137C                   IF        P2APRVR<>*BLANKS                                                 
     C                   EVAL      C0CIAS=@PCIAS                                                    
     C                   EVAL      C0PRVR=P2APRVR                                                   
     C     KPUPROV       CHAIN     PUPROV                             81                            
     C                   IF        CHAIN=*ON                                                        
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='PUR0001'                                                  
     C                   EVAL      WRK47=*ON                                                        
     C                   ENDIF                                                                      
C4406c                   ENDIF                                                                      
C4137 *                  ELSE                                                                       
C4137 *                  IF        P2APRVR<>*BLANKS                                                 
C4137 *                  EVAL      ERRGRL=*ON                                                       
C4137 *                  EVAL      MSGER='PUR0002'                                                  
C4137 *                  EVAL      WRK47=*ON                                                        
C4137 *                  ENDIF                                                                      
C4137 *                  ENDIF                                                                      
C4406c                   ELSE                                                                       
C4406c                   IF        P2APRVR<>*BLANKS                                                 
C4406c                   EVAL      ERRGRL=*ON                                                       
C4406c                   EVAL      MSGER='PUR0002'                                                  
C4406c                   EVAL      WRK47=*ON                                                        
C4406c                   ENDIF                                                                      
C4137C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP2ACHK                                            
                                                                                                    
      * Validaremos los valores numericos para %RESERVA AUTOMATICA                                  
     C                   EVAL      PXDCCD=0                                                         
                                                                                                    
     C                   EVAL      PXALPH=*BLANKS                                                   
     C                   MOVE      P2APRES       PXALPH                                             
     C                   EVAL      PXNUM=0                                                          
     C                   CALL      'PRD650'                                                         
     C                   PARM                    PXNUM                                              
     C                   PARM                    PXALPH                                             
     C                   PARM                    PXFLDD                                             
     C                   PARM                    PXDCCD                                             
     C                   PARM                    PXFMD1                                             
     C                   PARM                    PXEDTC                                             
     C                   PARM                    PXNMER                                             
     C                   PARM                    PXTIPA                                             
     C                   IF        PXNMER<>0                                                        
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      WRK61=*ON                                                        
     C                   EVAL      MSGER='MSG0022'                                                  
     C                   IF        PXNMER=1                                                         
     C                   EVAL      MSGER='MSG0023'                                                  
     C                   ENDIF                                                                      
     C                   IF        PXNMER=2                                                         
     C                   EVAL      MSGER='MSG0024'                                                  
     C                   ENDIF                                                                      
     C                   IF        PXNMER=3                                                         
     C                   EVAL      MSGER='MSG0025'                                                  
     C                   ENDIF                                                                      
     C                   IF        PXNMER=4                                                         
     C                   EVAL      MSGER='MSG0026'                                                  
     C                   ENDIF                                                                      
     C                   IF        PXNMER=5                                                         
     C                   EVAL      MSGER='MSG0032'                                                  
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP2ACHK                                            
     C                   MOVE      PXALPH        P2APRES                                            
                                                                                                    
      * El valor desde no puede superar al valor hasta                                              
     C                   IF        PXNUM<0   OR PXNUM>100                                           
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      WRK61=*ON                                                        
     C                   EVAL      MSGER='MSG0169'                                                  
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP2ACHK                                            
     C     TP2ACHK       TAG                                                                        
     C                   IF        ERRGRL=*ON                                                       
     C                   EVAL      ZXOPT2='DSP'                                                     
     C                   ENDIF                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA DE ACTUALIZACION DEL FMT P2A                     *                                
      *------------------------------------------------------------*                                
     C     P2AUPD        BEGSR                                                                      
     C                   EVAL      Z_P=Z_P+1                                                        
     C                   IF        SSSECPA(Z_P)=*BLANKS                                             
     C                   EVAL      ZXOPT='END'                                                      
     C                   IF        INDCRT=*ON  AND @POPCI<>'1B'                                     
     C                   EVAL      ZXOPT='P10CLR'                                                   
     C                   ENDIF                                                                      
     C                   ELSE                                                                       
     C                   EVAL      ZXOPT1='P2 '                                                     
     C                   MOVE      SSSECPA(Z_P)  ZXOPT1                                             
     C                   EVAL      ZXOPT2='CLR'                                                     
     C                   ENDIF                                                                      
                                                                                                    
      * En el caso de la opción de visualiza no actualizo                                           
     C                   IF        INDDSP=*ON                                                       
     C                   GOTO      P2AUPDT                                                          
     C                   ENDIF                                                                      
                                                                                                    
     C                   EVAL      M0CIAS=@PCIAS                                                    
     C                   EVAL      M0MAGA=P2AMAGA                                                   
     C     KMSALMA       CHAIN     MSALMA                             81                            
                                                                                                    
     C                   EXSR      P2AMPF                                                           
                                                                                                    
     C                   IF        CHAIN=*OFF                                                       
     C                   UPDATE    RMSALMA                                                          
      * Si han cambiado el tipo de almacen hacia o de un OL virtual ,                               
      * cambio todos los registros de logstica.                                                     
     C                   IF        (ZXTAL10<>M0TAL1) AND (ZXTAL10='8' OR                            
     C                              M0TAL1='8')                                                     
     C     KMSLOAD020    CHAIN     MSLOAD02                           81                            
     C                   DOW       CHAIN=*OFF                                                       
     C                   EVAL      MI_MIALOL=*BLANKS                                                
     C                   IF        M0TAL1='8'                                                       
     C                   EVAL      MI_MIALOL='1'                                                    
     C                   ENDIF                                                                      
                                                                                                    
     C                   UPDATE    RMSLOAD                                                          
      * Accedo a su cabecera para actualizar datos                                                  
     C     KMSLOGI       CHAIN     MSLOGI                             83                            
     C                   IF        READ1=*OFF                                                       
     C                   EVAL      MIALOL=*BLANKS                                                   
     C                   IF        M0TAL1='8'                                                       
     C                   EVAL      MIALOL='1'                                                       
     C                   ENDIF                                                                      
     C                   UPDATE    RMSLOGI                                                          
     C                   ENDIF                                                                      
                                                                                                    
     C     KMSLOAD020    READE     MSLOAD02                               81                        
     C                   ENDDO                                                                      
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
                                                                                                    
     C     P2AUPDT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA PASAR DE PANTALLA P2A A FICHERO                  *                                
      *------------------------------------------------------------*                                
     C     P2AMPF        BEGSR                                                                      
      *                                                                                             
     C                   EVAL      M0MAGA=P2AMAGA                                                   
     C                   EVAL      M0DES1=P2ADES1                                                   
MOVEXC*                  EVAL      M0AUXC=P2AAUXC                                                   
MOVEXC                   EVAL      M0AIT2=P2AAIT2                                                   
MOVEXC                   EVAL      M0AIT3=P2AAIT3                                                   
MOVEXC                   EVAL      M0AIT4=P2AAIT4                                                   
MOVEXC                   EVAL      M0AIT5=P2AAIT5                                                   
MOVEXC                   EVAL      M0AIT6=P2AAIT6                                                   
MOVEXC                   EVAL      M0AIT7=P2AAIT7                                                   
     C                   EVAL      M0DLGA=P2ADLGA                                                   
     C                   EVAL      M0PAIS=P2APAIS                                                   
     C                   EVAL      M0ZOPA=P2AZOPA                                                   
     C                   EVAL      M0SUPA=P2ASUPA                                                   
     C                   EVAL      M0ZONC=P2AZONC                                                   
     C                   EVAL      M0SUPC=P2ASUPC                                                   
     C                   EVAL      M0DIRE=P2ADIRE                                                   
     C                   EVAL      M0DIR1=P2ADIR1                                                   
     C                   EVAL      M0DIR2=P2ADIR2                                                   
     C                   EVAL      M0POST=P2APOST                                                   
     C                   EVAL      M0PEGE=P2APEGE                                                   
     C                   EVAL      M0TLEX=P2ATLEX                                                   
     C                   EVAL      M0TFAX=P2ATFAX                                                   
     C                   EVAL      M0TELE=P2ATELE                                                   
     C                   EVAL      M0EMAI=P2AEMAI                                                   
     C                   EVAL      M0TEL2=P2ATEL2                                                   
     C                   EVAL      M0TAL1=P2ATAL1                                                   
26117C                   EVAL      ZXTAL1=P2ATAL1                                                   
     C                   EVAL      M0TAL2=P2ATAL2                                                   
     C                   EVAL      M0TAL3=P2ATAL3                                                   
     C                   EVAL      M0PRVR=P2APRVR                                                   
     C                   EVAL      M0TDIR=P2ATDIR                                                   
     C                   EVAL      M0LOGE=P2ALOGE                                                   
     C                   EVAL      M0LOGS=P2ALOGS                                                   
     C                   EVAL      M0PRSV=P2APRSV                                                   
     C                   EVAL      M0PRES=P2APRES                                                   
30119C                   EVAL      M0LOGI=P2ALOGI                                                   
C1631C                   EVAL      M0EANA=P2AEANA                                                   
      *                                                                                             
     C                   EVAL      M0DAT8=ZZDATS                                                    
     C                   IF        M0DAT8=0                                                         
     C                   EVAL      M0DAT8=*DATE                                                     
     C                   ENDIF                                                                      
     C                   TIME                    M0HORA                                             
     C                   EVAL      M0USUA=ZZUSUA                                                    
     C                   EVAL      M0PANT=SDSJOB                                                    
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA CONTROL DEL FMT P2B                              *                                
      *------------------------------------------------------------*                                
     C     P2BMAIN       BEGSR                                                                      
     C                   EVAL      ZXOPT1='P2B'                                                     
     C                   DOW       ZXOPT1='P2B'                                                     
     C     ZXOPT2        CASEQ     'CLR'         P2BCLR                                             
     C     ZXOPT2        CASEQ     'INZ'         P2BINZ                                             
     C     ZXOPT2        CASEQ     'DSP'         P2BDSP                                             
     C     ZXOPT2        CASEQ     'CMD'         P2BCMD                                             
     C     ZXOPT2        CASEQ     'CHK'         P2BCHK                                             
     C     ZXOPT2        CASEQ     'UPD'         P2BUPD                                             
     C                   ENDCS                                                                      
     C                   ENDDO                                                                      
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA LIMPIEZA  DE P2B                                 *                                
      *------------------------------------------------------------*                                
     C     P2BCLR        BEGSR                                                                      
     C                   EVAL      ZXOPT2='INZ'                                                     
     C                   MOVEA     ZXZERO10      *IN(30)                                            
     C                   MOVEA     ZXZERO10      *IN(40)                                            
     C                   MOVEA     ZXZERO10      *IN(50)                                            
     C                   MOVEA     ZXZERO10      *IN(60)                                            
     C                   MOVE      *BLANKS       MSGER                                              
     C                   EVAL      CSRFILA=0                                                        
     C                   EVAL      CSRCOLU=0                                                        
     C     P2BCLRT       ENDSR                                                                      
      *                                                                                             
      **************************************************************                                
      * SUBRUTINA INICIALITZACIÓ DEL FMT P2B                       *                                
      *------------------------------------------------------------*                                
     C     P2BINZ        BEGSR                                                                      
      *                                                                                             
     C                   EVAL      ZXOPT2='DSP'                                                     
     C     *NOKEY        CLEAR     *ALL          RMSALMA                                            
     C                   IF        INDCPY=*ON                                                       
     C                   EVAL      M0MAGA=P30MAGA                                                   
     C                   ENDIF                                                                      
     C     KMSALMA       CHAIN     MSALMA                             81                            
     C                   EXSR      P2BMFP                                                           
21048 * Si la empresa tiene activado el parámetro de recalculo inv.per.                             
21048 * y opci=modif. protegemos el campo de inv. permanente                                        
21048C                   IF        @POPCI='2 ' OR @POPCI=' 2'                                       
21048C     KPMEMC        CHAIN     PMEMPR                             81                            
21048C                   IF        P7RAIP>='1' AND CHAIN=*OFF                                       
21048C                   EVAL      WRK64=*ON                                                        
21048C                   ENDIF                                                                      
21048C                   ENDIF                                                                      
      * En el caso de altas se pasan los valores por defecto de PURLDA                              
     C                   IF        INDCRT=*ON                                                       
     C****               EVAL      P2BPUBI='1'                                                      
     C                   EVAL      P2BPUBI=ZZPUBI                                                   
     C                   EVAL      P2BTGST=ZZTGST                                                   
     C                   EVAL      P2BCCO1=ZZCCO1                                                   
     C                   EVAL      P2BCCR1='1'                                                      
     C                   EVAL      P2BNSK1=*BLANKS                                                  
     C                   IF        @PMAGA=ZZMAGA                                                    
     C                   EVAL      P2BAPPL='1'                                                      
     C                   ENDIF                                                                      
     C                   EVAL      P2BAIVT='1'                                                      
     C                   EVAL      P2BASDI='1'                                                      
     C                   EVAL      P2BUBI0=ZZUBI0                                                   
     C                   EVAL      P2BUBIA=ZZUBIA                                                   
     C                   ENDIF                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA PASAR DE FICHERO A PANTALLA P2B                  *                                
      *------------------------------------------------------------*                                
     C     P2BMFP        BEGSR                                                                      
      *                                                                                             
     C                   EVAL      P2BMAGA=M0MAGA                                                   
     C                   EVAL      P2BDES1=M0DES1                                                   
     C                   EVAL      P2BPUBI=M0PUBI                                                   
     C                   EVAL      ZXPUBI=M0PUBI                                                    
     C                   EVAL      P2BNSK1=M0NSK1                                                   
     C                   EVAL      P2BTGST=M0TGST                                                   
     C                   EVAL      P2BTA01=M0TA01                                                   
     C                   EVAL      P2BCCO1=M0CCO1                                                   
     C                   EVAL      P2BAPPL=M0APPL                                                   
     C                   EVAL      P2BCCR1=M0CCR1                                                   
     C                   EVAL      P2BUBI0=M0UBI0                                                   
     C                   EVAL      P2BUBIA=M0UBIA                                                   
     C                   EVAL      P2BPRIE=M0PRIE                                                   
     C                   EVAL      P2BPRIS=M0PRIS                                                   
     C                   EVAL      P2BAIVT=M0AIVT                                                   
     C                   EVAL      P2BIPER=M0IPER                                                   
     C                   EVAL      P2BPPSC=M0PPSC                                                   
     C                   EVAL      P2BASDI=M0ASDI                                                   
     C                   EVAL      P2BCRO2=M0CRO2                                                   
E5659*                                                                                             
E5659C                   IF        INDCRT=*ON OR INDCPY=*ON                                         
E5659C                   EVAL      P2BCRO2='1'                                                      
E5659C                   ENDIF                                                                      
E5659*                                                                                             
     C                   EVAL      P2BZUBE=M0ZUBE                                                   
     C                   EVAL      P2BZUBS=M0ZUBS                                                   
     C                   EVAL      P2BZUBD=M0ZUBD                                                   
     C                   EVAL      ZXTDIR=M0TDIR                                                    
     C                   EVAL      P2BUBIB=M0UBIB                                                   
     C                   EVAL      P2BTFLU=M0TFLU                                                   
     C                   EVAL      P2BTFL2=M0TFL2                                                   
     C                   EVAL      ZXUBIC=M0UBIT                                                    
     C                   EVAL      P2BFILT=ZXFILA1                                                  
     C                   EVAL      P2BCOLT=ZXCOLU1                                                  
     C                   EVAL      P2BNIVT=ZXNIVE1                                                  
26117C                   EVAL      P2BUTTR=M0UTTR                                                   
26117C                   EVAL      P2BMATR=M0MATR                                                   
     C                   EVAL      P2BNPPC=M0NPPC                                                   
FQ876c                   Eval      p2bZPrd=m0ZPrd                                                   
FQ876c                   Eval      p2bASGA = m0ASGA                                                 
FQ876c                   Eval      P2BFTPV=M0FTPV                                                   
C2294c                   Eval      P2BTPDF=M0TPDF                                                   
C2294C                   EVAL      N1TTTA=P2BTPDF                                                   
C2294C     KMSTRTA       CHAIN     MSTRTA                             81                            
C2294C                   IF        %FOUND(MSTRTA)                                                   
C2294C                   MOVEL     N1DES1        P2BDTTA                                            
C2294C                   ENDIF                                                                      
FQ876C                   EVAL      P2BMN35=M0MN35                                                   
                                                                                                    
      * PARA EL CASO DE COPIAS CAMBIAREMOS LA CABECERA                                              
     C                   IF        INDCPY=*ON                                                       
     C                   EVAL      ZXTDIR=*BLANKS                                                   
     C                   EVAL      P2BMAGA=P3CMAGA                                                  
     C     *NOKEY        CLEAR     *ALL          RMSALMA                                            
     C                   ENDIF                                                                      
      * PARA EL CASO DE COPIAS CAMBIAREMOS LA CABECERA Y CODIGO ALTERNATIVO                         
     C                   IF        INDCPY=*ON                                                       
     C                   EVAL      P2BMAGA=P3CMAGA                                                  
     C                   ENDIF                                                                      
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VISUALITZACIÓ DEL FMT P2B                        *                                
      *------------------------------------------------------------*                                
     C     P2BDSP        BEGSR                                                                      
      * ENS ENCARREGUEM QUE EL PROPER PAS SIGUI COMPROVAR ENTRADA CMD                               
     C                   EVAL      ZXOPT2='CMD'                                                     
     C                   EVAL      PPPCMD1='CMD7801'                                                
     C                   EXFMT     P2B                                                              
     C                   MOVEA     ZXZERO10      *IN(30)                                            
     C                   MOVEA     ZXZERO10      *IN(40)                                            
     C                   MOVEA     ZXZERO10      *IN(50)                                            
     C                   MOVEA     ZXZERO10      *IN(60)                                            
     C                   EVAL      ERRGRL=*OFF                                                      
     C                   EVAL      MSGER=*BLANKS                                                    
     C                   EVAL      CSRFILA=*ZEROS                                                   
     C                   EVAL      CSRCOLU=*ZEROS                                                   
     C     P2BDSPT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VALIDACIÓ DELS CMDS DEL FMT P2B                 *                                 
      *------------------------------------------------------------*                                
     C     P2BCMD        BEGSR                                                                      
     C                   EVAL      ZXOPT2='CHK'                                                     
      *VALIDACIONES TECLAS DE FUNCION                                                               
     C                   SELECT                                                                     
      * FINALITZAR EL PROGRAMA                                                                      
     C                   WHEN      EXIT=*ON                                                         
     C                   EVAL      ZXOPT1='END'                                                     
      * SOL·LICITUD AJUDA D'ARTICLES                                                                
     C                   WHEN      HELP=*ON                                                         
     C                   EVAL      ZXOPT2='DSP'                                                     
     C                   EXSR      CS_POCUR2                                                        
     C                   EXSR      P2BF4                                                            
      * RETROCESO PANTALLA                                                                          
     C                   WHEN      RETRO=*ON                                                        
     C                   EVAL      Z_P=Z_P-1                                                        
     C                   IF        Z_P<=0                                                           
     C                   EVAL      ZXOPT='END'                                                      
     C                   ELSE                                                                       
     C                   EVAL      ZXOPT1='P2 '                                                     
     C                   MOVE      SSSECPA(Z_P)  ZXOPT1                                             
     C                   EVAL      ZXOPT2='DSP'                                                     
     C                   ENDIF                                                                      
     C                   ENDSL                                                                      
                                                                                                    
     C     TP2BCMD       TAG                                                                        
     C                   IF        ERRGRL=*ON                                                       
     C                   EVAL      ZXOPT2='DSP'                                                     
     C                   ENDIF                                                                      
                                                                                                    
     C     P2BCMDT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA DE AYUDA EN CAMPOS DEL   FMT P2B                 *                                
      *------------------------------------------------------------*                                
     C     P2BF4         BEGSR                                                                      
     C* No se permite acceso a consulta si estamos en opcion de visualizar                          
     C                   IF        INDDSP=*ON                                                       
     C                   EVAL      ERRGRL=*ON                                                       
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           P2BF4T                                             
     C* F4 PARA VALORES QUE UNICAMENTE SE ACCEDE POR PROMPT SEGUN REFERENCIA                        
     C* DEL DICCIONARIO                                                                             
     C                   EVAL      @PEFLD=*BLANKS                                                   
     C                   EVAL      @PEFMT=*BLANKS                                                   
                                                                                                    
     C                   IF        FIELD='P2BTGST'                                                  
     C                             OR FIELD='P2BPUBI' OR FIELD='P2BCCO1'                            
     C                             OR FIELD='P2BAPPL'                                               
     C                             OR FIELD='P2BCCR1' OR FIELD='P2BUBI0'                            
     C                             OR FIELD='P2BUBIA'                                               
     C                             OR FIELD='P2BAIVT'                                               
     C                             OR FIELD='P2BASDI'                                               
     C                             OR FIELD='P2BCRO2'                                               
     C                             OR FIELD='P2BUBIB'                                               
     C                             OR FIELD='P2BIPER'                                               
     C                             OR FIELD='P2BNSK1'                                               
     C                             OR FIELD='P2BPPSC'                                               
     C                             OR FIELD='P2BNPPC'                                               
FQ876C                             OR FIELD='P2BMN35'                                               
     C                   IF        FIELD='P2BTAL1' OR FIELD='P2BUBIB'                               
     C                             OR FIELD='P2BNSK1'                                               
     C                             OR FIELD='P2BNSK1'                                               
     C                   EVAL      @PEFLD=ZXFIE4                                                    
     C                   ELSE                                                                       
     C                   EVAL      @PEFLD='SINO'                                                    
     C                   ENDIF                                                                      
                                                                                                    
     C                   CALL      'MMPROM'                                                         
     C                   PARM      *BLANKS       @PEOPT                                             
     C                   PARM      *BLANKS       @PEPGM                                             
     C                   PARM                    @PEFMT                                             
     C                   PARM                    @PEFLD                                             
     C                   PARM      *BLANKS       @PEERR                                             
                                                                                                    
     C                   IF        @PEERR>'0'                                                       
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='ADP0304'                                                  
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           P2BF4T                                             
      * Si no han realizado ninguna selección no tocamos nada                                       
     C                   IF        @PEERR='A'                                                       
     C                   EVAL      ERRGRL=*ON                                                       
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           P2BF4T                                             
      *                                                                                             
     C                   IF        FIELD='P2BCRO2'                                                  
     C                   EVAL      P2BCRO2=@PEOPT                                                   
     C                   ENDIF                                                                      
                                                                                                    
     C                   IF        FIELD='P2BTGST'                                                  
     C                   EVAL      P2BTGST=@PEOPT                                                   
     C                   ENDIF                                                                      
                                                                                                    
     C                   IF        FIELD='P2BPUBI'                                                  
     C                   EVAL      P2BPUBI=@PEOPT                                                   
     C                   ENDIF                                                                      
                                                                                                    
     C                   IF        FIELD='P2BCCO1'                                                  
     C                   EVAL      P2BCCO1=@PEOPT                                                   
     C                   ENDIF                                                                      
                                                                                                    
     C                   IF        FIELD='P2BAPPL'                                                  
     C                   EVAL      P2BAPPL=@PEOPT                                                   
     C                   ENDIF                                                                      
                                                                                                    
     C                   IF        FIELD='P2BCCR1'                                                  
     C                   EVAL      P2BCCR1=@PEOPT                                                   
     C                   ENDIF                                                                      
                                                                                                    
     C                   IF        FIELD='P2BUBI0'                                                  
     C                   EVAL      P2BUBI0=@PEOPT                                                   
     C                   ENDIF                                                                      
                                                                                                    
     C                   IF        FIELD='P2BUBIA'                                                  
     C                   EVAL      P2BUBIA=@PEOPT                                                   
     C                   ENDIF                                                                      
                                                                                                    
     C                   IF        FIELD='P2BAIVT'                                                  
     C                   EVAL      P2BAIVT=@PEOPT                                                   
     C                   ENDIF                                                                      
                                                                                                    
     C                   IF        FIELD='P2BIPER'                                                  
     C                   EVAL      P2BIPER=@PEOPT                                                   
     C                   ENDIF                                                                      
                                                                                                    
     C                   IF        FIELD='P2BPPSC'                                                  
     C                   EVAL      P2BPPSC=@PEOPT                                                   
     C                   ENDIF                                                                      
                                                                                                    
     C                   IF        FIELD='P2BNPPC'                                                  
     C                   EVAL      P2BNPPC=@PEOPT                                                   
     C                   ENDIF                                                                      
                                                                                                    
     C                   IF        FIELD='P2BASDI'                                                  
     C                   EVAL      P2BASDI=@PEOPT                                                   
     C                   ENDIF                                                                      
                                                                                                    
     C                   IF        FIELD='P2BUBIB'                                                  
     C                   EVAL      P2BUBIB=@PEOPT                                                   
     C                   ENDIF                                                                      
                                                                                                    
     C                   IF        FIELD='P2BNSK1'                                                  
     C                   EVAL      P2BNSK1=@PEOPT                                                   
     C                   ENDIF                                                                      
FQ876                                                                                               
FQ876C                   IF        FIELD='P2BMN35'                                                  
FQ876C                   EVAL      P2BMN35=@PEOPT                                                   
FQ876C                   ENDIF                                                                      
                                                                                                    
     C                   GOTO      P2BF4T                                                           
     C                   ENDIF                                                                      
      * Ayudas en tablas                                                                            
     C                   IF        FIELD='P2BTA01' OR FIELD='P2BZUBE' OR                            
     C                             FIELD='P2BZUBS' OR FIELD='P2BZUBD'                               
FQ876C                               Or Field = 'P2BZPRD'                                           
     C                   EVAL      @PCLTA=*BLANKS                                                   
     C                   EVAL      @PCTAB=*BLANKS                                                   
     C                   EVAL      @PCTAB=ZXFIE4                                                    
     C                   IF        FIELD='P2BZUBE' OR FIELD='P2BZUBS' OR                            
     C                             FIELD='P2BZUBD'                                                  
FQ876C                               Or Field = 'P2BZPRD'                                           
     C                   EVAL      @PCTAB='ZUBC'                                                    
     C                   ENDIF                                                                      
     C                   IF        FIELD='P2BTA01'                                                  
     C                   EVAL      @PCLTA=P2BTA01                                                   
     C                   ENDIF                                                                      
                                                                                                    
     C                   CALL      'MMTABL'                                                         
     C                   PARM                    @PCLTA                                             
     C                   PARM                    @PCTAB                                             
     C                   PARM                    @PCIAS                                             
     C                   PARM                    @PEERR                                             
                                                                                                    
     C                   IF        @PEERR>'0'                                                       
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='ADP0304'                                                  
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           P2BF4T                                             
      * Si no han realizado ninguna selección no tocamos nada                                       
     C                   IF        @PEERR='A'                                                       
     C                   EVAL      ERRGRL=*ON                                                       
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           P2BF4T                                             
      *                                                                                             
     C                   IF        FIELD='P2BTA01'                                                  
     C                   EVAL      P2BTA01=@PCLTA                                                   
     C                   ENDIF                                                                      
                                                                                                    
     C                   IF        FIELD='P2BZUBE'                                                  
     C                   EVAL      P2BZUBE=@PCLTA                                                   
     C                   ENDIF                                                                      
                                                                                                    
     C                   IF        FIELD='P2BZUBS'                                                  
     C                   EVAL      P2BZUBS=@PCLTA                                                   
     C                   ENDIF                                                                      
                                                                                                    
     C                   IF        FIELD='P2BZUBD'                                                  
     C                   EVAL      P2BZUBD=@PCLTA                                                   
     C                   ENDIF                                                                      
FQ876C                   If        Field = 'P2BZPRD'                                                
FQ876C                   Eval      p2BZPrd = @pClta                                                 
FQ876C                   EndIf                                                                      
                                                                                                    
     C                   GOTO      P2BF4T                                                           
     C                   ENDIF                                                                      
                                                                                                    
     C                   IF        FIELD='P2BTFLU'                                                  
     C                   EVAL      @PCLTA=*BLANKS                                                   
     C                   EVAL      @PCLTA=P2BTFLU                                                   
     C                   CALL      'MMTABL'                                                         
     C                   PARM                    @PCLTA                                             
     C                   PARM      'TFLU'        @PCTAB                                             
     C                   PARM                    @PCIAS                                             
     C                   PARM      *BLANKS       @PERRO                                             
     C                   MOVEL     @PCLTA        P2BTFLU                                            
     C                   GOTO      P2BF4T                                                           
     C                   ENDIF                                                                      
      *                                                                                             
     C                   IF        FIELD='P2BTFL2'                                                  
     C                   EVAL      @PCLTA=*BLANKS                                                   
     C                   EVAL      @PCLTA=P2BTFL2                                                   
     C                   CALL      'MMTABL'                                                         
     C                   PARM                    @PCLTA                                             
     C                   PARM      'TFLU'        @PCTAB                                             
     C                   PARM                    @PCIAS                                             
     C                   PARM      *BLANKS       @PERRO                                             
     C                   MOVEL     @PCLTA        P2BTFL2                                            
     C                   GOTO      P2BF4T                                                           
     C                   ENDIF                                                                      
      * ¿UTILIZAR ALMACEN DE TRANSITO?                                                              
26117C                   IF        FIELD='P2BUTTR'                                                  
26117C                   EVAL      @PCLTA=*BLANKS                                                   
26117C                   EVAL      @PCLTA=P2BUTTR                                                   
26117C                   CALL      'MMPROM'                                                         
26117C                   PARM                    @PEOPT                                             
26117C                   PARM      *BLANKS       @PEPGM                                             
26117C                   PARM      *BLANKS       @PEFMT                                             
26117C                   PARM      'SINO      '  @PEFLD                                             
26117C                   PARM      ' '           @PEERR                                             
                                                                                                    
26117C                   IF        @PEERR>'0'                                                       
26117C                   EVAL      ERRGRL=*ON                                                       
26117C                   EVAL      MSGER='ADP0304'                                                  
26117C                   ENDIF                                                                      
26117C     ERRGRL        CABEQ     *ON           P2BF4T                                             
26117 * Si no han realizado ninguna selección no tocamos nada                                       
26117C                   IF        @PEERR='A'                                                       
26117C                   EVAL      ERRGRL=*ON                                                       
26117C                   ENDIF                                                                      
26117C     ERRGRL        CABEQ     *ON           P2BF4T                                             
26117 *                                                                                             
26117C                   EVAL      P2BUTTR=@PEOPT                                                   
26117C                   GOTO      P2BF4T                                                           
26117C                   ENDIF                                                                      
26117                                                                                               
26117C                   IF        FIELD='P2BMATR'                                                  
26117C                   CALL      'MM0605'                                                         
26117C                   PARM      ZZCIAS        @PCIAS                                             
26117C                   PARM                    @PEMAGA                                            
26117C                   PARM      *BLANKS       @PERRO                                             
26117C                                                                                              
26117C                   EVAL      P2BMATR=@PEMAGA                                                  
26117C                                                                                              
26117C                   GOTO      P2BF4T                                                           
26117C                   ENDIF                                                                      
FQ876* Almacén SGA                                                                                 
FQ876C                   If        Field='P2BASGA'                                                  
FQ876C                   Eval      @peOPt= *Blanks                                                  
FQ876C                   Call      'MMPROM'                                                         
FQ876C                   Parm                    @peOpt                                             
FQ876C                   Parm      *Blanks       @pePgm                                             
FQ876C                   Parm      *Blanks       @peFmt                                             
FQ876C                   Parm      'SINO      '  @peFld                                             
FQ876C                   Parm      ' '           @peErr                                             
                                                                                                    
FQ876C                   If        @peErr > '0'                                                     
FQ876C                   Eval      ErrGrl = *ON                                                     
FQ876C                   Eval      MsgEr = 'ADP0304'                                                
FQ876C                   EndIf                                                                      
FQ876C     ErrGrl        CabEq     *ON           p2BF4T                                             
FQ876* Si no han realizado ninguna selección no tocamos nada                                       
FQ876C                   If        @peErr='A'                                                       
FQ876C                   Eval      ErrGrl = *ON                                                     
FQ876C                   EndIf                                                                      
FQ876C     ErrGrl        CabEq     *ON           p2BF4T                                             
FQ876 *                                                                                             
FQ876C                   Eval      p2BASGA=@peOpt                                                   
FQ876C                   GoTo      p2BF4t                                                           
FQ876C                   EndIf                                                                      
C2294 ** ayuda sobre el transportista                                                               
C2294C                   IF        FIELD='P2BTPDF'                                                  
C2294C                   CALL      'MM0915'                                    Q                    
C2294C                   PARM                    @PCIAS                                             
C2294C                   PARM                    P2BTPDF                                            
C2294C                   PARM                    @PEERR                                             
C2294*                                                                                             
C2294C                   EVAL      N1TTTA=P2BTPDF                                                   
C2294C     KMSTRTA       CHAIN     MSTRTA                             81                            
C2294C                   IF        %FOUND(MSTRTA)                                                   
C2294C                   MOVEL     N1DES1        P2BDTTA                                            
C2294C                   ENDIF                                                                      
C2294*                                                                                             
C2294C                   GOTO      P2BF4T                                                           
C2294C                   ENDIF                                                                      
                                                                                                    
      * SI NO TIENE F4 SOPORTADO DOY ERROR                                                          
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='ADP0304'                                                  
     C     ERRGRL        CABEQ     *ON           P2BF4T                                             
                                                                                                    
     C     P2BF4T        ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VALIDACIÓ DELS CAMPS DEL FMT P2B                 *                                
      *------------------------------------------------------------*                                
     C     P2BCHK        BEGSR                                                                      
     C                   EVAL      ZXOPT2='UPD'                                                     
      * La descripcion no puede ser blancos                                                         
     C*                  IF        P2BDES1=*BLANKS                                                  
     C*                  EVAL      ERRGRL=*ON                                                       
     C*                  EVAL      MSGER='ASG1003'                                                  
     C*                  EVAL      WRK30=*ON                                                        
     C*                  ENDIF                                                                      
     C*    ERRGRL        CABEQ     *ON           TP2BCHK                                            
      * Validacion de los valores de SI o No                                                        
     C                   EVAL      @PEOPT=*BLANKS                                                   
     C                   EVAL      @PEOPT=P2BCCR1                                                   
     C                   CALL      'MMPROM'                                                         
     C                   PARM                    @PEOPT                                             
     C                   PARM      *BLANKS       @PEPGM                                             
     C                   PARM      *BLANKS       @PEFMT                                             
     C                   PARM      'SINO      '  @PEFLD                                             
     C                   PARM      'V'           @PEERR                                             
                                                                                                    
     C                   IF        @PEERR>'0'                                                       
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      WRK48=*ON                                                        
     C                   EVAL      MSGER='ASG1003'                                                  
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP2BCHK                                            
                                                                                                    
     C                   EVAL      @PEOPT=*BLANKS                                                   
     C                   EVAL      @PEOPT=P2BCCO1                                                   
     C                   CALL      'MMPROM'                                                         
     C                   PARM                    @PEOPT                                             
     C                   PARM      *BLANKS       @PEPGM                                             
     C                   PARM      *BLANKS       @PEFMT                                             
     C                   PARM      'SINO      '  @PEFLD                                             
     C                   PARM      'V'           @PEERR                                             
                                                                                                    
     C                   IF        @PEERR>'0'                                                       
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      WRK54=*ON                                                        
     C                   EVAL      MSGER='ASG1003'                                                  
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP2BCHK                                            
                                                                                                    
     C                   EVAL      @PEOPT=*BLANKS                                                   
     C                   EVAL      @PEOPT=P2BNSK1                                                   
     C                   CALL      'MMPROM'                                                         
     C                   PARM                    @PEOPT                                             
     C                   PARM      *BLANKS       @PEPGM                                             
     C                   PARM      *BLANKS       @PEFMT                                             
     C***                PARM      'SINO      '  @PEFLD                                             
     C                   PARM      'NSK1      '  @PEFLD                                             
     C                   PARM      'V'           @PEERR                                             
                                                                                                    
     C                   IF        @PEERR>'0'                                                       
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      WRK41=*ON                                                        
     C                   EVAL      MSGER='ASG1003'                                                  
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP2BCHK                                            
                                                                                                    
     C                   EVAL      @PEOPT=*BLANKS                                                   
     C                   EVAL      @PEOPT=P2BPUBI                                                   
     C                   CALL      'MMPROM'                                                         
     C                   PARM                    @PEOPT                                             
     C                   PARM      *BLANKS       @PEPGM                                             
     C                   PARM      *BLANKS       @PEFMT                                             
     C                   PARM      'SINO      '  @PEFLD                                             
     C                   PARM      'V'           @PEERR                                             
                                                                                                    
     C                   IF        @PEERR>'0'                                                       
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      WRK57=*ON                                                        
     C                   EVAL      MSGER='ASG1003'                                                  
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP2BCHK                                            
      * No se puede cambiar de almacén con ubicaciones a sin ubicaciones                            
      * si existe material asignado a aquella ubicación                                             
     C                   IF        ZXPUBI='1'                                                       
     C                   IF        P2BPUBI=' ' OR P2BPUBI='0'                                       
     C                   EVAL      M4UBIC=*BLANKS                                                   
     C     KMSUBI10      SETGT     MSUBI1                                                           
     C     KMSUBI100     READE     MSUBI1                                 81                        
     C                   IF        CHAIN=*OFF AND M4UBIC<>*BLANKS                                   
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='MMM0021'                                                  
     C                   EVAL      WRK57=*ON                                                        
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP2BCHK                                            
      * Los almacenes de transito y proveedor no puede tener ubicaciones                            
     C*                  IF        M0TAL1>'1' AND P2BPUBI>='1'                                      
     C*                  EVAL      ERRGRL=*ON                                                       
     C*                  EVAL      MSGER='MMM0301'                                                  
     C*                  EVAL      WRK57=*ON                                                        
     C*                  ENDIF                                                                      
     C*    ERRGRL        CABEQ     *ON           TP2BCHK                                            
      * Un almacén virual OL o con ubicaciones no puede permitir skt<0 s                            
     C                   IF        (M0TAL1>='8' OR P2BPUBI>='1') AND                                
     C                             (P2BNSK1<='0')                                                   
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='MMM0308'                                                  
     C                   EVAL      WRK41=*ON                                                        
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP2BCHK                                            
      * Los almacenes virtuales OL no pueden tener ubicaciones                                      
     C                   IF        M0TAL1>='8' AND P2BPUBI>='1'                                     
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='MMM0301'                                                  
     C                   EVAL      WRK57=*ON                                                        
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP2BCHK                                            
      * Validacion de la clase de almacen                                                           
     C                   EVAL      PECIAS=@PCIAS                                                    
     C                   EVAL      PECTAB='TA01      '                                              
     C                   EVAL      PECLTA=*BLANKS                                                   
     C                   EVAL      PECLTA=P2BTA01                                                   
     C     KPMTABD       CHAIN     PMTABD                             81                            
     C                   IF        CHAIN=*ON OR PEBAJA='1'                                          
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='ASG1003'                                                  
     C                   EVAL      WRK45=*ON                                                        
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP2BCHK                                            
                                                                                                    
      * Validacion del tipo de gestion de stocks                                                    
     C                   EVAL      @PEOPT=*BLANKS                                                   
     C                   EVAL      @PEOPT=P2BTGST                                                   
     C                   CALL      'MMPROM'                                                         
     C                   PARM                    @PEOPT                                             
     C                   PARM      *BLANKS       @PEPGM                                             
     C                   PARM      *BLANKS       @PEFMT                                             
     C                   PARM      'TGST      '  @PEFLD                                             
     C                   PARM      'V'           @PEERR                                             
                                                                                                    
     C                   IF        @PEERR>'0'                                                       
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      WRK46=*ON                                                        
     C                   EVAL      MSGER='ASG1003'                                                  
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP2BCHK                                            
                                                                                                    
     C                   EVAL      @PEOPT=*BLANKS                                                   
     C                   EVAL      @PEOPT=P2BAPPL                                                   
     C                   CALL      'MMPROM'                                                         
     C                   PARM                    @PEOPT                                             
     C                   PARM      *BLANKS       @PEPGM                                             
     C                   PARM      *BLANKS       @PEFMT                                             
     C                   PARM      'SINO      '  @PEFLD                                             
     C                   PARM      'V'           @PEERR                                             
                                                                                                    
     C                   IF        @PEERR>'0'                                                       
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      WRK55=*ON                                                        
     C                   EVAL      MSGER='ASG1003'                                                  
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP2BCHK                                            
                                                                                                    
     C                   EVAL      @PEOPT=*BLANKS                                                   
     C                   EVAL      @PEOPT=P2BUBI0                                                   
     C                   CALL      'MMPROM'                                                         
     C                   PARM                    @PEOPT                                             
     C                   PARM      *BLANKS       @PEPGM                                             
     C                   PARM      *BLANKS       @PEFMT                                             
     C                   PARM      'SINO      '  @PEFLD                                             
     C                   PARM      'V'           @PEERR                                             
                                                                                                    
     C                   IF        @PEERR>'0'                                                       
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      WRK49=*ON                                                        
     C                   EVAL      MSGER='ASG1003'                                                  
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP2BCHK                                            
                                                                                                    
     C                   EVAL      @PEOPT=*BLANKS                                                   
     C                   EVAL      @PEOPT=P2BUBIA                                                   
     C                   CALL      'MMPROM'                                                         
     C                   PARM                    @PEOPT                                             
     C                   PARM      *BLANKS       @PEPGM                                             
     C                   PARM      *BLANKS       @PEFMT                                             
     C                   PARM      'SINO      '  @PEFLD                                             
     C                   PARM      'V'           @PEERR                                             
                                                                                                    
     C                   IF        @PEERR>'0'                                                       
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      WRK50=*ON                                                        
     C                   EVAL      MSGER='ASG1003'                                                  
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP2BCHK                                            
                                                                                                    
     C                   EVAL      @PEOPT=*BLANKS                                                   
     C                   EVAL      @PEOPT=P2BUBIB                                                   
     C                   CALL      'MMPROM'                                                         
     C                   PARM                    @PEOPT                                             
     C                   PARM      *BLANKS       @PEPGM                                             
     C                   PARM      *BLANKS       @PEFMT                                             
     C                   PARM      'UBIB      '  @PEFLD                                             
     C                   PARM      'V'           @PEERR                                             
                                                                                                    
     C                   IF        @PEERR>'0'                                                       
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      WRK33=*ON                                                        
     C                   EVAL      MSGER='ASG1003'                                                  
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP2BCHK                                            
                                                                                                    
     C                   EVAL      @PEOPT=*BLANKS                                                   
     C                   EVAL      @PEOPT=P2BAIVT                                                   
     C                   CALL      'MMPROM'                                                         
     C                   PARM                    @PEOPT                                             
     C                   PARM      *BLANKS       @PEPGM                                             
     C                   PARM      *BLANKS       @PEFMT                                             
     C                   PARM      'SINO      '  @PEFLD                                             
     C                   PARM      'V'           @PEERR                                             
                                                                                                    
     C                   IF        @PEERR>'0'                                                       
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      WRK58=*ON                                                        
     C                   EVAL      MSGER='ASG1003'                                                  
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP2BCHK                                            
                                                                                                    
     C                   EVAL      @PEOPT=*BLANKS                                                   
     C                   EVAL      @PEOPT=P2BIPER                                                   
     C                   CALL      'MMPROM'                                                         
     C                   PARM                    @PEOPT                                             
     C                   PARM      *BLANKS       @PEPGM                                             
     C                   PARM      *BLANKS       @PEFMT                                             
     C                   PARM      'SINO      '  @PEFLD                                             
     C                   PARM      'V'           @PEERR                                             
                                                                                                    
     C                   IF        @PEERR>'0'                                                       
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      WRK40=*ON                                                        
     C                   EVAL      MSGER='ASG1003'                                                  
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP2BCHK                                            
                                                                                                    
     C                   EVAL      @PEOPT=*BLANKS                                                   
     C                   EVAL      @PEOPT=P2BPPSC                                                   
     C                   CALL      'MMPROM'                                                         
     C                   PARM                    @PEOPT                                             
     C                   PARM      *BLANKS       @PEPGM                                             
     C                   PARM      *BLANKS       @PEFMT                                             
     C                   PARM      'SINO      '  @PEFLD                                             
     C                   PARM      'V'           @PEERR                                             
                                                                                                    
     C                   IF        @PEERR>'0'                                                       
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      WRK42=*ON                                                        
     C                   EVAL      MSGER='ASG1003'                                                  
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP2BCHK                                            
                                                                                                    
     C                   EVAL      @PEOPT=*BLANKS                                                   
     C                   EVAL      @PEOPT=P2BNPPC                                                   
     C                   CALL      'MMPROM'                                                         
     C                   PARM                    @PEOPT                                             
     C                   PARM      *BLANKS       @PEPGM                                             
     C                   PARM      *BLANKS       @PEFMT                                             
     C                   PARM      'SINO      '  @PEFLD                                             
     C                   PARM      'V'           @PEERR                                             
                                                                                                    
     C                   IF        @PEERR>'0'                                                       
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      WRK68=*ON                                                        
     C                   EVAL      MSGER='ASG1003'                                                  
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP2BCHK                                            
                                                                                                    
     C                   EVAL      @PEOPT=*BLANKS                                                   
     C                   EVAL      @PEOPT=P2BASDI                                                   
     C                   CALL      'MMPROM'                                                         
     C                   PARM                    @PEOPT                                             
     C                   PARM      *BLANKS       @PEPGM                                             
     C                   PARM      *BLANKS       @PEFMT                                             
     C                   PARM      'SINO      '  @PEFLD                                             
     C                   PARM      'V'           @PEERR                                             
                                                                                                    
     C                   IF        @PEERR>'0'                                                       
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      WRK59=*ON                                                        
     C                   EVAL      MSGER='ASG1003'                                                  
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP2BCHK                                            
                                                                                                    
     C                   EVAL      @PEOPT=*BLANKS                                                   
     C                   EVAL      @PEOPT=P2BCRO2                                                   
     C                   CALL      'MMPROM'                                                         
     C                   PARM                    @PEOPT                                             
     C                   PARM      *BLANKS       @PEPGM                                             
     C                   PARM      *BLANKS       @PEFMT                                             
     C                   PARM      'SINO      '  @PEFLD                                             
     C                   PARM      'V'           @PEERR                                             
                                                                                                    
     C                   IF        @PEERR>'0'                                                       
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      WRK48=*ON                                                        
     C                   EVAL      MSGER='ASG1003'                                                  
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP2BCHK                                            
      * Validación de tablas                                                                        
     C                   IF        P2BPUBI>='1'                                                     
     C                   EVAL      PECTAB='ZUBC      '                                              
     C                   EVAL      PECLTA=*BLANKS                                                   
     C                   EVAL      PECLTA=P2BZUBE                                                   
     C     KPMTABD       CHAIN     PMTABD                             81                            
     C                   IF        CHAIN=*ON OR PEBAJA='1'                                          
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='ASG1003'                                                  
     C                   EVAL      WRK31=*ON                                                        
     C                   EVAL      WRK57=*ON                                                        
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP2BCHK                                            
     C                   EVAL      ZXBL63=PEBL63                                                    
      * La zona debe ser una zona de parking para entradas                                          
     C                   IF        ZXTZUB>='1' OR ZXPENT<='0'                                       
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='MMM0266'                                                  
     C                   EVAL      WRK31=*ON                                                        
     C                   EVAL      WRK57=*ON                                                        
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP2BCHK                                            
      * Las zonas deben tener asociada al menos 1 ubicación                                         
      * debe permitir multiples articulos y multiples lotes                                         
      * Caso de modificaciones                                                                      
     C                   IF        INDCHG=*ON OR P2BZUBE<>*BLANKS                                   
     C                   EVAL      M3MAGA=P2BMAGA                                                   
     C                   EVAL      M3ZUBC=P2BZUBE                                                   
     C     KMSUBIC060    CHAIN     MSUBIC06                           81                            
     C                   IF        CHAIN=*ON                                                        
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='MMM0267'                                                  
     C                   EVAL      WRK31=*ON                                                        
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP2BCHK                                            
                                                                                                    
     C                   IF        M3UBI0<='0' OR M3UBIA<='0' OR                                    
     C                             M3BLCK='1' OR M3BLCK='3'                                         
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='MMM0298'                                                  
     C                   EVAL      WRK31=*ON                                                        
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP2BCHK                                            
                                                                                                    
     C                   EVAL      PECLTA=*BLANKS                                                   
     C                   EVAL      PECLTA=P2BZUBS                                                   
     C     KPMTABD       CHAIN     PMTABD                             81                            
     C                   IF        CHAIN=*ON OR PEBAJA='1'                                          
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='ASG1003'                                                  
     C                   EVAL      WRK32=*ON                                                        
     C                   EVAL      WRK57=*ON                                                        
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP2BCHK                                            
     C                   EVAL      ZXBL63=PEBL63                                                    
      * La zona debe ser una zona de parking para salidas                                           
     C                   IF        ZXTZUB>='1' OR ZXPSAL<='0'                                       
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='MMM0266'                                                  
     C                   EVAL      WRK32=*ON                                                        
     C                   EVAL      WRK57=*ON                                                        
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP2BCHK                                            
      * Las zonas deben tener asociada al menos 1 ubicación                                         
     C                   EVAL      M3MAGA=P2BMAGA                                                   
      * Caso de modificaciones                                                                      
     C                   IF        INDCHG=*ON OR P2BZUBE<>*BLANKS                                   
     C                   EVAL      M3ZUBC=P2BZUBS                                                   
     C     KMSUBIC060    CHAIN     MSUBIC06                           81                            
     C                   IF        CHAIN=*ON                                                        
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='MMM0267'                                                  
     C                   EVAL      WRK32=*ON                                                        
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP2BCHK                                            
     C                   IF        M3UBI0<='0' OR M3UBIA<='0' OR                                    
     C                             M3BLCK='2' OR M3BLCK='3'                                         
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='MMM0298'                                                  
     C                   EVAL      WRK32=*ON                                                        
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP2BCHK                                            
                                                                                                    
     C                   EVAL      PECTAB='ZUBC      '                                              
     C                   EVAL      PECLTA=*BLANKS                                                   
     C                   EVAL      PECLTA=P2BZUBD                                                   
     C     KPMTABD       CHAIN     PMTABD                             81                            
     C                   IF        CHAIN=*ON OR PEBAJA='1'                                          
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='ASG1003'                                                  
     C                   EVAL      WRK38=*ON                                                        
     C                   EVAL      WRK57=*ON                                                        
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP2BCHK                                            
                                                                                                    
     C                   EVAL      ZXBL63=PEBL63                                                    
      * La zona debe ser una zona de parking para entradas                                          
     C                   IF        ZXTZUB>='1' OR ZXPENT<='0'                                       
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='MMM0266'                                                  
     C                   EVAL      WRK38=*ON                                                        
     C                   EVAL      WRK57=*ON                                                        
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP2BCHK                                            
      * Las zonas deben tener asociada al menos 1 ubicación                                         
     C                   EVAL      M3MAGA=P2BMAGA                                                   
     C                   EVAL      M3ZUBC=P2BZUBD                                                   
      * Caso de modificaciones                                                                      
     C                   IF        INDCHG=*ON OR P2BZUBE<>*BLANKS                                   
     C     KMSUBIC060    CHAIN     MSUBIC06                           81                            
     C                   IF        CHAIN=*ON                                                        
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='MMM0267'                                                  
     C                   EVAL      WRK38=*ON                                                        
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
28612C     ERRGRL        CABEQ     *ON           TP2BCHK                                            
      *                                                                                             
FQ876C                   IF        P2BZPRD<>*BLANKS                                                 
FQ876c                   Eval      pecTab = 'ZUBC      '                                            
FQ876c                   Eval      pecLta = p2BZPrd                                                 
FQ876c     kpmtabd       Chain     pmtabd                                                           
FQ876c                   If        Not %Found(pmtabd) Or peBaja>='1'                                
FQ876c                   Eval      ErrGrl = *ON                                                     
FQ876c                   Eval      MsgEr = 'ASG1003'                                                
FQ876c                   Eval      Wrk47 = *ON                                                      
FQ876c                   Eval      Wrk57 = *ON                                                      
FQ876c                   EndIf                                                                      
FQ876C     ErrGrl        CabEq     *On           tp2BChk                                            
FQ876                                                                                               
FQ876C                   Eval      zxBl63 = peBl63                                                  
FQ876* La zona debe ser una zona de parking para entradas                                          
FQ876C                   If        zxTZub >='1' Or zxPEnt <= '0'                                    
FQ876C                   Eval      ErrGrl = *ON                                                     
FQ876C                   Eval      MsgEr = 'MMM0266'                                                
FQ876C                   Eval      WRK47=*ON                                                        
FQ876C                   Eval      WRK57=*ON                                                        
FQ876C                   EndIf                                                                      
FQ876C     ErrGrl        CabEq     *On           tp2BChk                                            
FQ876* Las zonas deben tener asociada al menos 1 ubicación                                         
FQ876C                   Eval      m3Maga = p2BMaga                                                 
FQ876C                   Eval      m3ZUbc = p2BZPrd                                                 
FQ876* Caso de modificaciones                                                                      
FQ876C                   If        IndChg = *ON Or p2BZUbe <> *Blanks                               
FQ876C     KmsUbic060    Chain     msUbic06                                                         
FQ876C                   If        Not %Found(msubic06)                                             
FQ876C                   Eval      ErrGrl = *ON                                                     
FQ876C                   Eval      MsgEr = 'MMM0267'                                                
FQ876C                   Eval      WRK47 = *ON                                                      
FQ876C                   EndIf                                                                      
FQ876C                   EndIf                                                                      
FQ876C     ERRGRL        CABEQ     *ON           TP2BCHK                                            
FQ876C                   EndIf                                                                      
28612C*    ERRGRL        CABEQ     *ON           TP2BCHK                                            
                                                                                                    
     C                   IF        P2BTFLU<>*BLANKS                                                 
     C                   EVAL      PECTAB='TFLU'                                                    
     C                   EVAL      PECLTA=*BLANKS                                                   
     C                   EVAL      PECLTA=P2BTFLU                                                   
     C     KPMTABD       CHAIN     PMTABD                             81                            
     C                   IF        CHAIN=*ON OR PEBAJA='1'                                          
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='ASG1003'                                                  
     C                   EVAL      WRK34=*ON                                                        
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP2BCHK                                            
     C                   ENDIF                                                                      
                                                                                                    
     C                   IF        P2BTFL2<>*BLANKS                                                 
     C                   EVAL      PECTAB='TFLU'                                                    
     C                   EVAL      PECLTA=*BLANKS                                                   
     C                   EVAL      PECLTA=P2BTFL2                                                   
     C     KPMTABD       CHAIN     PMTABD                             81                            
     C                   IF        CHAIN=*ON OR PEBAJA='1'                                          
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='ASG1003'                                                  
     C                   EVAL      WRK37=*ON                                                        
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP2BCHK                                            
                                                                                                    
26117 * Validacion SI ALMACEN TRANSITO SI O NO                                                      
26117C                   EVAL      @PEOPT=*BLANKS                                                   
26117C                   EVAL      @PEOPT=P2BUTTR                                                   
26117C                   CALL      'MMPROM'                                                         
26117C                   PARM                    @PEOPT                                             
26117C                   PARM      *BLANKS       @PEPGM                                             
26117C                   PARM      *BLANKS       @PEFMT                                             
26117C                   PARM      'SINO      '  @PEFLD                                             
26117C                   PARM      'V'           @PEERR                                             
26117                                                                                               
26117C                   IF        @PEERR>'0'                                                       
26117C                   EVAL      ERRGRL=*ON                                                       
26117C                   EVAL      WRK43=*ON                                                        
26117C                   EVAL      MSGER='ASG1003'                                                  
26117C                   ENDIF                                                                      
26117C     ERRGRL        CABEQ     *ON           TP2BCHK                                            
      * VALIDACIÓN ALMACEN TRANSITO                                                                 
26117C                   IF        P2BUTTR='1'                                                      
      * SI EL PROPIO ALMACEN ES DE TRANSITO ¿?                                                      
26117C                   IF        ZXTAL1='3'                                                       
26117C                   EVAL      ERRGRL=*ON                                                       
26117C                   EVAL      MSGER='MMM0308'                                                  
26117C                   EVAL      WRK44=*ON                                                        
26117C                   ENDIF                                                                      
26117C     ERRGRL        CABEQ     *ON           TP2BCHK                                            
                                                                                                    
26117C                   IF        P2BMAGA=P2BMATR                                                  
26117C                   EVAL      ERRGRL=*ON                                                       
26117C                   EVAL      MSGER='MMM0308'                                                  
26117C                   EVAL      WRK44=*ON                                                        
26117C                   ENDIF                                                                      
26117C     ERRGRL        CABEQ     *ON           TP2BCHK                                            
                                                                                                    
26117C                   EVAL      M0CIAS=@PCIAS                                                    
26117C                   EVAL      M0MAGA=P2BMATR                                                   
26117C     KMSALMA       CHAIN(N)  MSALMA                             81                            
26117C                   IF        CHAIN='1' OR M0BAJA='1'                                          
26117C                   EVAL      ERRGRL=*ON                                                       
26117C                   EVAL      MSGER='ADP0109'                                                  
26117C                   EVAL      WRK44=*ON                                                        
26117C                   ENDIF                                                                      
26117C     ERRGRL        CABEQ     *ON           TP2BCHK                                            
26117C                   IF        M0TAL1<>'3'                                                      
26117C                   EVAL      ERRGRL=*ON                                                       
26117C                   EVAL      MSGER='MMM0308'                                                  
26117C                   EVAL      WRK44=*ON                                                        
26117C                   ENDIF                                                                      
26117C                   ELSE                                                                       
26117C                   IF        P2BMATR<>*BLANKS                                                 
26117C                   EVAL      ERRGRL=*ON                                                       
26117C                   EVAL      MSGER='MMM0308'                                                  
26117C                   EVAL      WRK44=*ON                                                        
26117C                   ENDIF                                                                      
26117C                   ENDIF                                                                      
                                                                                                    
FQ876C     ERRGRL        CABEQ     *ON           TP2BCHK                                            
                                                                                                    
FQ876* Validacion Almacén SGA                                                                      
FQ876C                   Eval      @peOpt = p2bASGA                                                 
FQ876C                   Call      'MMPROM'                                                         
FQ876C                   Parm                    @peOpt                                             
FQ876C                   Parm      *Blanks       @pePgm                                             
FQ876C                   Parm      *Blanks       @peFmt                                             
FQ876C                   Parm      'SINO      '  @peFld                                             
FQ876C                   Parm      'V'           @peErr                                             
FQ876                                                                                               
FQ876C                   If        @peErr > '0'                                                     
FQ876C                   Eval      ErrGrl= *ON                                                      
FQ876C                   Eval      WRK35 = *ON                                                      
FQ876C                   Eval      msgEr = 'ASG1003'                                                
FQ876C                   EndIf                                                                      
FQ876C     ERRGRL        CABEQ     *ON           TP2BCHK                                            
                                                                                                    
FQ876** Magatzem SGA ha de treballar amb ubicacions                                                
FQ876                                                                                               
FQ876c                   If        (p2bASGA >='1' And p2bPUbi <'1')                                 
FQ876c                   Eval      ErrGrl = *ON                                                     
FQ876c                   Eval      wrk35 = *ON                                                      
FQ876c                   Eval      wrk57 = *ON                                                      
FQ876c                   Eval      msgEr = 'MM00250'                                                
FQ876c                   EndIf                                                                      
FQ876c     ErrGrl        CabEq     *ON           tp2BChk                                            
FQ876                                                                                               
FQ876C                   EVAL      @PEOPT=*BLANKS                                                   
FQ876C                   EVAL      @PEOPT=P2BMN35                                                   
FQ876C                   CALL      'MMPROM'                                                         
FQ876C                   PARM                    @PEOPT                                             
FQ876C                   PARM      *BLANKS       @PEPGM                                             
FQ876C                   PARM      *BLANKS       @PEFMT                                             
FQ876C                   PARM      'SINO      '  @PEFLD                                             
FQ876C                   PARM      'V'           @PEERR                                             
FQ876                                                                                               
FQ876C                   IF        @PEERR>'0'                                                       
FQ876C                   EVAL      ERRGRL=*ON                                                       
FQ876C                   EVAL      WRK35=*ON                                                        
FQ876C                   EVAL      MSGER='ASG1003'                                                  
FQ876C                   ENDIF                                                                      
FQ876C     ERRGRL        CABEQ     *ON           TP2BCHK                                            
C2294* Validar els tipus de transport                                                              
C2294C                   IF        P2BTPDF<>*BLANKS                                                 
C2294C                   EVAL      N1CIAS=ZZCIAS                                                    
C2294C                   EVAL      N1TTTA=P2BTPDF                                                   
C2294C     KMSTRTA       CHAIN     MSTRTA                             81                            
C2294C                   IF        CHAIN=*ON                                                        
C2294C                   EVAL      ERRGRL=*ON                                                       
C2294C                   EVAL      MSGER='ASG1003'                                                  
C2294C                   EVAL      WRK48=*ON                                                        
C2294C                   ENDIF                                                                      
C2294C     ERRGRL        CABEQ     *ON           TP2BCHK                                            
C2294C                   MOVEL     N1DES1        P2BDTTA                                            
C2294C                   ENDIF                                                                      
                                                                                                    
     C     TP2BCHK       TAG                                                                        
     C                   IF        ERRGRL=*ON                                                       
     C                   EVAL      ZXOPT2='DSP'                                                     
     C                   ENDIF                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA DE ACTUALIZACION DEL FMT P2B                     *                                
      *------------------------------------------------------------*                                
     C     P2BUPD        BEGSR                                                                      
     C                   EVAL      Z_P=Z_P+1                                                        
     C                   IF        SSSECPA(Z_P)=*BLANKS                                             
     C                   EVAL      ZXOPT='END'                                                      
     C                   IF        INDCRT=*ON  AND @POPCI<>'1B'                                     
     C                   EVAL      ZXOPT='P10CLR'                                                   
     C                   ENDIF                                                                      
     C                   ELSE                                                                       
     C                   EVAL      ZXOPT1='P2 '                                                     
     C                   MOVE      SSSECPA(Z_P)  ZXOPT1                                             
     C                   EVAL      ZXOPT2='CLR'                                                     
     C                   ENDIF                                                                      
                                                                                                    
      * En el caso de la opción de visualiza no actualizo                                           
     C                   IF        INDDSP=*ON                                                       
     C                   GOTO      P2BUPDT                                                          
     C                   ENDIF                                                                      
                                                                                                    
     C                   EVAL      M0CIAS=@PCIAS                                                    
     C                   EVAL      M0MAGA=P2BMAGA                                                   
     C     KMSALMA       CHAIN     MSALMA                             81                            
                                                                                                    
     C                   IF        INDCRT=*ON OR INDCPY=*ON                                         
     C                   EXSR      P2AMPF                                                           
     C                   ENDIF                                                                      
     C                   EXSR      P2BMPF                                                           
                                                                                                    
     C                   IF        CHAIN=*OFF                                                       
     C                   UPDATE    RMSALMA                                                          
     C                   ELSE                                                                       
     C                   EVAL      M0DAT1=M0DAT8                                                    
     C                   WRITE     RMSALMA                                                          
      * Creo automáticamente la logística si no existía.                                            
     C                   EVAL      @PETLGC=*BLANKS                                                  
     C                   IF        M0LOGE<>M0LOGS                                                   
     C                   EVAL      @PETLGC='1'                                                      
     C                   ENDIF                                                                      
                                                                                                    
     C                   EVAL      @PECIAS=@PCIAS                                                   
     C                   CALL      'MM2610'                                                         
     C                   PARM                    @PECIAS                                            
     C                   PARM      P2ADLGA       @PEDLGA                                            
     C                   PARM      M0LOGE        @PELGCA                                            
     C                   PARM      M0MAGA        @PEMAGA                                            
     C                   PARM                    @PETLGC                                            
     C                   PARM      *BLANKS       @PEERR                                             
                                                                                                    
     C                   IF        M0LOGE=M0LOGS                                                    
     C                   EVAL      @PETLGC='2'                                                      
     C                   CALL      'MM2610'                                                         
     C                   PARM                    @PECIAS                                            
     C                   PARM      P2ADLGA       @PEDLGA                                            
     C                   PARM      M0LOGS        @PELGCA                                            
     C                   PARM      M0MAGA        @PEMAGA                                            
     C                   PARM                    @PETLGC                                            
     C                   PARM      *BLANKS       @PEERR                                             
     C                   ENDIF                                                                      
     C                   ENDIF                                                                      
C2165 *                                                                                             
C2165 * Grabo o actualizo la dirección en el fichero de direcciones                                 
C2165 * de almacenes                                                                                
C2165 *                                                                                             
C2165C                   EVAL      C2CIAS=M0CIAS                                                    
C2165C                   EVAL      C2MAGA=M0MAGA                                                    
C2165C                   EVAL      C2TDIR=M0TDIR                                                    
C2165C     KCODIMA       CHAIN     CODIMA                                                           
C2165C                   EVAL      C2CIAS=M0CIAS                                                    
C2165C                   EVAL      C2DLGA=M0DLGA                                                    
C2165C                   EVAL      C2MAGA=M0MAGA                                                    
C2165C                   EVAL      C2TDIR=M0TDIR                                                    
C2165C                   EVAL      C2DIRE=M0DIRE                                                    
C2165C                   EVAL      C2DIR2=M0DIR1                                                    
C2165C                   EVAL      C2POBL=M0DIR2                                                    
C2165C                   EVAL      C2POST=M0POST                                                    
C2165C                   EVAL      C2PAIS=M0PAIS                                                    
C2165C                   EVAL      C2TELE=M0TELE                                                    
C2165C                   EVAL      C2TEL2=M0TEL2                                                    
C2165C                   EVAL      C2TLEX=M0TLEX                                                    
C2165C                   EVAL      C2TFAX=M0TFAX                                                    
C2165C                   EVAL      C2EMAI=M0EMAI                                                    
C2165C                   EVAL      C2PEGE=M0PEGE                                                    
C2165 *                                                                                             
C2165C                   EVAL      C2DAT1=ZZDATS                                                    
C2165C                   EVAL      C2DAT8=ZZDATS                                                    
C2165C                   EVAL      C2PANT=SDSJOB                                                    
C2165C                   EVAL      C2USUA=SDSUSR                                                    
C2165C                   TIME                    C2HORA                                             
C2165 *                                                                                             
C2165C                   IF        NOT %FOUND(CODIMA)                                               
C2165C                   WRITE     RCODIMA                                                          
C2165C                   ELSE                                                                       
C2165C                   UPDATE    RCODIMA                                                          
C2165C                   ENDIF                                                                      
                                                                                                    
     C     P2BUPDT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA PASAR DE PANTALLA P2B A FICHERO                  *                                
      *------------------------------------------------------------*                                
     C     P2BMPF        BEGSR                                                                      
      *                                                                                             
     C                   EVAL      M0MAGA=P2BMAGA                                                   
     C***                EVAL      M0DES1=P2BDES1                                                   
     C                   EVAL      M0PUBI=P2BPUBI                                                   
     C                   EVAL      M0NSK1=P2BNSK1                                                   
     C                   EVAL      M0TGST=P2BTGST                                                   
     C                   EVAL      M0TA01=P2BTA01                                                   
     C                   EVAL      M0CCO1=P2BCCO1                                                   
     C                   EVAL      M0APPL=P2BAPPL                                                   
     C                   EVAL      M0CCR1=P2BCCR1                                                   
     C                   EVAL      M0UBI0=P2BUBI0                                                   
     C                   EVAL      M0UBIA=P2BUBIA                                                   
     C                   EVAL      M0PRIE=P2BPRIE                                                   
     C                   EVAL      M0PRIS=P2BPRIS                                                   
     C                   EVAL      M0AIVT=P2BAIVT                                                   
     C                   EVAL      M0IPER=P2BIPER                                                   
     C                   EVAL      M0PPSC=P2BPPSC                                                   
     C                   EVAL      M0ASDI=P2BASDI                                                   
     C                   EVAL      M0CRO2=P2BCRO2                                                   
     C                   EVAL      M0ZUBE=P2BZUBE                                                   
     C                   EVAL      M0ZUBS=P2BZUBS                                                   
     C                   EVAL      M0ZUBD=P2BZUBD                                                   
     C                   EVAL      M0UBIB=P2BUBIB                                                   
     C                   EVAL      M0TFLU=P2BTFLU                                                   
     C                   EVAL      M0TFL2=P2BTFL2                                                   
     C                   EVAL      ZXFILA1=P2BFILT                                                  
     C                   EVAL      ZXCOLU1=P2BCOLT                                                  
     C                   EVAL      ZXNIVE1=P2BNIVT                                                  
     C                   EVAL      M0UBIT=ZXUBIC                                                    
26117C                   EVAL      M0UTTR=P2BUTTR                                                   
26117C                   EVAL      M0MATR=P2BMATR                                                   
     C                   EVAL      M0NPPC=P2BNPPC                                                   
      * A pesar de validar obligo que no permita stk negativo si                                    
      * almacén con ubicaciones o virtual O.L.                                                      
     C                   IF        M0TAL1>='8' OR M0PUBI>='1'                                       
     C                   EVAL      M0NSK1='1'                                                       
     C                   ENDIF                                                                      
      *                                                                                             
     C                   EVAL      M0DAT8=ZZDATS                                                    
     C                   IF        M0DAT8=0                                                         
     C                   EVAL      M0DAT8=*DATE                                                     
     C                   ENDIF                                                                      
     C                   TIME                    M0HORA                                             
     C                   EVAL      M0USUA=ZZUSUA                                                    
     C                   EVAL      M0PANT=SDSJOB                                                    
FQ876c                   Eval      m0ZPrd=p2BZPrd                                                   
FQ876c                   Eval      m0ASGA = p2bASGA                                                 
FQ876c                   EVAL      m0FTPV = p2bFTPV                                                 
C2294c                   EVAL      M0TPDF = p2bTPDF                                                 
FQ876C                   EVAL      M0MN35=P2BMN35                                                   
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA CONTROL DEL FMT P30                              *                                
      *------------------------------------------------------------*                                
     C     P30MAIN       BEGSR                                                                      
     C                   DOW       ZXOPT1='P30'                                                     
     C     ZXOPT2        CASEQ     'CLR'         P30CLR                                             
     C     ZXOPT2        CASEQ     'INZ'         P30INZ                                             
     C     ZXOPT2        CASEQ     'DSP'         P30DSP                                             
     C     ZXOPT2        CASEQ     'CMD'         P30CMD                                             
     C     ZXOPT2        CASEQ     'CHK'         P30CHK                                             
     C     ZXOPT2        CASEQ     'UPD'         P30UPD                                             
     C                   ENDCS                                                                      
     C                   ENDDO                                                                      
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA LIMPIEZA  DE P30                                 *                                
      *------------------------------------------------------------*                                
     C     P30CLR        BEGSR                                                                      
     C                   EVAL      ZXOPT2='INZ'                                                     
     C                   RESET                   Z_P                                                
     C                   MOVEA     ZXZERO10      *IN(30)                                            
     C                   MOVEA     ZXZERO10      *IN(40)                                            
     C                   MOVEA     ZXZERO10      *IN(50)                                            
     C                   MOVEA     ZXZERO10      *IN(60)                                            
     C                   EVAL      CSRFILA=0                                                        
     C                   EVAL      CSRCOLU=0                                                        
     C     P30CLRT       ENDSR                                                                      
      *                                                                                             
      **************************************************************                                
      * SUBRUTINA INICIALITZACIÓ DEL FMT P30                       *                                
      *------------------------------------------------------------*                                
     C     P30INZ        BEGSR                                                                      
      *                                                                                             
     C                   EVAL      ZXOPT2='DSP'                                                     
     C     *NOKEY        CLEAR     *ALL          RMSALMA                                            
     C     KMSALMA       CHAIN     MSALMA                             81                            
     C                   IF        CHAIN=*ON                                                        
     C                   EVAL      ZXOPT='END'                                                      
     C                   GOTO      P30INZT                                                          
     C                   ENDIF                                                                      
                                                                                                    
     C                   EXSR      P30MFP                                                           
                                                                                                    
     C     P30INZT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA PASAR DE FICHERO A PANTALLA P30                  *                                
      *------------------------------------------------------------*                                
     C     P30MFP        BEGSR                                                                      
      *                                                                                             
     C                   EVAL      P30MAGA=M0MAGA                                                   
     C                   EVAL      P30DES1=M0DES1                                                   
     C                   EVAL      P3CMAGA=M0MAGA                                                   
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VISUALITZACIÓ DEL FMT P30                        *                                
      *------------------------------------------------------------*                                
     C     P30DSP        BEGSR                                                                      
      * ENS ENCARREGUEM QUE EL PROPER PAS SIGUI COMPROVAR ENTRADA CMD                               
     C                   EVAL      ZXOPT2='CMD'                                                     
     C                   EVAL      PPPCMD1='CMD3012'                                                
     C                   EXFMT     P30                                                              
     C                   MOVEA     ZXZERO10      *IN(30)                                            
     C                   MOVEA     ZXZERO10      *IN(40)                                            
     C                   MOVEA     ZXZERO10      *IN(50)                                            
     C                   MOVEA     ZXZERO10      *IN(60)                                            
     C                   EVAL      ERRGRL=*OFF                                                      
     C                   EVAL      MSGER=*BLANKS                                                    
     C     P30DSPT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VALIDACIÓ DELS CMDS  DEL FMT P30                 *                                
      *------------------------------------------------------------*                                
     C     P30CMD        BEGSR                                                                      
     C                   EVAL      ZXOPT2='CHK'                                                     
      *VALIDACIONES TECLAS DE FUNCION                                                               
     C                   SELECT                                                                     
      * FINALITZAR EL PROGRAMA                                                                      
     C                   WHEN      EXIT=*ON                                                         
     C                   EVAL      ZXOPT1='END'                                                     
      * SOL·LICITUD AJUDA D'ARTICLES                                                                
     C                   WHEN      HELP=*ON                                                         
     C                   EVAL      ZXOPT2='DSP'                                                     
     C                   EXSR      CS_POCUR2                                                        
      * RETROCESO PANTALLA                                                                          
     C                   WHEN      RETRO=*ON                                                        
     C                   EVAL      ZXOPT1='END'                                                     
     C                   ENDSL                                                                      
                                                                                                    
     C     TP30CMD       TAG                                                                        
     C                   IF        ERRGRL=*ON                                                       
     C                   EVAL      ZXOPT2='DSP'                                                     
     C                   ENDIF                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VALIDACIÓ DELS CAMPS DEL FMT P30                 *                                
      *------------------------------------------------------------*                                
     C     P30CHK        BEGSR                                                                      
     C                   EVAL      ZXOPT2='UPD'                                                     
                                                                                                    
      * Si el almacén es blanco no continuamos                                                      
     C                   IF        P3CMAGA=*BLANKS                                                  
     C                   EVAL      ERRGRL=*ON                                                       
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP30CHK                                            
      * El almacén  no puede existir                                                                
     C                   EVAL      M0MAGA=P3CMAGA                                                   
     C     KMSALMA       CHAIN (N) MSALMA                             81                            
     C                   IF        CHAIN=*OFF                                                       
     C                   EVAL      ERRGRL=*ON                                                       
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP30CHK                                            
                                                                                                    
                                                                                                    
     C     TP30CHK       TAG                                                                        
     C                   IF        ERRGRL=*ON                                                       
     C                   EVAL      MSGER='MSG0008'                                                  
     C                   EVAL      ZXOPT2='DSP'                                                     
     C                   ENDIF                                                                      
                                                                                                    
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA DE AYUDA PARA FMT P30                            *                                
      *------------------------------------------------------------*                                
     C     P30F4         BEGSR                                                                      
     C     P30F4T        ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA DE ACTUALIZACION DEL FMT P30                     *                                
      *------------------------------------------------------------*                                
     C     P30UPD        BEGSR                                                                      
     C                   EVAL      ZXOPT1='P2 '                                                     
     C                   RESET                   Z_P                                                
     C                   MOVE      SSSECPA(Z_P)  ZXOPT1                                             
     C                   EVAL      ZXOPT2='CLR'                                                     
                                                                                                    
     C                   EVAL      M0MAGA=P30MAGA                                                   
     C     P30UPDT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA CONTROL DEL FMT P40                              *                                
      *------------------------------------------------------------*                                
     C     P40MAIN       BEGSR                                                                      
     C                   DOW       ZXOPT1='P40'                                                     
     C     ZXOPT2        CASEQ     'CLR'         P40CLR                                             
     C     ZXOPT2        CASEQ     'INZ'         P40INZ                                             
     C     ZXOPT2        CASEQ     'DSP'         P40DSP                                             
     C     ZXOPT2        CASEQ     'CMD'         P40CMD                                             
     C     ZXOPT2        CASEQ     'CHK'         P40CHK                                             
     C     ZXOPT2        CASEQ     'UPD'         P40UPD                                             
     C                   ENDCS                                                                      
     C                   ENDDO                                                                      
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA LIMPIEZA  DE P40                                 *                                
      *------------------------------------------------------------*                                
     C     P40CLR        BEGSR                                                                      
     C                   EVAL      ZXOPT2='INZ'                                                     
     C                   MOVEA     ZXZERO10      *IN(30)                                            
     C                   MOVEA     ZXZERO10      *IN(40)                                            
     C                   MOVEA     ZXZERO10      *IN(50)                                            
     C                   MOVEA     ZXZERO10      *IN(60)                                            
     C                   EVAL      CSRFILA=0                                                        
     C                   EVAL      CSRCOLU=0                                                        
     C     P40CLRT       ENDSR                                                                      
      *                                                                                             
      **************************************************************                                
      * SUBRUTINA INICIALITZACIÓ DEL FMT P40                       *                                
      *------------------------------------------------------------*                                
     C     P40INZ        BEGSR                                                                      
      *                                                                                             
     C                   EVAL      ZXOPT2='DSP'                                                     
     C     *NOKEY        CLEAR     *ALL          RMSALMA                                            
     C     KMSALMA       CHAIN     MSALMA                             81                            
     C                   EXSR      P40MFP                                                           
                                                                                                    
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA PASAR DE FICHERO A PANTALLA P40                  *                                
      *------------------------------------------------------------*                                
     C     P40MFP        BEGSR                                                                      
      *                                                                                             
     C                   EVAL      P40MAGA=M0MAGA                                                   
     C                   EVAL      P40DES1=M0DES1                                                   
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VISUALITZACIÓ DEL FMT P40                        *                                
      *------------------------------------------------------------*                                
     C     P40DSP        BEGSR                                                                      
      * ENS ENCARREGUEM QUE EL PROPER PAS SIGUI COMPROVAR ENTRADA CMD                               
     C                   EVAL      ZXOPT2='CMD'                                                     
     C                   EVAL      PPPCMD1='CMD3029'                                                
     C                   EXFMT     P40                                                              
     C                   MOVEA     ZXZERO10      *IN(30)                                            
     C                   MOVEA     ZXZERO10      *IN(40)                                            
     C                   MOVEA     ZXZERO10      *IN(50)                                            
     C                   MOVEA     ZXZERO10      *IN(60)                                            
     C                   EVAL      ERRGRL=*OFF                                                      
     C                   EVAL      MSGER=*BLANKS                                                    
     C     P40DSPT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VALIDACIÓ DELS CMDS  DEL FMT P40                 *                                
      *------------------------------------------------------------*                                
     C     P40CMD        BEGSR                                                                      
     C                   EVAL      ZXOPT2='CHK'                                                     
      *VALIDACIONES TECLAS DE FUNCION                                                               
     C                   SELECT                                                                     
      * FINALITZAR EL PROGRAMA                                                                      
     C                   WHEN      EXIT=*ON                                                         
     C                   EVAL      ZXOPT1='END'                                                     
      * RETROCESO PANTALLA                                                                          
     C                   WHEN      RETRO=*ON                                                        
     C                   EVAL      ZXOPT1='END'                                                     
     C                   ENDSL                                                                      
                                                                                                    
     C     TP40CMD       TAG                                                                        
     C                   IF        ERRGRL=*ON                                                       
     C                   EVAL      ZXOPT2='DSP'                                                     
     C                   ENDIF                                                                      
                                                                                                    
     C     P40CMDT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA VALIDACIÓ DELS CAMPS DEL FMT P40                 *                                
      *------------------------------------------------------------*                                
     C     P40CHK        BEGSR                                                                      
     C                   EVAL      ZXOPT2='UPD'                                                     
                                                                                                    
      * No puede borrarse una ubicación asignada a algún artículo                                   
     C     KMSUBIC       CHAIN     MSUBIC                             81                            
     C                   IF        CHAIN=*OFF                                                       
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='MMM0021'                                                  
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP40CHK                                            
                                                                                                    
      * No puede borrarse una ubicación asignada a algún artículo                                   
     C                   EVAL      MICIAS=@PCIAS                                                    
     C                   EVAL      MIDLGA=ZZDLGA                                                    
     C                   EVAL      MILGCA=M0LOGE                                                    
     C     KMSLOGI       CHAIN(N)  MSLOGI                             81                            
     C                   IF        CHAIN=*OFF                                                       
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='MMM0240'                                                  
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP40CHK                                            
                                                                                                    
     C                   EVAL      MILGCA=M0LOGS                                                    
     C     KMSLOGI       CHAIN(N)  MSLOGI                             81                            
     C                   IF        CHAIN=*OFF                                                       
     C                   EVAL      ERRGRL=*ON                                                       
     C                   EVAL      MSGER='MMM0240'                                                  
     C                   ENDIF                                                                      
     C     ERRGRL        CABEQ     *ON           TP40CHK                                            
                                                                                                    
     C     TP40CHK       TAG                                                                        
     C                   IF        ERRGRL=*ON                                                       
     C                   EVAL      ZXOPT2='DSP'                                                     
     C                   ENDIF                                                                      
                                                                                                    
     C     P40CHKT       ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA DE AYUDA PARA FMT P40                            *                                
      *------------------------------------------------------------*                                
     C     P40F4         BEGSR                                                                      
     C     P40F4T        ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA DE ACTUALIZACION DEL FMT P40                     *                                
      *------------------------------------------------------------*                                
     C     P40UPD        BEGSR                                                                      
     C                   EVAL      ZXOPT='END'                                                      
                                                                                                    
     C                   EVAL      M0CIAS=@PCIAS                                                    
     C                   EVAL      M0MAGA=@PMAGA                                                    
     C     KMSALMA       CHAIN     MSALMA                             81                            
                                                                                                    
     C                   IF        CHAIN=*OFF                                                       
09055C                   EVAL      M0BAJA='1'                                                       
09055C                   UPDATE    RMSALMA                                                          
09055C***                DELETE    RMSALMA                                                          
     C                   ENDIF                                                                      
                                                                                                    
     C     P40UPDT       ENDSR                                                                      
C1078                                                                                               
C1078 **************************************************************                                
C1078 * SUBRUTINA CONTROL DEL FMT P5A                              *                                
C1078 *------------------------------------------------------------*                                
C1078C     P5AMAIN       BEGSR                                                                      
C1078C                   DOW       ZXOPT1='P5A'                                                     
C1078C     ZXOPT2        CASEQ     'CLR'         P5ACLR                                             
C1078C     ZXOPT2        CASEQ     'INZ'         P5AINZ                                             
C1078C     ZXOPT2        CASEQ     'DSP'         P5ADSP                                             
C1078C     ZXOPT2        CASEQ     'CMD'         P5ACMD                                             
C1078C     ZXOPT2        CASEQ     'CHK'         P5ACHK                                             
C1078C     ZXOPT2        CASEQ     'UPD'         P5AUPD                                             
C1078C                   ENDCS                                                                      
C1078C                   ENDDO                                                                      
C1078C                   ENDSR                                                                      
C1078 **************************************************************                                
C1078 * SUBRUTINA INICIALITZACIÓ DEL FMT P5A                       *                                
C1078 *------------------------------------------------------------*                                
C1078C     P5ACLR        BEGSR                                                                      
C1078 * ENS ENCARREGUEM QUE EL PROPER PAS SIGUI VISUALITZAR P5A                                     
C1078C                   EVAL      ZXOPT2='INZ'                                                     
C1078C                   MOVEA     ZXZERO10      *IN(30)                                            
C1078C                   MOVEA     ZXZERO10      *IN(40)                                            
C1078C                   MOVEA     ZXZERO10      *IN(50)                                            
C1078C                   MOVEA     ZXZERO10      *IN(60)                                            
C1078C                   EVAL      CSRFILA=0                                                        
C1078C                   EVAL      CSRCOLU=0                                                        
C1078C                   RESET                   Z_P                                                
C1078C     P5ACLRT       ENDSR                                                                      
C1078 **************************************************************                                
C1078 * SUBRUTINA INICIALITZACIÓ DEL FMT P5A                       *                                
C1078 *------------------------------------------------------------*                                
C1078C     P5AINZ        BEGSR                                                                      
C1078 * ENS ENCARREGUEM QUE EL PROPER PAS SIGUI VISUALITZAR P5A                                     
C1078C                   EVAL      ZXOPT2='DSP'                                                     
IT244C                   If        Not nP7EDV3                                                      
IT244C                   move      *on           *IN78                                              
IT244C                   endif                                                                      
C1078C     KMSALMA       CHAIN     MSALMA                             81                            
IT244C* Incloura control de m0tal1=8 -  activar indicador                                           
IT244C*   habilitar camp P5ADISP per la seva ediciò.                                                
IT244C                   IF        m0tal1='8'                                                       
IT244C                   move      *on           *IN77                                              
IT244C                   else                                                                       
IT244C                   move      *off          *IN77                                              
IT244C                   ENDIF                                                                      
C1078C     KEDPAR3       CHAIN     EDPAR3                                                           
C1078C                   EXSR      P5AMFP                                                           
C1078C     P5AINZT       ENDSR                                                                      
C1078 **************************************************************                                
C1078 * SUBRUTINA INICIALITZACIÓ DEL FMT P5A                       *                                
C1078 *------------------------------------------------------------*                                
C1078C     P5AMFP        BEGSR                                                                      
C1078C                   EVAL      P5AMAGA=T5MAGA                                                   
C1078C                   EVAL      P5ADESC=M0DES1                                                   
C1078C                   EVAL      ZXRFLU=T5RFLU                                                    
C1078C                   EVAL      P5ARFLU=T5RFLU                                                   
C1078C                   EVAL      P5ADOBC=T5DOBC                                                   
C1078C                   EVAL      P5ADOFD=T5DOFD                                                   
C1078C                   EVAL      P5AMONE=ZZMONE                                                   
C1078                                                                                               
C1078C                   EVAL      PXALPH=*BLANKS                                                   
C1078C                   EVAL      PXNUM=T5MLIN                                                     
C1078C                   CALL      'PRD650'                                                         
C1078C                   PARM                    PXNUM                                              
C1078C                   PARM                    PXALPH                                             
C1078C                   PARM                    PXFLDD                                             
C1078C                   PARM      0             PXDCCD                                             
C1078C                   PARM                    PXFMD1                                             
C1078C                   PARM                    PXEDTC                                             
C1078C                   PARM                    PXNMER                                             
C1078C                   PARM                    PXTIPA                                             
C1078C                   MOVE      PXALPH        P5AMLIN                                            
C1078                                                                                               
C1078C                   EVAL      PXALPH=*BLANKS                                                   
C1078C                   EVAL      PXNUM=T5CAPA                                                     
C1078C                   CALL      'PRD650'                                                         
C1078C                   PARM                    PXNUM                                              
C1078C                   PARM                    PXALPH                                             
C1078C                   PARM                    PXFLDD                                             
C1078C                   PARM      2             PXDCCD                                             
C1078C                   PARM                    PXFMD1                                             
C1078C                   PARM                    PXEDTC                                             
C1078C                   PARM                    PXNMER                                             
C1078C                   PARM                    PXTIPA                                             
C1078C                   MOVE      PXALPH        P5ACAPA                                            
IT244 * t5disp                                                                                      
C1078                                                                                               
C1078C                   EVAL      PXALPH=*BLANKS                                                   
C1078C                   EVAL      PXNUM=T5DISP                                                     
C1078C                   CALL      'PRD650'                                                         
C1078C                   PARM                    PXNUM                                              
C1078C                   PARM                    PXALPH                                             
C1078C                   PARM                    PXFLDD                                             
C1078C                   PARM      2             PXDCCD                                             
C1078C                   PARM                    PXFMD1                                             
C1078C                   PARM                    PXEDTC                                             
C1078C                   PARM                    PXNMER                                             
C1078C                   PARM                    PXTIPA                                             
C1078C                   MOVE      PXALPH        P5ADISP                                            
IT244 * t5masi                                                                                      
IT244C                   EVAL      PXALPH=*BLANKS                                                   
IT244C                   EVAL      PXNUM=T5MASI                                                     
IT244C                   CALL      'PRD650'                                                         
IT244C                   PARM                    PXNUM                                              
IT244C                   PARM                    PXALPH                                             
IT244C                   PARM                    PXFLDD                                             
IT244C                   PARM      2             PXDCCD                                             
IT244C                   PARM                    PXFMD1                                             
IT244C                   PARM                    PXEDTC                                             
IT244C                   PARM                    PXNMER                                             
IT244C                   PARM                    PXTIPA                                             
IT244C                   MOVE      PXALPH        P5AMASI                                            
IT244                                                                                               
C1078                                                                                               
C1078C                   EVAL      PXALPH=*BLANKS                                                   
C1078C                   EVAL      PXNUM=T5DIFD                                                     
C1078C                   CALL      'PRD650'                                                         
C1078C                   PARM                    PXNUM                                              
C1078C                   PARM                    PXALPH                                             
C1078C                   PARM                    PXFLDD                                             
C1078C                   PARM      2             PXDCCD                                             
C1078C                   PARM                    PXFMD1                                             
C1078C                   PARM                    PXEDTC                                             
C1078C                   PARM                    PXNMER                                             
C1078C                   PARM                    PXTIPA                                             
C1078C                   MOVE      PXALPH        P5ADIFD                                            
C1078                                                                                               
C1078C                   EVAL      PXALPH=*BLANKS                                                   
C1078C                   EVAL      PXNUM=T5IMPO                                                     
C1078C                   CALL      'PRD650'                                                         
C1078C                   PARM                    PXNUM                                              
C1078C                   PARM                    PXALPH                                             
C1078C                   PARM                    PXFLDD                                             
C1078C                   PARM      2             PXDCCD                                             
C1078C                   PARM                    PXFMD1                                             
C1078C                   PARM                    PXEDTC                                             
C1078C                   PARM                    PXNMER                                             
C1078C                   PARM                    PXTIPA                                             
C1078C                   MOVE      PXALPH        P5AIMPO                                            
C1078C                   EXSR      CS_CONTLIN                                                       
C1078                                                                                               
C1078C                   EVAL      PXALPH=*BLANKS                                                   
C1078C                   EVAL      PXNUM=T5MLIA                                                     
C1078C                   CALL      'PRD650'                                                         
C1078C                   PARM                    PXNUM                                              
C1078C                   PARM                    PXALPH                                             
C1078C                   PARM                    PXFLDD                                             
C1078C                   PARM      0             PXDCCD                                             
C1078C                   PARM                    PXFMD1                                             
C1078C                   PARM                    PXEDTC                                             
C1078C                   PARM                    PXNMER                                             
C1078C                   PARM                    PXTIPA                                             
C1078C                   MOVE      PXALPH        P5AMLIA                                            
C1078                                                                                               
C1078C                   EVAL      PXALPH=*BLANKS                                                   
C1078C                   EVAL      PXNUM=T5PESO                                                     
C1078C                   CALL      'PRD650'                                                         
C1078C                   PARM                    PXNUM                                              
C1078C                   PARM                    PXALPH                                             
C1078C                   PARM                    PXFLDD                                             
C1078C                   PARM      2             PXDCCD                                             
C1078C                   PARM                    PXFMD1                                             
C1078C                   PARM                    PXEDTC                                             
C1078C                   PARM                    PXNMER                                             
C1078C                   PARM                    PXTIPA                                             
C1078C                   MOVE      PXALPH        P5APESO                                            
C1078                                                                                               
C1078C                   EVAL      PXALPH=*BLANKS                                                   
C1078C                   EVAL      PXNUM=T5VOLU                                                     
C1078C                   CALL      'PRD650'                                                         
C1078C                   PARM                    PXNUM                                              
C1078C                   PARM                    PXALPH                                             
C1078C                   PARM                    PXFLDD                                             
C1078C                   PARM      2             PXDCCD                                             
C1078C                   PARM                    PXFMD1                                             
C1078C                   PARM                    PXEDTC                                             
C1078C                   PARM                    PXNMER                                             
C1078C                   PARM                    PXTIPA                                             
C1078C                   MOVE      PXALPH        P5AVOLU                                            
C1078                                                                                               
C1078C                   EVAL      P5AUPES=ZZUPES                                                   
C1078C                   EVAL      P5AUVOL=ZZUVOL                                                   
C1078                                                                                               
C1078C                   EVAL      PXALPH=*BLANKS                                                   
C1078C                   EVAL      PXNUM=T5HORZ                                                     
C1078C                   CALL      'PRD650'                                                         
C1078C                   PARM                    PXNUM                                              
C1078C                   PARM                    PXALPH                                             
C1078C                   PARM                    PXFLDD                                             
C1078C                   PARM      0             PXDCCD                                             
C1078C                   PARM                    PXFMD1                                             
C1078C                   PARM                    PXEDTC                                             
C1078C                   PARM                    PXNMER                                             
C1078C                   PARM                    PXTIPA                                             
C1078C                   MOVE      PXALPH        P5AHORZ                                            
C1078                                                                                               
C1078C                   EVAL      PXALPH=*BLANKS                                                   
C1078C                   EVAL      PXNUM=T5PMIN                                                     
C1078C                   CALL      'PRD650'                                                         
C1078C                   PARM                    PXNUM                                              
C1078C                   PARM                    PXALPH                                             
C1078C                   PARM                    PXFLDD                                             
C1078C                   PARM      2             PXDCCD                                             
C1078C                   PARM                    PXFMD1                                             
C1078C                   PARM                    PXEDTC                                             
C1078C                   PARM                    PXNMER                                             
C1078C                   PARM                    PXTIPA                                             
C1078C                   MOVE      PXALPH        P5APMIN                                            
C1078                                                                                               
C1078C                   EVAL      PXALPH=*BLANKS                                                   
C1078C                   EVAL      PXNUM=T5PMFD                                                     
C1078C                   CALL      'PRD650'                                                         
C1078C                   PARM                    PXNUM                                              
C1078C                   PARM                    PXALPH                                             
C1078C                   PARM                    PXFLDD                                             
C1078C                   PARM      2             PXDCCD                                             
C1078C                   PARM                    PXFMD1                                             
C1078C                   PARM                    PXEDTC                                             
C1078C                   PARM                    PXNMER                                             
C1078C                   PARM                    PXTIPA                                             
C1078C                   MOVE      PXALPH        P5APMFD                                            
C1078                                                                                               
C1078C                   EVAL      P5AACTO=T5ACTO                                                   
      *                                                                                             
C1078C                   EVAL      ZXMAXLIN=T5MLIN*T5CAPA/100                                       
C1078C                   EVAL      PXALPH=*BLANKS                                                   
C1078C                   EVAL      PXNUM=ZXMAXLIN                                                   
C1078C                   CALL      'PRD650'                                                         
C1078C                   PARM                    PXNUM                                              
C1078C                   PARM                    PXALPH                                             
C1078C                   PARM                    PXFLDD                                             
C1078C                   PARM      0             PXDCCD                                             
C1078C                   PARM                    PXFMD1                                             
C1078C                   PARM                    PXEDTC                                             
C1078C                   PARM                    PXNMER                                             
C1078C                   PARM                    PXTIPA                                             
C1078C                   MOVE      PXALPH        P5ANLPE                                            
C1078                                                                                               
C1078C                   IF        NOT%FOUND(EDPAR3)                                                
C1078C                   CLEAR                   P5AIMPO                                            
C1078C                   CLEAR                   P5ADISP                                            
IT244C                   CLEAR                   P5AMASI                                            
C1078C                   CLEAR                   P5ADIFD                                            
C1078C                   CLEAR                   P5ACAPA                                            
C1078C                   CLEAR                   P5AMLIN                                            
C1078C                   CLEAR                   P5AVOLU                                            
C1078C                   CLEAR                   P5APESO                                            
C1078C                   ENDIF                                                                      
C1078C                                                                                              
C1078C                   ENDSR                                                                      
C1078 **************************************************************                                
C1078 * SUBRUTINA VISUALITZACIÓ DEL FMT P5A                        *                                
C1078 *------------------------------------------------------------*                                
C1078C     P5ADSP        BEGSR                                                                      
C1078 * ENS ENCARREGUEM QUE EL PROPER PAS SIGUI COMPROVAR ENTRADA CMD                               
C1078C                   EVAL      ZXOPT2='CMD'                                                     
C1078C                   EVAL      PPPCMD1='CMD7801'                                                
C1078C                   EVAL      WRK97=*OFF                                                       
C1078C                   IF        M0TAL1>'6'                                                       
C1078C                   EVAL      WRK97=*ON                                                        
C1078C                   EVAL      INDPROT=*ON                                                      
C1078C                   ENDIF                                                                      
C1078C                   EXFMT     P5A                                                              
C1078C                   MOVEA     ZXZERO10      *IN(30)                                            
C1078C                   MOVEA     ZXZERO10      *IN(40)                                            
C1078C                   MOVEA     ZXZERO10      *IN(50)                                            
C1078C                   MOVEA     ZXZERO10      *IN(60)                                            
C1078C                   EVAL      ERRGRL=*OFF                                                      
C1078C                   EVAL      MSGER=*BLANKS                                                    
C1078C     P5ADSPT       ENDSR                                                                      
C1078 **************************************************************                                
C1078 * SUBRUTINA VALIDACIÓ DELS CAMPS DEL FMT P5A                 *                                
C1078 *------------------------------------------------------------*                                
C1078C     P5ACMD        BEGSR                                                                      
C1078C                   EVAL      ZXOPT2='CHK'                                                     
C1078 *VALIDACIONES TECLAS DE FUNCION                                                               
C1078C                   SELECT                                                                     
C1078 * FINALITZAR EL PROGRAMA                                                                      
C1078C                   WHEN      EXIT=*ON                                                         
C1078C                   EVAL      ZXOPT1='END'                                                     
C1078 * SOL·LICITUD AJUDA D'ARTICLES                                                                
C1078C                   WHEN      HELP=*ON                                                         
C1078C                   EVAL      ZXOPT2='DSP'                                                     
C1078C                   EXSR      CS_POCUR2                                                        
C1078                                                                                               
C1078C                   WHEN      RETRO=*ON                                                        
C1078C                   EVAL      ZXOPT1='END'                                                     
C1078C                   ENDSL                                                                      
C1078                                                                                               
C1078C     P5ACMDT       ENDSR                                                                      
C1078 **************************************************************                                
C1078 * SUBRUTINA VALIDACIÓ DELS CAMPS DEL FMT P5A                 *                                
C1078 *------------------------------------------------------------*                                
C1078C     P5ACHK        BEGSR                                                                      
C1078C                   EVAL      ZXOPT2='UPD'                                                     
C1078 *                  EVAL      PXALPH=P5AMLIN                                                   
C1078C                   CLEAR                   PXALPH                                             
C1078C                   MOVE      P5AMLIN       PXALPH                                             
C1078C                   EVAL      PXNUM=0                                                          
C1078C                   CALL      'PRD650'                                                         
C1078C                   PARM                    PXNUM                                              
C1078C                   PARM                    PXALPH                                             
C1078C                   PARM                    PXFLDD                                             
C1078C                   PARM      0             PXDCCD                                             
C1078C                   PARM                    PXFMD1                                             
C1078C                   PARM                    PXEDTC                                             
C1078C                   PARM                    PXNMER                                             
C1078C                   PARM                    PXTIPA                                             
C1078C                   IF        PXNMER<>0                                                        
C1078C                   EVAL      ERRGRL=*ON                                                       
C1078C                   EVAL      WRK41=*ON                                                        
C1078C                   EVAL      MSGER='ASG1003'                                                  
C1078C                   ENDIF                                                                      
C1078C     ERRGRL        CABEQ     *ON           TP5ACHK                                            
C1078C                   MOVE      PXALPH        P5AMLIN                                            
C1078                                                                                               
C1078C                   CLEAR                   PXALPH                                             
C1078C                   MOVE      P5ACAPA       PXALPH                                             
C1078C                   EVAL      PXNUM=0                                                          
C1078C                   CALL      'PRD650'                                                         
C1078C                   PARM                    PXNUM                                              
C1078C                   PARM                    PXALPH                                             
C1078C                   PARM                    PXFLDD                                             
C1078C                   PARM      2             PXDCCD                                             
C1078C                   PARM                    PXFMD1                                             
C1078C                   PARM                    PXEDTC                                             
C1078C                   PARM                    PXNMER                                             
C1078C                   PARM                    PXTIPA                                             
C1078C                   IF        PXNMER<>0                                                        
C1078C                   EVAL      ERRGRL=*ON                                                       
C1078C                   EVAL      WRK42=*ON                                                        
C1078C                   EVAL      MSGER='ASG1003'                                                  
C1078C                   ENDIF                                                                      
C1078C     ERRGRL        CABEQ     *ON           TP5ACHK                                            
C1078C                   MOVE      PXALPH        P5ACAPA                                            
C1078                                                                                               
C1078C                   CLEAR                   PXALPH                                             
C1078C                   MOVE      P5ADISP       PXALPH                                             
C1078 *                  EVAL      PXALPH=P5ADISP                                                   
C1078C                   EVAL      PXNUM=0                                                          
C1078C                   CALL      'PRD650'                                                         
C1078C                   PARM                    PXNUM                                              
C1078C                   PARM                    PXALPH                                             
C1078C                   PARM                    PXFLDD                                             
C1078C                   PARM      2             PXDCCD                                             
C1078C                   PARM                    PXFMD1                                             
C1078C                   PARM                    PXEDTC                                             
C1078C                   PARM                    PXNMER                                             
C1078C                   PARM                    PXTIPA                                             
C1078C                   IF        PXNMER<>0                                                        
C1078C                   EVAL      ERRGRL=*ON                                                       
C1078C                   EVAL      WRK43=*ON                                                        
C1078C                   EVAL      MSGER='ASG1003'                                                  
C1078C                   ENDIF                                                                      
C1078C     ERRGRL        CABEQ     *ON           TP5ACHK                                            
C1078C                   MOVE      PXALPH        P5ADISP                                            
C1078                                                                                               
C1078C                   CLEAR                   PXALPH                                             
C1078C                   MOVE      P5ADIFD       PXALPH                                             
C1078 *                  EVAL      PXALPH=P5ADISP                                                   
C1078C                   EVAL      PXNUM=0                                                          
C1078C                   CALL      'PRD650'                                                         
C1078C                   PARM                    PXNUM                                              
C1078C                   PARM                    PXALPH                                             
C1078C                   PARM                    PXFLDD                                             
C1078C                   PARM      2             PXDCCD                                             
C1078C                   PARM                    PXFMD1                                             
C1078C                   PARM                    PXEDTC                                             
C1078C                   PARM                    PXNMER                                             
C1078C                   PARM                    PXTIPA                                             
C1078C                   IF        PXNMER<>0                                                        
C1078C                   EVAL      ERRGRL=*ON                                                       
C1078C                   EVAL      WRK51=*ON                                                        
C1078C                   EVAL      MSGER='ASG1003'                                                  
C1078C                   ENDIF                                                                      
C1078C     ERRGRL        CABEQ     *ON           TP5ACHK                                            
C1078C                   MOVE      PXALPH        P5ADIFD                                            
C1078                                                                                               
C1078C                   CLEAR                   PXALPH                                             
C1078C                   MOVE      P5AIMPO       PXALPH                                             
C1078 *                  EVAL      PXALPH=P5AIMPO                                                   
C1078C                   EVAL      PXNUM=0                                                          
C1078C                   CALL      'PRD650'                                                         
C1078C                   PARM                    PXNUM                                              
C1078C                   PARM                    PXALPH                                             
C1078C                   PARM                    PXFLDD                                             
C1078C                   PARM      2             PXDCCD                                             
C1078C                   PARM                    PXFMD1                                             
C1078C                   PARM                    PXEDTC                                             
C1078C                   PARM                    PXNMER                                             
C1078C                   PARM                    PXTIPA                                             
C1078C                   IF        PXNMER<>0                                                        
C1078C                   EVAL      ERRGRL=*ON                                                       
C1078C                   EVAL      WRK44=*ON                                                        
C1078C                   EVAL      MSGER='ASG1003'                                                  
C1078C                   ENDIF                                                                      
C1078C     ERRGRL        CABEQ     *ON           TP5ACHK                                            
C1078C                   MOVE      PXALPH        P5AIMPO                                            
C1078C                   EVAL      P5AMONE=ZZMONE                                                   
C1078                                                                                               
C1078C                   CLEAR                   PXALPH                                             
C1078C                   MOVE      P5AVOLU       PXALPH                                             
C1078C                   EVAL      PXNUM=0                                                          
C1078C                   CALL      'PRD650'                                                         
C1078C                   PARM                    PXNUM                                              
C1078C                   PARM                    PXALPH                                             
C1078C                   PARM                    PXFLDD                                             
C1078C                   PARM      2             PXDCCD                                             
C1078C                   PARM                    PXFMD1                                             
C1078C                   PARM                    PXEDTC                                             
C1078C                   PARM                    PXNMER                                             
C1078C                   PARM                    PXTIPA                                             
C1078C                   IF        PXNMER<>0                                                        
C1078C                   EVAL      ERRGRL=*ON                                                       
C1078C                   EVAL      WRK46=*ON                                                        
C1078C                   EVAL      MSGER='ASG1003'                                                  
C1078C                   ENDIF                                                                      
C1078C     ERRGRL        CABEQ     *ON           TP5ACHK                                            
C1078C                   MOVE      PXALPH        P5AVOLU                                            
C1078                                                                                               
C1078C                   CLEAR                   PXALPH                                             
C1078C                   MOVE      P5APESO       PXALPH                                             
C1078C                   EVAL      PXNUM=0                                                          
C1078C                   CALL      'PRD650'                                                         
C1078C                   PARM                    PXNUM                                              
C1078C                   PARM                    PXALPH                                             
C1078C                   PARM                    PXFLDD                                             
C1078C                   PARM      2             PXDCCD                                             
C1078C                   PARM                    PXFMD1                                             
C1078C                   PARM                    PXEDTC                                             
C1078C                   PARM                    PXNMER                                             
C1078C                   PARM                    PXTIPA                                             
C1078C                   IF        PXNMER<>0                                                        
C1078C                   EVAL      ERRGRL=*ON                                                       
C1078C                   EVAL      WRK47=*ON                                                        
C1078C                   EVAL      MSGER='ASG1003'                                                  
C1078C                   ENDIF                                                                      
C1078C     ERRGRL        CABEQ     *ON           TP5ACHK                                            
C1078C                   MOVE      PXALPH        P5APESO                                            
C1078                                                                                               
C1078C                   CLEAR                   PXALPH                                             
C1078C                   MOVE      P5APMIN       PXALPH                                             
C1078C                   EVAL      PXNUM=0                                                          
C1078C                   CALL      'PRD650'                                                         
C1078C                   PARM                    PXNUM                                              
C1078C                   PARM                    PXALPH                                             
C1078C                   PARM                    PXFLDD                                             
C1078C                   PARM      2             PXDCCD                                             
C1078C                   PARM                    PXFMD1                                             
C1078C                   PARM                    PXEDTC                                             
C1078C                   PARM                    PXNMER                                             
C1078C                   PARM                    PXTIPA                                             
C1078C                   IF        PXNMER<>0                                                        
C1078C                   EVAL      ERRGRL=*ON                                                       
C1078C                   EVAL      WRK48=*ON                                                        
C1078C                   EVAL      MSGER='ASG1003'                                                  
C1078C                   ENDIF                                                                      
C1078C     ERRGRL        CABEQ     *ON           TP5ACHK                                            
C1078C                   MOVE      PXALPH        P5APMIN                                            
C1078                                                                                               
C1078C                   CLEAR                   PXALPH                                             
C1078C                   MOVE      P5APMFD       PXALPH                                             
C1078C                   EVAL      PXNUM=0                                                          
C1078C                   CALL      'PRD650'                                                         
C1078C                   PARM                    PXNUM                                              
C1078C                   PARM                    PXALPH                                             
C1078C                   PARM                    PXFLDD                                             
C1078C                   PARM      2             PXDCCD                                             
C1078C                   PARM                    PXFMD1                                             
C1078C                   PARM                    PXEDTC                                             
C1078C                   PARM                    PXNMER                                             
C1078C                   PARM                    PXTIPA                                             
C1078C                   IF        PXNMER<>0                                                        
C1078C                   EVAL      ERRGRL=*ON                                                       
C1078C                   EVAL      WRK51=*ON                                                        
C1078C                   EVAL      MSGER='ASG1003'                                                  
C1078C                   ENDIF                                                                      
C1078C     ERRGRL        CABEQ     *ON           TP5ACHK                                            
C1078C                   MOVE      PXALPH        P5APMFD                                            
C1078                                                                                               
C1078C                   CLEAR                   PXALPH                                             
C1078C                   MOVE      P5AHORZ       PXALPH                                             
C1078C                   EVAL      PXNUM=0                                                          
C1078C                   CALL      'PRD650'                                                         
C1078C                   PARM                    PXNUM                                              
C1078C                   PARM                    PXALPH                                             
C1078C                   PARM                    PXFLDD                                             
C1078C                   PARM      0             PXDCCD                                             
C1078C                   PARM                    PXFMD1                                             
C1078C                   PARM                    PXEDTC                                             
C1078C                   PARM                    PXNMER                                             
C1078C                   PARM                    PXTIPA                                             
C1078C                   IF        PXNMER<>0                                                        
C1078C                   EVAL      ERRGRL=*ON                                                       
C1078C                   EVAL      WRK49=*ON                                                        
C1078C                   EVAL      MSGER='ASG1003'                                                  
C1078C                   ENDIF                                                                      
C1078C     ERRGRL        CABEQ     *ON           TP5ACHK                                            
C1078C                   MOVE      PXALPH        P5AHORZ                                            
C1078 *                                                                                             
C1078C     TP5ACHK       TAG                                                                        
C1078C                   IF        ERRGRL=*ON                                                       
C1078C                   EVAL      ZXOPT2='DSP'                                                     
C1078C                   ENDIF                                                                      
C1078                                                                                               
C1078C     P5ACHKT       ENDSR                                                                      
C1078                                                                                               
C1078 **************************************************************                                
C1078 * SUBRUTINA                              P5AUPD              *                                
C1078 *------------------------------------------------------------*                                
C1078C     P5AUPD        BEGSR                                                                      
C1078C                   EVAL      ZXOPT ='END'                                                     
C1078                                                                                               
C1078C                   EVAL      T5CIAS=@PCIAS                                                    
C1078C                   EVAL      T5MAGA=P5AMAGA                                                   
C1078C     KEDPAR3       CHAIN     EDPAR3                             81                            
C1078C                   EXSR      P5AMPF                                                           
C1078                                                                                               
C1078C                   IF        %FOUND(EDPAR3)                                                   
C1078C                   UPDATE    REDPAR3                                                          
C1078C                   ELSE                                                                       
C1078C                   EVAL      T5DAT1=T5DAT8                                                    
C1078C                   WRITE     REDPAR3                                                          
C1078C                   ENDIF                                                                      
C1078                                                                                               
C1078C                   EXSR      CS_REDFLUIDRA                                                    
C1078C     P5AUPDT       ENDSR                                                                      
C1078 **************************************************************                                
C1078 * SUBRUTINA                              P5AUPD              *                                
C1078 *------------------------------------------------------------*                                
C1078C     P5AMPF        BEGSR                                                                      
C1078                                                                                               
C1078C                   CLEAR                   PXALPH                                             
C1078C                   MOVE      P5AMLIN       PXALPH                                             
C1078C                   EVAL      PXNUM=0                                                          
C1078C                   CALL      'PRD650'                                                         
C1078C                   PARM                    PXNUM                                              
C1078C                   PARM                    PXALPH                                             
C1078C                   PARM                    PXFLDD                                             
C1078C                   PARM      0             PXDCCD                                             
C1078C                   PARM                    PXFMD1                                             
C1078C                   PARM                    PXEDTC                                             
C1078C                   PARM                    PXNMER                                             
C1078C                   PARM                    PXTIPA                                             
C1078C                   EVAL      T5MLIN=PXNUM                                                     
C1078                                                                                               
C1078C                   CLEAR                   PXALPH                                             
C1078C                   MOVE      P5AMLIA       PXALPH                                             
C1078C                   EVAL      PXNUM=0                                                          
C1078C                   CALL      'PRD650'                                                         
C1078C                   PARM                    PXNUM                                              
C1078C                   PARM                    PXALPH                                             
C1078C                   PARM                    PXFLDD                                             
C1078C                   PARM      0             PXDCCD                                             
C1078C                   PARM                    PXFMD1                                             
C1078C                   PARM                    PXEDTC                                             
C1078C                   PARM                    PXNMER                                             
C1078C                   PARM                    PXTIPA                                             
C1078C                   EVAL      T5MLIA=PXNUM                                                     
C1078                                                                                               
C1078C                   CLEAR                   PXALPH                                             
C1078C                   MOVE      P5ACAPA       PXALPH                                             
C1078C                   EVAL      PXNUM=0                                                          
C1078C                   CALL      'PRD650'                                                         
C1078C                   PARM                    PXNUM                                              
C1078C                   PARM                    PXALPH                                             
C1078C                   PARM                    PXFLDD                                             
C1078C                   PARM      2             PXDCCD                                             
C1078C                   PARM                    PXFMD1                                             
C1078C                   PARM                    PXEDTC                                             
C1078C                   PARM                    PXNMER                                             
C1078C                   PARM                    PXTIPA                                             
C1078C                   EVAL      T5CAPA=PXNUM                                                     
IT244 * P5adisp                                                                                     
C1078                                                                                               
C1078C                   CLEAR                   PXALPH                                             
C1078C                   MOVE      P5ADISP       PXALPH                                             
C1078C                   EVAL      PXNUM=0                                                          
C1078C                   CALL      'PRD650'                                                         
C1078C                   PARM                    PXNUM                                              
C1078C                   PARM                    PXALPH                                             
C1078C                   PARM                    PXFLDD                                             
C1078C                   PARM      2             PXDCCD                                             
C1078C                   PARM                    PXFMD1                                             
C1078C                   PARM                    PXEDTC                                             
C1078C                   PARM                    PXNMER                                             
C1078C                   PARM                    PXTIPA                                             
C1078C                   EVAL      T5DISP=PXNUM                                                     
C1078                                                                                               
IT244 * P5amasi                                                                                     
IT244C                   CLEAR                   PXALPH                                             
IT244C                   MOVE      P5AMASI       PXALPH                                             
IT244C                   EVAL      PXNUM=0                                                          
IT244C                   CALL      'PRD650'                                                         
IT244C                   PARM                    PXNUM                                              
IT244C                   PARM                    PXALPH                                             
IT244C                   PARM                    PXFLDD                                             
IT244C                   PARM      2             PXDCCD                                             
IT244C                   PARM                    PXFMD1                                             
IT244C                   PARM                    PXEDTC                                             
IT244C                   PARM                    PXNMER                                             
IT244C                   PARM                    PXTIPA                                             
IT244C                   EVAL      T5MASI=PXNUM                                                     
IT244                                                                                               
C1078C                   CLEAR                   PXALPH                                             
C1078C                   MOVE      P5ADIFD       PXALPH                                             
C1078C                   EVAL      PXNUM=0                                                          
C1078C                   CALL      'PRD650'                                                         
C1078C                   PARM                    PXNUM                                              
C1078C                   PARM                    PXALPH                                             
C1078C                   PARM                    PXFLDD                                             
C1078C                   PARM      2             PXDCCD                                             
C1078C                   PARM                    PXFMD1                                             
C1078C                   PARM                    PXEDTC                                             
C1078C                   PARM                    PXNMER                                             
C1078C                   PARM                    PXTIPA                                             
C1078C                   EVAL      T5DIFD=PXNUM                                                     
C1078                                                                                               
C1078C                   CLEAR                   PXALPH                                             
C1078C                   MOVE      P5AIMPO       PXALPH                                             
C1078C                   EVAL      PXNUM=0                                                          
C1078C                   CALL      'PRD650'                                                         
C1078C                   PARM                    PXNUM                                              
C1078C                   PARM                    PXALPH                                             
C1078C                   PARM                    PXFLDD                                             
C1078C                   PARM      2             PXDCCD                                             
C1078C                   PARM                    PXFMD1                                             
C1078C                   PARM                    PXEDTC                                             
C1078C                   PARM                    PXNMER                                             
C1078C                   PARM                    PXTIPA                                             
C1078C                   EVAL      T5IMPO=PXNUM                                                     
C1078                                                                                               
C1078C                   CLEAR                   PXALPH                                             
C1078C                   MOVE      P5APESO       PXALPH                                             
C1078C                   EVAL      PXNUM=0                                                          
C1078C                   CALL      'PRD650'                                                         
C1078C                   PARM                    PXNUM                                              
C1078C                   PARM                    PXALPH                                             
C1078C                   PARM                    PXFLDD                                             
C1078C                   PARM      2             PXDCCD                                             
C1078C                   PARM                    PXFMD1                                             
C1078C                   PARM                    PXEDTC                                             
C1078C                   PARM                    PXNMER                                             
C1078C                   PARM                    PXTIPA                                             
C1078C                   EVAL      T5PESO=PXNUM                                                     
C1078                                                                                               
C1078C                   CLEAR                   PXALPH                                             
C1078C                   MOVE      P5AHORZ       PXALPH                                             
C1078C                   EVAL      PXNUM=0                                                          
C1078C                   CALL      'PRD650'                                                         
C1078C                   PARM                    PXNUM                                              
C1078C                   PARM                    PXALPH                                             
C1078C                   PARM                    PXFLDD                                             
C1078C                   PARM      0             PXDCCD                                             
C1078C                   PARM                    PXFMD1                                             
C1078C                   PARM                    PXEDTC                                             
C1078C                   PARM                    PXNMER                                             
C1078C                   PARM                    PXTIPA                                             
C1078C                   EVAL      T5HORZ=PXNUM                                                     
C1078                                                                                               
C1078C                   CLEAR                   PXALPH                                             
C1078C                   MOVE      P5APMIN       PXALPH                                             
C1078C                   EVAL      PXNUM=0                                                          
C1078C                   CALL      'PRD650'                                                         
C1078C                   PARM                    PXNUM                                              
C1078C                   PARM                    PXALPH                                             
C1078C                   PARM                    PXFLDD                                             
C1078C                   PARM      2             PXDCCD                                             
C1078C                   PARM                    PXFMD1                                             
C1078C                   PARM                    PXEDTC                                             
C1078C                   PARM                    PXNMER                                             
C1078C                   PARM                    PXTIPA                                             
C1078C                   EVAL      T5PMIN=PXNUM                                                     
C1078                                                                                               
C1078C                   CLEAR                   PXALPH                                             
C1078C                   MOVE      P5APMFD       PXALPH                                             
C1078C                   EVAL      PXNUM=0                                                          
C1078C                   CALL      'PRD650'                                                         
C1078C                   PARM                    PXNUM                                              
C1078C                   PARM                    PXALPH                                             
C1078C                   PARM                    PXFLDD                                             
C1078C                   PARM      2             PXDCCD                                             
C1078C                   PARM                    PXFMD1                                             
C1078C                   PARM                    PXEDTC                                             
C1078C                   PARM                    PXNMER                                             
C1078C                   PARM                    PXTIPA                                             
C1078C                   EVAL      T5PMFD=PXNUM                                                     
C1078                                                                                               
C1078C                   CLEAR                   PXALPH                                             
C1078C                   MOVE      P5AVOLU       PXALPH                                             
C1078C                   EVAL      PXNUM=0                                                          
C1078C                   CALL      'PRD650'                                                         
C1078C                   PARM                    PXNUM                                              
C1078C                   PARM                    PXALPH                                             
C1078C                   PARM                    PXFLDD                                             
C1078C                   PARM      2             PXDCCD                                             
C1078C                   PARM                    PXFMD1                                             
C1078C                   PARM                    PXEDTC                                             
C1078C                   PARM                    PXNMER                                             
C1078C                   PARM                    PXTIPA                                             
C1078C                   EVAL      T5VOLU=PXNUM                                                     
C1078                                                                                               
C1078C                   EVAL      T5ACTO=P5AACTO                                                   
C1078                                                                                               
C1078C                   EVAL      T5RFLU=P5ARFLU                                                   
C1078C                   EVAL      T5DOBC=P5ADOBC                                                   
C1078C                   EVAL      T5DOFD=P5ADOFD                                                   
C1078                                                                                               
C1078C                   EVAL      T5DAT8=ZZDATS                                                    
C1078C                   IF        T5DAT8=0                                                         
C1078C                   EVAL      T5DAT8=*DATE                                                     
C1078C                   ENDIF                                                                      
C1078C                   TIME                    T5HORA                                             
C1078C                   EVAL      T5USUA=ZZUSUA                                                    
C1078C                   EVAL      T5PANT=SDSJOB                                                    
C1078C     P5AMPFT       ENDSR                                                                      
C1078 **************************************************************                                
C1078 * COMMON SUBRUTINE (CS_) :                                  *                                 
C1078 * CONTAR LINEAS A PREPARAR                                   *                                
C1078 *------------------------------------------------------------*                                
C1078C     CS_CONTLIN    BEGSR                                                                      
C1078C                                                                                              
C1078 *                                                                                             
C1078C*                  EVAL      ZXDIAS=T5HORZ                                                    
C1078C*                  IF        ZXDIAS=0                                                         
C1078C*                  EVAL      ZXDIAS=999                                                       
C1078C*                  ENDIF                                                                      
C1078 *                                                                                             
C1078C*                  MOVE      *DATE         ZXFISO                                             
C1078C*                  ADDDUR    ZXDIAS:*D     ZXFISO                                             
C1078C*                  MOVE      ZXFISO        ZXFMAX                                             
C1078 *                                                                                             
C1078C*                  EVAL      T5MLIA=0                                                         
C1078C*    @PCIAS        SETLL     COCAPEA8                                                         
C1078C*    @PCIAS        READE     COCAPEA8                                                         
C1078C*                  DOW       NOT%EOF                                                          
C1078C*                  IF        (S0TPE4<>'2')                                                    
C1078C*                  EVAL      S5CIAS=S0CIAS                                                    
C1078C*                  EVAL      S5DLGA=S0DLGA                                                    
C1078C*                  EVAL      S5NPCO=S0NPCO                                                    
C1078C*                  EVAL      S5TPED=S0TPED                                                    
C1078C*                  EVAL      S5DATP=S0DATP                                                    
C1078C*                  EVAL      S5NOPL=S0NOPL                                                    
C1078C*    KCODEPE       SETLL     CODEPE                                                           
C1078C*    KCODEPE       READE     CODEPE                                                           
C1078C*                  DOW       NOT%EOF                                                          
C1078C*                  IF        M0LOGE=S5LOGE AND S5STUL<'5'                                     
C1078C*                            AND ZXFMAX>S5FREP                                                
C1078C*                  EVAL      T5MLIA=T5MLIA+1                                                  
C1078C*                  ENDIF                                                                      
C1078C*    KCODEPE       READE     CODEPE                                                           
C1078C*                  ENDDO                                                                      
C1078C*                  ENDIF                                                                      
C1078C*    @PCIAS        READE     COCAPEA8                                                         
C1078C*                  ENDDO                                                                      
C1078C                   ENDSR                                                                      
C1078C                                                                                              
C1078C                                                                                              
C1078 **************************************************************                                
C1078 * COMMON SUBRUTINE (CS_) :                                  *                                 
C1078 * CONTAR LINEAS A PREPARAR                                   *                                
C1078 *------------------------------------------------------------*                                
C1078C     CS_REDFLUIDRA BEGSR                                                                      
C1078 *                                                                                             
C1078C                   EVAL      G1CIAO=M0CIAS                                                    
C1078C                   MOVE      M0MAGA        G1MAGO                                             
C1078C                   MOVE      M1ARTI        G1ARTO                                             
C1078C                   MOVE      M1VARI        G1VARO                                             
C1078C                   MOVE      M1MODE        G1MODO                                             
C1078C                   MOVE      'A'           G1CALO                                             
C1078C     KGXSTO0       SETLL     GXSTO02                                                          
C1078C     KGXSTO0       READE     GXSTO02                                                          
C1078C                   DOW       NOT%EOF                                                          
C1078C                   DELETE    RGXSTO0                                                          
C1078C     KGXSTO0       READE     GXSTO02                                                          
C1078C                   ENDDO                                                                      
C1078 *                                                                                             
C1078C                   IF        P5ARFLU='1'                                                      
C1078C                   EVAL      M1CIAS=M0CIAS                                                    
C1078C                   EVAL      M1MAGA=M0MAGA                                                    
C1078C     KMSSTO0       SETLL     MSSTO0                                                           
C1078C     KMSSTO0       READE     MSSTO0                                                           
C1078C                   DOW       NOT%EOF                                                          
C1078                                                                                               
C1078C                   EVAL      M5CIAS=M1CIAS                                                    
C1078C                   EVAL      M5ARTI=M1ARTI                                                    
C1078C                   EVAL      M5VARI=M1VARI                                                    
C1078C                   EVAL      M5MODE=M1MODE                                                    
C1078C     KMSARTI00     CHAIN     MSARTI00                                                         
C1078C                   IF        %FOUND AND M5BAJA<>'1' AND                                       
C1078C                             M5PPV2<'1'                                                       
C1078C                   EVAL      S3CIAS=M5CIAS                                                    
C1078C                   EVAL      S3ARVM=M5ARTI+M5VARI+M5MODE                                      
C1078C                   EVAL      P3CIAR=M5CIAS                                                    
C1078C                   EVAL      P3ARVL=M5ARTI+M5VARI+M5MODE                                      
C1078C     KGMPRO303     CHAIN(N)  GMPRO303                                                         
C1078C     KCOCLP007     CHAIN(N)  COCLP007                                                         
C1078C                   IF        %FOUND(GMPRO303)                                                 
     C                             OR %FOUND(COCLP007)                                              
C1078C                                                                                              
C1078C     KMSSTOK       CHAIN     MSSTOK                                                           
C1078C                   IF        M1SMIN<M1SACT AND                                                
C1078C                             M1SACT>0  AND M1CALI='A'                                         
C1078C                   EVAL      ZXSDIS = M1SACT-M1SKRE-M1SKRP-M1SKR1-M1SKR2                      
C1078 * QUITAMOS EL VALOR                                                                           
C1078C                   IF        T5PMFD<>0                                                        
C2557C*C1078             EVAL      ZXSDIS=ZXSDIS-((T5PMFD/100)*ZXSDIS)                              
C2557C                   EVAL      ZXSDIS=ZXSDIS-((T5PMFD/100)*M1SMIN)                              
C1078C                   ENDIF                                                                      
C1078C                                                                                              
C1078C                   IF        T5DIFD<>0                                                        
C1078C                   EVAL      ZXSDIS=((T5DIFD/100)*ZXSDIS)                                     
C1078C                   ENDIF                                                                      
C1078C                                                                                              
C1078C                   IF        ZXSDIS>0                                                         
C1078C                   EVAL      G1CIAS=M0CIAS                                                    
C1078C                   MOVEL(P)  M0MAGA        G1MAGA                                             
C1078C                   MOVEL(P)  M1ARTI        G1ARTI                                             
C1078C                   MOVEL(P)  M1VARI        G1VARI                                             
C1078C                   MOVEL(P)  M1MODE        G1MODE                                             
C1078C                   MOVEL(P)  M1CALI        G1CALI                                             
C1078C                   EVAL      G1CIAO=M0CIAS                                                    
C1078C                   MOVEL(P)  M0MAGA        G1MAGO                                             
C1078C                   MOVEL(P)  M1ARTI        G1ARTO                                             
C1078C                   MOVEL(P)  M1VARI        G1VARO                                             
C1078C                   MOVEL(P)  M1MODE        G1MODO                                             
C1078C                   MOVEL(P)  M1CALI        G1CALO                                             
C1078C                   EVAL      G1SACT=ZXSDIS                                                    
C1078C                   EVAL      G1SKRE=0                                                         
C1078C                   EVAL      G1SKRP=0                                                         
C1078C                   EVAL      G1SKR1=0                                                         
C1078C                   EVAL      G1SKR2=0                                                         
C1078C                   EVAL      G1ARES=P3ARES                                                    
C1078C                   MOVE      *DATE         G1DAT1                                             
C1078C                   MOVE      *DATE         G1DAT8                                             
C1078C                   MOVEL(P)  SDSUSR        G1USUA                                             
C1078C                   MOVEL(P)  SDSJOB        G1PANT                                             
C1078C                   WRITE     RGXSTO0                                                          
C1078C                   ENDIF                                                                      
C1078 *                                                                                             
C1078                                                                                               
C1078C                   ENDIF                                                                      
C1078C                   ENDIF                                                                      
C1078C                   ENDIF                                                                      
C1078C     KMSSTO0       READE     MSSTO0                                                           
C1078C                   ENDDO                                                                      
C1078C                   CALL      'DO0055'                                                         
C1078C                   PARM      @PCIAS        @PECIAS                                            
C1078C                   PARM      @PMAGA        @PEMAGA                                            
C1078C                   PARM      *BLANKS       @PEOPCI                                            
C1078C                   PARM      *BLANKS       @PERRO                                             
C1078C                   ENDIF                                                                      
C1078C                   ENDSR                                                                      
C1078 **************************************************************                                
C1078 * COMMON SUBRUTINE (CS_) :                                  *                                 
C1078 * CREAR LOGÍSTICAS                                           *                                
C1078 *------------------------------------------------------------*                                
C1078C     CS_CRTLOG     BEGSR                                                                      
C1078C                   EVAL      F_M0CIAS=M0CIAS                                                  
C1078C                   EVAL      F_M0LOGE=P2ALOGE                                                 
C1078C     KMSALMA05     CHAIN     MSALMA05                                                         
C1078C                   IF        NOT%FOUND                                                        
C1078C                   EXFMT     W02                                                              
C1078C                   IF        CREATE='1'  OR                                                   
C1078C                             CMD10='1'                                                        
C1078C     @PCIAS        SETLL     PMEMPR                                                           
C1078C     @PCIAS        READE     PMEMPR                                                           
C1078C                   DOW       NOT%EOF                                                          
C1078C                   IF        ((CREATE='1' AND P7DLGA=M0DLGA) OR                               
C1078C                             CMD10='1')                                                       
C1078C                   EVAL      XL_MICIAS=M0CIAS                                                 
C1078C                   EVAL      XL_MIDLGA=P7DLGA                                                 
C1078C                   EVAL      XL_MILGCA=P2ALOGE                                                
C1078C     KMSLOAD       CHAIN     MSLOAD                                                           
C1078C                   IF        NOT%FOUND                                                        
C1078C                   EVAL      XL_MICIAS=M0CIAS                                                 
C1078C                   EVAL      XL_MIDLGA=P7DLGA                                                 
C1078C                   EVAL      XL_MILGCA=P2ALOGE                                                
C1078C                   EVAL      XL_MIPRIO='001'                                                  
C1078C                   EVAL      XL_MIMI05=*BLANKS                                                
C1078C                   EVAL      XL_MIMI06=*BLANKS                                                
C1078C                   EVAL      XL_MIMI20=*BLANKS                                                
C1078C                   EVAL      XL_MIMI21=*BLANKS                                                
C1078C                   EVAL      XL_MIMAGA=P2AMAGA                                                
C1078C                   EVAL      XL_MICPRI=*BLANKS                                                
C1078C                   EVAL      XL_MIZUBC=*BLANKS                                                
C1078C                   EVAL      XL_MISUBC=*BLANKS                                                
C1078 *                                                                                             
C1078C                   EVAL      XL_MILOGU=*BLANKS                                                
C1078C                   EVAL      XL_MILGRT=*BLANKS                                                
C1078C                   EVAL      XL_MIDAT1=*DATE                                                  
C1078C                   EVAL      XL_MIDAT8=*DATE                                                  
C1078C                   EVAL      XL_MIPANT=SDSJOB                                                 
C1078C                   EVAL      XL_MIUSUA=SDSUSR                                                 
C1078C                   TIME                    XL_MIHORA                                          
C1078C                   EVAL      XL_MITFLU=*BLANKS                                                
C1078C                   EVAL      XL_MIALOL=*BLANKS                                                
C1078C                   WRITE     RMSLOAD1                                                         
C1078C                   EVAL      ERRGRL=*OFF                                                      
C1078C                   ENDIF                                                                      
C1078                                                                                               
C1078C                   EVAL      XL_MICIAS=M0CIAS                                                 
C1078C                   EVAL      XL_MIDLGA=P7DLGA                                                 
C1078C                   EVAL      XL_MILGCA=P2ALOGE                                                
C1078C     KMSLOAD       CHAIN     MSLOGI                                                           
C1078C                   IF        NOT%FOUND                                                        
C1078C                   EVAL      MICIAS=M0CIAS                                                    
C1078C                   EVAL      MIDLGA=P7DLGA                                                    
C1078C                   EVAL      MILGCA=P2ALOGE                                                   
C1078C                   EVAL      MIDESC=M0DES1                                                    
C1078C                   EVAL      MITLGC=*BLANKS                                                   
C1078C                   EVAL      MITPRI=*BLANKS                                                   
C1078C                   EVAL      MIMI01=*BLANKS                                                   
C1078C                   EVAL      MIMI02=*BLANKS                                                   
C1078C                   EVAL      MIMI20=*BLANKS                                                   
C1078C                   EVAL      MIMI21=*BLANKS                                                   
C1078C                   EVAL      MIDAT1=*DATE                                                     
C1078C                   EVAL      MIDAT8=*DATE                                                     
C1078C                   EVAL      MIPANT=SDSJOB                                                    
C1078C                   EVAL      MIUSUA=SDSUSR                                                    
C1078C                   TIME                    MIHORA                                             
C1078C                   EVAL      MIUBIB=M0UBIB                                                    
C1078C                   EVAL      MIPUBI=M0PUBI                                                    
C1078 *                  EVAL      MIALOL=M0ALOL                                                    
C1078C                   WRITE     RMSLOGI                                                          
C1078C                   EVAL      ERRGRL=*OFF                                                      
C1078C                   ENDIF                                                                      
C1078C                   ENDIF                                                                      
C1078C     @PCIAS        READE     PMEMPR                                                           
C1078C                   ENDDO                                                                      
C1078C                   ENDIF                                                                      
C1078C                   ENDIF                                                                      
C1078C                   ENDSR                                                                      
      **************************************************************                                
      * COMMON SUBRUTINE (CS_) :                                  *                                 
      * SUBRUTINA DE POSICIONAMENT DEL CURSOR                      *                                
      *------------------------------------------------------------*                                
     C     CS_POCUR2     BEGSR                                                                      
      * OBTENIM LA POSICIO DEL CURSOR                                                               
     C     FMTPOCUR      DIV       256           CSRFILA                                            
     C                   MVR                     CSRCOLU                                            
     C                   ENDSR                                                                      
      **************************************************************                                
      * COMMON SUBRUTINE (CS_) :                                  *                                 
      * SUBRUTINA DE PROXIMA PANTALLA SI NO RESPONDE               *                                
      * UNA PANTALLA A NINGUNA DE LAS PANTALLA CONSIDERADAS        *                                
      *------------------------------------------------------------*                                
     C     PANNEXT       BEGSR                                                                      
     C                   EVAL      Z_P=Z_P+1                                                        
     C                   IF        SSSECPA(Z_P)=*BLANKS                                             
     C                   EVAL      ZXOPT='END'                                                      
     C                   ELSE                                                                       
     C                   EVAL      ZXOPT1='P2 '                                                     
     C                   MOVE      SSSECPA(Z_P)  ZXOPT1                                             
     C                   EVAL      ZXOPT2='CLR'                                                     
     C                   ENDIF                                                                      
     C                   ENDSR                                                                      
      **************************************************************                                
      * SUBRUTINA QUE CONTROLA ELS POSSIBLES ERRORS DE PROGRAMA    *                                
      *------------------------------------------------------------*                                
     C/COPY *LIBL/QSRDSRC,SRD020                                                                    
