     A          R RMSARAL                   PFILE(MSARAL)                                           
     A          K I0TROL                                                                            
     A          K I0ARAL                                                                            
     A          K I0ARES                                                                            
     A          S I0BAJA                    VALUES(0)                                               
