      *                 DDS ADP 400.             23/06/98  15:28                                    
      * Copyright (c)   ASTRAL GRUP. All Rights Reserved.                                           
      * Aplic PUR       astral Grup, S.A. COMPRAS                                                   
      * File  MSSOCI01  Maestro de datos de la Sociedad.                                            
      * Type  LF                                                                                    
     A          R RMSSOCI                   PFILE(MSSOCI)                                           
     A          K MSCIAS                                                                            
     A          K MSTDIR                                                                            
     A          K MSDLGA                                                                            
