     A          R RPMJOBC                                                                           
      *                                                                                             
     A            JOTRAT        18                                                                  
     A            JOLINE         2S 0                                                               
     A                                                                                              
     A            JODATO      2000                                                                  
     A          K JOTRAT                                                                            
     A          K JOLINE                                                                            
